club_1.club.clubname
county_public_safety.county_public_safety.county_id
phone_market.phone.name
dog_kennels.owners.city
local_govt_and_lot.customer_events.property_id
student_transcripts_tracking.addresses.state_province_county
city_record.hosting_city.match_id
local_govt_mdm.council_tax
twitter_1.user_profiles
pets_1
wedding.wedding.year
cre_theme_park.staff_has_cre_theme_park
academic.author
restaurants.restaurant
cre_doc_tracking_db.employees
college_1.enroll.stu_num
farm.farm.total_horses
school_player.school_details.nickname
aircraft.pilot.age
music_4.music_festival.date_of_ceremony
cre_docs_and_epenses.documents.document_type_code
imdb.director.birth_year
store_product.store_district
geo.city
manufacturer.furniture.name
cre_doc_tracking_db.ref_locations
customers_campaigns_ecommerce.products
solvency_ii.products_in_events.event_id
cre_drama_workshop_groups.drama_workshop_groups.currency_code
customers_and_invoices.invoices.invoice_date
icfp_1.papers
music_4.artist
tracking_software_problems.problems.other_problem_details
yelp.review.text
railway.train.from
customer_deliveries.delivery_routes.route_name
apartment_rentals.apartment_facilities.facility_code
medicine_enzyme_interaction.medicine_enzyme_interaction.medicine_id
county_public_safety.city.black
epinions_1.review
activity_1.student.fname
activity_1.faculty.rank
cre_theme_park.features
culture_company.movie.year
student_transcripts_tracking.student_enrolment
machine_repair
dog_kennels.dogs.owner_id
hospital_1.patient.insuranceid
ship_mission.ship.tonnage
tracking_software_problems.problem_log
tracking_share_transactions.purchases.purchase_transaction_id
hospital_1.nurse.name
student_assessment.courses.course_name
hospital_1.nurse.registered
shop_membership.purchase.total_pounds
twitter_1.tweets_has_twitter_1
insurance_fnol.services.service_name
pets_1.student.fname
poker_player
cre_doc_tracking_db.documents_to_be_destroyed.document_id
college_3.department.building
sports_competition.club_rank.rank
employee_hire_evaluation.hiring.is_full_time
insurance_policies.payments.date_payment_made
customers_and_invoices.customers.customer_last_name
orchestra.orchestra.orchestra
game_injury.game_has_game_injury
student_transcripts_tracking.semesters.semester_description
assets_maintenance.maintenance_contracts.maintenance_contract_company_id
machine_repair.machine
csu_1.faculty.campus
concert_singer.concert.theme
cre_drama_workshop_groups.invoices.order_quantity
student_assessment.people_addresses.person_id
music_1.genre
geo.river.river_name
student_assessment.candidate_assessments_has_student_assessment
wrestler.elimination_has_wrestler
tracking_orders.customers.customer_id
driving_school.staff.date_left_staff
music_2.albums
concert_singer.singer.country
pets_1.has_pet.petid
college_3.department.room
behavior_monitoring.student_addresses.student_id
local_govt_mdm.council_tax.cmi_cross_ref_id
match_season.player.total_wl
student_assessment.people.password
railway.railway.wheels
concert_singer.singer_in_concert
ship_1.captain.name
pilot_record.pilot_record.aircraft_id
wedding.wedding.female_id
farm.farm_competition
customers_and_addresses.addresses.state_province_county
imdb.writer.num_of_episodes
company_1.employee.dno
train_station.train.service
candidate_poll.candidate.oppose_rate
battle_death.death_has_battle_death
geo.state.area
railway.railway_manage.railway_id
insurance_and_eclaims.claim_headers.date_of_settlement
company_employee.company.sales_in_billion
school_finance.school.location
dorm_1.has_amenity.amenid
battle_death.battle.bulgarian_commander
swimming.stadium.capacity
employee_hire_evaluation.hiring.shop_id
theme_gallery.artist.country
network_2.person.job
behavior_monitoring.teachers_has_behavior_monitoring
hr_1.locations.street_address
epinions_1
inn_1.rooms.baseprice
performance_attendance.performance.performance_id
music_4.artist.age
geo.highlow.lowest_point
behavior_monitoring.addresses.zip_postcode
student_transcripts_tracking.addresses.line_2
tracking_software_problems.problem_log.problem_status_code
course_teach.teacher.teacher_id
inn_1.reservations.kids
flight_1.flight.arrival_date
products_gen_characteristics.products.product_id
match_season.match_season.college
sports_competition.player.club_id
movie_1.movie.title
network_2.personfriend
orchestra.performance.date
riding_club.player.sponsor_name
academic.keyword
hospital_1.prescribes_has_hospital_1
customers_campaigns_ecommerce.order_items.item_order_quantity
assets_maintenance.maintenance_engineers.engineer_id
election.party.lieutenant_governor
workshop_paper.acceptance.result
college_1.professor.emp_num
solvency_ii.events.channel_id
insurance_fnol.available_policies.policy_type_code
hr_1.employees.department_id
department_store.order_items.order_item_id
tracking_share_transactions.transactions.transaction_id
wine_1.wine.no
local_govt_mdm.customer_master_index
cre_drama_workshop_groups.stores.store_phone
college_3.course.hours
workshop_paper.submission.author
company_1.department.dname
customers_card_transactions.accounts
customers_and_addresses.customers.other_customer_details
products_for_hire.customers.date_became_customer
yelp.neighbourhood
customer_complaints.products.product_category_code
tracking_software_problems.staff.staff_id
hr_1.job_history.end_date
solvency_ii.events.location_id
train_station.station.annual_entry_exit
dog_kennels.treatments.treatment_id
behavior_monitoring.student_addresses.other_details
orchestra.performance.orchestra_id
riding_club.match_result.rank
medicine_enzyme_interaction
insurance_policies.settlements.claim_id
cre_doc_template_mgt.templates.date_effective_to
ship_1.ship
product_catalog.catalog_contents_additional_attributes.attribute_value
school_bus.school
customers_card_transactions.customers.customer_first_name
cre_drama_workshop_groups.ref_service_types
customer_deliveries.customer_addresses.customer_id
cre_drama_workshop_groups.stores.store_name
student_assessment.candidate_assessments.asessment_outcome_code
poker_player.poker_player.earnings
phone_market.market.ranking
department_store.customers.customer_id
program_share.channel.channel_id
dog_kennels.treatments.cost_of_treatment
race_track.race.race_id
election_representative.election.election_id
cre_doc_control_systems.ref_shipping_agents.shipping_agent_description
student_transcripts_tracking.student_enrolment.student_enrolment_id
school_bus.driver.party
assets_maintenance.part_faults.fault_description
restaurant_1.student.city_code
gas_company.station_company.company_id
flight_company.flight.airport_id
cinema.film.number_in_season
customers_card_transactions
imdb.classification.gid
orchestra.performance.weekly_rank
department_store.supplier_addresses.supplier_id
csu_1.degrees
city_record.city
local_govt_and_lot.timed_status_of_things.status_of_thing_code
customer_deliveries.order_deliveries
cre_drama_workshop_groups.services_has_cre_drama_workshop_groups
performance_attendance.performance.attendance
customers_and_products_contacts.customer_address_history.date_from
roller_coaster.roller_coaster.status
party_people.region.date
scholar.journal.journalid
museum_visit.visit.visitor_id
hr_1.jobs.min_salary
student_transcripts_tracking
products_gen_characteristics.ref_product_categories.product_category_code
cre_drama_workshop_groups.stores.other_details
cre_doc_template_mgt.templates.date_effective_from
student_1.list.lastname
shop_membership.branch.branch_id
ship_mission.mission.speed_knots
ship_1.captain_has_ship_1
race_track.race.date
flight_2.flights
local_govt_and_lot.services.organization_id
match_season.player.years_played
phone_1.phone.accreditation_type
tracking_grants_for_research.projects.organisation_id
customers_and_invoices.accounts
station_weather.weekly_weather_has_station_weather
school_finance.budget.total_budget_percent_budgeted
customers_and_addresses.customer_addresses
machine_repair.technician.technician_id
machine_repair.machine.making_year
department_store.customers.customer_phone
restaurants.location.restaurant_id
tracking_grants_for_research.grants.other_details
voter_1.contestants
local_govt_mdm.electoral_register.electoral_register_id
tracking_grants_for_research.documents_has_tracking_grants_for_research
company_1.department.mgr_ssn
cre_docs_and_epenses.ref_document_types.document_type_description
icfp_1.inst.country
hospital_1.undergoes.physician
dog_kennels.treatments_has_dog_kennels
e_government.addresses.line_1_number_building
restaurants.geographic.region
dog_kennels.breeds.breed_code
entrepreneur.people.name
sports_competition.competition_result.score
student_transcripts_tracking.students.student_id
college_1.student.dept_code
imdb.actor
hospital_1.appointment_has_hospital_1
cre_doc_tracking_db.all_documents.document_id
hr_1.countries.region_id
apartment_rentals.apartments
assets_maintenance.assets.asset_model
behavior_monitoring.students.date_first_rental
insurance_and_eclaims.claim_headers_has_insurance_and_eclaims
museum_visit.visitor.level_of_membership
yelp
product_catalog.catalog_structure.catalog_level_number
department_store.customers.customer_address
customers_card_transactions.customers_cards.date_valid_from
student_transcripts_tracking.degree_programs
program_share.channel.owner
tracking_software_problems.problems.date_problem_closed
customers_and_invoices.customers.phone_number
tracking_grants_for_research.research_staff.staff_details
cre_theme_park.shops.shop_id
farm.city.official_name
manufacturer.furniture_manufacte.manufacturer_id
department_management.head.name
debate.debate.num_of_audience
architecture.bridge
employee_hire_evaluation.evaluation.employee_id
concert_singer.singer.name
e_learning.student_course_enrolment.course_id
musical.musical.name
musical.actor
yelp.tip.month
county_public_safety.county_public_safety.location
machine_repair.repair_assignment
company_office.companies
cre_theme_park.tourist_attractions.name
insurance_policies.settlements.amount_claimed
real_estate_properties.other_available_features.feature_description
allergy_1
academic
school_bus.school.location
epinions_1.useracct.name
theme_gallery.exhibition
swimming.swimmer.time
ship_1.ship.name
manufactory_1.products
cre_drama_workshop_groups.order_items.product_id
riding_club.club.club_name
products_for_hire.discount_coupons
student_assessment.candidates_has_student_assessment
cre_theme_park.royal_family.royal_family_id
journal_committee.editor.name
college_1.student.stu_dob
solvency_ii.events.address_id
program_share.channel.name
customers_campaigns_ecommerce.premises.premise_details
company_1.project.plocation
insurance_policies.payments.payment_method_code
local_govt_and_lot.residents_services
manufactory_1
company_1.employee.fname
apartment_rentals.apartment_facilities
department_store.staff.staff_name
club_1.member_of_club
machine_repair.repair.launch_date
music_1.song.song_name
cre_drama_workshop_groups.products.product_id
department_store.order_items.order_id
customers_and_invoices.customers
railway.train.railway_id
employee_hire_evaluation.shop.name
local_govt_mdm.benefits_overpayments_has_local_govt_mdm
college_1.employee.emp_dob
insurance_policies.payments_has_insurance_policies
company_office.companies.sales_billion
course_teach
course_teach.course_arrange.course_id
products_gen_characteristics.ref_product_categories.product_category_description
aircraft.match
entertainment_awards.festival_detail.festival_name
insurance_and_eclaims.claim_headers.date_of_claim
culture_company.book_club.result
assets_maintenance.third_party_companies
cre_theme_park.theme_parks.theme_park_id
election_representative.election.votes
coffee_shop.member.address
products_for_hire.customers.coupon_id
medicine_enzyme_interaction.enzyme.id
train_station.station.annual_interchanges
university_basketball.basketball_match.all_home
tracking_software_problems.problem_category_codes.problem_category_code
railway.train
tracking_orders.invoices.invoice_number
music_1.genre.most_popular_in
wine_1.wine.appelation
college_3.course_has_college_3
orchestra.orchestra.orchestra_id
customer_deliveries.actual_order_products.product_id
hr_1.employees_has_hr_1
ship_1.ship.built_year
cre_drama_workshop_groups.clients
document_management.document_sections_images
customers_and_addresses.order_items.product_id
club_1.student.sex
products_for_hire.discount_coupons.coupon_id
customers_and_invoices.products
scholar.paper.venueid
sports_competition.competition.competition_type
hospital_1.prescribes.date
cre_drama_workshop_groups.bookings_has_cre_drama_workshop_groups
customers_and_addresses.customer_orders_has_customers_and_addresses
local_govt_and_lot.customer_event_notes.date_moved_in
pilot_record.pilot.rank
flight_1.flight.departure_date
insurance_policies.settlements.date_claim_made
cre_doc_tracking_db.ref_document_types.document_type_description
e_government.addresses.state_province_county
student_transcripts_tracking.addresses.country
cre_drama_workshop_groups.clients.customer_email_address
driving_school.lessons.customer_id
swimming.record
program_share.broadcast_share
document_management.documents_has_document_management
local_govt_and_lot.services_has_local_govt_and_lot
phone_1.chip_model.slots
roller_coaster.roller_coaster.length
cinema.film
decoration_competition.college
products_for_hire.bookings.amount_outstanding
cinema.schedule.film_id
medicine_enzyme_interaction.enzyme.name
student_transcripts_tracking.students.date_first_registered
aircraft.aircraft.max_gross_weight
school_player.school_details.colors
imdb.writer
department_store.staff.staff_id
voter_2.student.major
climbing.climber_has_climbing
scientist_1.scientists
news_report.journalist.journalist_id
storm_record.region.region_name
flight_company.flight.pilot
candidate_poll.candidate.consider_rate
cre_docs_and_epenses.accounts
university_basketball.basketball_match.team_name
customers_and_invoices.products.production_type_code
orchestra.performance
store_product.product.product_id
behavior_monitoring.addresses
products_for_hire.bookings.booking_start_date
voter_1.votes
activity_1.faculty.lname
film_rank.film.studio
cre_theme_park.locations.location_name
voter_2.voting_record_has_voter_2
employee_hire_evaluation.shop.manager_name
insurance_fnol.customers_policies.customer_id
dorm_1.dorm.student_capacity
flight_company.airport.country
network_2.personfriend.year
tracking_orders.order_items.order_id
college_1.department.dept_name
book_2.book
products_for_hire.products_booked.returned_yn
hospital_1.nurse.position
department_management.management.temporary_acting
yelp.category.id
manufacturer.furniture.market_rate
battle_death.ship.disposition_of_ship
manufacturer.manufacturer.manufacturer_id
tracking_grants_for_research.organisations.organisation_id
apartment_rentals.guests.guest_first_name
student_assessment.people_addresses.person_address_id
poker_player.people.people_id
customers_and_invoices.customers.login_password
cre_doc_control_systems.documents_mailed
assets_maintenance.skills.skill_id
customer_deliveries.products.product_name
driving_school.customers.customer_status_code
singer.singer.singer_id
tracking_share_transactions.purchases
customers_campaigns_ecommerce.customer_addresses.address_type_code
cre_doc_tracking_db.ref_document_types.document_type_name
city_record.match.competition
college_3.enrolled_in
assets_maintenance.engineer_visits.fault_log_entry_id
wine_1.appellations.county
tracking_share_transactions.sales.sales_transaction_id
student_transcripts_tracking.student_enrolment_has_student_transcripts_tracking
dog_kennels.professionals.email_address
document_management.functional_areas.functional_area_code
workshop_paper.workshop.workshop_id
products_gen_characteristics.products.typical_selling_price
cre_doc_template_mgt.ref_template_types
activity_1
orchestra.show.if_first_show
station_weather.station.services
hospital_1.on_call.blockfloor
music_4.volume_has_music_4
dog_kennels.breeds
architecture.bridge.name
customers_and_products_contacts.addresses.line_1_number_building
musical
decoration_competition.college.college_location
gymnast.gymnast.horizontal_bar_points
tracking_orders.orders_has_tracking_orders
gas_company.gas_station.open_year
tvshow.cartoon.directed_by
theme_gallery.artist.name
orchestra.orchestra.major_record_format
academic.journal.name
course_teach.course.course_id
company_1.employee.sex
imdb.copyright.cid
election.election.first_elected
voter_1.votes.phone_number
sports_competition.player.position
hospital_1.patient.ssn
school_finance.school.school_id
university_basketball
roller_coaster.roller_coaster.name
shop_membership.branch.membership_amount
e_learning.course_authors_and_tutors.address_line_1
county_public_safety.city.name
pets_1.pets.petid
game_injury.game.away_team
customer_deliveries.delivery_route_locations.route_id
department_store.order_items_has_department_store
real_estate_properties.other_available_features.feature_type_code
film_rank.film_market_estimation.type
school_finance.school
ship_mission.mission.location
tracking_orders.customers.customer_details
behavior_monitoring.students.email_address
phone_market.market.district
customers_and_invoices.order_items.product_quantity
game_1.student
assets_maintenance.engineer_visits.contact_staff_id
election_representative.representative.lifespan
school_finance.school.mascot
driving_school.customers.last_name
imdb.copyright
customers_and_addresses.customer_contact_channels.customer_id
imdb.classification.id
university_basketball.university.enrollment
inn_1.rooms.decor
school_finance.endowment
assets_maintenance.skills.skill_code
storm_record.region.region_code
browser_web.accelerator_compatible_browser.accelerator_id
driving_school.customers.first_name
sports_competition.club_rank_has_sports_competition
sports_competition.competition
protein_institute.institution.building_id
news_report.news_report.event_id
cre_drama_workshop_groups.invoice_items.invoice_item_id
wine_1.grapes.id
hospital_1.prescribes.physician
restaurants.restaurant.name
geo.city.population
customers_and_products_contacts.contacts.last_name
insurance_and_eclaims.customers.customer_details
school_player.school.boys_or_girls
cre_doc_template_mgt.paragraphs_has_cre_doc_template_mgt
academic.publication.year
products_for_hire.discount_coupons.coupon_amount
tracking_software_problems.problem_log.problem_log_id
architecture.mill.type
county_public_safety.city.city_id
county_public_safety.city.white
department_store.customers.customer_code
insurance_and_eclaims.claims_processing.claim_outcome_code
shop_membership.member.member_id
local_govt_mdm.business_rates
city_record.temperature.dec
customer_complaints.staff.email_address
flight_company.airport.city
e_government.party_addresses.address_id
local_govt_in_alabama
concert_singer
cre_doc_tracking_db.document_locations.location_code
assets_maintenance.third_party_companies.company_type
customers_and_invoices.customers.state_county_province
customers_card_transactions.financial_transactions.transaction_amount
wrestler.wrestler
battle_death.death.injured
journal_committee.journal_committee.editor_id
ship_mission.mission.mission_id
customers_and_invoices.order_items.product_id
loan_1.customer.credit_score
inn_1.reservations.rate
cre_doc_control_systems.addresses.address_details
employee_hire_evaluation.employee.employee_id
assets_maintenance.fault_log.recorded_by_staff_id
debate.debate_people.debate_id
student_transcripts_tracking.students.middle_name
railway.railway
county_public_safety.county_public_safety.residents_per_officer
dog_kennels.professionals.first_name
tracking_software_problems.problem_category_codes
cre_theme_park.hotels.hotel_id
concert_singer.concert.concert_name
program_share.broadcast_share.share_in_percent
city_record.temperature.oct
customer_complaints.products.parent_product_id
voter_2
gymnast.gymnast.total_points
solvency_ii.locations.location_id
csu_1.discipline_enrollments.campus
culture_company.culture_company.company_name
flight_2.flights.sourceairport
decoration_competition.college.name
perpetrator.perpetrator
products_gen_characteristics.characteristics.characteristic_id
gas_company.company.rank
college_3.course.days
election.election.counties_represented
music_4.music_festival.music_festival
flight_company.flight.id
yelp.business.review_count
allergy_1.student.stuid
perpetrator.perpetrator.year
riding_club.player.votes
browser_web
coffee_shop.happy_hour_has_coffee_shop
city_record.match.result
swimming.stadium.city
real_estate_properties.properties.property_type_code
election
hr_1.job_history.employee_id
cre_drama_workshop_groups.services
behavior_monitoring.assessment_notes.student_id
products_gen_characteristics.ref_characteristic_types
music_1.song.artist_name
debate.debate.venue
school_player.school.denomination
aircraft.match.winning_pilot
small_bank_1.savings
cre_docs_and_epenses.ref_budget_codes.budget_type_description
hospital_1.prescribes
cre_doc_template_mgt.paragraphs.paragraph_text
news_report.event.event_id
inn_1.rooms.bedtype
scholar.venue.venuename
cre_theme_park.visitors.tourist_id
customers_campaigns_ecommerce.customer_orders
shop_membership.membership_register_branch_has_shop_membership
mountain_photos.photos_has_mountain_photos
roller_coaster.roller_coaster
tracking_share_transactions.investors
driving_school.addresses.country
course_teach.course_arrange
game_injury.game.home_team
hospital_1.prescribes.medication
flight_1.flight.origin
local_govt_mdm.electoral_register_has_local_govt_mdm
real_estate_properties.other_available_features.feature_name
assets_maintenance.maintenance_engineers_has_assets_maintenance
real_estate_properties.ref_feature_types
insurance_and_eclaims.claims_processing
company_1.employee
manufacturer.manufacturer.open_year
dog_kennels.owners.last_name
behavior_monitoring.students.middle_name
assets_maintenance.engineer_visits.fault_status
aircraft.match.location
shop_membership.purchase.branch_id
flight_1.certificate.eid
customers_card_transactions.accounts.other_account_details
yelp.checkin.count
cre_docs_and_epenses.documents.document_name
activity_1.faculty.sex
candidate_poll.candidate.candidate_id
department_store.department_stores.store_email
tracking_grants_for_research.research_outcomes
department_store.products.product_name
cre_docs_and_epenses.statements_has_cre_docs_and_epenses
epinions_1.trust.target_u_id
theme_gallery.exhibition_record.attendance
college_1.course.dept_code
medicine_enzyme_interaction.medicine.fda_approved
imdb.keyword
tracking_grants_for_research.documents.document_id
customers_and_products_contacts.customers.customer_id
riding_club.club.club_id
journal_committee.editor
gymnast.gymnast.gymnast_id
tracking_grants_for_research.project_outcomes
game_1.student.sex
local_govt_in_alabama.events.event_id
customers_card_transactions.accounts.account_name
dog_kennels.owners.street
manufactory_1.manufacturers
music_1.files.artist_name
city_record.temperature.nov
products_for_hire.products_booked.booked_amount
museum_visit.visitor.id
school_player.school_details.class
customers_campaigns_ecommerce.order_items.order_id
twitter_1.user_profiles.followers
local_govt_and_lot.timed_status_of_things_has_local_govt_and_lot
solvency_ii.products_in_events.product_in_event_id
game_injury.game.score
university_basketball.basketball_match
school_bus.school_bus.driver_id
riding_club.coach_has_riding_club
store_product.district.headquartered_city
department_store.departments.department_id
assets_maintenance.third_party_companies.other_company_details
behavior_monitoring.addresses.country
customers_and_addresses.addresses.country
solvency_ii.products.product_name
tracking_software_problems.problems.reported_by_staff_id
student_assessment.students
geo.river.length
imdb.tags.id
behavior_monitoring.ref_incident_type.incident_type_description
insurance_and_eclaims.policies.end_date
course_teach.course_arrange.grade
device.stock.quantity
school_finance.endowment.endowment_id
college_1.department
tvshow.tv_channel.id
local_govt_and_lot.things.service_type_code
restaurant_1.visits_restaurant
journal_committee.editor.age
products_for_hire.payments.payment_date
architecture.mill.built_year
news_report.event.venue
coffee_shop.shop.num_of_staff
cre_doc_tracking_db.documents_to_be_destroyed.planned_destruction_date
hospital_1.patient.address
cre_drama_workshop_groups.services.service_type_code
customers_and_invoices.orders.order_id
assets_maintenance.third_party_companies.company_id
department_store.products.product_price
college_3.faculty.building
concert_singer.stadium.name
storm_record.region.region_id
imdb.producer.name
browser_web.accelerator_compatible_browser
game_1.plays_games.stuid
tracking_software_problems.staff.other_staff_details
activity_1.faculty_participates_in.facid
game_injury.injury_accident.id
machine_repair.technician
assets_maintenance.engineer_skills.skill_id
workshop_paper.workshop.venue
dorm_1.dorm_amenity
department_store.staff_department_assignments.date_assigned_to
customers_and_products_contacts.contacts
e_learning.students.date_of_latest_logon
tracking_orders.shipments.order_id
phone_market.phone_market.num_of_stock
tracking_share_transactions.purchases.purchase_details
music_4.artist.artist
city_record.temperature
riding_club.club.region
match_season.player.player_id
dog_kennels.owners.owner_id
assets_maintenance.third_party_companies.company_name
hr_1.job_history.department_id
driving_school.staff.last_name
tracking_software_problems.problems.problem_description
department_management.head.head_id
insurance_policies.claims.claim_id
voter_2.voting_record.treasurer_vote
orchestra.performance.performance_id
medicine_enzyme_interaction.medicine_enzyme_interaction
railway.railway.railway_id
customers_and_invoices.accounts.other_account_details
cre_theme_park.visits
music_4.artist.famous_release_date
hr_1.employees.job_id
game_injury.game.stadium_id
customers_and_products_contacts.order_items.order_quantity
tracking_share_transactions.sales
tracking_software_problems.problem_log.log_entry_fix
news_report.event.name
aircraft.airport.transit_passengers
decoration_competition.round.rank_in_round
geo.highlow.lowest_elevation
tvshow.cartoon.channel
school_finance.school.county
imdb.classification
concert_singer.concert_has_concert_singer
local_govt_and_lot.timed_locations_of_things.thing_id
network_2.personfriend.name
tracking_grants_for_research.tasks.project_id
cre_drama_workshop_groups.drama_workshop_groups.store_name
coffee_shop.happy_hour.shop_id
station_weather.train.destination
wrestler.elimination.time
loan_1.loan.loan_type
music_1.genre.g_name
candidate_poll.people.height
product_catalog.catalogs.date_of_latest_revision
wine_1.wine.winery
restaurant_1.student.advisor
local_govt_and_lot.residents.date_moved_out
e_learning.student_tests_taken.date_test_taken
driving_school.staff.nickname
sports_competition
scientist_1.projects.hours
workshop_paper
department_store.customer_orders.order_date
city_record.temperature.apr
shop_membership.membership_register_branch.register_year
device.shop.open_date
insurance_and_eclaims.claims_processing_stages.next_claim_stage_id
music_4.volume.issue_date
products_for_hire.products_for_hire.product_name
college_1.student.stu_hrs
student_transcripts_tracking.departments.department_name
hospital_1.appointment.prepnurse
soccer_2.player
customers_and_products_contacts.order_items.order_item_id
journal_committee.editor.editor_id
match_season.country
geo.lake.lake_name
shop_membership.purchase
customers_and_products_contacts.customers.customer_name
perpetrator.perpetrator.location
protein_institute.building.height_feet
student_transcripts_tracking.degree_programs.degree_summary_description
coffee_shop.happy_hour
entertainment_awards.festival_detail.chair_name
city_record.match.score
party_host.party.party_theme
station_weather.weekly_weather.precipitation
tracking_grants_for_research.documents.grant_id
cinema.film.directed_by
hospital_1.room_has_hospital_1
customer_deliveries.customer_addresses.address_id
student_assessment.students_has_student_assessment
network_2.person.name
cre_theme_park.theme_parks_has_cre_theme_park
yelp.tip.business_id
body_builder.body_builder.body_builder_id
tracking_orders.shipment_items
railway.train.train_num
college_1.student.stu_lname
browser_web.browser.id
customers_campaigns_ecommerce.premises.premise_id
insurance_and_eclaims.staff.staff_details
voter_2.student.stuid
student_transcripts_tracking.students.first_name
customers_and_invoices.orders.date_order_placed
mountain_photos.camera_lens.max_aperture
company_1.employee.address
customers_campaigns_ecommerce.mailshot_customers.outcome_code
epinions_1.trust.source_u_id
scholar.keyphrase.keyphraseid
assets_maintenance.staff.other_staff_details
cinema.cinema.cinema_id
student_assessment.addresses.state_province_county
behavior_monitoring.behavior_incident.recommendations
college_3.faculty.fname
shop_membership.membership_register_branch.branch_id
local_govt_in_alabama.participants.participant_id
loan_1.customer
book_2.publication.publication_date
local_govt_and_lot.timed_status_of_things.date_and_date
party_people
customers_and_invoices.invoice_line_items.product_title
college_3.enrolled_in.grade
cre_doc_control_systems.documents.receipt_number
insurance_and_eclaims.policies.customer_id
college_1.employee.emp_lname
poker_player.people.name
hr_1.employees.commission_pct
county_public_safety.city_has_county_public_safety
cre_theme_park.royal_family_has_cre_theme_park
driving_school.addresses.line_1_number_building
coffee_shop.shop.open_year
college_1.student.prof_num
pets_1.student.city_code
local_govt_mdm.rent_arrears
cre_theme_park.ref_hotel_star_ratings
products_gen_characteristics.ref_characteristic_types.characteristic_type_code
driving_school.customers.cell_mobile_phone_number
assets_maintenance.assets_has_assets_maintenance
college_1.department.school_code
music_4.volume.volume_id
customer_deliveries.order_deliveries.truck_id
museum_visit.visit
products_gen_characteristics.product_characteristics.product_characteristic_value
aircraft.match.round
program_share.channel.rating_in_percent
gymnast.gymnast_has_gymnast
battle_death.battle.date
pilot_record.pilot_record.date
culture_company.book_club.author_or_editor
imdb.movie.budget
product_catalog.catalog_contents.product_stock_number
driving_school.lessons.lesson_status_code
imdb.company.id
protein_institute
customers_and_addresses.addresses.zip_postcode
network_1.likes.student_id
solvency_ii.finances.other_details
tracking_grants_for_research.documents.response_received_date
customers_and_invoices.orders
store_product.store_product.product_id
wine_1.wine.price
academic.publication
company_1.project.dnum
apartment_rentals.apartment_bookings
soccer_2.college
battle_death.death.id
journal_committee.journal_committee
customers_and_addresses.order_items
aircraft.airport_aircraft
race_track.track.name
company_employee.company
small_bank_1.accounts.custid
orchestra.performance.share
department_store.supplier_addresses.date_from
tracking_grants_for_research.tasks_has_tracking_grants_for_research
match_season.team.team_id
concert_singer.concert.concert_id
game_1.sportsinfo_has_game_1
customers_and_addresses.products.product_id
e_learning.course_authors_and_tutors.author_tutor_atb
academic.conference
race_track.race
wine_1.wine.year
loan_1.bank.branch_id
architecture.mill.architect_id
dorm_1.lives_in.room_number
game_injury.injury_accident.game_id
car_1.model_list.model
driving_school.customer_payments
yelp.business.is_open
hospital_1.physician.ssn
epinions_1.item
restaurant_1.student.age
workshop_paper.acceptance
medicine_enzyme_interaction.enzyme.chromosome
student_transcripts_tracking.semesters.semester_id
document_management.document_sections.section_sequence
products_gen_characteristics.ref_colors.color_code
e_learning.student_course_enrolment
cre_drama_workshop_groups.stores.store_id
cre_doc_tracking_db.documents_to_be_destroyed
e_government.addresses.country
hr_1.jobs
scientist_1.projects.code
cre_docs_and_epenses.ref_budget_codes.budget_type_code
music_1.files.f_id
dog_kennels.professionals.last_name
shop_membership.purchase.year
assets_maintenance.fault_log.asset_id
driving_school.customer_payments_has_driving_school
insurance_fnol.first_notification_of_loss.fnol_id
medicine_enzyme_interaction.enzyme.product
dog_kennels.professionals.state
driving_school.customers.date_of_birth
imdb.tags.kid
farm.farm.sheep_and_goats
products_for_hire.products_for_hire.daily_hire_cost
poker_player.poker_player.best_finish
geo.city.country_name
wedding.people
customers_card_transactions.financial_transactions.previous_transaction_id
apartment_rentals.guests.guest_id
match_season.country.country_name
dog_kennels.owners.zip_code
solvency_ii.parties_in_events.event_id
customers_and_products_contacts.customers.customer_email
assets_maintenance.maintenance_contracts_has_assets_maintenance
cre_docs_and_epenses.ref_document_types.document_type_code
game_injury.stadium.id
dorm_1.dorm.gender
cre_drama_workshop_groups.performers
apartment_rentals.apartment_buildings
activity_1.student
medicine_enzyme_interaction.enzyme
customer_deliveries.customer_addresses.date_to
university_basketball.basketball_match.team_id
small_bank_1.savings.balance
flight_2.flights.destairport
customers_and_products_contacts.products.product_name
department_store.customer_orders.customer_id
hospital_1.on_call.oncallstart
customer_complaints.products.product_name
riding_club.player.player_id
body_builder.people.birth_date
customer_deliveries.delivery_route_locations
dog_kennels.treatment_types.treatment_type_description
cre_theme_park.shops
real_estate_properties.properties.room_count
customer_deliveries.addresses.address_details
driving_school.customers.date_became_customer
phone_1.chip_model.model_name
college_1.employee.emp_hiredate
dorm_1.student
customer_complaints.complaints.complaint_outcome_code
news_report.journalist.name
pilot_record.aircraft.order_year
tvshow.cartoon.title
network_1.highschooler.id
company_1.project.pnumber
soccer_2.player.ycard
product_catalog.catalogs.catalog_id
car_1.continents.contid
film_rank.film_market_estimation.low_estimate
student_transcripts_tracking.transcript_contents.transcript_id
student_assessment.addresses.line_2
products_for_hire.view_product_availability
ship_1.ship.flag
perpetrator.people.weight
products_for_hire.customers.customer_id
movie_1.movie.mid
museum_visit.visit.num_of_ticket
insurance_fnol.first_notification_of_loss.service_id
e_learning.student_tests_taken
student_transcripts_tracking.addresses
car_1.car_makers.country
csu_1.csu_fees.year
local_govt_mdm.parking_fines
school_player.school.school_id
club_1.club
match_season.match_season.draft_pick_number
customers_and_products_contacts.addresses
document_management.document_sections_images.image_id
imdb.made_by.pid
school_player.school.day_or_boarding
department_store.addresses.address_id
e_government.forms.form_id
customer_deliveries.delivery_route_locations.location_name
e_learning.students.date_of_registration
station_weather.weekly_weather.low_temperature
assets_maintenance.fault_log.fault_description
pets_1.student.sex
train_station.station.location
insurance_policies.customer_policies_has_insurance_policies
e_learning.students.password
e_learning.subjects.subject_name
scientist_1.projects.name
tvshow.tv_series_has_tvshow
imdb.tags.msid
machine_repair.technician.team
cre_doc_template_mgt.templates
party_people.member
body_builder.people.birth_place
university_basketball.basketball_match.acc_road
college_1.student.stu_gpa
employee_hire_evaluation.shop.district
company_office.buildings
student_transcripts_tracking.sections.section_name
protein_institute.institution.institution
device.device
coffee_shop.happy_hour.month
apartment_rentals.apartment_bookings.booking_start_date
activity_1.faculty_participates_in
company_employee.people
cre_theme_park.theme_parks.theme_park_details
tracking_orders
loan_1.bank.no_of_customers
flight_2.airports.city
e_learning.courses.course_description
body_builder.body_builder.total
apartment_rentals.apartments.room_count
cre_drama_workshop_groups.addresses.address_id
store_product.store_district_has_store_product
customers_and_invoices.invoice_line_items.derived_total_cost
icfp_1.authorship.authid
voter_2.voting_record.stuid
roller_coaster
product_catalog.attribute_definitions.attribute_name
manufactory_1.products.name
e_learning.courses.subject_id
school_bus.school.type
tracking_orders.shipment_items.order_item_id
academic.author.homepage
geo.river.traverse
musical.musical.award
wrestler.wrestler.event
tracking_share_transactions.transactions_lots
manufacturer.furniture.num_of_component
game_injury.game
entertainment_awards.festival_detail.year
customers_and_addresses.customer_contact_channels.channel_code
music_1.artist.preferred_genre
driving_school.customers.amount_outstanding
store_product.store.number_of_product_category
cre_doc_tracking_db.employees.employee_id
imdb.copyright.id
behavior_monitoring.student_addresses.monthly_rental
driving_school.staff.staff_id
scholar.journal
program_share.broadcast_share.channel_id
cre_doc_control_systems.ref_document_status.document_status_description
swimming.stadium
college_1.student_has_college_1
aircraft.airport
products_gen_characteristics.ref_colors
car_1.continents
yelp.review
college_3.faculty.phone
gas_company.gas_station
yelp.business.business_id
customers_campaigns_ecommerce.customers.customer_address
real_estate_properties.properties.vendor_requested_price
tvshow.tv_channel.content
cre_theme_park.ref_attraction_types.attraction_type_code
yelp.business.longitude
behavior_monitoring.behavior_incident
school_finance.school.ihsaa_class
entertainment_awards
e_government
car_1.cars_data.horsepower
hospital_1.stay
browser_web.web_client_accelerator.id
city_record.city.gdp
cre_doc_tracking_db.ref_calendar
tracking_grants_for_research.project_outcomes.project_id
assets_maintenance.staff.staff_name
icfp_1
imdb.cast.role
station_weather.weekly_weather.high_temperature
csu_1.degrees.campus
company_1.dependent.dependent_name
cinema.schedule
game_injury.stadium.capacity_percentage
local_govt_in_alabama.participants_in_events.participant_id
party_people.member.party_id
school_player.player
student_transcripts_tracking.students.other_student_details
music_4.music_festival.category
architecture.mill.notes
csu_1.enrollments.campus
insurance_fnol.customers.customer_id
flight_company.operate_company.principal_activities
driving_school.customers.phone_number
city_record.city.hanzi
student_1.list.classroom
insurance_policies.customers.customer_id
soccer_2.college.enr
wine_1.appellations.no
hospital_1.trained_in.treatment
battle_death.battle.id
behavior_monitoring.students.first_name
yelp.business.name
railway.manager.working_year_starts
swimming.swimmer
party_people.party
activity_1.participates_in
restaurant_1.student
restaurant_1.type_of_restaurant.resid
flight_company.operate_company.type
e_government.party_addresses.address_type_code
imdb.movie.title
swimming.swimmer.meter_600
csu_1.enrollments.fte_ay
gymnast.gymnast.pommel_horse_points
local_govt_and_lot.properties.property_type_code
election.county
ship_mission.mission.fate
museum_visit.visitor.age
device.device.device_id
customers_and_addresses.customer_addresses.address_id
scientist_1.scientists.name
tracking_grants_for_research.staff_roles.role_code
student_transcripts_tracking.degree_programs.degree_summary_name
customers_and_invoices.customers.customer_first_name
customer_deliveries.order_deliveries.location_code
gymnast.people.people_id
customers_and_invoices.financial_transactions.transaction_amount
tracking_grants_for_research.documents.document_type_code
news_report.event.event_attendance
party_people.party.took_office
insurance_and_eclaims.claim_headers.policy_id
culture_company.book_club
student_transcripts_tracking.departments.department_id
products_for_hire.payments.booking_id
student_transcripts_tracking.students.last_name
university_basketball.university.primary_conference
party_people.member_has_party_people
tracking_orders.order_items.product_id
hospital_1.appointment.patient
imdb.tv_series
assets_maintenance.maintenance_contracts.maintenance_contract_id
insurance_fnol.claims_has_insurance_fnol
insurance_fnol.settlements.settlement_amount
solvency_ii.products_in_events
behavior_monitoring.detention.teacher_id
cre_doc_control_systems.ref_shipping_agents.shipping_agent_code
orchestra.show
architecture.architect.id
customers_and_invoices.accounts_has_customers_and_invoices
assets_maintenance.skills_required_to_fix.skill_id
hr_1.regions.region_id
student_assessment.people
activity_1.faculty.facid
swimming.stadium.id
geo.mountain
apartment_rentals.apartment_bookings_has_apartment_rentals
restaurant_1.student.lname
cre_theme_park.staff.tourist_attraction_id
coffee_shop.member.time_of_purchase
wedding.people.name
customers_campaigns_ecommerce.mailshot_campaigns.mailshot_start_date
cre_drama_workshop_groups.invoice_items
department_store.product_suppliers
csu_1.faculty
debate.people.name
driving_school.lessons_has_driving_school
department_store.addresses.address_details
products_for_hire.customers.date_last_hire
customer_deliveries.employees.employee_address_id
entrepreneur.entrepreneur.company
customers_campaigns_ecommerce.mailshot_campaigns.mailshot_name
train_station
hospital_1.medication.code
twitter_1.follows.f2
machine_repair.machine.machine_id
college_1.enroll.class_code
workshop_paper.workshop
products_for_hire.bookings_has_products_for_hire
hr_1.locations_has_hr_1
university_basketball.basketball_match.acc_home
e_government.individuals.individual_address
customer_deliveries.delivery_routes.other_route_details
imdb.writer.birth_year
phone_market.phone
academic.author.aid
local_govt_and_lot.residents
musical.musical.musical_id
music_1.files_has_music_1
customers_campaigns_ecommerce.mailshot_customers
department_store.departments
college_1.student.stu_phone
ship_1.captain.age
candidate_poll.candidate.people_id
epinions_1.review.a_id
gas_company.company.headquarters
solvency_ii
product_catalog
customers_and_invoices.customers.email_address
protein_institute.institution.institution_id
decoration_competition.college.leader_name
tracking_grants_for_research.projects.project_id
tracking_share_transactions.purchases_has_tracking_share_transactions
manufacturer.furniture_manufacte
musical.actor.musical_id
behavior_monitoring.detention_has_behavior_monitoring
insurance_fnol.claims.fnol_id
train_station.station
railway
hr_1
customers_and_invoices.product_categories
match_season.player
voter_1.area_code_state.area_code
customers_and_addresses.customer_orders.order_details
store_product.store_product.store_id
tracking_software_problems.product.product_name
election_representative.election
body_builder.people.weight
car_1.car_names_has_car_1
tracking_share_transactions.ref_transaction_types.transaction_type_code
manufactory_1.manufacturers.founder
farm.farm_competition.theme
solvency_ii.agreements.event_id
customers_and_products_contacts.customer_address_history.date_to
music_2.band.lastname
cre_theme_park.shops.shop_details
pilot_record.aircraft
local_govt_mdm.cmi_cross_references.source_system_code
college_3.student.major
candidate_poll.candidate.poll_source
product_catalog.catalogs.catalog_name
wine_1.appellations.isava
election.party.comptroller
university_basketball.university.affiliation
allergy_1.student.major
cre_doc_control_systems.document_drafts_has_cre_doc_control_systems
scholar.paper.paperid
cre_drama_workshop_groups.addresses.line_2
restaurant_1.type_of_restaurant
entertainment_awards.artwork.artwork_id
ship_1.captain.class
election_representative.election_has_election_representative
perpetrator.perpetrator.date
music_4.volume
hospital_1.stay.stayid
cre_drama_workshop_groups.invoice_items.product_id
driving_school.lessons.vehicle_id
customer_complaints.complaints.complaint_id
station_weather.weekly_weather.wind_speed_mph
film_rank.film_market_estimation_has_film_rank
restaurants.geographic.city_name
dog_kennels.professionals.home_phone
restaurant_1.restaurant_type.restypeid
restaurant_1.type_of_restaurant.restypeid
theme_gallery.exhibition.exhibition_id
manufacturer
riding_club.match_result.bronze
e_government.individuals.individual_last_name
student_transcripts_tracking.student_enrolment_courses
icfp_1.papers.title
hospital_1.block
county_public_safety.county_public_safety.name
sports_competition.club_rank.silver
decoration_competition.round
car_1.car_names
network_1.friend.student_id
cre_drama_workshop_groups.customer_orders.planned_delivery_date
solvency_ii.channels.other_details
station_weather.train.interval
apartment_rentals.view_unit_status.status_date
race_track.track
tracking_grants_for_research.organisation_types.organisation_type_description
assets_maintenance.engineer_visits
soccer_2
election.party.attorney_general
race_track.race.track_id
local_govt_and_lot.customer_events
customers_card_transactions.customers
tracking_grants_for_research
music_2.band.firstname
assets_maintenance.part_faults
cre_theme_park.visits.visit_id
tracking_software_problems.problem_status_codes
school_bus.school.school_id
customers_campaigns_ecommerce.customers.customer_email
cre_doc_template_mgt.documents.document_description
solvency_ii.channels
medicine_enzyme_interaction.enzyme.location
e_government.services
flight_2.airlines.abbreviation
cre_doc_tracking_db.documents_to_be_destroyed.actual_destruction_date
department_store.product_suppliers.total_amount_purchased
singer.singer.net_worth_millions
musical.actor.duration
voter_2.voting_record.election_cycle
local_govt_and_lot.residents_services.service_id
cre_drama_workshop_groups.addresses
journal_committee.journal.date
solvency_ii.agreements_has_solvency_ii
candidate_poll.candidate.unsure_rate
browser_web.web_client_accelerator.connection
academic.author.name
student_transcripts_tracking.transcripts.transcript_id
body_builder.body_builder.clean_jerk
party_people.party_events.party_id
driving_school.addresses.address_id
hospital_1.physician.name
decoration_competition
customer_deliveries.regular_orders.regular_order_id
concert_singer.stadium.lowest
twitter_1.user_profiles.partitionid
customer_complaints.customers.customer_type_code
hospital_1.undergoes.stay
behavior_monitoring.assessment_notes
e_learning.students
employee_hire_evaluation.hiring
dorm_1.dorm.dormid
manufacturer.manufacturer.num_of_factories
document_management
film_rank.market.country
customer_complaints.staff.last_name
customers_campaigns_ecommerce.customer_orders.order_status_code
local_govt_mdm.electoral_register
company_office
cinema.film.rank_in_series
cre_drama_workshop_groups.performers.other_details
insurance_policies.claims.date_claim_settled
program_share.broadcast.program_id
behavior_monitoring.students_in_detention.detention_id
roller_coaster.roller_coaster_has_roller_coaster
local_govt_and_lot.customer_events.customer_event_id
tracking_software_problems.problem_log_has_tracking_software_problems
customers_and_products_contacts.customer_orders
tracking_orders.invoices.invoice_details
customers_and_invoices.customers.country
local_govt_mdm.benefits_overpayments.cmi_cross_ref_id
epinions_1.item.i_id
customers_campaigns_ecommerce.customers.customer_password
student_transcripts_tracking.students.permanent_address_id
storm_record.storm.number_deaths
local_govt_mdm.cmi_cross_references.master_customer_id
dog_kennels.professionals.cell_number
student_assessment.student_course_attendance.student_id
news_report.journalist
coffee_shop.shop.address
tracking_grants_for_research.organisations.organisation_type
*
cre_docs_and_epenses.documents.document_date
geo.lake.state_name
imdb.writer.gender
insurance_and_eclaims.customers
cre_docs_and_epenses.accounts.account_id
aircraft.airport_aircraft.aircraft_id
mountain_photos.mountain.id
customer_deliveries.delivery_routes
activity_1.student.sex
e_learning.course_authors_and_tutors.personal_name
college_3.course.credits
department_store.department_store_chain
school_finance.school.enrollment
ship_1.ship.class
music_4.artist.artist_id
customer_deliveries.addresses
behavior_monitoring.students_in_detention.incident_id
wrestler.elimination.eliminated_by
local_govt_mdm.rent_arrears_has_local_govt_mdm
epinions_1.review.rating
customers_and_addresses.customer_contact_channels.contact_number
car_1.countries.continent
customers_campaigns_ecommerce.products.product_name
customers_and_invoices.invoice_line_items.order_item_id
race_track.track.track_id
customers_and_products_contacts.customer_address_history
singer.song.singer_id
imdb.actor.name
gymnast.gymnast.rings_points
coffee_shop.happy_hour_member.hh_id
tracking_share_transactions.lots.lot_id
solvency_ii.addresses.address_id
mountain_photos.camera_lens.name
imdb.writer.name
county_public_safety.city.multiracial
tracking_grants_for_research.document_types
tracking_grants_for_research.project_staff.role_code
cre_drama_workshop_groups.performers_in_bookings.performer_id
behavior_monitoring.students_in_detention
coffee_shop.happy_hour_member.total_amount
local_govt_and_lot.properties.property_address
concert_singer.singer_in_concert.singer_id
restaurant_1.restaurant_type.restypedescription
product_catalog.catalog_structure_has_product_catalog
student_transcripts_tracking.students_has_student_transcripts_tracking
farm.competition_record.competition_id
yelp.tip.text
company_office.buildings.name
academic.organization.name
pilot_record.pilot_record.record_id
entrepreneur.entrepreneur
car_1.cars_data
loan_1.customer.cust_name
music_1.song
twitter_1.user_profiles.uid
products_for_hire.products_booked.returned_late_yn
yelp.review.month
cre_drama_workshop_groups.invoice_items.order_item_id
cre_doc_tracking_db.document_locations.date_in_locaton_to
museum_visit.visitor
twitter_1.tweets
apartment_rentals.apartment_bookings.booking_end_date
browser_web.accelerator_compatible_browser.compatible_since_year
swimming.swimmer.meter_100
cre_doc_control_systems.circulation_history.employee_id
products_for_hire.products_for_hire
activity_1.activity
