[
    {
        "question": "list names of all departments ordered by their names.",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nRETURN department.DEPT_NAME\nORDER BY department.DEPT_NAME",
        "db_id": "college_1",
        "answers": [
            [
                "Accounting"
            ],
            [
                "Biology"
            ],
            [
                "Computer Info. Systems"
            ],
            [
                "Economics/Finance"
            ],
            [
                "English"
            ],
            [
                "Fine Arts"
            ],
            [
                "History"
            ],
            [
                "Marketing/Management"
            ],
            [
                "Mathematics"
            ],
            [
                "Psychology"
            ],
            [
                "Sociology"
            ]
        ]
    },
    {
        "question": "List the codes of all courses that take place in room KLR209.",
        "query": "MATCH (class:`college_1.CLASS`)\nWHERE class.CLASS_ROOM = 'KLR209'\nRETURN class.CLASS_CODE",
        "db_id": "college_1",
        "answers": [
            [
                "10017"
            ],
            [
                "10019"
            ],
            [
                "10020"
            ]
        ]
    },
    {
        "question": "List the first name of all employees with job code PROF ordered by their date of birth.",
        "query": "MATCH (employee:`college_1.EMPLOYEE`)\nWHERE employee.EMP_JOBCODE = 'PROF'\nRETURN employee.EMP_FNAME\nORDER BY employee.EMP_DOB",
        "db_id": "college_1",
        "answers": [
            [
                "Robert"
            ],
            [
                "Gerald"
            ],
            [
                "Peter"
            ],
            [
                "Ross"
            ],
            [
                "Ronald"
            ],
            [
                "James"
            ],
            [
                "Melanie"
            ],
            [
                "George"
            ],
            [
                "Preston"
            ],
            [
                "Carlos"
            ],
            [
                "Arnelle"
            ],
            [
                "Hermine"
            ],
            [
                "Van"
            ],
            [
                "Ronald"
            ],
            [
                "Ismael"
            ],
            [
                "Willa"
            ],
            [
                "Herman"
            ],
            [
                "Robert"
            ],
            [
                "Annelise"
            ],
            [
                "Doreen"
            ],
            [
                "Anne"
            ],
            [
                "Ralph"
            ]
        ]
    },
    {
        "question": "Find the name and address of the department that has the highest number of students.",
        "query": "MATCH (T1:`college_1.STUDENT`)-[]-(T2:`college_1.DEPARTMENT`)\nWITH T2.DEPT_NAME AS DEPT_NAME, T2.DEPT_ADDRESS AS DEPT_ADDRESS, count(T1.DEPT_CODE) AS count\nRETURN DEPT_NAME,DEPT_ADDRESS\nORDER BY count DESC\nLIMIT 1",
        "db_id": "college_1",
        "answers": [
            [
                "Accounting",
                "KLR 211, Box 52"
            ]
        ]
    },
    {
        "question": "Find the name, address, number of students in the departments that have the top 3 highest number of students.",
        "query": "MATCH (T1:`college_1.STUDENT`)-[]-(T2:`college_1.DEPARTMENT`)\nWITH T2.DEPT_NAME AS DEPT_NAME, T2.DEPT_ADDRESS AS DEPT_ADDRESS, count(T1.DEPT_CODE) AS count\nRETURN DEPT_NAME,DEPT_ADDRESS,count\nORDER BY count DESC\nLIMIT 3",
        "db_id": "college_1",
        "answers": [
            [
                "Accounting",
                "KLR 211, Box 52",
                3
            ],
            [
                "Computer Info. Systems",
                "KLR 333, Box 56",
                2
            ],
            [
                "Biology",
                "AAK 230, Box 415",
                1
            ]
        ]
    },
    {
        "question": "What is the name, address, and number of students in the departments that have the 3 most students?",
        "query": "MATCH (T1:`college_1.STUDENT`)-[]-(T2:`college_1.DEPARTMENT`)\nWITH T2.DEPT_NAME AS DEPT_NAME, T2.DEPT_ADDRESS AS DEPT_ADDRESS, count(T1.DEPT_CODE) AS count\nRETURN DEPT_NAME,DEPT_ADDRESS,count\nORDER BY count DESC\nLIMIT 3",
        "db_id": "college_1",
        "answers": [
            [
                "Accounting",
                "KLR 211, Box 52",
                3
            ],
            [
                "Computer Info. Systems",
                "KLR 333, Box 56",
                2
            ],
            [
                "Biology",
                "AAK 230, Box 415",
                1
            ]
        ]
    },
    {
        "question": "List the distinct region of clubs in ascending alphabetical order.",
        "query": "MATCH (club:`sports_competition.club`)\nRETURN DISTINCT club.Region\nORDER BY club.Region ASC",
        "db_id": "sports_competition",
        "answers": [
            [
                "Brazil"
            ],
            [
                "China"
            ],
            [
                "England"
            ],
            [
                "Japan"
            ],
            [
                "UK"
            ],
            [
                "USA"
            ]
        ]
    },
    {
        "question": "What are the distinct years in which the competitions type is not \"Tournament\"?",
        "query": "MATCH (competition:`sports_competition.competition`)\nWHERE competition.Competition_type <> 'Tournament'\nRETURN DISTINCT competition.Year",
        "db_id": "sports_competition",
        "answers": [
            [
                2006.0
            ],
            [
                2007.0
            ]
        ]
    },
    {
        "question": "What are the maximum and minimum number of silver medals for clubs.",
        "query": "MATCH (club_rank:`sports_competition.club_rank`)\nRETURN max(club_rank.Silver),min(club_rank.Silver)",
        "db_id": "sports_competition",
        "answers": [
            [
                11.0,
                1.0
            ]
        ]
    },
    {
        "question": "List all club names in ascending order of start year.",
        "query": "MATCH (club:`sports_competition.club`)\nRETURN club.name\nORDER BY club.Start_year ASC",
        "db_id": "sports_competition",
        "answers": [
            [
                "BK Slide"
            ],
            [
                "HGS2"
            ],
            [
                "ASC"
            ],
            [
                "IFG"
            ],
            [
                "AIB"
            ],
            [
                "HSBIF"
            ]
        ]
    },
    {
        "question": "List all club names in descending alphabetical order.",
        "query": "MATCH (club:`sports_competition.club`)\nRETURN club.name\nORDER BY club.name DESC",
        "db_id": "sports_competition",
        "answers": [
            [
                "IFG"
            ],
            [
                "HSBIF"
            ],
            [
                "HGS2"
            ],
            [
                "BK Slide"
            ],
            [
                "ASC"
            ],
            [
                "AIB"
            ]
        ]
    },
    {
        "question": "Please show the names and the players of clubs.",
        "query": "MATCH (T1:`sports_competition.club`)-[]-(T2:`sports_competition.player`)\nRETURN T1.name,T2.Player_ID",
        "db_id": "sports_competition",
        "answers": [
            [
                "AIB",
                3
            ],
            [
                "AIB",
                1
            ],
            [
                "BK Slide",
                9
            ],
            [
                "BK Slide",
                12
            ],
            [
                "BK Slide",
                10
            ],
            [
                "BK Slide",
                4
            ],
            [
                "BK Slide",
                11
            ],
            [
                "BK Slide",
                2
            ],
            [
                "IFG",
                13
            ],
            [
                "ASC",
                14
            ],
            [
                "ASC",
                6
            ],
            [
                "ASC",
                15
            ],
            [
                "ASC",
                5
            ],
            [
                "HGS2",
                7
            ],
            [
                "HGS2",
                8
            ]
        ]
    },
    {
        "question": "Show the names of clubs that have players with position \"Right Wing\".",
        "query": "MATCH (T1:`sports_competition.club`)-[]-(T2:`sports_competition.player`)\nWHERE T2.Position = 'Right Wing'\nRETURN T1.name",
        "db_id": "sports_competition",
        "answers": [
            [
                "BK Slide"
            ]
        ]
    },
    {
        "question": "What is the average points of players from club with name \"AIB\".",
        "query": "MATCH (T1:`sports_competition.club`)-[]-(T2:`sports_competition.player`)\nWHERE T1.name = 'AIB'\nRETURN avg(T2.Points)",
        "db_id": "sports_competition",
        "answers": [
            [
                28.0
            ]
        ]
    },
    {
        "question": "List the types of competition and the number of competitions of each type.",
        "query": "MATCH (competition:`sports_competition.competition`)\nWITH count(competition.Competition_type) AS count, competition.Competition_type AS Competition_type\nRETURN Competition_type,count",
        "db_id": "sports_competition",
        "answers": [
            [
                "Friendly",
                8
            ],
            [
                "Tournament",
                3
            ]
        ]
    },
    {
        "question": "List the most common type of competition.",
        "query": "MATCH (competition:`sports_competition.competition`)\nWITH count(competition.Competition_type) AS count, competition.Competition_type AS Competition_type\nRETURN Competition_type\nORDER BY count DESC\nLIMIT 1",
        "db_id": "sports_competition",
        "answers": [
            [
                "Friendly"
            ]
        ]
    },
    {
        "question": "What is the most common competition type?",
        "query": "MATCH (competition:`sports_competition.competition`)\nWITH count(competition.Competition_type) AS count, competition.Competition_type AS Competition_type\nRETURN Competition_type\nORDER BY count DESC\nLIMIT 1",
        "db_id": "sports_competition",
        "answers": [
            [
                "Friendly"
            ]
        ]
    },
    {
        "question": "List the types of competition that have at most five competitions of that type.",
        "query": "MATCH (competition:`sports_competition.competition`)\nWITH count(*) AS count, competition.Competition_type AS Competition_type\nWHERE count  <= 5\nRETURN Competition_type",
        "db_id": "sports_competition",
        "answers": [
            [
                "Tournament"
            ]
        ]
    },
    {
        "question": "List the names of clubs that do not have any players.",
        "query": "MATCH (club:`sports_competition.club`)\nWHERE NOT (club:`sports_competition.club`)-[]-(:`sports_competition.player`)\nRETURN club.name",
        "db_id": "sports_competition",
        "answers": [
            [
                "HSBIF"
            ]
        ]
    },
    {
        "question": "find the number of players whose points are lower than 30 in each position.",
        "query": "MATCH (player:`sports_competition.player`)\nWHERE player.Points < 30\nWITH player.Position AS Position, count(player.Position) AS count\nRETURN count,Position",
        "db_id": "sports_competition",
        "answers": [
            [
                1,
                "Full Back"
            ],
            [
                1,
                "Left Wing"
            ],
            [
                3,
                "Prop"
            ],
            [
                3,
                "Second Row"
            ],
            [
                1,
                "Loose Forward"
            ]
        ]
    },
    {
        "question": "Return the name and id of the furniture with the highest market rate.",
        "query": "MATCH (furniture:`manufacturer.furniture`)\nRETURN furniture.Name,furniture.Furniture_ID\nORDER BY furniture.Market_Rate DESC\nLIMIT 1",
        "db_id": "manufacturer",
        "answers": [
            [
                "Billiard table",
                1
            ]
        ]
    },
    {
        "question": "Find the component amounts and names of all furnitures that have more than 10 components.",
        "query": "MATCH (furniture:`manufacturer.furniture`)\nWHERE furniture.Num_of_Component > 10\nRETURN furniture.Num_of_Component,furniture.Name",
        "db_id": "manufacturer",
        "answers": [
            [
                14,
                "Billiard table"
            ],
            [
                12,
                "Dining set"
            ]
        ]
    },
    {
        "question": "Find the name and component amount of the least popular furniture.",
        "query": "MATCH (furniture:`manufacturer.furniture`)\nRETURN furniture.Name,furniture.Num_of_Component\nORDER BY furniture.Market_Rate\nLIMIT 1",
        "db_id": "manufacturer",
        "answers": [
            [
                "Hatstand",
                5
            ]
        ]
    },
    {
        "question": "Which manufacturer has the most number of shops? List its name and year of opening.",
        "query": "MATCH (manufacturer:`manufacturer.manufacturer`)\nRETURN manufacturer.Open_Year,manufacturer.Name\nORDER BY manufacturer.Num_of_Shops DESC\nLIMIT 1",
        "db_id": "manufacturer",
        "answers": [
            [
                1992.0,
                "Jiaju"
            ]
        ]
    },
    {
        "question": "Find the average number of factories for the manufacturers that have more than 20 shops.",
        "query": "MATCH (manufacturer:`manufacturer.manufacturer`)\nWHERE manufacturer.Num_of_Shops > 20\nRETURN avg(manufacturer.Num_of_Factories)",
        "db_id": "manufacturer",
        "answers": [
            [
                19.5
            ]
        ]
    },
    {
        "question": "List all manufacturer names and ids ordered by their opening year.",
        "query": "MATCH (manufacturer:`manufacturer.manufacturer`)\nRETURN manufacturer.Name,manufacturer.Manufacturer_ID\nORDER BY manufacturer.Open_Year",
        "db_id": "manufacturer",
        "answers": [
            [
                "Chevrolet House",
                1
            ],
            [
                "IKEA",
                2
            ],
            [
                "Ford Make",
                3
            ],
            [
                "Jiaju",
                4
            ],
            [
                "Chevrolet",
                5
            ],
            [
                "Dodge",
                6
            ],
            [
                "Tomorrow",
                7
            ]
        ]
    },
    {
        "question": "Give me the name and year of opening of the manufacturers that have either less than 10 factories or more than 10 shops.",
        "query": "MATCH (manufacturer:`manufacturer.manufacturer`)\nWHERE manufacturer.Num_of_Shops > 10 OR manufacturer.Num_of_Factories < 10\nRETURN manufacturer.Name,manufacturer.Open_Year",
        "db_id": "manufacturer",
        "answers": [
            [
                "IKEA",
                1990.0
            ],
            [
                "Jiaju",
                1992.0
            ],
            [
                "Chevrolet",
                2000.0
            ],
            [
                "Dodge",
                2001.0
            ]
        ]
    },
    {
        "question": "what is the average number of factories and maximum number of shops for manufacturers that opened before 1990.",
        "query": "MATCH (manufacturer:`manufacturer.manufacturer`)\nWHERE manufacturer.Open_Year < 1990\nRETURN max(manufacturer.Num_of_Shops),avg(manufacturer.Num_of_Factories)",
        "db_id": "manufacturer",
        "answers": [
            [
                8,
                36.0
            ]
        ]
    },
    {
        "question": "Find the market shares and names of furnitures which no any company is producing in our records.",
        "query": "MATCH (furniture:`manufacturer.furniture`)\nWHERE NOT (furniture:`manufacturer.furniture`)-[:`manufacturer.furniture_manufacte`]-()\nRETURN furniture.Market_Rate,furniture.Name",
        "db_id": "manufacturer",
        "answers": [
            [
                3.5,
                "Bench"
            ],
            [
                2.0,
                "Four-poster bed"
            ]
        ]
    },
    {
        "question": "Display the first name, and department number for all employees whose last name is \"McEwen\".",
        "query": "MATCH (employees:`hr_1.employees`)\nWHERE employees.LAST_NAME = 'McEwen'\nRETURN employees.FIRST_NAME,employees.DEPARTMENT_ID",
        "db_id": "hr_1",
        "answers": [
            [
                "Allan",
                80
            ]
        ]
    },
    {
        "question": "Return the phone numbers of employees with salaries between 8000 and 12000.",
        "query": "MATCH (employees:`hr_1.employees`)\nWHERE 8000<=employees.SALARY<=12000\nRETURN employees.PHONE_NUMBER",
        "db_id": "hr_1",
        "answers": [
            [
                "590.423.4567"
            ],
            [
                "515.124.4569"
            ],
            [
                "515.124.4169"
            ],
            [
                "515.124.4269"
            ],
            [
                "515.127.4561"
            ],
            [
                "650.123.1234"
            ],
            [
                "650.123.2234"
            ],
            [
                "011.44.1344.429278"
            ],
            [
                "011.44.1344.619268"
            ],
            [
                "011.44.1344.429018"
            ],
            [
                "011.44.1344.129268"
            ],
            [
                "011.44.1344.345268"
            ],
            [
                "011.44.1344.478968"
            ],
            [
                "011.44.1344.498718"
            ],
            [
                "011.44.1345.429268"
            ],
            [
                "011.44.1345.929268"
            ],
            [
                "011.44.1345.829268"
            ],
            [
                "011.44.1345.729268"
            ],
            [
                "011.44.1346.129268"
            ],
            [
                "011.44.1346.229268"
            ],
            [
                "011.44.1343.929268"
            ],
            [
                "011.44.1343.829268"
            ],
            [
                "011.44.1343.729268"
            ],
            [
                "011.44.1644.429267"
            ],
            [
                "011.44.1644.429266"
            ],
            [
                "011.44.1644.429265"
            ],
            [
                "011.44.1644.429264"
            ],
            [
                "515.123.8888"
            ],
            [
                "515.123.8080"
            ],
            [
                "515.123.8181"
            ]
        ]
    },
    {
        "question": "display the job title of jobs which minimum salary is greater than 9000.",
        "query": "MATCH (jobs:`hr_1.jobs`)\nWHERE jobs.MIN_SALARY > 9000\nRETURN jobs.JOB_TITLE",
        "db_id": "hr_1",
        "answers": [
            [
                "President"
            ],
            [
                "Administration Vice President"
            ],
            [
                "Sales Manager"
            ]
        ]
    },
    {
        "question": "display the country ID and number of cities for each country.",
        "query": "MATCH (locations:`hr_1.locations`)\nWITH count(locations.COUNTRY_ID) AS count, locations.COUNTRY_ID AS COUNTRY_ID\nRETURN COUNTRY_ID,count",
        "db_id": "hr_1",
        "answers": [
            [
                "IT",
                2
            ],
            [
                "JP",
                2
            ],
            [
                "US",
                4
            ],
            [
                "CA",
                2
            ],
            [
                "CN",
                1
            ],
            [
                "IN",
                1
            ],
            [
                "AU",
                1
            ],
            [
                "SG",
                1
            ],
            [
                "UK",
                2
            ],
            [
                "Ox",
                1
            ],
            [
                "DE",
                1
            ],
            [
                "BR",
                1
            ],
            [
                "CH",
                2
            ],
            [
                "NL",
                1
            ],
            [
                "\"",
                1
            ]
        ]
    },
    {
        "question": "display the ID for those employees who did two or more jobs in the past.",
        "query": "MATCH (job_history:`hr_1.job_history`)\nWITH count(*) AS count, job_history.EMPLOYEE_ID AS EMPLOYEE_ID\nWHERE count  >= 2\nRETURN EMPLOYEE_ID",
        "db_id": "hr_1",
        "answers": [
            [
                101
            ],
            [
                200
            ],
            [
                176
            ]
        ]
    },
    {
        "question": "Find the id of the song that lasts the longest.",
        "query": "MATCH (files:`music_1.files`)\nRETURN files.f_id\nORDER BY files.duration DESC\nLIMIT 1",
        "db_id": "music_1",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "question": "Find the names of all English songs.",
        "query": "MATCH (song:`music_1.song`)\nWHERE song.languages = 'english'\nRETURN song.song_name",
        "db_id": "music_1",
        "answers": [
            [
                "My love"
            ],
            [
                "Just beat it"
            ]
        ]
    },
    {
        "question": "What are the names of all songs in English?",
        "query": "MATCH (song:`music_1.song`)\nWHERE song.languages = 'english'\nRETURN song.song_name",
        "db_id": "music_1",
        "answers": [
            [
                "My love"
            ],
            [
                "Just beat it"
            ]
        ]
    },
    {
        "question": "What are the id of songs whose format is mp3.",
        "query": "MATCH (files:`music_1.files`)\nWHERE files.formats = 'mp3'\nRETURN files.f_id",
        "db_id": "music_1",
        "answers": [
            [
                2
            ],
            [
                5
            ]
        ]
    },
    {
        "question": "What are the id of all the files in mp3 format?",
        "query": "MATCH (files:`music_1.files`)\nWHERE files.formats = 'mp3'\nRETURN files.f_id",
        "db_id": "music_1",
        "answers": [
            [
                2
            ],
            [
                5
            ]
        ]
    },
    {
        "question": "List the name and country of origin for all singers who have produced songs with rating above 9.",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWHERE T2.rating > 9\nRETURN DISTINCT T1.artist_name,T1.country",
        "db_id": "music_1",
        "answers": [
            [
                "Topu",
                "India"
            ]
        ]
    },
    {
        "question": "List the file size and format for all songs that have resolution lower than 800.",
        "query": "MATCH (T1:`music_1.files`)-[]-(T2:`music_1.song`)\nWHERE T2.resolution < 800\nRETURN DISTINCT T1.file_size,T1.formats",
        "db_id": "music_1",
        "answers": [
            [
                "4.12 MB",
                "mp3"
            ],
            [
                "3.69 MB",
                "mp4"
            ],
            [
                "5.10 MB",
                "mp3"
            ],
            [
                "4.10 MB",
                "mp4"
            ]
        ]
    },
    {
        "question": "What are the names and countries of origin for the artists who produced the top three highly rated songs.",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nRETURN T1.artist_name,T1.country\nORDER BY T2.rating DESC\nLIMIT 3",
        "db_id": "music_1",
        "answers": [
            [
                "Topu",
                "India"
            ],
            [
                "Shrikanta",
                "India"
            ],
            [
                "Michel",
                "UK"
            ]
        ]
    },
    {
        "question": "How many artists are from Bangladesh?",
        "query": "MATCH (artist:`music_1.artist`)\nWHERE artist.country = 'Bangladesh'\nRETURN count(*)",
        "db_id": "music_1",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "How many Bangladeshi artists are listed?",
        "query": "MATCH (artist:`music_1.artist`)\nWHERE artist.country = 'Bangladesh'\nRETURN count(*)",
        "db_id": "music_1",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "What is the average rating of songs produced by female artists?",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWHERE T1.gender = 'Female'\nRETURN avg(T2.rating)",
        "db_id": "music_1",
        "answers": [
            [
                7.333333333333333
            ]
        ]
    },
    {
        "question": "How many songs, on average, are sung by a female artist?",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWHERE T1.gender = 'Female'\nRETURN avg(T2.rating)",
        "db_id": "music_1",
        "answers": [
            [
                7.333333333333333
            ]
        ]
    },
    {
        "question": "Find the file format that is used by the most files.",
        "query": "MATCH (files:`music_1.files`)\nWITH count(files.formats) AS count, files.formats AS formats\nRETURN formats\nORDER BY count DESC\nLIMIT 1",
        "db_id": "music_1",
        "answers": [
            [
                "mp4"
            ]
        ]
    },
    {
        "question": "What is the country of origin of the artist who is female and produced a song in Bangla?",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWHERE T1.gender = 'Female' AND T2.languages = 'bangla'\nRETURN T1.country",
        "db_id": "music_1",
        "answers": [
            [
                "Bangladesh"
            ],
            [
                "Bangladesh"
            ],
            [
                "India"
            ]
        ]
    },
    {
        "question": "What countries are the female artists who sung in the language Bangla from?",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWHERE T1.gender = 'Female' AND T2.languages = 'bangla'\nRETURN T1.country",
        "db_id": "music_1",
        "answers": [
            [
                "Bangladesh"
            ],
            [
                "Bangladesh"
            ],
            [
                "India"
            ]
        ]
    },
    {
        "question": "Return the gender and name of artist who produced the song with the lowest resolution.",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nRETURN T1.gender,T1.artist_name\nORDER BY T2.resolution\nLIMIT 1",
        "db_id": "music_1",
        "answers": [
            [
                "Female",
                "Farida"
            ]
        ]
    },
    {
        "question": "For each file format, return the number of artists who released songs in that format.",
        "query": "MATCH (files:`music_1.files`)\nWITH count(files.formats) AS count, files.formats AS formats\nRETURN count,formats",
        "db_id": "music_1",
        "answers": [
            [
                4,
                "mp4"
            ],
            [
                2,
                "mp3"
            ]
        ]
    },
    {
        "question": "List the names of all genres in alphabetical oder, together with its ratings.",
        "query": "MATCH (genre:`music_1.genre`)\nRETURN genre.g_name,genre.rating\nORDER BY genre.g_name",
        "db_id": "music_1",
        "answers": [
            [
                "blues",
                "7"
            ],
            [
                "folk",
                "9"
            ],
            [
                "modern",
                "8"
            ],
            [
                "nazrul",
                "7"
            ],
            [
                "pop",
                "9"
            ],
            [
                "tagore",
                "8"
            ]
        ]
    },
    {
        "question": "Give me a list of the names of all songs ordered by their resolution.",
        "query": "MATCH (song:`music_1.song`)\nRETURN song.song_name\nORDER BY song.resolution",
        "db_id": "music_1",
        "answers": [
            [
                "Ami opar hoye"
            ],
            [
                "Aj ei akash"
            ],
            [
                "Shukno patar nupur pae"
            ],
            [
                "Just beat it"
            ],
            [
                "Tumi robe nirobe"
            ],
            [
                "My love"
            ]
        ]
    },
    {
        "question": "What is the language used most often in the songs?",
        "query": "MATCH (song:`music_1.song`)\nWITH song.languages AS languages, count(song.languages) AS count\nRETURN languages\nORDER BY count DESC\nLIMIT 1",
        "db_id": "music_1",
        "answers": [
            [
                "bangla"
            ]
        ]
    },
    {
        "question": "What are the languages that are used most often in songs?",
        "query": "MATCH (song:`music_1.song`)\nWITH song.languages AS languages, count(song.languages) AS count\nRETURN languages\nORDER BY count DESC\nLIMIT 1",
        "db_id": "music_1",
        "answers": [
            [
                "bangla"
            ]
        ]
    },
    {
        "question": "What are the names of artists who are Male and are from UK?",
        "query": "MATCH (artist:`music_1.artist`)\nWHERE artist.country = 'UK' AND artist.gender = 'Male'\nRETURN artist.artist_name",
        "db_id": "music_1",
        "answers": [
            [
                "Michel"
            ]
        ]
    },
    {
        "question": "What are the names of all male British artists?",
        "query": "MATCH (artist:`music_1.artist`)\nWHERE artist.country = 'UK' AND artist.gender = 'Male'\nRETURN artist.artist_name",
        "db_id": "music_1",
        "answers": [
            [
                "Michel"
            ]
        ]
    }
]