[
    {
        "question": "Show the reign and days held of wrestlers.",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN wrestler.Reign,wrestler.Days_held",
        "db_id": "wrestler",
        "answers": [
            [
                "1",
                "344"
            ],
            [
                "1",
                "113"
            ],
            [
                "1",
                "1285"
            ],
            [
                "1",
                "960"
            ],
            [
                "1",
                "1"
            ],
            [
                "1",
                "99"
            ],
            [
                "1",
                "54"
            ],
            [
                "1",
                "183"
            ],
            [
                "2",
                "35"
            ],
            [
                "1",
                "56"
            ]
        ]
    },
    {
        "question": "Please show the most common reigns of wrestlers.",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nWITH count(wrestler.Reign) AS count, wrestler.Reign AS Reign\nRETURN Reign\nORDER BY count DESC\nLIMIT 1",
        "db_id": "wrestler",
        "answers": [
            [
                "1"
            ]
        ]
    },
    {
        "question": "Which reign is the most common among wrestlers?",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nWITH count(wrestler.Reign) AS count, wrestler.Reign AS Reign\nRETURN Reign\nORDER BY count DESC\nLIMIT 1",
        "db_id": "wrestler",
        "answers": [
            [
                "1"
            ]
        ]
    },
    {
        "question": "List the locations that are shared by more than two wrestlers.",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nWITH count(*) AS count, wrestler.Location AS Location\nWHERE count  > 2\nRETURN Location",
        "db_id": "wrestler",
        "answers": [
            [
                "Tijuana , Mexico"
            ],
            [
                "Tokyo , Japan"
            ]
        ]
    },
    {
        "question": "Count the number of schools.",
        "query": "MATCH (school:`school_finance.School`)\nRETURN count(*)",
        "db_id": "school_finance",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "question": "Show all school names in alphabetical order.",
        "query": "MATCH (school:`school_finance.School`)\nRETURN school.School_name\nORDER BY school.School_name",
        "db_id": "school_finance",
        "answers": [
            [
                "Bremen"
            ],
            [
                "Culver Community"
            ],
            [
                "Glenn"
            ],
            [
                "Jimtown"
            ],
            [
                "Knox Community"
            ],
            [
                "LaVille"
            ],
            [
                "New Prairie 1"
            ],
            [
                "Triton"
            ]
        ]
    },
    {
        "question": "List the name, location, mascot for all schools.",
        "query": "MATCH (school:`school_finance.School`)\nRETURN school.School_name,school.Location,school.Mascot",
        "db_id": "school_finance",
        "answers": [
            [
                "Bremen",
                "Bremen",
                "Lions"
            ],
            [
                "Culver Community",
                "Culver",
                "Cavaliers"
            ],
            [
                "Glenn",
                "Walkerton",
                "Falcons"
            ],
            [
                "Jimtown",
                "Elkhart",
                "Jimmies"
            ],
            [
                "Knox Community",
                "Knox",
                "Redskins"
            ],
            [
                "LaVille",
                "Lakeville",
                "Lancers"
            ],
            [
                "New Prairie 1",
                "New Carlisle",
                "Cougars"
            ],
            [
                "Triton",
                "Bourbon",
                "Trojans"
            ]
        ]
    },
    {
        "question": "List the name of the school with the smallest enrollment.",
        "query": "MATCH (school:`school_finance.School`)\nRETURN school.School_name\nORDER BY school.Enrollment\nLIMIT 1",
        "db_id": "school_finance",
        "answers": [
            [
                "Culver Community"
            ]
        ]
    },
    {
        "question": "Show the average, maximum, minimum enrollment of all schools.",
        "query": "MATCH (school:`school_finance.School`)\nRETURN avg(school.Enrollment),max(school.Enrollment),min(school.Enrollment)",
        "db_id": "school_finance",
        "answers": [
            [
                519.375,
                852,
                287
            ]
        ]
    },
    {
        "question": "List the amount and donor name for the largest amount of donation.",
        "query": "MATCH (endowment:`school_finance.endowment`)\nRETURN endowment.amount,endowment.donator_name\nORDER BY endowment.amount DESC\nLIMIT 1",
        "db_id": "school_finance",
        "answers": [
            [
                9.83,
                "San Jos\u00e9 de Ocoa"
            ]
        ]
    },
    {
        "question": "Count the number of budgets in year 2001 or before whose budgeted amount is greater than 3000",
        "query": "MATCH (budget:`school_finance.budget`)\nWHERE budget.Budgeted > 3000 AND budget.Year <= 2001\nRETURN count(*)",
        "db_id": "school_finance",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "Show all donor names.",
        "query": "MATCH (endowment:`school_finance.endowment`)\nRETURN DISTINCT endowment.donator_name",
        "db_id": "school_finance",
        "answers": [
            [
                "Monte Plata"
            ],
            [
                "San Jos\u00e9 de Ocoa"
            ],
            [
                "Distrito Nacional"
            ],
            [
                "Valverde"
            ],
            [
                "San Crist\u00f3bal"
            ],
            [
                "Santo Domingo Este"
            ],
            [
                "Santiago"
            ],
            [
                "Duarte"
            ],
            [
                "Com. Dom. En Estados Unidos"
            ],
            [
                "La Vega"
            ],
            [
                "Peravia"
            ]
        ]
    },
    {
        "question": "Show the name, street address, and number of floors for all buildings ordered by the number of floors.",
        "query": "MATCH (building:`protein_institute.building`)\nRETURN building.Name,building.Street_address,building.Floors\nORDER BY building.Floors",
        "db_id": "protein_institute",
        "answers": [
            [
                "Tampa City Hall",
                "315 John F. Kennedy Boulevard",
                10
            ],
            [
                "Citizens Bank Building",
                "701 North Franklin Street",
                12
            ],
            [
                "Floridan Hotel",
                "905 Franklin Street",
                17
            ],
            [
                "Franklin Exchange Building",
                "655 North Franklin Street",
                22
            ],
            [
                "Park Tower",
                "400 North Tampa Street",
                36
            ],
            [
                "One Tampa City Center",
                "201 North Franklin Street",
                39
            ],
            [
                "Bank of America Tower",
                "101 East Kennedy Boulevard",
                42
            ],
            [
                "100 North Tampa",
                "100 North Tampa Street",
                42
            ]
        ]
    },
    {
        "question": "List the names of buildings with at least 200 feet of height and with at least 20 floors.",
        "query": "MATCH (building:`protein_institute.building`)\nWHERE building.Height_feet >= 200 AND building.Floors >= 20\nRETURN building.Name",
        "db_id": "protein_institute",
        "answers": [
            [
                "Franklin Exchange Building"
            ],
            [
                "Park Tower"
            ],
            [
                "One Tampa City Center"
            ],
            [
                "Bank of America Tower"
            ],
            [
                "100 North Tampa"
            ]
        ]
    },
    {
        "question": "Show the names and locations of institutions that are founded after 1990 and have the type \"Private\".",
        "query": "MATCH (institution:`protein_institute.Institution`)\nWHERE institution.Founded > 1990 AND institution.Type = 'Private'\nRETURN institution.Institution,institution.Location",
        "db_id": "protein_institute",
        "answers": [
            [
                "Ave Maria University",
                "Ave Maria, Florida"
            ],
            [
                "Lindenwood University\u2013Belleville",
                "Belleville, Illinois"
            ]
        ]
    },
    {
        "question": "Show the institution type with the largest number of institutions.",
        "query": "MATCH (institution:`protein_institute.Institution`)\nWITH count(institution.Type) AS count, institution.Type AS Type\nRETURN Type\nORDER BY count DESC\nLIMIT 1",
        "db_id": "protein_institute",
        "answers": [
            [
                "Private"
            ]
        ]
    },
    {
        "question": "Show the institution type with an institution founded after 1990 and an institution with at least 1000 enrollment.",
        "query": "MATCH (institution:`protein_institute.Institution`)\nWHERE institution.Founded > 1990 AND institution.Enrollment >= 1000\nRETURN institution.Type",
        "db_id": "protein_institute",
        "answers": [
            [
                "Private"
            ],
            [
                "Private"
            ]
        ]
    },
    {
        "question": "Show the name of buildings that do not have any institution.",
        "query": "MATCH (building:`protein_institute.building`)\nWHERE NOT (building:`protein_institute.building`)-[]-(:`protein_institute.Institution`)\nRETURN building.Name",
        "db_id": "protein_institute",
        "answers": [
            [
                "Bank of America Tower"
            ]
        ]
    },
    {
        "question": "For each building, show the name of the building and the number of institutions in it.",
        "query": "MATCH (T1:`protein_institute.building`)-[]-(T2:`protein_institute.Institution`)\nWITH T1.Name AS Name, count(T1.building_id) AS count\nRETURN Name,count",
        "db_id": "protein_institute",
        "answers": [
            [
                "Citizens Bank Building",
                2
            ],
            [
                "Tampa City Hall",
                2
            ],
            [
                "Floridan Hotel",
                1
            ],
            [
                "Franklin Exchange Building",
                2
            ],
            [
                "Park Tower",
                1
            ],
            [
                "One Tampa City Center",
                2
            ],
            [
                "100 North Tampa",
                1
            ]
        ]
    },
    {
        "question": "Show all the distinct institution types.",
        "query": "MATCH (institution:`protein_institute.Institution`)\nRETURN DISTINCT institution.Type",
        "db_id": "protein_institute",
        "answers": [
            [
                "Private"
            ],
            [
                "Public"
            ],
            [
                "Tribal"
            ]
        ]
    },
    {
        "question": "Show institution names along with the number of proteins for each institution.",
        "query": "MATCH (T1:`protein_institute.Institution`)-[]-(T2:`protein_institute.protein`)\nWITH T1.Institution AS Institution, count(T1.Institution_id) AS count\nRETURN Institution,count",
        "db_id": "protein_institute",
        "answers": [
            [
                "Dakota State University",
                1
            ],
            [
                "Haskell Indian Nations University",
                1
            ],
            [
                "Lindenwood University\u2013Belleville",
                2
            ],
            [
                "Valley City State University",
                1
            ]
        ]
    },
    {
        "question": "How many proteins are associated with an institution founded after 1880 or an institution with type \"Private\"?",
        "query": "MATCH (T1:`protein_institute.Institution`)-[]-(T2:`protein_institute.protein`)\nWHERE T1.Founded > 1880 OR T1.Type = 'Private'\nRETURN count(*)",
        "db_id": "protein_institute",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "Show the protein name and the institution name.",
        "query": "MATCH (T1:`protein_institute.Institution`)-[]-(T2:`protein_institute.protein`)\nRETURN T2.protein_name,T1.Institution",
        "db_id": "protein_institute",
        "answers": [
            [
                "uncharacterized protein C20orf117-like",
                "Dakota State University"
            ],
            [
                "uncharacterized protein LOC578090",
                "Haskell Indian Nations University"
            ],
            [
                "Centromeric protein E, putative",
                "Lindenwood University\u2013Belleville"
            ],
            [
                "conserved hypothetical protein",
                "Lindenwood University\u2013Belleville"
            ],
            [
                "surface antigen repeat family protein",
                "Valley City State University"
            ]
        ]
    },
    {
        "question": "How many institutions do not have an associated protein in our record?",
        "query": "MATCH (institution:`protein_institute.Institution`)\nWHERE NOT (institution:`protein_institute.Institution`)-[]-(:`protein_institute.protein`)\nRETURN count(*)",
        "db_id": "protein_institute",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "Count the number of cinemas.",
        "query": "MATCH (cinema:`cinema.cinema`)\nRETURN count(*)",
        "db_id": "cinema",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "question": "Show name, opening year, and capacity for each cinema.",
        "query": "MATCH (cinema:`cinema.cinema`)\nRETURN cinema.Name,cinema.Openning_year,cinema.Capacity",
        "db_id": "cinema",
        "answers": [
            [
                "Codling",
                2010,
                1100
            ],
            [
                "Carrowleagh",
                2012,
                368
            ],
            [
                "Dublin Array",
                2015,
                364
            ],
            [
                "Glenmore",
                2009,
                305
            ],
            [
                "Glenough",
                2010,
                325
            ],
            [
                "Gortahile",
                2010,
                208
            ],
            [
                "Grouse Lodge",
                2011,
                203
            ],
            [
                "Moneypoint",
                2011,
                225
            ],
            [
                "Mount Callan",
                2011,
                908
            ],
            [
                "Oriel",
                2013,
                330
            ]
        ]
    },
    {
        "question": "Find the distinct locations that has a cinema.",
        "query": "MATCH (cinema:`cinema.cinema`)\nRETURN DISTINCT cinema.Location",
        "db_id": "cinema",
        "answers": [
            [
                "County Wicklow"
            ],
            [
                "County Cork"
            ],
            [
                "County Dublin"
            ],
            [
                "County Clare"
            ],
            [
                "County Tipperary"
            ],
            [
                "County Laois"
            ],
            [
                "County Louth"
            ]
        ]
    },
    {
        "question": "Show all the cinema names and opening years in descending order of opening year.",
        "query": "MATCH (cinema:`cinema.cinema`)\nRETURN cinema.Name,cinema.Openning_year\nORDER BY cinema.Openning_year DESC",
        "db_id": "cinema",
        "answers": [
            [
                "Dublin Array",
                2015
            ],
            [
                "Oriel",
                2013
            ],
            [
                "Carrowleagh",
                2012
            ],
            [
                "Grouse Lodge",
                2011
            ],
            [
                "Moneypoint",
                2011
            ],
            [
                "Mount Callan",
                2011
            ],
            [
                "Codling",
                2010
            ],
            [
                "Glenough",
                2010
            ],
            [
                "Gortahile",
                2010
            ],
            [
                "Glenmore",
                2009
            ]
        ]
    },
    {
        "question": "Show the average, minimum, and maximum capacity for all the cinemas opened in year 2011 or later.",
        "query": "MATCH (cinema:`cinema.cinema`)\nWHERE cinema.Openning_year >= 2011\nRETURN avg(cinema.Capacity),min(cinema.Capacity),max(cinema.Capacity)",
        "db_id": "cinema",
        "answers": [
            [
                399.6666666666667,
                203,
                908
            ]
        ]
    },
    {
        "question": "Show each location and the number of cinemas there.",
        "query": "MATCH (cinema:`cinema.cinema`)\nWITH cinema.Location AS Location, count(cinema.Location) AS count\nRETURN Location,count",
        "db_id": "cinema",
        "answers": [
            [
                "County Wicklow",
                1
            ],
            [
                "County Cork",
                1
            ],
            [
                "County Dublin",
                1
            ],
            [
                "County Clare",
                3
            ],
            [
                "County Tipperary",
                2
            ],
            [
                "County Laois",
                1
            ],
            [
                "County Louth",
                1
            ]
        ]
    },
    {
        "question": "What is the location with the most cinemas opened in year 2010 or later?",
        "query": "MATCH (cinema:`cinema.cinema`)\nWHERE cinema.Openning_year >= 2010\nWITH cinema.Location AS Location, count(cinema.Location) AS count\nRETURN Location\nORDER BY count DESC\nLIMIT 1",
        "db_id": "cinema",
        "answers": [
            [
                "County Tipperary"
            ]
        ]
    },
    {
        "question": "Show all the locations with at least two cinemas with capacity above 300.",
        "query": "MATCH (cinema:`cinema.cinema`)\nWHERE cinema.Capacity > 300\nWITH cinema.Location AS Location, count(*) AS count\nWHERE count  >= 2\nRETURN Location",
        "db_id": "cinema",
        "answers": [
            [
                "County Clare"
            ]
        ]
    },
    {
        "question": "Show the title and director for all films.",
        "query": "MATCH (film:`cinema.film`)\nRETURN film.Title,film.Directed_by",
        "db_id": "cinema",
        "answers": [
            [
                "The Case of the Mystery Weekend",
                "Bill Schreiner"
            ],
            [
                "The Case of the Smart Dummy",
                "Bill Schreiner"
            ],
            [
                "The Case: Off the Record",
                "Bill Schreiner"
            ],
            [
                "The Case of the Bermuda Triangle",
                "Jesus Salvador Trevi\u00f1o"
            ],
            [
                "The Case of the Piggy Banker",
                "Bill Schreiner"
            ]
        ]
    },
    {
        "question": "Show all directors.",
        "query": "MATCH (film:`cinema.film`)\nRETURN DISTINCT film.Directed_by",
        "db_id": "cinema",
        "answers": [
            [
                "Bill Schreiner"
            ],
            [
                "Jesus Salvador Trevi\u00f1o"
            ]
        ]
    },
    {
        "question": "List all directors along with the number of films directed by each director.",
        "query": "MATCH (film:`cinema.film`)\nWITH count(film.Directed_by) AS count, film.Directed_by AS Directed_by\nRETURN Directed_by,count",
        "db_id": "cinema",
        "answers": [
            [
                "Bill Schreiner",
                4
            ],
            [
                "Jesus Salvador Trevi\u00f1o",
                1
            ]
        ]
    },
    {
        "question": "Find the locations that have more than one movie theater with capacity above 300.",
        "query": "MATCH (cinema:`cinema.cinema`)\nWHERE cinema.Capacity > 300\nWITH cinema.Location AS Location, count(*) AS count\nWHERE count  > 1\nRETURN Location",
        "db_id": "cinema",
        "answers": [
            [
                "County Clare"
            ]
        ]
    },
    {
        "question": "How many bookings did each customer make? List the customer id, first name, and the count.",
        "query": "MATCH (T1:`products_for_hire.Customers`)-[]-(T2:`products_for_hire.Bookings`)\nWITH T1.first_name AS first_name, count(T1.customer_id) AS count, T1.customer_id AS customer_id\nRETURN customer_id,first_name,count",
        "db_id": "products_for_hire",
        "answers": [
            [
                7,
                "Marilou",
                3
            ],
            [
                15,
                "Jamir",
                1
            ],
            [
                3,
                "Rosalee",
                4
            ],
            [
                10,
                "Layne",
                2
            ],
            [
                11,
                "Maximilian",
                1
            ],
            [
                9,
                "German",
                2
            ],
            [
                8,
                "Elinore",
                2
            ]
        ]
    },
    {
        "question": "What are the first name, last name, and gender of all the good customers? Order by their last name.",
        "query": "MATCH (customers:`products_for_hire.Customers`)\nWHERE customers.good_or_bad_customer = 'good'\nRETURN customers.first_name,customers.last_name,customers.gender_mf\nORDER BY customers.last_name",
        "db_id": "products_for_hire",
        "answers": [
            [
                "Tyler",
                "Breitenberg",
                "1"
            ],
            [
                "Elinore",
                "Crona",
                "0"
            ],
            [
                "Jailyn",
                "Gerlach",
                "0"
            ],
            [
                "Ericka",
                "Greenholt",
                "0"
            ],
            [
                "Geovany",
                "Homenick",
                "0"
            ],
            [
                "Rosalee",
                "Kessler",
                "0"
            ],
            [
                "Laury",
                "Lemke",
                "1"
            ],
            [
                "German",
                "Little",
                "1"
            ],
            [
                "Maximilian",
                "Murphy",
                "0"
            ],
            [
                "Vergie",
                "Nicolas",
                "0"
            ],
            [
                "Marilou",
                "Strosin",
                "1"
            ]
        ]
    },
    {
        "question": "What are the payment date of the payment with amount paid higher than 300 or with payment type is 'Check'",
        "query": "MATCH (payments:`products_for_hire.Payments`)\nWHERE payments.amount_paid > 300 OR payments.payment_type_code = 'Check'\nRETURN payments.payment_date",
        "db_id": "products_for_hire",
        "answers": [
            [
                "2018-03-09 16:28:00"
            ],
            [
                "2018-03-03 13:39:44"
            ],
            [
                "2018-03-22 02:28:11"
            ],
            [
                "2018-03-23 20:36:04"
            ],
            [
                "2018-03-19 12:39:31"
            ],
            [
                "2018-03-02 06:25:45"
            ],
            [
                "2018-03-12 23:00:55"
            ],
            [
                "2018-03-12 23:23:56"
            ],
            [
                "2018-03-23 13:24:33"
            ],
            [
                "2018-03-03 03:07:00"
            ],
            [
                "2018-02-27 10:50:39"
            ],
            [
                "2018-03-03 14:22:51"
            ],
            [
                "2018-03-17 15:51:52"
            ],
            [
                "2018-03-17 03:07:45"
            ]
        ]
    },
    {
        "question": "List the names of phones in ascending order of price.",
        "query": "MATCH (phone:`phone_market.phone`)\nRETURN phone.Name\nORDER BY phone.Price ASC",
        "db_id": "phone_market",
        "answers": [
            [
                "IPhone 5s"
            ],
            [
                "IPhone 6"
            ],
            [
                "IPhone 6s"
            ],
            [
                "IPhone 7"
            ],
            [
                "IPhone X"
            ]
        ]
    },
    {
        "question": "List the distinct carriers of phones with memories bigger than 32.",
        "query": "MATCH (phone:`phone_market.phone`)\nWHERE phone.Memory_in_G > 32\nRETURN DISTINCT phone.Carrier",
        "db_id": "phone_market",
        "answers": [
            [
                "Sprint"
            ],
            [
                "TMobile"
            ]
        ]
    },
    {
        "question": "Show the names of phones with carrier either \"Sprint\" or \"TMobile\".",
        "query": "MATCH (phone:`phone_market.phone`)\nWHERE phone.Carrier = 'Sprint' OR phone.Carrier = 'TMobile'\nRETURN phone.Name",
        "db_id": "phone_market",
        "answers": [
            [
                "IPhone 5s"
            ],
            [
                "IPhone 6"
            ],
            [
                "IPhone 6s"
            ],
            [
                "IPhone 7"
            ],
            [
                "IPhone X"
            ]
        ]
    },
    {
        "question": "Show different carriers of phones together with the number of phones with each carrier.",
        "query": "MATCH (phone:`phone_market.phone`)\nWITH count(phone.Carrier) AS count, phone.Carrier AS Carrier\nRETURN Carrier,count",
        "db_id": "phone_market",
        "answers": [
            [
                "Sprint",
                2
            ],
            [
                "TMobile",
                3
            ]
        ]
    },
    {
        "question": "Show the most frequently used carrier of the phones.",
        "query": "MATCH (phone:`phone_market.phone`)\nWITH count(phone.Carrier) AS count, phone.Carrier AS Carrier\nRETURN Carrier\nORDER BY count DESC\nLIMIT 1",
        "db_id": "phone_market",
        "answers": [
            [
                "TMobile"
            ]
        ]
    },
    {
        "question": "List the company name and rank for all companies in the decreasing order of their sales.",
        "query": "MATCH (company:`gas_company.company`)\nRETURN company.Company,company.Rank\nORDER BY company.Sales_billion DESC",
        "db_id": "gas_company",
        "answers": [
            [
                "Royal Dutch Shell",
                4
            ],
            [
                "ExxonMobil",
                1
            ],
            [
                "BP",
                11
            ],
            [
                "PetroChina",
                7
            ],
            [
                "General Electric",
                3
            ],
            [
                "Petrobras",
                10
            ],
            [
                "Berkshire Hathaway",
                8
            ],
            [
                "HSBC",
                6
            ],
            [
                "Wells Fargo",
                9
            ],
            [
                "Industrial and Commercial Bank of China",
                5
            ]
        ]
    },
    {
        "question": "Show the company name and the main industry for all companies whose headquarters are not from USA.",
        "query": "MATCH (company:`gas_company.company`)\nWHERE company.Headquarters <> 'USA'\nRETURN company.Company,company.Main_Industry",
        "db_id": "gas_company",
        "answers": [
            [
                "Royal Dutch Shell",
                "Oil and gas"
            ],
            [
                "Industrial and Commercial Bank of China",
                "Banking"
            ],
            [
                "HSBC",
                "Banking"
            ],
            [
                "PetroChina",
                "Oil and gas"
            ],
            [
                "Petrobras",
                "Oil and gas"
            ],
            [
                "BP",
                "Oil and gas"
            ]
        ]
    },
    {
        "question": "Show all company names and headquarters in the descending order of market value.",
        "query": "MATCH (company:`gas_company.company`)\nRETURN company.Company,company.Headquarters\nORDER BY company.Market_Value DESC",
        "db_id": "gas_company",
        "answers": [
            [
                "ExxonMobil",
                "USA"
            ],
            [
                "PetroChina",
                "China"
            ],
            [
                "Industrial and Commercial Bank of China",
                "China"
            ],
            [
                "Royal Dutch Shell",
                "Netherlands"
            ],
            [
                "General Electric",
                "USA"
            ],
            [
                "Berkshire Hathaway",
                "USA"
            ],
            [
                "Petrobras",
                "Brazil"
            ],
            [
                "Wells Fargo",
                "USA"
            ],
            [
                "HSBC",
                "UK"
            ],
            [
                "BP",
                "UK"
            ]
        ]
    },
    {
        "question": "Show minimum, maximum, and average market value for all companies.",
        "query": "MATCH (company:`gas_company.company`)\nRETURN min(company.Market_Value),max(company.Market_Value),avg(company.Market_Value)",
        "db_id": "gas_company",
        "answers": [
            [
                147.4,
                407.4,
                225.34
            ]
        ]
    }
]