[
    {
        "question": "Show different parties of people along with the number of people in each party.",
        "query": "MATCH (people:`debate.people`)\nWITH people.Party AS Party, count(people.Party) AS count\nRETURN Party,count",
        "db_id": "debate",
        "answers": [
            [
                "Republican",
                4
            ],
            [
                "Democratic",
                3
            ],
            [
                "Independent Democrat",
                1
            ],
            [
                "Anti-Lecompton Democrat",
                2
            ]
        ]
    },
    {
        "question": "Show the party that has the most people.",
        "query": "MATCH (people:`debate.people`)\nWITH people.Party AS Party, count(people.Party) AS count\nRETURN Party\nORDER BY count DESC\nLIMIT 1",
        "db_id": "debate",
        "answers": [
            [
                "Republican"
            ]
        ]
    },
    {
        "question": "Show the distinct venues of debates",
        "query": "MATCH (debate:`debate.debate`)\nRETURN DISTINCT debate.Venue",
        "db_id": "debate",
        "answers": [
            [
                "Manama , Bahrain"
            ],
            [
                "Doha , Qatar"
            ],
            [
                "Dubai , UAE"
            ],
            [
                "Abu Dhabi , UAE"
            ]
        ]
    },
    {
        "question": "List the names of all the customers in alphabetical order.",
        "query": "MATCH (customers:`insurance_and_eClaims.Customers`)\nRETURN customers.Customer_Details\nORDER BY customers.Customer_Details",
        "db_id": "insurance_and_eClaims",
        "answers": [
            [
                "America Jaskolski"
            ],
            [
                "Augustine Kerluke"
            ],
            [
                "Buddy Marquardt"
            ],
            [
                "Dayana Robel"
            ],
            [
                "Dr. Diana Rath"
            ],
            [
                "Ellsworth Paucek"
            ],
            [
                "Lauriane Ferry PhD"
            ],
            [
                "Miss Felicita Reichel"
            ],
            [
                "Mr. Edwardo Blanda I"
            ],
            [
                "Mr. Randal Lynch III"
            ],
            [
                "Mrs. Hanna Willms"
            ],
            [
                "Mrs. Lilly Graham III"
            ],
            [
                "Mrs. Liza Heller V"
            ],
            [
                "Selena Gerhold"
            ],
            [
                "Sydnie Friesen"
            ]
        ]
    },
    {
        "question": "Which type of policy is most frequently used? Give me the policy type code.",
        "query": "MATCH (policies:`insurance_and_eClaims.Policies`)\nWITH count(policies.Policy_Type_Code) AS count, policies.Policy_Type_Code AS Policy_Type_Code\nRETURN Policy_Type_Code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "insurance_and_eClaims",
        "answers": [
            [
                "Uniformed"
            ]
        ]
    },
    {
        "question": "Find all the policy types that are used by more than 2 customers.",
        "query": "MATCH (policies:`insurance_and_eClaims.Policies`)\nWITH count(*) AS count, policies.Policy_Type_Code AS Policy_Type_Code\nWHERE count  > 2\nRETURN Policy_Type_Code",
        "db_id": "insurance_and_eClaims",
        "answers": [
            [
                "Deputy"
            ],
            [
                "Jurisdiction"
            ],
            [
                "Uniformed"
            ]
        ]
    },
    {
        "question": "Find the number of distinct stages in claim processing.",
        "query": "MATCH (claims_processing_stages:`insurance_and_eClaims.Claims_Processing_Stages`)\nRETURN count(*)",
        "db_id": "insurance_and_eClaims",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "Find the number of records of each policy type and its type code.",
        "query": "MATCH (policies:`insurance_and_eClaims.Policies`)\nWITH count(policies.Policy_Type_Code) AS count, policies.Policy_Type_Code AS Policy_Type_Code\nRETURN Policy_Type_Code,count",
        "db_id": "insurance_and_eClaims",
        "answers": [
            [
                "Deputy",
                3
            ],
            [
                "Jurisdiction",
                3
            ],
            [
                "Uniformed",
                8
            ],
            [
                "Normal",
                1
            ]
        ]
    },
    {
        "question": "What is the description of the claim status \"Open\"?",
        "query": "MATCH (claims_processing_stages:`insurance_and_eClaims.Claims_Processing_Stages`)\nWHERE claims_processing_stages.Claim_Status_Name = 'Open'\nRETURN claims_processing_stages.Claim_Status_Description",
        "db_id": "insurance_and_eClaims",
        "answers": [
            [
                "Open a new claim"
            ]
        ]
    },
    {
        "question": "Count the number of distinct claim outcome codes.",
        "query": "MATCH (claims_processing:`insurance_and_eClaims.Claims_Processing`)\nRETURN count(DISTINCT claims_processing.Claim_Outcome_Code)",
        "db_id": "insurance_and_eClaims",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "Show the number of accounts.",
        "query": "MATCH (accounts:`customers_and_invoices.Accounts`)\nRETURN count(*)",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Count the number of customers who have an account.",
        "query": "MATCH (accounts:`customers_and_invoices.Accounts`)\nRETURN count(DISTINCT accounts.customer_id)",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "Show the id, the date of account opened, the account name, and other account detail for all accounts.",
        "query": "MATCH (accounts:`customers_and_invoices.Accounts`)\nRETURN accounts.account_id,accounts.date_account_opened,accounts.account_name,accounts.other_account_details",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                1,
                "2016-07-30 22:22:24",
                "900",
                "Regular"
            ],
            [
                2,
                "2017-05-29 16:45:17",
                "520",
                "VIP"
            ],
            [
                3,
                "2012-05-04 18:50:32",
                "323",
                "Regular"
            ],
            [
                4,
                "2011-03-29 15:06:59",
                "390",
                "VIP"
            ],
            [
                5,
                "2014-08-11 18:15:14",
                "935",
                "Regular"
            ],
            [
                6,
                "2014-05-30 12:16:52",
                "371",
                "Regular"
            ],
            [
                7,
                "2015-11-03 08:04:15",
                "398",
                "VIP"
            ],
            [
                8,
                "2009-06-13 11:41:52",
                "710",
                "Regular"
            ],
            [
                9,
                "2010-10-22 13:33:45",
                "337",
                "Regular"
            ],
            [
                10,
                "2016-04-25 21:49:17",
                "429",
                "VIP"
            ],
            [
                11,
                "2012-07-09 23:40:15",
                "191",
                "VIP"
            ],
            [
                12,
                "2015-02-02 09:47:08",
                "601",
                "Regular"
            ],
            [
                13,
                "2010-06-16 09:35:00",
                "272",
                "Regular"
            ],
            [
                14,
                "2014-12-28 07:29:42",
                "861",
                "VIP"
            ],
            [
                15,
                "2008-05-04 22:15:56",
                "662",
                "VIP"
            ]
        ]
    },
    {
        "question": "Show the account name and other account detail for all accounts by the customer with first name Meaghan and last name Keeling.",
        "query": "MATCH (T1:`customers_and_invoices.Accounts`)-[]-(T2:`customers_and_invoices.Customers`)\nWHERE T2.customer_first_name = 'Meaghan' AND T2.customer_last_name = 'Keeling'\nRETURN T1.account_name,T1.other_account_details",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                "900",
                "Regular"
            ],
            [
                "601",
                "Regular"
            ],
            [
                "337",
                "Regular"
            ],
            [
                "323",
                "Regular"
            ]
        ]
    },
    {
        "question": "What are the names and other details for accounts corresponding to the customer named Meaghan Keeling?",
        "query": "MATCH (T1:`customers_and_invoices.Accounts`)-[]-(T2:`customers_and_invoices.Customers`)\nWHERE T2.customer_first_name = 'Meaghan' AND T2.customer_last_name = 'Keeling'\nRETURN T1.account_name,T1.other_account_details",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                "900",
                "Regular"
            ],
            [
                "601",
                "Regular"
            ],
            [
                "337",
                "Regular"
            ],
            [
                "323",
                "Regular"
            ]
        ]
    },
    {
        "question": "Show the first name and last name for the customer with account name 900.",
        "query": "MATCH (T1:`customers_and_invoices.Accounts`)-[]-(T2:`customers_and_invoices.Customers`)\nWHERE T1.account_name = '900'\nRETURN T2.customer_first_name,T2.customer_last_name",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                "Meaghan",
                "Keeling"
            ]
        ]
    },
    {
        "question": "What are the full names of customers with the account name 900?",
        "query": "MATCH (T1:`customers_and_invoices.Accounts`)-[]-(T2:`customers_and_invoices.Customers`)\nWHERE T1.account_name = '900'\nRETURN T2.customer_first_name,T2.customer_last_name",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                "Meaghan",
                "Keeling"
            ]
        ]
    },
    {
        "question": "How many customers don't have an account?",
        "query": "MATCH (customers:`customers_and_invoices.Customers`)\nWHERE NOT (customers:`customers_and_invoices.Customers`)-[]-(:`customers_and_invoices.Accounts`)\nRETURN count(*)",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "question": "Show the unique first names, last names, and phone numbers for all customers with any account.",
        "query": "MATCH (T1:`customers_and_invoices.Customers`)-[]-(T2:`customers_and_invoices.Accounts`)\nRETURN DISTINCT T1.customer_first_name,T1.customer_last_name,T1.phone_number",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                "Meaghan",
                "Keeling",
                "06015518212"
            ],
            [
                "Joesph",
                "Schaefer",
                "(488)524-5345"
            ],
            [
                "Ruby",
                "Boyle",
                "1-546-302-5676"
            ],
            [
                "Jensen",
                "Muller",
                "(650)406-8761"
            ],
            [
                "Kieran",
                "Auer",
                "(157)046-6255x98627"
            ],
            [
                "Abbey",
                "Ruecker",
                "1-344-593-4896x425"
            ],
            [
                "Vesta",
                "Leuschke",
                "+69(0)7149212554"
            ]
        ]
    },
    {
        "question": "How many accounts does each customer have? List the number and customer id.",
        "query": "MATCH (accounts:`customers_and_invoices.Accounts`)\nWITH count(accounts.customer_id) AS count, accounts.customer_id AS customer_id\nRETURN count,customer_id",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                4,
                8
            ],
            [
                1,
                3
            ],
            [
                3,
                15
            ],
            [
                1,
                12
            ],
            [
                4,
                13
            ],
            [
                1,
                9
            ],
            [
                1,
                6
            ]
        ]
    },
    {
        "question": "Show id, first name and last name for all customers and the number of accounts.",
        "query": "MATCH (T1:`customers_and_invoices.Accounts`)-[]-(T2:`customers_and_invoices.Customers`)\nWITH T2.customer_last_name AS customer_last_name, T2.customer_first_name AS customer_first_name, count(T1.customer_id) AS count, T1.customer_id AS customer_id\nRETURN customer_id,customer_first_name,customer_last_name,count",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                8,
                "Meaghan",
                "Keeling",
                4
            ],
            [
                3,
                "Joesph",
                "Schaefer",
                1
            ],
            [
                15,
                "Ruby",
                "Boyle",
                3
            ],
            [
                12,
                "Jensen",
                "Muller",
                1
            ],
            [
                13,
                "Kieran",
                "Auer",
                4
            ],
            [
                9,
                "Abbey",
                "Ruecker",
                1
            ],
            [
                6,
                "Vesta",
                "Leuschke",
                1
            ]
        ]
    },
    {
        "question": "Show the number of customers.",
        "query": "MATCH (customers:`customers_and_invoices.Customers`)\nRETURN count(*)",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Show the number of customers for each gender.",
        "query": "MATCH (customers:`customers_and_invoices.Customers`)\nWITH customers.gender AS gender, count(customers.gender) AS count\nRETURN gender,count",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                "1",
                6
            ],
            [
                "0",
                9
            ]
        ]
    },
    {
        "question": "Show all product sizes.",
        "query": "MATCH (products:`customers_and_invoices.Products`)\nRETURN DISTINCT products.product_size",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                "Medium"
            ],
            [
                "Small"
            ],
            [
                "Large"
            ]
        ]
    },
    {
        "question": "Show all product colors.",
        "query": "MATCH (products:`customers_and_invoices.Products`)\nRETURN DISTINCT products.product_color",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                "Red"
            ],
            [
                "Yellow"
            ],
            [
                "Black"
            ]
        ]
    },
    {
        "question": "Count the number of invoices.",
        "query": "MATCH (invoices:`customers_and_invoices.Invoices`)\nRETURN count(*)",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Show invoice dates and order id and details for all invoices.",
        "query": "MATCH (T1:`customers_and_invoices.Invoices`)-[]-(T2:`customers_and_invoices.Orders`)\nRETURN T1.invoice_date,T1.order_id,T2.order_details",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                "2018-03-15 21:24:13",
                3,
                null
            ],
            [
                "2018-03-05 08:47:33",
                3,
                null
            ],
            [
                "2018-03-03 20:44:06",
                3,
                null
            ],
            [
                "2018-03-19 22:38:10",
                4,
                null
            ],
            [
                "2018-03-23 04:59:28",
                5,
                null
            ],
            [
                "2018-03-16 21:57:43",
                8,
                null
            ],
            [
                "2018-03-20 00:21:41",
                9,
                null
            ],
            [
                "2018-02-28 19:01:06",
                9,
                null
            ],
            [
                "2018-03-01 16:40:48",
                9,
                null
            ],
            [
                "2018-03-13 07:27:38",
                10,
                null
            ],
            [
                "2018-03-19 17:06:30",
                10,
                null
            ],
            [
                "2018-03-01 01:44:08",
                11,
                null
            ],
            [
                "2018-03-16 11:01:06",
                12,
                null
            ],
            [
                "2018-03-07 02:04:32",
                13,
                null
            ],
            [
                "2018-03-15 09:38:49",
                14,
                null
            ]
        ]
    },
    {
        "question": "Show the order ids and the number of invoices for each order.",
        "query": "MATCH (invoices:`customers_and_invoices.Invoices`)\nWITH invoices.order_id AS order_id, count(invoices.order_id) AS count\nRETURN order_id,count",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                9,
                3
            ],
            [
                3,
                3
            ],
            [
                13,
                1
            ],
            [
                8,
                1
            ],
            [
                10,
                2
            ],
            [
                12,
                1
            ],
            [
                11,
                1
            ],
            [
                5,
                1
            ],
            [
                4,
                1
            ],
            [
                14,
                1
            ]
        ]
    },
    {
        "question": "What is the order id and order details for the order more than two invoices.",
        "query": "MATCH (T1:`customers_and_invoices.Invoices`)-[]-(T2:`customers_and_invoices.Orders`)\nWITH count(*) AS count, T2.order_id AS order_id, T2.order_details AS order_details\nWHERE count  > 2\nRETURN order_id,order_details",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                3,
                null
            ],
            [
                9,
                null
            ]
        ]
    },
    {
        "question": "What is the customer last name, id and phone number with most number of orders?",
        "query": "MATCH (T1:`customers_and_invoices.Orders`)-[]-(T2:`customers_and_invoices.Customers`)\nWITH T2.customer_last_name AS customer_last_name, count(T1.customer_id) AS count, T2.phone_number AS phone_number, T1.customer_id AS customer_id\nRETURN customer_last_name,customer_id,phone_number\nORDER BY count DESC\nLIMIT 1",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                "Muller",
                12,
                "(650)406-8761"
            ]
        ]
    },
    {
        "question": "Show the order ids and the number of items in each order.",
        "query": "MATCH (order_items:`customers_and_invoices.Order_Items`)\nWITH count(order_items.order_id) AS count, order_items.order_id AS order_id\nRETURN order_id,count",
        "db_id": "customers_and_invoices",
        "answers": [
            [
                4,
                3
            ],
            [
                15,
                2
            ],
            [
                1,
                2
            ],
            [
                2,
                1
            ],
            [
                13,
                4
            ],
            [
                10,
                1
            ],
            [
                14,
                1
            ],
            [
                12,
                1
            ]
        ]
    },
    {
        "question": "Show the name, open date, and organizer for all churches.",
        "query": "MATCH (church:`wedding.church`)\nRETURN church.Name,church.Open_Date,church.Organized_by",
        "db_id": "wedding",
        "answers": [
            [
                "Pure Church of Christ",
                1831,
                "Wycam Clark"
            ],
            [
                "Independent Church",
                1832,
                "\u2013 Hoton"
            ],
            [
                "Church of Christ",
                1836,
                "Ezra Booth"
            ],
            [
                "Church of Christ (Parrishite)",
                1837,
                "Warren Parrish"
            ],
            [
                "Alston Church",
                1839,
                "Isaac Russell"
            ],
            [
                "Church of Christ",
                1830,
                "William Chubby"
            ],
            [
                "Church of Jesus Christ, the Bride, the Lamb's Wife",
                1840,
                "George M. Hinkle"
            ],
            [
                "Church of Christ",
                1842,
                "Hiram Page"
            ],
            [
                "True Church of Jesus Christ of Latter Day Saints",
                1844,
                "William Law"
            ]
        ]
    },
    {
        "question": "List all church names in descending order of opening date.",
        "query": "MATCH (church:`wedding.church`)\nRETURN church.Name\nORDER BY church.Open_Date DESC",
        "db_id": "wedding",
        "answers": [
            [
                "True Church of Jesus Christ of Latter Day Saints"
            ],
            [
                "Church of Christ"
            ],
            [
                "Church of Jesus Christ, the Bride, the Lamb's Wife"
            ],
            [
                "Alston Church"
            ],
            [
                "Church of Christ (Parrishite)"
            ],
            [
                "Church of Christ"
            ],
            [
                "Independent Church"
            ],
            [
                "Pure Church of Christ"
            ],
            [
                "Church of Christ"
            ]
        ]
    },
    {
        "question": "Show the organizer and name for churches that opened between 1830 and 1840.",
        "query": "MATCH (church:`wedding.church`)\nWHERE 1830<=church.Open_Date<=1840\nRETURN church.Organized_by,church.Name",
        "db_id": "wedding",
        "answers": [
            [
                "Wycam Clark",
                "Pure Church of Christ"
            ],
            [
                "\u2013 Hoton",
                "Independent Church"
            ],
            [
                "Ezra Booth",
                "Church of Christ"
            ],
            [
                "Warren Parrish",
                "Church of Christ (Parrishite)"
            ],
            [
                "Isaac Russell",
                "Alston Church"
            ],
            [
                "William Chubby",
                "Church of Christ"
            ],
            [
                "George M. Hinkle",
                "Church of Jesus Christ, the Bride, the Lamb's Wife"
            ]
        ]
    },
    {
        "question": "Show all opening years and the number of churches that opened in that year.",
        "query": "MATCH (church:`wedding.church`)\nWITH church.Open_Date AS Open_Date, count(church.Open_Date) AS count\nRETURN Open_Date,count",
        "db_id": "wedding",
        "answers": [
            [
                1831,
                1
            ],
            [
                1832,
                1
            ],
            [
                1836,
                1
            ],
            [
                1837,
                1
            ],
            [
                1839,
                1
            ],
            [
                1830,
                1
            ],
            [
                1840,
                1
            ],
            [
                1842,
                1
            ],
            [
                1844,
                1
            ]
        ]
    },
    {
        "question": "Show the name and opening year for three churches that opened most recently.",
        "query": "MATCH (church:`wedding.church`)\nRETURN church.Name,church.Open_Date\nORDER BY church.Open_Date DESC\nLIMIT 3",
        "db_id": "wedding",
        "answers": [
            [
                "True Church of Jesus Christ of Latter Day Saints",
                1844
            ],
            [
                "Church of Christ",
                1842
            ],
            [
                "Church of Jesus Christ, the Bride, the Lamb's Wife",
                1840
            ]
        ]
    },
    {
        "question": "Show the minimum, maximum, and average age for all people.",
        "query": "MATCH (people:`wedding.people`)\nRETURN min(people.Age),max(people.Age),avg(people.Age)",
        "db_id": "wedding",
        "answers": [
            [
                25,
                36,
                30.166666666666668
            ]
        ]
    },
    {
        "question": "Show all countries and the number of people from each country.",
        "query": "MATCH (people:`wedding.people`)\nWITH people.Country AS Country, count(people.Country) AS count\nRETURN Country,count",
        "db_id": "wedding",
        "answers": [
            [
                "Canada",
                1
            ],
            [
                "Sweden",
                1
            ],
            [
                "United States",
                8
            ],
            [
                "Northern Ireland",
                1
            ],
            [
                "Australia",
                1
            ]
        ]
    },
    {
        "question": "Count the number of artists.",
        "query": "MATCH (artist:`theme_gallery.artist`)\nRETURN count(*)",
        "db_id": "theme_gallery",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "Show all artist name, age, and country ordered by the yeared they joined.",
        "query": "MATCH (artist:`theme_gallery.artist`)\nRETURN artist.Name,artist.Age,artist.Country\nORDER BY artist.Year_Join",
        "db_id": "theme_gallery",
        "answers": [
            [
                "Larry Nelson",
                50,
                "United States"
            ],
            [
                "Jeff Sluman",
                57,
                "United States"
            ],
            [
                "John Daly",
                46,
                "United States"
            ],
            [
                "Paul Azinger",
                47,
                "United States"
            ],
            [
                "Nick Price",
                48,
                "Zimbabwe"
            ],
            [
                "Mark Brooks",
                48,
                "United States"
            ],
            [
                "Vijay Singh",
                45,
                "Fiji"
            ]
        ]
    },
    {
        "question": "Return the different countries for artists.",
        "query": "MATCH (artist:`theme_gallery.artist`)\nRETURN DISTINCT artist.Country",
        "db_id": "theme_gallery",
        "answers": [
            [
                "Fiji"
            ],
            [
                "United States"
            ],
            [
                "Zimbabwe"
            ]
        ]
    },
    {
        "question": "Show all artist names and the year joined who are not from United States.",
        "query": "MATCH (artist:`theme_gallery.artist`)\nWHERE artist.Country <> 'United States'\nRETURN artist.Name,artist.Year_Join",
        "db_id": "theme_gallery",
        "answers": [
            [
                "Vijay Singh",
                1998
            ],
            [
                "Nick Price",
                1994
            ]
        ]
    },
    {
        "question": "Count the number of artists who are older than 46 and joined after 1990.",
        "query": "MATCH (artist:`theme_gallery.artist`)\nWHERE artist.Age > 46 AND artist.Year_Join > 1990\nRETURN count(*)",
        "db_id": "theme_gallery",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "What is the average and minimum age of all artists from United States.",
        "query": "MATCH (artist:`theme_gallery.artist`)\nWHERE artist.Country = 'United States'\nRETURN avg(artist.Age),min(artist.Age)",
        "db_id": "theme_gallery",
        "answers": [
            [
                49.6,
                46
            ]
        ]
    },
    {
        "question": "Return the name of the artist who has the latest join year.",
        "query": "MATCH (artist:`theme_gallery.artist`)\nRETURN artist.Name\nORDER BY artist.Year_Join DESC\nLIMIT 1",
        "db_id": "theme_gallery",
        "answers": [
            [
                "Vijay Singh"
            ]
        ]
    },
    {
        "question": "Count the number of exhibitions that happened in or after 2005.",
        "query": "MATCH (exhibition:`theme_gallery.exhibition`)\nWHERE exhibition.Year >= 2005\nRETURN count(*)",
        "db_id": "theme_gallery",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "Show theme and year for all exhibitions with ticket prices lower than 15.",
        "query": "MATCH (exhibition:`theme_gallery.exhibition`)\nWHERE exhibition.Ticket_Price < 15\nRETURN exhibition.Theme,exhibition.Year",
        "db_id": "theme_gallery",
        "answers": [
            [
                "Santa Claus and Rudolph the Red-Nosed Reindeer",
                2006
            ],
            [
                "Summer",
                2009
            ]
        ]
    }
]