[
    {
        "db_id": "hr_1",
        "query": "MATCH (T1:`hr_1.employees`)-[]-(T2:`hr_1.jobs`)\nWHERE T1.DEPARTMENT_ID = 80\nRETURN T1.EMPLOYEE_ID,T2.JOB_TITLE",
        "question": "display the employee ID and job name for all those jobs in department 80.",
        "answers": [
            [
                145,
                "Sales Manager"
            ],
            [
                146,
                "Sales Manager"
            ],
            [
                147,
                "Sales Manager"
            ],
            [
                148,
                "Sales Manager"
            ],
            [
                149,
                "Sales Manager"
            ],
            [
                150,
                "Sales Representative"
            ],
            [
                151,
                "Sales Representative"
            ],
            [
                152,
                "Sales Representative"
            ],
            [
                153,
                "Sales Representative"
            ],
            [
                154,
                "Sales Representative"
            ],
            [
                155,
                "Sales Representative"
            ],
            [
                156,
                "Sales Representative"
            ],
            [
                157,
                "Sales Representative"
            ],
            [
                158,
                "Sales Representative"
            ],
            [
                159,
                "Sales Representative"
            ],
            [
                160,
                "Sales Representative"
            ],
            [
                161,
                "Sales Representative"
            ],
            [
                162,
                "Sales Representative"
            ],
            [
                163,
                "Sales Representative"
            ],
            [
                164,
                "Sales Representative"
            ],
            [
                165,
                "Sales Representative"
            ],
            [
                166,
                "Sales Representative"
            ],
            [
                167,
                "Sales Representative"
            ],
            [
                168,
                "Sales Representative"
            ],
            [
                169,
                "Sales Representative"
            ],
            [
                170,
                "Sales Representative"
            ],
            [
                171,
                "Sales Representative"
            ],
            [
                172,
                "Sales Representative"
            ],
            [
                173,
                "Sales Representative"
            ],
            [
                174,
                "Sales Representative"
            ],
            [
                175,
                "Sales Representative"
            ],
            [
                176,
                "Sales Representative"
            ],
            [
                177,
                "Sales Representative"
            ],
            [
                179,
                "Sales Representative"
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (T1:`hr_1.employees`)-[]-(T2:`hr_1.jobs`)\nWHERE T1.DEPARTMENT_ID = 80\nRETURN T1.EMPLOYEE_ID,T2.JOB_TITLE",
        "question": "what are the employee ids and job titles for employees in department 80?",
        "answers": [
            [
                145,
                "Sales Manager"
            ],
            [
                146,
                "Sales Manager"
            ],
            [
                147,
                "Sales Manager"
            ],
            [
                148,
                "Sales Manager"
            ],
            [
                149,
                "Sales Manager"
            ],
            [
                150,
                "Sales Representative"
            ],
            [
                151,
                "Sales Representative"
            ],
            [
                152,
                "Sales Representative"
            ],
            [
                153,
                "Sales Representative"
            ],
            [
                154,
                "Sales Representative"
            ],
            [
                155,
                "Sales Representative"
            ],
            [
                156,
                "Sales Representative"
            ],
            [
                157,
                "Sales Representative"
            ],
            [
                158,
                "Sales Representative"
            ],
            [
                159,
                "Sales Representative"
            ],
            [
                160,
                "Sales Representative"
            ],
            [
                161,
                "Sales Representative"
            ],
            [
                162,
                "Sales Representative"
            ],
            [
                163,
                "Sales Representative"
            ],
            [
                164,
                "Sales Representative"
            ],
            [
                165,
                "Sales Representative"
            ],
            [
                166,
                "Sales Representative"
            ],
            [
                167,
                "Sales Representative"
            ],
            [
                168,
                "Sales Representative"
            ],
            [
                169,
                "Sales Representative"
            ],
            [
                170,
                "Sales Representative"
            ],
            [
                171,
                "Sales Representative"
            ],
            [
                172,
                "Sales Representative"
            ],
            [
                173,
                "Sales Representative"
            ],
            [
                174,
                "Sales Representative"
            ],
            [
                175,
                "Sales Representative"
            ],
            [
                176,
                "Sales Representative"
            ],
            [
                177,
                "Sales Representative"
            ],
            [
                179,
                "Sales Representative"
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (T1:`hr_1.employees`)-[]-(T2:`hr_1.departments`)\nWHERE T2.DEPARTMENT_NAME = 'Finance'\nRETURN T1.FIRST_NAME,T1.JOB_ID",
        "question": "What is the first name and job id for all employees in the Finance department?",
        "answers": [
            [
                "Jose Manuel",
                "FI_ACCOUNT"
            ],
            [
                "Luis",
                "FI_ACCOUNT"
            ],
            [
                "Daniel",
                "FI_ACCOUNT"
            ],
            [
                "John",
                "FI_ACCOUNT"
            ],
            [
                "Nancy",
                "FI_MGR"
            ],
            [
                "Ismael",
                "FI_ACCOUNT"
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (T1:`hr_1.employees`)-[]-(T2:`hr_1.departments`)\nWHERE T2.DEPARTMENT_NAME = 'Finance'\nRETURN T1.FIRST_NAME,T1.JOB_ID",
        "question": "Give the first name and job id for all employees in the Finance department.",
        "answers": [
            [
                "Jose Manuel",
                "FI_ACCOUNT"
            ],
            [
                "Luis",
                "FI_ACCOUNT"
            ],
            [
                "Daniel",
                "FI_ACCOUNT"
            ],
            [
                "John",
                "FI_ACCOUNT"
            ],
            [
                "Nancy",
                "FI_MGR"
            ],
            [
                "Ismael",
                "FI_ACCOUNT"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (song:`music_1.song`)\nRETURN song.song_name,song.releasedate\nORDER BY song.releasedate DESC\nLIMIT 1",
        "question": "What is the name of the song that was released in the most recent year?",
        "answers": [
            [
                "Ami opar hoye",
                "7-APR-2001"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (song:`music_1.song`)\nRETURN song.song_name,song.releasedate\nORDER BY song.releasedate DESC\nLIMIT 1",
        "question": "What is the name of the song that was released most recently?",
        "answers": [
            [
                "Ami opar hoye",
                "7-APR-2001"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (files:`music_1.files`)\nRETURN files.f_id\nORDER BY files.duration DESC\nLIMIT 1",
        "question": "What is the id of the longest song?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (files:`music_1.files`)\nRETURN files.f_id\nORDER BY files.duration DESC\nLIMIT 1",
        "question": "Find the id of the song that lasts the longest.",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWHERE T2.rating > 9\nRETURN DISTINCT T1.artist_name,T1.country",
        "question": "List the name and country of origin for all singers who have produced songs with rating above 9.",
        "answers": [
            [
                "Topu",
                "India"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWHERE T2.rating > 9\nRETURN DISTINCT T1.artist_name,T1.country",
        "question": "What are the different names and countries of origins for all artists whose song ratings are above 9?",
        "answers": [
            [
                "Topu",
                "India"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (T1:`music_1.files`)-[]-(T2:`music_1.song`)\nWHERE T2.resolution < 800\nRETURN DISTINCT T1.file_size,T1.formats",
        "question": "List the file size and format for all songs that have resolution lower than 800.",
        "answers": [
            [
                "4.12 MB",
                "mp3"
            ],
            [
                "3.69 MB",
                "mp4"
            ],
            [
                "5.10 MB",
                "mp3"
            ],
            [
                "4.10 MB",
                "mp4"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (T1:`music_1.files`)-[]-(T2:`music_1.song`)\nWHERE T2.resolution < 800\nRETURN DISTINCT T1.file_size,T1.formats",
        "question": "What are the file sizes and formats for all songs with a resolution lower than 800?",
        "answers": [
            [
                "4.12 MB",
                "mp3"
            ],
            [
                "3.69 MB",
                "mp4"
            ],
            [
                "5.10 MB",
                "mp3"
            ],
            [
                "4.10 MB",
                "mp4"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (T1:`music_1.song`)-[]-(T2:`music_1.files`)\nRETURN T1.artist_name\nORDER BY T2.duration\nLIMIT 1",
        "question": "What is the name of the artist who produced the shortest song?",
        "answers": [
            [
                "Prity"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (T1:`music_1.song`)-[]-(T2:`music_1.files`)\nRETURN T1.artist_name\nORDER BY T2.duration\nLIMIT 1",
        "question": "What are the names of the artists who sang the shortest song?",
        "answers": [
            [
                "Prity"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nRETURN T1.artist_name,T1.country\nORDER BY T2.rating DESC\nLIMIT 3",
        "question": "What are the names and countries of origin for the artists who produced the top three highly rated songs.",
        "answers": [
            [
                "Topu",
                "India"
            ],
            [
                "Shrikanta",
                "India"
            ],
            [
                "Michel",
                "UK"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nRETURN T1.artist_name,T1.country\nORDER BY T2.rating DESC\nLIMIT 3",
        "question": "What are the names of the singers who sang the top 3 most highly rated songs and what countries do they hail from?",
        "answers": [
            [
                "Topu",
                "India"
            ],
            [
                "Shrikanta",
                "India"
            ],
            [
                "Michel",
                "UK"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (files:`music_1.files`)\nRETURN files.formats\nORDER BY files.formats DESC\nLIMIT 1",
        "question": "What is the most popular file format?",
        "answers": [
            [
                "mp4"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (files:`music_1.files`)\nRETURN files.formats\nORDER BY files.formats DESC\nLIMIT 1",
        "question": "Find the file format that is used by the most files.",
        "answers": [
            [
                "mp4"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (artist:`music_1.artist`)\nRETURN count(*),artist.gender",
        "question": "What is the number of artists for each gender?",
        "answers": [
            [
                3,
                "Male"
            ],
            [
                3,
                "Female"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (artist:`music_1.artist`)\nRETURN count(*),artist.gender",
        "question": "How many artists are male and how many are female?",
        "answers": [
            [
                3,
                "Male"
            ],
            [
                3,
                "Female"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (song:`music_1.song`)\nRETURN avg(song.rating),song.languages",
        "question": "What is the average rating of songs for each language?",
        "answers": [
            [
                7.5,
                "bangla"
            ],
            [
                7.0,
                "english"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (song:`music_1.song`)\nRETURN avg(song.rating),song.languages",
        "question": "What is the average song rating for each language?",
        "answers": [
            [
                7.5,
                "bangla"
            ],
            [
                7.0,
                "english"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nRETURN T1.gender,T1.artist_name\nORDER BY T2.resolution\nLIMIT 1",
        "question": "Return the gender and name of artist who produced the song with the lowest resolution.",
        "answers": [
            [
                "Female",
                "Farida"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nRETURN T1.gender,T1.artist_name\nORDER BY T2.resolution\nLIMIT 1",
        "question": "What is the gender and name of the artist who sang the song with the smallest resolution?",
        "answers": [
            [
                "Female",
                "Farida"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (files:`music_1.files`)\nRETURN count(*),files.formats",
        "question": "For each file format, return the number of artists who released songs in that format.",
        "answers": [
            [
                4,
                "mp4"
            ],
            [
                2,
                "mp3"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (files:`music_1.files`)\nRETURN count(*),files.formats",
        "question": "How many songs were released for each format?",
        "answers": [
            [
                4,
                "mp4"
            ],
            [
                2,
                "mp3"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (genre:`music_1.genre`)\nRETURN genre.g_name,genre.rating\nORDER BY genre.g_name",
        "question": "List the names of all genres in alphabetical oder, together with its ratings.",
        "answers": [
            [
                "blues",
                "7"
            ],
            [
                "folk",
                "9"
            ],
            [
                "modern",
                "8"
            ],
            [
                "nazrul",
                "7"
            ],
            [
                "pop",
                "9"
            ],
            [
                "tagore",
                "8"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (genre:`music_1.genre`)\nRETURN genre.g_name,genre.rating\nORDER BY genre.g_name",
        "question": "What are the names of all genres in alphabetical order, combined with its ratings?",
        "answers": [
            [
                "blues",
                "7"
            ],
            [
                "folk",
                "9"
            ],
            [
                "modern",
                "8"
            ],
            [
                "nazrul",
                "7"
            ],
            [
                "pop",
                "9"
            ],
            [
                "tagore",
                "8"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (song:`music_1.song`)\nRETURN song.song_name\nORDER BY song.resolution",
        "question": "Give me a list of the names of all songs ordered by their resolution.",
        "answers": [
            [
                "Ami opar hoye"
            ],
            [
                "Aj ei akash"
            ],
            [
                "Shukno patar nupur pae"
            ],
            [
                "Just beat it"
            ],
            [
                "Tumi robe nirobe"
            ],
            [
                "My love"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (song:`music_1.song`)\nRETURN song.song_name\nORDER BY song.resolution",
        "question": "What are the names of all songs that are ordered by their resolution numbers?",
        "answers": [
            [
                "Ami opar hoye"
            ],
            [
                "Aj ei akash"
            ],
            [
                "Shukno patar nupur pae"
            ],
            [
                "Just beat it"
            ],
            [
                "Tumi robe nirobe"
            ],
            [
                "My love"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (song:`music_1.song`)\nWHERE song.resolution > 500\nRETURN song.artist_name\nORDER BY song.languages DESC\nLIMIT 1",
        "question": "What is the language that was used most often in songs with resolution above 500?",
        "answers": [
            [
                "Enrique"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (song:`music_1.song`)\nWHERE song.resolution > 500\nRETURN song.artist_name\nORDER BY song.languages DESC\nLIMIT 1",
        "question": "What is the name of the artist, for each language, that has the most songs with a higher resolution than 500?",
        "answers": [
            [
                "Enrique"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWHERE T2.resolution > 900\nWITH count(*) AS count, T1.country AS country, T1.artist_name AS artist_name\nWHERE count  >= 1\nRETURN artist_name,country",
        "question": "Find the name and country of origin for all artists who have release at least one song of resolution above 900.",
        "answers": [
            [
                "Shrikanta",
                "India"
            ],
            [
                "Enrique",
                "USA"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWHERE T2.resolution > 900\nWITH count(*) AS count, T1.country AS country, T1.artist_name AS artist_name\nWHERE count  >= 1\nRETURN artist_name,country",
        "question": "What is the name and country of origin for each artist who has released a song with a resolution higher than 900?",
        "answers": [
            [
                "Shrikanta",
                "India"
            ],
            [
                "Enrique",
                "USA"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (song:`music_1.song`)\nWHERE song.languages = 'english'\nWITH min(song.rating) AS rating\nMATCH (song:`music_1.song`)\nWHERE  song.rating <  rating \nRETURN song.song_name",
        "question": "What are the names of the songs whose rating is below the rating of all songs in English?",
        "answers": [
            [
                "Shukno patar nupur pae"
            ]
        ]
    },
    {
        "db_id": "music_1",
        "query": "MATCH (song:`music_1.song`)\nWHERE song.languages = 'english'\nWITH min(song.rating) AS rating\nMATCH (song:`music_1.song`)\nWHERE  song.rating <  rating \nRETURN song.song_name",
        "question": "What are the song names for every song whose rating is less than the minimum rating for English songs?",
        "answers": [
            [
                "Shukno patar nupur pae"
            ]
        ]
    },
    {
        "db_id": "mountain_photos",
        "query": "MATCH (camera_lens:`mountain_photos.camera_lens`)\nWHERE camera_lens.focal_length_mm > 15\nRETURN count(*)",
        "question": "How many camera lenses have a focal length longer than 15 mm?",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "mountain_photos",
        "query": "MATCH (camera_lens:`mountain_photos.camera_lens`)\nRETURN camera_lens.brand,camera_lens.name\nORDER BY camera_lens.max_aperture DESC",
        "question": "Find the brand and name for each camera lens, and sort in descending order of maximum aperture.",
        "answers": [
            [
                "Olympus",
                "Olympus 15mm f/8.0 Body Cap"
            ],
            [
                "Panasonic",
                "Panasonic Lumix G 150mm f /2.8"
            ],
            [
                "Sigma",
                "Sigma 19mm f2.8 DN"
            ],
            [
                "Sigma",
                "Sigma 19mm f2.8 EX DN"
            ],
            [
                "Sigma",
                "Sigma 30mm f2.8 DN"
            ],
            [
                "Schneider Kreuznach",
                "Schneider Kreuznach Super Angulon 14mm f /2.0"
            ],
            [
                "Olympus",
                "Olympus M.Zuiko Digital ED 45mm f/1.8"
            ],
            [
                "Olympus",
                "Olympus M.Zuiko Digital ED 75mm f/1.8"
            ],
            [
                "Panasonic",
                "Panasonic Leica DG Summilux 25mm f /1.4 Asph."
            ],
            [
                "Schneider Kreuznach",
                "Schneider Kreuznach Xenon 30mm f /1.4"
            ],
            [
                "Panasonic",
                "Panasonic Leica DG Nocticron 42.5mm f /1.2"
            ]
        ]
    },
    {
        "db_id": "mountain_photos",
        "query": "MATCH (photos:`mountain_photos.photos`)\nRETURN photos.id,photos.color,photos.name",
        "question": "List the id, color scheme, and name for all the photos.",
        "answers": [
            [
                1,
                "RBG",
                "monkey"
            ],
            [
                2,
                "RBG",
                "rabbits"
            ],
            [
                3,
                "Black/White",
                "deers"
            ],
            [
                4,
                "RBG",
                "grass"
            ],
            [
                5,
                "RBG",
                "cloud"
            ],
            [
                6,
                "RBG",
                "sunset"
            ],
            [
                7,
                "RBG",
                "river"
            ],
            [
                8,
                "Black/White",
                "wolfs"
            ],
            [
                9,
                "RBG",
                "the mountain"
            ],
            [
                10,
                "RBG",
                "life"
            ]
        ]
    },
    {
        "db_id": "mountain_photos",
        "query": "MATCH (mountain:`mountain_photos.mountain`)\nWHERE mountain.Country = 'Morocco'\nRETURN avg(mountain.Prominence)",
        "question": "What are the average prominence of the mountains in country 'Morocco'?",
        "answers": [
            [
                1316.5
            ]
        ]
    },
    {
        "db_id": "mountain_photos",
        "query": "MATCH (mountain:`mountain_photos.mountain`)\nWHERE mountain.Range <> 'Aberdare Range'\nRETURN mountain.name,mountain.Height,mountain.Prominence",
        "question": "What are the name, height and prominence of mountains which do not belong to the range 'Aberdare Range'?",
        "answers": [
            [
                "Abune Yosef / Guliba Amba",
                4260.0,
                1909.0
            ],
            [
                "Ioll / Yoll",
                4220.0,
                350.0
            ],
            [
                "Bada",
                4195.0,
                1605.0
            ],
            [
                "Kaka / Kecha / Chiqe",
                4193.0,
                1215.0
            ],
            [
                "Jbel Toubkal",
                4167.0,
                3755.0
            ],
            [
                "Muhavura",
                4127.0,
                1530.0
            ],
            [
                "Hey / Hay",
                4125.0,
                660.0
            ],
            [
                "Guna",
                4120.0,
                1510.0
            ],
            [
                "Choqa / Choke / Birhan",
                4100.0,
                2225.0
            ],
            [
                "Ouanoukrim",
                4088.0,
                420.0
            ],
            [
                "Chilalo",
                4071.0,
                610.0
            ],
            [
                "Mount Cameroon",
                4070.0,
                3931.0
            ],
            [
                "Inatye",
                4070.0,
                500.0
            ],
            [
                "Ighil Mgoun",
                4068.0,
                1904.0
            ],
            [
                "Weshema / Wasema?",
                4030.0,
                420.0
            ],
            [
                "Jebel n'Tarourt / Tifnout / Iferouane",
                3996.0,
                910.0
            ],
            [
                "Muggia",
                3950.0,
                500.0
            ],
            [
                "Dubbai",
                3941.0,
                1540.0
            ],
            [
                "Taska n\u2019Zat",
                3912.0,
                460.0
            ],
            [
                "Aksou\u00e2l",
                3903.0,
                450.0
            ],
            [
                "Cimbia",
                3900.0,
                590.0
            ]
        ]
    },
    {
        "db_id": "mountain_photos",
        "query": "MATCH (T1:`mountain_photos.mountain`)-[]-(T2:`mountain_photos.photos`)\nWHERE T1.Height > 4000\nRETURN T1.id,T1.name",
        "question": "What are the id and name of the photos for mountains?",
        "answers": [
            [
                1,
                "Abune Yosef / Guliba Amba"
            ],
            [
                2,
                "Ioll / Yoll"
            ],
            [
                10,
                "Ouanoukrim"
            ],
            [
                12,
                "Mount Cameroon"
            ],
            [
                12,
                "Mount Cameroon"
            ],
            [
                12,
                "Mount Cameroon"
            ],
            [
                14,
                "Ighil Mgoun"
            ],
            [
                14,
                "Ighil Mgoun"
            ]
        ]
    },
    {
        "db_id": "mountain_photos",
        "query": "MATCH (T1:`mountain_photos.mountain`)-[]-(T2:`mountain_photos.photos`)\nWITH T1.name AS name, count(*) AS count, T1.id AS id\nWHERE count  >= 2\nRETURN id,name",
        "question": "What are the id and name of the mountains that have at least 2 photos?",
        "answers": [
            [
                20,
                "Taska n\u2019Zat"
            ],
            [
                14,
                "Ighil Mgoun"
            ],
            [
                12,
                "Mount Cameroon"
            ]
        ]
    },
    {
        "db_id": "mountain_photos",
        "query": "MATCH (T1:`mountain_photos.photos`)-[]-(T2:`mountain_photos.camera_lens`)\nWITH count(T1.id) AS cnt, T2\nRETURN T2.name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What are the names of the cameras that have taken picture of the most mountains?",
        "answers": [
            [
                "Sigma 19mm f2.8 EX DN"
            ]
        ]
    },
    {
        "db_id": "mountain_photos",
        "query": "MATCH (T1:`mountain_photos.camera_lens`)-[]-(T2:`mountain_photos.photos`)\nWHERE T1.brand = 'Sigma' OR T1.brand = 'Olympus'\nRETURN T1.name",
        "question": "What are the names of photos taken with the lens brand 'Sigma' or 'Olympus'?",
        "answers": [
            [
                "Olympus 15mm f/8.0 Body Cap"
            ],
            [
                "Olympus 15mm f/8.0 Body Cap"
            ],
            [
                "Sigma 19mm f2.8 EX DN"
            ],
            [
                "Sigma 19mm f2.8 EX DN"
            ],
            [
                "Sigma 19mm f2.8 EX DN"
            ],
            [
                "Sigma 19mm f2.8 EX DN"
            ]
        ]
    },
    {
        "db_id": "mountain_photos",
        "query": "MATCH (camera_lens:`mountain_photos.camera_lens`)\nRETURN count(DISTINCT camera_lens.brand)",
        "question": "How many different kinds of lens brands are there?",
        "answers": [
            [
                4
            ]
        ]
    }
]