[
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWHERE documents.Document_Name = 'Noel CV' OR documents.Document_Name = 'King Book'\nRETURN documents.Document_Type_Code,documents.Document_Name,documents.Document_Description",
        "question": "What are the type come, name, and description of the document that has either the name 'Noel CV' or 'King Book'?",
        "answers": [
            [
                "BK",
                "Noel CV",
                null
            ],
            [
                "PP",
                "King Book",
                null
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nRETURN documents.Document_ID,documents.Document_Name",
        "question": "Show the ids and names of all documents.",
        "answers": [
            [
                29,
                "Review on UK files"
            ],
            [
                42,
                "Review on Canadian files"
            ],
            [
                57,
                "Review on French files"
            ],
            [
                121,
                "Review on USA files"
            ],
            [
                181,
                "Chapter on private files"
            ],
            [
                192,
                "Book on USA files"
            ],
            [
                226,
                "Review on UK files"
            ],
            [
                227,
                "Deontae files"
            ],
            [
                240,
                "Winona Book"
            ],
            [
                300,
                "Trenton Presentation"
            ],
            [
                309,
                "Noel CV"
            ],
            [
                318,
                "King Book"
            ],
            [
                367,
                "Jevon Paper"
            ],
            [
                371,
                "Katheryn statement"
            ],
            [
                383,
                "Review on UK files"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nRETURN documents.Document_ID,documents.Document_Name",
        "question": "What are the ids and names for each of the documents?",
        "answers": [
            [
                29,
                "Review on UK files"
            ],
            [
                42,
                "Review on Canadian files"
            ],
            [
                57,
                "Review on French files"
            ],
            [
                121,
                "Review on USA files"
            ],
            [
                181,
                "Chapter on private files"
            ],
            [
                192,
                "Book on USA files"
            ],
            [
                226,
                "Review on UK files"
            ],
            [
                227,
                "Deontae files"
            ],
            [
                240,
                "Winona Book"
            ],
            [
                300,
                "Trenton Presentation"
            ],
            [
                309,
                "Noel CV"
            ],
            [
                318,
                "King Book"
            ],
            [
                367,
                "Jevon Paper"
            ],
            [
                371,
                "Katheryn statement"
            ],
            [
                383,
                "Review on UK files"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nRETURN documents.Project_ID,count(*)",
        "question": "Show project ids and the number of documents in each project.",
        "answers": [
            [
                30,
                3
            ],
            [
                105,
                5
            ],
            [
                195,
                1
            ],
            [
                134,
                3
            ],
            [
                35,
                3
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nRETURN documents.Project_ID,count(*)",
        "question": "How many documents correspond with each project id?",
        "answers": [
            [
                30,
                3
            ],
            [
                105,
                5
            ],
            [
                195,
                1
            ],
            [
                134,
                3
            ],
            [
                35,
                3
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWITH documents.Project_ID AS Project_ID, count(*) AS count\nWHERE count  >= 2\nRETURN Project_ID",
        "question": "Show the ids for projects with at least 2 documents.",
        "answers": [
            [
                30
            ],
            [
                105
            ],
            [
                134
            ],
            [
                35
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWITH documents.Project_ID AS Project_ID, count(*) AS count\nWHERE count  >= 2\nRETURN Project_ID",
        "question": "What are project ids of projects that have 2 or more corresponding documents?",
        "answers": [
            [
                30
            ],
            [
                105
            ],
            [
                134
            ],
            [
                35
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nRETURN documents.Document_Type_Code,count(*)",
        "question": "List document type codes and the number of documents in each code.",
        "answers": [
            [
                "CV",
                3
            ],
            [
                "BK",
                6
            ],
            [
                "PP",
                5
            ],
            [
                "FM",
                1
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nRETURN documents.Document_Type_Code,count(*)",
        "question": "How many documents are there of each type?",
        "answers": [
            [
                "CV",
                3
            ],
            [
                "BK",
                6
            ],
            [
                "PP",
                5
            ],
            [
                "FM",
                1
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWITH count(*) AS count, documents.Document_Type_Code AS Document_Type_Code\nWHERE count  < 3\nRETURN Document_Type_Code",
        "question": "Show the document type code with fewer than 3 documents.",
        "answers": [
            [
                "FM"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWITH count(*) AS count, documents.Document_Type_Code AS Document_Type_Code\nWHERE count  < 3\nRETURN Document_Type_Code",
        "question": "What are the codes corresponding to document types for which there are less than 3 documents?",
        "answers": [
            [
                "FM"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Statements`)-[]-(T2:`cre_Docs_and_Epenses.Documents`)\nWHERE T1.Statement_Details = 'Private Project'\nRETURN T1.Statement_Details,T2.Document_Name",
        "question": "Show the statement detail and the corresponding document name for the statement with detail 'Private Project'.",
        "answers": [
            [
                "Private Project",
                "Book on USA files"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Statements`)-[]-(T2:`cre_Docs_and_Epenses.Documents`)\nWHERE T1.Statement_Details = 'Private Project'\nRETURN T1.Statement_Details,T2.Document_Name",
        "question": "What are the details for statements with the details 'Private Project', and what are the names of the corresponding documents?",
        "answers": [
            [
                "Private Project",
                "Book on USA files"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (ref_document_types:`cre_Docs_and_Epenses.Ref_Document_Types`)\nRETURN ref_document_types.Document_Type_Code,ref_document_types.Document_Type_Name,ref_document_types.Document_Type_Description",
        "question": "Show all document type codes, document type names, document type descriptions.",
        "answers": [
            [
                "BK",
                "Book",
                "excellent"
            ],
            [
                "CV",
                "CV",
                "excellent"
            ],
            [
                "PT",
                "Presentation",
                "very good"
            ],
            [
                "PP",
                "Paper",
                "good"
            ],
            [
                "FM",
                "Film",
                "fun"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (ref_document_types:`cre_Docs_and_Epenses.Ref_Document_Types`)\nRETURN ref_document_types.Document_Type_Code,ref_document_types.Document_Type_Name,ref_document_types.Document_Type_Description",
        "question": "What are the codes, names, and descriptions of the different document types?",
        "answers": [
            [
                "BK",
                "Book",
                "excellent"
            ],
            [
                "CV",
                "CV",
                "excellent"
            ],
            [
                "PT",
                "Presentation",
                "very good"
            ],
            [
                "PP",
                "Paper",
                "good"
            ],
            [
                "FM",
                "Film",
                "fun"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Ref_Document_Types`)-[]-(T2:`cre_Docs_and_Epenses.Documents`)\nRETURN T1.Document_Type_Name,T1.Document_Type_Description,T2.Document_Date",
        "question": "What is the document type name and the document type description and creation date for all the documents?",
        "answers": [
            [
                "Book",
                "excellent",
                "1970-03-06 07:34:49"
            ],
            [
                "Book",
                "excellent",
                "1971-06-09 19:03:41"
            ],
            [
                "Book",
                "excellent",
                "2012-12-27 19:09:18"
            ],
            [
                "Book",
                "excellent",
                "1981-11-29 10:23:01"
            ],
            [
                "Book",
                "excellent",
                "1991-07-08 08:49:59"
            ],
            [
                "Book",
                "excellent",
                "1978-10-15 10:33:17"
            ],
            [
                "CV",
                "excellent",
                "1983-08-24 17:10:26"
            ],
            [
                "CV",
                "excellent",
                "2004-08-28 06:59:19"
            ],
            [
                "CV",
                "excellent",
                "1980-10-22 14:17:11"
            ],
            [
                "Paper",
                "good",
                "1970-01-30 10:53:35"
            ],
            [
                "Paper",
                "good",
                "2013-01-26 15:15:25"
            ],
            [
                "Paper",
                "good",
                "2005-10-28 03:17:16"
            ],
            [
                "Paper",
                "good",
                "1976-05-06 12:56:12"
            ],
            [
                "Paper",
                "good",
                "1970-06-17 14:03:21"
            ],
            [
                "Film",
                "fun",
                "2007-09-26 02:39:11"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Ref_Document_Types`)-[]-(T2:`cre_Docs_and_Epenses.Documents`)\nRETURN T1.Document_Type_Name,T1.Document_Type_Description,T2.Document_Date",
        "question": "Return the type name, type description, and date of creation for each document.",
        "answers": [
            [
                "Book",
                "excellent",
                "1970-03-06 07:34:49"
            ],
            [
                "Book",
                "excellent",
                "1971-06-09 19:03:41"
            ],
            [
                "Book",
                "excellent",
                "2012-12-27 19:09:18"
            ],
            [
                "Book",
                "excellent",
                "1981-11-29 10:23:01"
            ],
            [
                "Book",
                "excellent",
                "1991-07-08 08:49:59"
            ],
            [
                "Book",
                "excellent",
                "1978-10-15 10:33:17"
            ],
            [
                "CV",
                "excellent",
                "1983-08-24 17:10:26"
            ],
            [
                "CV",
                "excellent",
                "2004-08-28 06:59:19"
            ],
            [
                "CV",
                "excellent",
                "1980-10-22 14:17:11"
            ],
            [
                "Paper",
                "good",
                "1970-01-30 10:53:35"
            ],
            [
                "Paper",
                "good",
                "2013-01-26 15:15:25"
            ],
            [
                "Paper",
                "good",
                "2005-10-28 03:17:16"
            ],
            [
                "Paper",
                "good",
                "1976-05-06 12:56:12"
            ],
            [
                "Paper",
                "good",
                "1970-06-17 14:03:21"
            ],
            [
                "Film",
                "fun",
                "2007-09-26 02:39:11"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (projects:`cre_Docs_and_Epenses.Projects`)\nRETURN count(*)",
        "question": "Show the number of projects.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (projects:`cre_Docs_and_Epenses.Projects`)\nRETURN count(*)",
        "question": "How many projects are there?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (projects:`cre_Docs_and_Epenses.Projects`)\nRETURN projects.Project_ID,projects.Project_Details",
        "question": "List ids and details for all projects.",
        "answers": [
            [
                30,
                "Society Research project"
            ],
            [
                35,
                "Internet of Things project"
            ],
            [
                105,
                "Graph Database project"
            ],
            [
                134,
                "Human Resource project"
            ],
            [
                195,
                "Population Research project"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (projects:`cre_Docs_and_Epenses.Projects`)\nRETURN projects.Project_ID,projects.Project_Details",
        "question": "What are the ids and details for each project?",
        "answers": [
            [
                30,
                "Society Research project"
            ],
            [
                35,
                "Internet of Things project"
            ],
            [
                105,
                "Graph Database project"
            ],
            [
                134,
                "Human Resource project"
            ],
            [
                195,
                "Population Research project"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Projects`)-[]-(T2:`cre_Docs_and_Epenses.Documents`)\nWITH count(*) AS count, T1.Project_Details AS Project_Details, T1.Project_ID AS Project_ID\nWHERE count  > 2\nRETURN Project_ID,Project_Details",
        "question": "What is the project id and detail for the project with at least two documents?",
        "answers": [
            [
                30,
                "Society Research project"
            ],
            [
                35,
                "Internet of Things project"
            ],
            [
                105,
                "Graph Database project"
            ],
            [
                134,
                "Human Resource project"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Projects`)-[]-(T2:`cre_Docs_and_Epenses.Documents`)\nWHERE T2.Document_Name = \"King Book\"\nRETURN T1.Project_Details",
        "question": "What is the project detail for the project with document \"King Book\"?",
        "answers": [
            [
                "Human Resource project"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Projects`)-[]-(T2:`cre_Docs_and_Epenses.Documents`)\nWHERE T2.Document_Name = \"King Book\"\nRETURN T1.Project_Details",
        "question": "Give the details of the project with the document name 'King Book'.",
        "answers": [
            [
                "Human Resource project"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (ref_budget_codes:`cre_Docs_and_Epenses.Ref_Budget_Codes`)\nRETURN count(*)",
        "question": "How many budget types do we have?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (ref_budget_codes:`cre_Docs_and_Epenses.Ref_Budget_Codes`)\nRETURN count(*)",
        "question": "Count the number of budget codes.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (ref_budget_codes:`cre_Docs_and_Epenses.Ref_Budget_Codes`)\nRETURN ref_budget_codes.Budget_Type_Code,ref_budget_codes.Budget_Type_Description",
        "question": "List all budget type codes and descriptions.",
        "answers": [
            [
                "GV",
                "Government"
            ],
            [
                "ORG",
                "Organisation"
            ],
            [
                "SF",
                "Self founded"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (ref_budget_codes:`cre_Docs_and_Epenses.Ref_Budget_Codes`)\nRETURN ref_budget_codes.Budget_Type_Code,ref_budget_codes.Budget_Type_Description",
        "question": "What are the type codes and descriptions of each budget type?",
        "answers": [
            [
                "GV",
                "Government"
            ],
            [
                "ORG",
                "Organisation"
            ],
            [
                "SF",
                "Self founded"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents_with_expenses:`cre_Docs_and_Epenses.Documents_with_Expenses`)\nRETURN count(*)",
        "question": "How many documents have expenses?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents_with_expenses:`cre_Docs_and_Epenses.Documents_with_Expenses`)\nRETURN count(*)",
        "question": "Count the number of documents with expenses.",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents_with_expenses:`cre_Docs_and_Epenses.Documents_with_Expenses`)\nWHERE documents_with_expenses.Budget_Type_Code = 'SF'\nRETURN documents_with_expenses.Document_ID",
        "question": "What are the document ids for the budget type code 'SF'?",
        "answers": [
            [
                309
            ],
            [
                367
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents_with_expenses:`cre_Docs_and_Epenses.Documents_with_Expenses`)\nWHERE documents_with_expenses.Budget_Type_Code = 'SF'\nRETURN documents_with_expenses.Document_ID",
        "question": "Give the ids of documents with expenses that have the budget code 'SF'.",
        "answers": [
            [
                309
            ],
            [
                367
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Documents_with_Expenses`)-[]-(T2:`cre_Docs_and_Epenses.Ref_Budget_Codes`)\nRETURN T2.Budget_Type_Code,T2.Budget_Type_Description,T1.Document_ID",
        "question": "Show the budget type code and description and the corresponding document id.",
        "answers": [
            [
                "GV",
                "Government",
                192
            ],
            [
                "GV",
                "Government",
                226
            ],
            [
                "GV",
                "Government",
                227
            ],
            [
                "GV",
                "Government",
                240
            ],
            [
                "GV",
                "Government",
                300
            ],
            [
                "GV",
                "Government",
                57
            ],
            [
                "ORG",
                "Organisation",
                371
            ],
            [
                "ORG",
                "Organisation",
                383
            ],
            [
                "SF",
                "Self founded",
                367
            ],
            [
                "SF",
                "Self founded",
                309
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Documents_with_Expenses`)-[]-(T2:`cre_Docs_and_Epenses.Ref_Budget_Codes`)\nRETURN T2.Budget_Type_Code,T2.Budget_Type_Description,T1.Document_ID",
        "question": "Return the budget type codes, budget type descriptions and document ids for documents with expenses.",
        "answers": [
            [
                "GV",
                "Government",
                192
            ],
            [
                "GV",
                "Government",
                226
            ],
            [
                "GV",
                "Government",
                227
            ],
            [
                "GV",
                "Government",
                240
            ],
            [
                "GV",
                "Government",
                300
            ],
            [
                "GV",
                "Government",
                57
            ],
            [
                "ORG",
                "Organisation",
                371
            ],
            [
                "ORG",
                "Organisation",
                383
            ],
            [
                "SF",
                "Self founded",
                367
            ],
            [
                "SF",
                "Self founded",
                309
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents_with_expenses:`cre_Docs_and_Epenses.Documents_with_Expenses`)\nRETURN documents_with_expenses.Budget_Type_Code,count(*)",
        "question": "Show budget type codes and the number of documents in each budget type.",
        "answers": [
            [
                "GV",
                6
            ],
            [
                "SF",
                2
            ],
            [
                "ORG",
                2
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents_with_expenses:`cre_Docs_and_Epenses.Documents_with_Expenses`)\nRETURN documents_with_expenses.Budget_Type_Code,count(*)",
        "question": "What are the different budget type codes, and how many documents are there for each?",
        "answers": [
            [
                "GV",
                6
            ],
            [
                "SF",
                2
            ],
            [
                "ORG",
                2
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Documents`)-[]-(T2:`cre_Docs_and_Epenses.Documents_with_Expenses`)\nWHERE T1.Document_Name =~'.*[S|s].*'\nRETURN T1.Document_ID",
        "question": "What are the ids of documents with letter 's' in the name with any expense budgets.",
        "answers": [
            [
                57
            ],
            [
                192
            ],
            [
                226
            ],
            [
                227
            ],
            [
                300
            ],
            [
                371
            ],
            [
                383
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Documents`)-[]-(T2:`cre_Docs_and_Epenses.Documents_with_Expenses`)\nWHERE T1.Document_Name =~'.*[S|s].*'\nRETURN T1.Document_ID",
        "question": "Give the ids of documents that have expenses and contain the letter s in their names.",
        "answers": [
            [
                57
            ],
            [
                192
            ],
            [
                226
            ],
            [
                227
            ],
            [
                300
            ],
            [
                371
            ],
            [
                383
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (scientists:`scientist_1.Scientists`)\nRETURN count(*)",
        "question": "Find the total number of scientists.",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (scientists:`scientist_1.Scientists`)\nRETURN count(*)",
        "question": "How many scientists are there?",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (projects:`scientist_1.Projects`)\nRETURN count(DISTINCT projects.Name)",
        "question": "Find the number of distinct projects.",
        "answers": [
            [
                14
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (projects:`scientist_1.Projects`)\nRETURN count(DISTINCT projects.Name)",
        "question": "How many different projects are there?",
        "answers": [
            [
                14
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (projects:`scientist_1.Projects`)\nRETURN projects.Name\nORDER BY projects.Hours DESC\nLIMIT 1",
        "question": "Find the name of project that continues for the longest time.",
        "answers": [
            [
                "A Magnetic Primer Designer"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (projects:`scientist_1.Projects`)\nRETURN projects.Name\nORDER BY projects.Hours DESC\nLIMIT 1",
        "question": "What is the name of the project with the most hours?",
        "answers": [
            [
                "A Magnetic Primer Designer"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (projects:`scientist_1.Projects`)\nWITH avg(projects.Hours) AS hours\nMATCH (projects:`scientist_1.Projects`)\nWHERE  projects.Hours >  hours \nRETURN projects.Name",
        "question": "List the name of all projects that are operated longer than the average working hours of all projects.",
        "answers": [
            [
                "Build Your Own Telescope"
            ],
            [
                "A Magnetic Primer Designer"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (projects:`scientist_1.Projects`)\nWITH avg(projects.Hours) AS hours\nMATCH (projects:`scientist_1.Projects`)\nWHERE  projects.Hours >  hours \nRETURN projects.Name",
        "question": "What are the names of projects that have taken longer than the average number of hours for all projects?",
        "answers": [
            [
                "Build Your Own Telescope"
            ],
            [
                "A Magnetic Primer Designer"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (T2:`scientist_1.Projects`)-[T1:`scientist_1.AssignedTo`]-(T3:`scientist_1.Scientists`)\nWHERE T3.Name =~'.*[S|s]mith.*'\nRETURN T2.Name",
        "question": "Find the name of the project for which a scientist whose name contains \u2018Smith\u2019 is assigned to.",
        "answers": [
            [
                "Build Your Own Telescope"
            ],
            [
                "Build Your Own Telescope"
            ],
            [
                "Aerodynamics and Gas Mileage"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (T2:`scientist_1.Projects`)-[T1:`scientist_1.AssignedTo`]-(T3:`scientist_1.Scientists`)\nWHERE T3.Name =~'.*[S|s]mith.*'\nRETURN T2.Name",
        "question": "What is the name of the project that has a scientist assigned to it whose name contains 'Smith'?",
        "answers": [
            [
                "Build Your Own Telescope"
            ],
            [
                "Build Your Own Telescope"
            ],
            [
                "Aerodynamics and Gas Mileage"
            ]
        ]
    }
]