[
    {
        "db_id": "riding_club",
        "query": "MATCH (player:`riding_club.player`)\nWHERE player.Occupation <> 'Researcher'\nRETURN player.Player_name,player.Residence",
        "question": "List the name and residence for players whose occupation is not \"Researcher\".",
        "answers": [
            [
                "Jean Luc Bouch\u00e9",
                "Brandon"
            ],
            [
                "Fiona Shiells",
                "Winnipeg"
            ],
            [
                "Ron Strynadka",
                "Birtle"
            ],
            [
                "Jim Maloway",
                "Winnipeg"
            ],
            [
                "Ross Eadie",
                "Winnipeg"
            ],
            [
                "Mohamed Alli",
                "Winnipeg"
            ],
            [
                "Ross C. Martin",
                "Oakbank"
            ],
            [
                "Matt Schaubroeck",
                "Winnipeg"
            ],
            [
                "Patricia Cordner",
                "Selkirk"
            ],
            [
                "Pat Martin",
                "Winnipeg"
            ],
            [
                "Judy Wasylycia-Leis",
                "Winnipeg"
            ],
            [
                "Sean Robert",
                "Winnipeg"
            ],
            [
                "Rachel Heinrichs",
                "Winnipeg"
            ]
        ]
    },
    {
        "db_id": "riding_club",
        "query": "MATCH (player:`riding_club.player`)\nWHERE player.Residence = 'Brandon' OR player.Residence = 'Birtle'\nRETURN player.Sponsor_name",
        "question": "Show the names of sponsors of players whose residence is either \"Brandon\" or \"Birtle\".",
        "answers": [
            [
                "Brandon\u2014Souris"
            ],
            [
                "Dauphin\u2014Swan River\u2014Marquette"
            ]
        ]
    },
    {
        "db_id": "riding_club",
        "query": "MATCH (player:`riding_club.player`)\nRETURN player.Player_name\nORDER BY player.Votes DESC\nLIMIT 1",
        "question": "What is the name of the player with the largest number of votes?",
        "answers": [
            [
                "Jim Maloway"
            ]
        ]
    },
    {
        "db_id": "riding_club",
        "query": "MATCH (player:`riding_club.player`)\nRETURN player.Occupation,count(*)",
        "question": "Show different occupations along with the number of players in each occupation.",
        "answers": [
            [
                "Locomotive Engineer",
                1
            ],
            [
                "Ministerial Assistant",
                1
            ],
            [
                "Researcher",
                1
            ],
            [
                "Retired",
                2
            ],
            [
                "Small Businessman",
                1
            ],
            [
                "Self Employed / Consultant",
                1
            ],
            [
                "Distribution Centre Associate",
                1
            ],
            [
                "Design Coordinator",
                1
            ],
            [
                "Student",
                2
            ],
            [
                "Parliamentarian",
                2
            ],
            [
                "Product Consultant - MLCC",
                1
            ]
        ]
    },
    {
        "db_id": "riding_club",
        "query": "MATCH (player:`riding_club.player`)\nRETURN player.Occupation\nORDER BY player.Occupation DESC\nLIMIT 1",
        "question": "Please show the most common occupation of players.",
        "answers": [
            [
                "Student"
            ]
        ]
    },
    {
        "db_id": "riding_club",
        "query": "MATCH (player:`riding_club.player`)\nWITH count(*) AS count, player.Residence AS Residence\nWHERE count  >= 2\nRETURN Residence",
        "question": "Show the residences that have at least two players.",
        "answers": [
            [
                "Winnipeg"
            ]
        ]
    },
    {
        "db_id": "riding_club",
        "query": "MATCH (T2:`riding_club.coach`)-[T1:`riding_club.player_coach`]-(T3:`riding_club.player`)\nRETURN T3.Player_name,T2.Coach_name",
        "question": "Show the names of players and names of their coaches.",
        "answers": [
            [
                "Fiona Shiells",
                "Jameson Tomas"
            ],
            [
                "Jean Luc Bouch\u00e9",
                "Jameson Tomas"
            ],
            [
                "Niki Ashton",
                "Jameson Tomas"
            ],
            [
                "Ron Strynadka",
                "Joe Fabbri"
            ],
            [
                "Ross Eadie",
                "Robert Chen"
            ],
            [
                "Patricia Cordner",
                "Robert Chen"
            ],
            [
                "Rachel Heinrichs",
                "Smith Brown"
            ]
        ]
    },
    {
        "db_id": "riding_club",
        "query": "MATCH (T2:`riding_club.coach`)-[T1:`riding_club.player_coach`]-(T3:`riding_club.player`)\nWHERE T2.Rank = 1\nRETURN T3.Player_name",
        "question": "Show the names of players coached by the rank 1 coach.",
        "answers": [
            [
                "Fiona Shiells"
            ],
            [
                "Jean Luc Bouch\u00e9"
            ],
            [
                "Niki Ashton"
            ]
        ]
    },
    {
        "db_id": "riding_club",
        "query": "MATCH (T2:`riding_club.coach`)-[T1:`riding_club.player_coach`]-(T3:`riding_club.player`)\nWHERE T1.Starting_year > 2011\nRETURN T3.Player_name,T3.Gender",
        "question": "Show the names and genders of players with a coach starting after 2011.",
        "answers": [
            [
                "Niki Ashton",
                "F"
            ],
            [
                "Ron Strynadka",
                "M"
            ],
            [
                "Ross Eadie",
                "M"
            ]
        ]
    },
    {
        "db_id": "riding_club",
        "query": "MATCH (T2:`riding_club.coach`)-[T1:`riding_club.player_coach`]-(T3:`riding_club.player`)\nRETURN T3.Player_name,T2.Coach_name\nORDER BY T3.Votes DESC",
        "question": "Show the names of players and names of their coaches in descending order of the votes of players.",
        "answers": [
            [
                "Ross Eadie",
                "Robert Chen"
            ],
            [
                "Patricia Cordner",
                "Robert Chen"
            ],
            [
                "Niki Ashton",
                "Jameson Tomas"
            ],
            [
                "Fiona Shiells",
                "Jameson Tomas"
            ],
            [
                "Jean Luc Bouch\u00e9",
                "Jameson Tomas"
            ],
            [
                "Rachel Heinrichs",
                "Smith Brown"
            ],
            [
                "Ron Strynadka",
                "Joe Fabbri"
            ]
        ]
    },
    {
        "db_id": "riding_club",
        "query": "MATCH (T1:`riding_club.club`)-[]-(T2:`riding_club.coach`)\nRETURN T1.Club_ID,T1.Club_name,count(*)",
        "question": "How many coaches does each club has? List the club id, name and the number of coaches.",
        "answers": [
            [
                1,
                "AIK",
                3
            ],
            [
                3,
                "Djurg\u00e5rdens IF",
                2
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (gymnast:`gymnast.gymnast`)\nRETURN count(*)",
        "question": "Count the number of gymnasts.",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (gymnast:`gymnast.gymnast`)\nRETURN gymnast.Total_Points\nORDER BY gymnast.Total_Points DESC",
        "question": "List the total points of gymnasts in descending order.",
        "answers": [
            [
                58.061
            ],
            [
                57.924
            ],
            [
                57.649
            ],
            [
                57.436
            ],
            [
                57.424
            ],
            [
                57.398
            ],
            [
                57.374
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (gymnast:`gymnast.gymnast`)\nRETURN gymnast.Total_Points\nORDER BY gymnast.Floor_Exercise_Points DESC",
        "question": "List the total points of gymnasts in descending order of floor exercise points.",
        "answers": [
            [
                57.436
            ],
            [
                58.061
            ],
            [
                57.924
            ],
            [
                57.424
            ],
            [
                57.398
            ],
            [
                57.374
            ],
            [
                57.649
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (gymnast:`gymnast.gymnast`)\nRETURN avg(gymnast.Horizontal_Bar_Points)",
        "question": "Return the average horizontal bar points across all gymnasts.",
        "answers": [
            [
                9.603428571428571
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (people:`gymnast.people`)\nRETURN people.Name\nORDER BY people.Name ASC",
        "question": "Return the names of people, ordered alphabetically.",
        "answers": [
            [
                "Ashley P\u00e9rez Cabrera"
            ],
            [
                "Clary Sermina Delgado Cid"
            ],
            [
                "Elizabeth Qui\u00f1\u00f3nez Aroyo"
            ],
            [
                "Endis de los Santos \u00c1lvarez"
            ],
            [
                "Eve Tatiana Cruz Oviedo"
            ],
            [
                "Lorraine S\u00faarez Carmona"
            ],
            [
                "Marina Castro Medina"
            ],
            [
                "Nadia Caba Rodr\u00edguez"
            ],
            [
                "Paul Hamm"
            ],
            [
                "Rosa Clarissa Ort\u00edz Melo"
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T2.Name",
        "question": "What are the names of gymnasts?",
        "answers": [
            [
                "Paul Hamm"
            ],
            [
                "Lorraine S\u00faarez Carmona"
            ],
            [
                "Elizabeth Qui\u00f1\u00f3nez Aroyo"
            ],
            [
                "Nadia Caba Rodr\u00edguez"
            ],
            [
                "Clary Sermina Delgado Cid"
            ],
            [
                "Marina Castro Medina"
            ],
            [
                "Endis de los Santos \u00c1lvarez"
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T2.Name",
        "question": "Return the names of the gymnasts.",
        "answers": [
            [
                "Paul Hamm"
            ],
            [
                "Lorraine S\u00faarez Carmona"
            ],
            [
                "Elizabeth Qui\u00f1\u00f3nez Aroyo"
            ],
            [
                "Nadia Caba Rodr\u00edguez"
            ],
            [
                "Clary Sermina Delgado Cid"
            ],
            [
                "Marina Castro Medina"
            ],
            [
                "Endis de los Santos \u00c1lvarez"
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nWHERE T2.Hometown <> 'Santo Domingo'\nRETURN T2.Name",
        "question": "What are the names of gymnasts whose hometown is not \"Santo Domingo\"?",
        "answers": [
            [
                "Lorraine S\u00faarez Carmona"
            ],
            [
                "Clary Sermina Delgado Cid"
            ],
            [
                "Endis de los Santos \u00c1lvarez"
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nWHERE T2.Hometown <> 'Santo Domingo'\nRETURN T2.Name",
        "question": "Return the names of gymnasts who did not grow up in Santo Domingo.",
        "answers": [
            [
                "Lorraine S\u00faarez Carmona"
            ],
            [
                "Clary Sermina Delgado Cid"
            ],
            [
                "Endis de los Santos \u00c1lvarez"
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (people:`gymnast.people`)\nRETURN people.Age\nORDER BY people.Height DESC\nLIMIT 1",
        "question": "Return the age of the person with the greatest height.",
        "answers": [
            [
                23.0
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (people:`gymnast.people`)\nRETURN people.Name\nORDER BY people.Age DESC\nLIMIT 5",
        "question": "List the names of the top 5 oldest people.",
        "answers": [
            [
                "Paul Hamm"
            ],
            [
                "Endis de los Santos \u00c1lvarez"
            ],
            [
                "Rosa Clarissa Ort\u00edz Melo"
            ],
            [
                "Nadia Caba Rodr\u00edguez"
            ],
            [
                "Lorraine S\u00faarez Carmona"
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T1.Total_Points\nORDER BY T2.Age ASC\nLIMIT 1",
        "question": "What is the total point count of the youngest gymnast?",
        "answers": [
            [
                57.649
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T1.Total_Points\nORDER BY T2.Age ASC\nLIMIT 1",
        "question": "Return the total points of the gymnast with the lowest age.",
        "answers": [
            [
                57.649
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nWHERE T1.Total_Points > 57.5\nRETURN DISTINCT T2.Hometown",
        "question": "Give the different hometowns of gymnasts that have a total point score of above 57.5.",
        "answers": [
            [
                "Santo Domingo"
            ],
            [
                "Bonao"
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T2.Hometown,count(*)",
        "question": "What are the hometowns of gymnasts and the corresponding number of gymnasts?",
        "answers": [
            [
                "Santo Domingo",
                4
            ],
            [
                "Bonao",
                1
            ],
            [
                "Santiago de los Caballeros",
                1
            ],
            [
                "Los Alcarrizos",
                1
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T2.Hometown,count(*)",
        "question": "How many gymnasts are from each hometown?",
        "answers": [
            [
                "Santo Domingo",
                4
            ],
            [
                "Bonao",
                1
            ],
            [
                "Santiago de los Caballeros",
                1
            ],
            [
                "Los Alcarrizos",
                1
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nWITH count(T2.Hometown) AS cnt, T2\nRETURN T2.Hometown\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the most common hometown of gymnasts?",
        "answers": [
            [
                "Santo Domingo"
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nWITH count(T2.Hometown) AS cnt, T2\nRETURN T2.Hometown\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Return the hometown that is most common among gymnasts.",
        "answers": [
            [
                "Santo Domingo"
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nWITH T2.Hometown AS Hometown, count(*) AS count\nWHERE count  >= 2\nRETURN Hometown",
        "question": "What are the hometowns that are shared by at least two gymnasts?",
        "answers": [
            [
                "Santo Domingo"
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nWITH T2.Hometown AS Hometown, count(*) AS count\nWHERE count  >= 2\nRETURN Hometown",
        "question": "Give the hometowns from which two or more gymnasts are from.",
        "answers": [
            [
                "Santo Domingo"
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T2.Name\nORDER BY T2.Height ASC",
        "question": "List the names of gymnasts in ascending order by their heights.",
        "answers": [
            [
                "Paul Hamm"
            ],
            [
                "Elizabeth Qui\u00f1\u00f3nez Aroyo"
            ],
            [
                "Endis de los Santos \u00c1lvarez"
            ],
            [
                "Lorraine S\u00faarez Carmona"
            ],
            [
                "Clary Sermina Delgado Cid"
            ],
            [
                "Marina Castro Medina"
            ],
            [
                "Nadia Caba Rodr\u00edguez"
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T2.Name\nORDER BY T2.Height ASC",
        "question": "What are the names of gymnasts, ordered by their heights ascending?",
        "answers": [
            [
                "Paul Hamm"
            ],
            [
                "Elizabeth Qui\u00f1\u00f3nez Aroyo"
            ],
            [
                "Endis de los Santos \u00c1lvarez"
            ],
            [
                "Lorraine S\u00faarez Carmona"
            ],
            [
                "Clary Sermina Delgado Cid"
            ],
            [
                "Marina Castro Medina"
            ],
            [
                "Nadia Caba Rodr\u00edguez"
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T2.Age\nORDER BY T1.Total_Points DESC",
        "question": "Show the ages of gymnasts in descending order of total points.",
        "answers": [
            [
                24.0
            ],
            [
                21.0
            ],
            [
                20.0
            ],
            [
                22.0
            ],
            [
                21.0
            ],
            [
                20.0
            ],
            [
                24.0
            ]
        ]
    },
    {
        "db_id": "gymnast",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T2.Age\nORDER BY T1.Total_Points DESC",
        "question": "What are the ages of the gymnasts, ordered descending by their total points?",
        "answers": [
            [
                24.0
            ],
            [
                21.0
            ],
            [
                20.0
            ],
            [
                22.0
            ],
            [
                21.0
            ],
            [
                20.0
            ],
            [
                24.0
            ]
        ]
    },
    {
        "db_id": "small_bank_1",
        "query": "MATCH (accounts:`small_bank_1.ACCOUNTS`)\nRETURN count(*)",
        "question": "How many accounts are there in total?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "small_bank_1",
        "query": "MATCH (accounts:`small_bank_1.ACCOUNTS`)\nRETURN count(*)",
        "question": "Count the number of accounts.",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "small_bank_1",
        "query": "MATCH (checking:`small_bank_1.CHECKING`)\nRETURN avg(checking.balance)",
        "question": "Find the average checking balance.",
        "answers": [
            [
                4583.428571428572
            ]
        ]
    },
    {
        "db_id": "small_bank_1",
        "query": "MATCH (checking:`small_bank_1.CHECKING`)\nRETURN avg(checking.balance)",
        "question": "What is the average balance in checking accounts?",
        "answers": [
            [
                4583.428571428572
            ]
        ]
    },
    {
        "db_id": "small_bank_1",
        "query": "MATCH (savings:`small_bank_1.SAVINGS`)\nWITH avg(savings.balance) AS balance\nMATCH (savings:`small_bank_1.SAVINGS`)\nWHERE  savings.balance >  balance \nRETURN count(*)",
        "question": "How many accounts have a savings balance above the average savings balance?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "small_bank_1",
        "query": "MATCH (savings:`small_bank_1.SAVINGS`)\nWITH avg(savings.balance) AS balance\nMATCH (savings:`small_bank_1.SAVINGS`)\nWHERE  savings.balance >  balance \nRETURN count(*)",
        "question": "Find the number of accounts with a savings balance that is higher than the average savings balance.",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "small_bank_1",
        "query": "MATCH (accounts:`small_bank_1.ACCOUNTS`)\nRETURN accounts.name\nORDER BY accounts.name",
        "question": "List all customers\u2019 names in the alphabetical order.",
        "answers": [
            [
                "Brown"
            ],
            [
                "Granger"
            ],
            [
                "O'mahony"
            ],
            [
                "Porter"
            ],
            [
                "Wang"
            ],
            [
                "Weeks"
            ],
            [
                "Wesley"
            ]
        ]
    },
    {
        "db_id": "small_bank_1",
        "query": "MATCH (accounts:`small_bank_1.ACCOUNTS`)\nRETURN accounts.name\nORDER BY accounts.name",
        "question": "What are the names of all the customers in alphabetical order?",
        "answers": [
            [
                "Brown"
            ],
            [
                "Granger"
            ],
            [
                "O'mahony"
            ],
            [
                "Porter"
            ],
            [
                "Wang"
            ],
            [
                "Weeks"
            ],
            [
                "Wesley"
            ]
        ]
    },
    {
        "db_id": "browser_web",
        "query": "MATCH (browser:`browser_web.browser`)\nRETURN browser.name\nORDER BY browser.market_share DESC",
        "question": "List the name of browsers in descending order by market share.",
        "answers": [
            [
                "Internet Explorer"
            ],
            [
                "Firefox"
            ],
            [
                "Safari"
            ],
            [
                "Opera"
            ]
        ]
    },
    {
        "db_id": "browser_web",
        "query": "MATCH (browser:`browser_web.browser`)\nRETURN browser.id,browser.name,browser.market_share",
        "question": "List the ids, names and market shares of all browsers.",
        "answers": [
            [
                1,
                "Internet Explorer",
                28.96
            ],
            [
                2,
                "Firefox",
                18.11
            ],
            [
                3,
                "Safari",
                8.54
            ],
            [
                4,
                "Opera",
                1.2
            ]
        ]
    },
    {
        "db_id": "browser_web",
        "query": "MATCH (T1:`browser_web.browser`)-[T2:`browser_web.accelerator_compatible_browser`]-(T3:`browser_web.Web_client_accelerator`)\nWHERE T3.name = 'CProxy' AND T2.compatible_since_year > 1998\nRETURN T1.name",
        "question": "What is the name of the browser that became compatible with the accelerator 'CProxy' after year 1998 ?",
        "answers": [
            [
                "Opera"
            ]
        ]
    },
    {
        "db_id": "browser_web",
        "query": "MATCH (T1:`browser_web.Web_client_accelerator`)-[T2:`browser_web.accelerator_compatible_browser`]-()\nWITH T1.name AS name, count(*) AS count, T1.id AS id\nWHERE count  >= 2\nRETURN id,name",
        "question": "What are the ids and names of the web accelerators that are compatible with two or more browsers?",
        "answers": [
            [
                1,
                "CACHEbox"
            ],
            [
                2,
                "CProxy"
            ],
            [
                3,
                "Fasterfox"
            ]
        ]
    },
    {
        "db_id": "browser_web",
        "query": "MATCH (T2:`browser_web.browser`)-[T1:`browser_web.accelerator_compatible_browser`]-(T3:`browser_web.Web_client_accelerator`)\nWHERE T3.name = 'CACHEbox' AND T2.name = 'Internet Explorer'\nRETURN T1.compatible_since_year",
        "question": "When did the web accelerator 'CACHEbox' and browser 'Internet Explorer' become compatible?",
        "answers": [
            [
                1995
            ]
        ]
    },
    {
        "db_id": "browser_web",
        "query": "MATCH (web_client_accelerator:`browser_web.Web_client_accelerator`)\nRETURN web_client_accelerator.Operating_system,count(*)",
        "question": "Find the number of web accelerators used for each Operating system.",
        "answers": [
            [
                "Appliance (Linux)",
                1
            ],
            [
                "Windows",
                3
            ],
            [
                "Windows, Mac, Linux and Mobile devices",
                1
            ],
            [
                "Any",
                1
            ],
            [
                "Windows, except NT and 95",
                1
            ],
            [
                "Windows, Mac",
                3
            ],
            [
                "Windows, Mac and Mobile devices",
                1
            ],
            [
                "Android, Linux, Mac and Windows devices",
                1
            ],
            [
                "Unix (Linux, *BSD, Mac OS X, others), Windows",
                2
            ],
            [
                "Windows, Mac, Mobile devices",
                1
            ],
            [
                "Any system with Java 1.6 VM available",
                1
            ],
            [
                "Windows, Linux, Mac OS, Symbian, WindowsMobile",
                1
            ],
            [
                "Windows (2000 onwards)",
                1
            ],
            [
                "Unix (Linux, *BSD, Mac OS X, others)",
                1
            ]
        ]
    },
    {
        "db_id": "browser_web",
        "query": "MATCH (T2:`browser_web.browser`)-[T1:`browser_web.accelerator_compatible_browser`]-(T3:`browser_web.Web_client_accelerator`)\nRETURN T2.name,T3.name\nORDER BY T1.compatible_since_year DESC",
        "question": "give me names of all compatible browsers and accelerators in the descending order of compatible year",
        "answers": [
            [
                "Internet Explorer",
                "Nitro"
            ],
            [
                "Opera",
                "fasTun"
            ],
            [
                "Safari",
                "Fasterfox"
            ],
            [
                "Firefox",
                "Fasterfox"
            ],
            [
                "Internet Explorer",
                "Fasterfox"
            ],
            [
                "Opera",
                "CProxy"
            ],
            [
                "Firefox",
                "CACHEbox"
            ],
            [
                "Safari",
                "CProxy"
            ],
            [
                "Internet Explorer",
                "CACHEbox"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN count(*)",
        "question": "How many wrestlers are there?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN count(*)",
        "question": "Count the number of wrestlers.",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN wrestler.Name\nORDER BY wrestler.Days_held DESC",
        "question": "List the names of wrestlers in descending order of days held.",
        "answers": [
            [
                "The Great Sasuke \u00a7"
            ],
            [
                "Gran Hamada"
            ],
            [
                "Shinjiro Otani \u00a7"
            ],
            [
                "\u00daltimo Drag\u00f3n \u00a7"
            ],
            [
                "El Samurai \u00a7"
            ],
            [
                "Rey Misterio Sr."
            ],
            [
                "Jushin Liger \u00a7"
            ],
            [
                "Villa\u00f1o IV"
            ],
            [
                "Fishman"
            ],
            [
                "El Samurai"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN wrestler.Name\nORDER BY wrestler.Days_held DESC",
        "question": "What are the names of the wrestlers, ordered descending by days held?",
        "answers": [
            [
                "The Great Sasuke \u00a7"
            ],
            [
                "Gran Hamada"
            ],
            [
                "Shinjiro Otani \u00a7"
            ],
            [
                "\u00daltimo Drag\u00f3n \u00a7"
            ],
            [
                "El Samurai \u00a7"
            ],
            [
                "Rey Misterio Sr."
            ],
            [
                "Jushin Liger \u00a7"
            ],
            [
                "Villa\u00f1o IV"
            ],
            [
                "Fishman"
            ],
            [
                "El Samurai"
            ]
        ]
    }
]