[
    {
        "db_id": "mountain_photos",
        "query": "MATCH (camera_lens:`mountain_photos.camera_lens`)\nWHERE NOT (camera_lens)-[]-(:`mountain_photos.photos`)    \nRETURN count(*)",
        "question": "How many camera lenses are not used in taking any photos?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "mountain_photos",
        "query": "MATCH (T1:`mountain_photos.mountain`)-[]-(T2:`mountain_photos.photos`)\nWHERE T1.Country = 'Ethiopia'\nRETURN count(DISTINCT T2.camera_lens_id)",
        "question": "How many distinct kinds of camera lenses are used to take photos of mountains in the country 'Ethiopia'?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (channel:`program_share.channel`)\nWHERE channel.Owner <> 'CCTV'\nRETURN channel.Name",
        "question": "Find the names of channels that are not owned by CCTV.",
        "answers": [
            [
                "Hunan Satellite TV"
            ],
            [
                "Anhui Satellite TV"
            ],
            [
                "Shandong Satellite TV"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (channel:`program_share.channel`)\nWHERE channel.Owner <> 'CCTV'\nRETURN channel.Name",
        "question": "Which channels are not owned by CCTV? Give me the channel names.",
        "answers": [
            [
                "Hunan Satellite TV"
            ],
            [
                "Anhui Satellite TV"
            ],
            [
                "Shandong Satellite TV"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (channel:`program_share.channel`)\nRETURN channel.Name\nORDER BY channel.Rating_in_percent DESC",
        "question": "List all channel names ordered by their rating in percent from big to small.",
        "answers": [
            [
                "CCTV-1"
            ],
            [
                "Hunan Satellite TV"
            ],
            [
                "CCTV-8"
            ],
            [
                "CCTV-13"
            ],
            [
                "CCTV-3"
            ],
            [
                "CCTV-6"
            ],
            [
                "CCTV-14"
            ],
            [
                "CCTV-4"
            ],
            [
                "Anhui Satellite TV"
            ],
            [
                "Shandong Satellite TV"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (channel:`program_share.channel`)\nRETURN channel.Name\nORDER BY channel.Rating_in_percent DESC",
        "question": "Give me a list of all the channel names sorted by the channel rating in descending order.",
        "answers": [
            [
                "CCTV-1"
            ],
            [
                "Hunan Satellite TV"
            ],
            [
                "CCTV-8"
            ],
            [
                "CCTV-13"
            ],
            [
                "CCTV-3"
            ],
            [
                "CCTV-6"
            ],
            [
                "CCTV-14"
            ],
            [
                "CCTV-4"
            ],
            [
                "Anhui Satellite TV"
            ],
            [
                "Shandong Satellite TV"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (channel:`program_share.channel`)\nRETURN channel.Owner\nORDER BY channel.Rating_in_percent DESC\nLIMIT 1",
        "question": "What is the owner of the channel that has the highest rating ratio?",
        "answers": [
            [
                "CCTV"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (channel:`program_share.channel`)\nRETURN channel.Owner\nORDER BY channel.Rating_in_percent DESC\nLIMIT 1",
        "question": "Show me the owner of the channel with the highest rating.",
        "answers": [
            [
                "CCTV"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (program:`program_share.program`)\nRETURN count(*)",
        "question": "how many programs are there?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (program:`program_share.program`)\nRETURN count(*)",
        "question": "Count the number of programs.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (program:`program_share.program`)\nRETURN program.Name\nORDER BY program.Launch",
        "question": "list all the names of programs, ordering by launch time.",
        "answers": [
            [
                "Kaku"
            ],
            [
                "Aniworld"
            ],
            [
                "Toonmax"
            ],
            [
                "Jiajia"
            ],
            [
                "Youman"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (program:`program_share.program`)\nRETURN program.Name\nORDER BY program.Launch",
        "question": "What is the list of program names, sorted by the order of launch date?",
        "answers": [
            [
                "Kaku"
            ],
            [
                "Aniworld"
            ],
            [
                "Toonmax"
            ],
            [
                "Jiajia"
            ],
            [
                "Youman"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (program:`program_share.program`)\nRETURN program.Name,program.Origin,program.Owner",
        "question": "List the name, origin and owner of each program.",
        "answers": [
            [
                "Aniworld",
                "Hunan",
                "Hunan Broadcasting System (HBS)"
            ],
            [
                "Kaku",
                "Beijing",
                "Beijing Television (BTV)"
            ],
            [
                "Toonmax",
                "Shanghai",
                "Shanghai Media Group (SMG)"
            ],
            [
                "Jiajia",
                "Guangdong",
                "Southern Media Corporation (SMC)"
            ],
            [
                "Youman",
                "Jiangsu",
                "Jiangsu Broadcasting Corporation (JSBC)"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (program:`program_share.program`)\nRETURN program.Name,program.Origin,program.Owner",
        "question": "What are the name, origin and owner of each program?",
        "answers": [
            [
                "Aniworld",
                "Hunan",
                "Hunan Broadcasting System (HBS)"
            ],
            [
                "Kaku",
                "Beijing",
                "Beijing Television (BTV)"
            ],
            [
                "Toonmax",
                "Shanghai",
                "Shanghai Media Group (SMG)"
            ],
            [
                "Jiajia",
                "Guangdong",
                "Southern Media Corporation (SMC)"
            ],
            [
                "Youman",
                "Jiangsu",
                "Jiangsu Broadcasting Corporation (JSBC)"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (program:`program_share.program`)\nRETURN program.Name\nORDER BY program.Launch DESC\nLIMIT 1",
        "question": "find the name of the program that was launched most recently.",
        "answers": [
            [
                "Youman"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (program:`program_share.program`)\nRETURN program.Name\nORDER BY program.Launch DESC\nLIMIT 1",
        "question": "Which program was launched most recently? Return the program name.",
        "answers": [
            [
                "Youman"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (t1:`program_share.channel`)-[t2:`program_share.broadcast`]-()\nWHERE t2.Time_of_day = 'Morning'\nRETURN t1.Name",
        "question": "Find the names of the channels that are broadcast in the morning.",
        "answers": [
            [
                "CCTV-1"
            ],
            [
                "CCTV-8"
            ],
            [
                "CCTV-3"
            ],
            [
                "CCTV-6"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (t1:`program_share.channel`)-[t2:`program_share.broadcast`]-()\nWHERE t2.Time_of_day = 'Morning'\nRETURN t1.Name",
        "question": "Which channels are broadcast in the morning? Give me the channel names.",
        "answers": [
            [
                "CCTV-1"
            ],
            [
                "CCTV-8"
            ],
            [
                "CCTV-3"
            ],
            [
                "CCTV-6"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (program:`program_share.program`)\nRETURN program.Origin\nORDER BY program.Origin",
        "question": "List all program origins in the alphabetical order.",
        "answers": [
            [
                "Beijing"
            ],
            [
                "Guangdong"
            ],
            [
                "Hunan"
            ],
            [
                "Jiangsu"
            ],
            [
                "Shanghai"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (program:`program_share.program`)\nRETURN program.Origin\nORDER BY program.Origin",
        "question": "What is the list of program origins ordered alphabetically?",
        "answers": [
            [
                "Beijing"
            ],
            [
                "Guangdong"
            ],
            [
                "Hunan"
            ],
            [
                "Jiangsu"
            ],
            [
                "Shanghai"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (channel:`program_share.channel`)\nRETURN count(DISTINCT channel.Owner)",
        "question": "what is the number of different channel owners?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (channel:`program_share.channel`)\nRETURN count(DISTINCT channel.Owner)",
        "question": "Count the number of distinct channel owners.",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (program:`program_share.program`)\nWHERE program.Origin <> 'Beijing'\nRETURN program.Name",
        "question": "find the names of programs whose origin is not in Beijing.",
        "answers": [
            [
                "Aniworld"
            ],
            [
                "Toonmax"
            ],
            [
                "Jiajia"
            ],
            [
                "Youman"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (program:`program_share.program`)\nWHERE program.Origin <> 'Beijing'\nRETURN program.Name",
        "question": "Which programs' origins are not \"Beijing\"? Give me the program names.",
        "answers": [
            [
                "Aniworld"
            ],
            [
                "Toonmax"
            ],
            [
                "Jiajia"
            ],
            [
                "Youman"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (channel:`program_share.channel`)\nWHERE channel.Owner = 'CCTV' OR channel.Owner = 'HBS'\nRETURN channel.Name",
        "question": "What are the names of the channels owned by CCTV or HBS?",
        "answers": [
            [
                "CCTV-1"
            ],
            [
                "Hunan Satellite TV"
            ],
            [
                "CCTV-8"
            ],
            [
                "CCTV-13"
            ],
            [
                "CCTV-3"
            ],
            [
                "CCTV-6"
            ],
            [
                "CCTV-14"
            ],
            [
                "CCTV-4"
            ]
        ]
    },
    {
        "db_id": "program_share",
        "query": "MATCH (channel:`program_share.channel`)\nWHERE channel.Owner = 'CCTV' OR channel.Owner = 'HBS'\nRETURN channel.Name",
        "question": "List the names of all the channels owned by either CCTV or HBS",
        "answers": [
            [
                "CCTV-1"
            ],
            [
                "Hunan Satellite TV"
            ],
            [
                "CCTV-8"
            ],
            [
                "CCTV-13"
            ],
            [
                "CCTV-3"
            ],
            [
                "CCTV-6"
            ],
            [
                "CCTV-14"
            ],
            [
                "CCTV-4"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (courses:`e_learning.Courses`)\nRETURN count(*)",
        "question": "Find the total number of courses offered.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (course_authors_and_tutors:`e_learning.Course_Authors_and_Tutors`)\nRETURN course_authors_and_tutors.address_line_1",
        "question": "List the addresses of all the course authors or tutors.",
        "answers": [
            [
                "756 Monahan Mews\nSpinkashire, NJ 64230-5098"
            ],
            [
                "98623 Huels Manor\nJasttown, DE 31611"
            ],
            [
                "99296 Keeling Courts\nNorth Audreanne, IL 28272"
            ],
            [
                "644 Montana Hill Suite 489\nDaijamouth, CA 19587-4254"
            ],
            [
                "5284 Champlin Roads\nCassinport, WY 54636"
            ],
            [
                "92220 Hellen Skyway Apt. 635\nRennerview, MS 81036"
            ],
            [
                "67541 Osborne Creek Suite 532\nBernhardview, WV 30288-1050"
            ],
            [
                "0256 Walter Meadows Suite 523\nNorbertoborough, AZ 49193"
            ],
            [
                "445 Quigley Fall\nPort Antonette, IN 81992-1255"
            ],
            [
                "22575 Effertz Neck Apt. 046\nPort Scotty, NY 67108-9197"
            ],
            [
                "425 White Brooks\nEmmaleefort, IN 97850-2510"
            ],
            [
                "513 Collins Plain Apt. 829\nClementinaville, VT 59908-2793"
            ],
            [
                "139 O'Conner Circles\nVirginieland, KS 23365"
            ],
            [
                "3602 Boehm Forest\nZulaufton, DC 35229-0366"
            ],
            [
                "8928 Kunze Valley Apt. 747\nSouth Jedidiahmouth, DE 28167"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (course_authors_and_tutors:`e_learning.Course_Authors_and_Tutors`)\nRETURN course_authors_and_tutors.address_line_1",
        "question": "What is the address of each course author or tutor?",
        "answers": [
            [
                "756 Monahan Mews\nSpinkashire, NJ 64230-5098"
            ],
            [
                "98623 Huels Manor\nJasttown, DE 31611"
            ],
            [
                "99296 Keeling Courts\nNorth Audreanne, IL 28272"
            ],
            [
                "644 Montana Hill Suite 489\nDaijamouth, CA 19587-4254"
            ],
            [
                "5284 Champlin Roads\nCassinport, WY 54636"
            ],
            [
                "92220 Hellen Skyway Apt. 635\nRennerview, MS 81036"
            ],
            [
                "67541 Osborne Creek Suite 532\nBernhardview, WV 30288-1050"
            ],
            [
                "0256 Walter Meadows Suite 523\nNorbertoborough, AZ 49193"
            ],
            [
                "445 Quigley Fall\nPort Antonette, IN 81992-1255"
            ],
            [
                "22575 Effertz Neck Apt. 046\nPort Scotty, NY 67108-9197"
            ],
            [
                "425 White Brooks\nEmmaleefort, IN 97850-2510"
            ],
            [
                "513 Collins Plain Apt. 829\nClementinaville, VT 59908-2793"
            ],
            [
                "139 O'Conner Circles\nVirginieland, KS 23365"
            ],
            [
                "3602 Boehm Forest\nZulaufton, DC 35229-0366"
            ],
            [
                "8928 Kunze Valley Apt. 747\nSouth Jedidiahmouth, DE 28167"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (course_authors_and_tutors:`e_learning.Course_Authors_and_Tutors`)\nRETURN course_authors_and_tutors.login_name,course_authors_and_tutors.family_name",
        "question": "List all the login names and family names of course author and tutors.",
        "answers": [
            [
                "jmckenzie",
                "Grant"
            ],
            [
                "heidenreich.ara",
                "Armstrong"
            ],
            [
                "clementina29",
                "Reichel"
            ],
            [
                "wlehner",
                "Nader"
            ],
            [
                "nyundt",
                "Barrows"
            ],
            [
                "al75",
                "Rohan"
            ],
            [
                "marty.bergnaum",
                "Treutel"
            ],
            [
                "medhurst.alvah",
                "Rowe"
            ],
            [
                "antonetta19",
                "Zboncak"
            ],
            [
                "adam.rippin",
                "Champlin"
            ],
            [
                "dschaefer",
                "Greenholt"
            ],
            [
                "nellie.mosciski",
                "Kreiger"
            ],
            [
                "qking",
                "Effertz"
            ],
            [
                "fiona77",
                "Crist"
            ],
            [
                "ekshlerin",
                "Haley"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (course_authors_and_tutors:`e_learning.Course_Authors_and_Tutors`)\nRETURN course_authors_and_tutors.login_name,course_authors_and_tutors.family_name",
        "question": "What are the login names and family names of course author and tutors?",
        "answers": [
            [
                "jmckenzie",
                "Grant"
            ],
            [
                "heidenreich.ara",
                "Armstrong"
            ],
            [
                "clementina29",
                "Reichel"
            ],
            [
                "wlehner",
                "Nader"
            ],
            [
                "nyundt",
                "Barrows"
            ],
            [
                "al75",
                "Rohan"
            ],
            [
                "marty.bergnaum",
                "Treutel"
            ],
            [
                "medhurst.alvah",
                "Rowe"
            ],
            [
                "antonetta19",
                "Zboncak"
            ],
            [
                "adam.rippin",
                "Champlin"
            ],
            [
                "dschaefer",
                "Greenholt"
            ],
            [
                "nellie.mosciski",
                "Kreiger"
            ],
            [
                "qking",
                "Effertz"
            ],
            [
                "fiona77",
                "Crist"
            ],
            [
                "ekshlerin",
                "Haley"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (student_course_enrolment:`e_learning.Student_Course_Enrolment`)\nRETURN student_course_enrolment.date_of_enrolment,student_course_enrolment.date_of_completion",
        "question": "List all the dates of enrollment and completion of students.",
        "answers": [
            [
                "2017-10-09 07:09:02",
                "2018-02-26 07:48:52"
            ],
            [
                "2017-11-13 12:49:33",
                "2018-03-04 01:24:56"
            ],
            [
                "2017-10-17 13:50:40",
                "2018-03-22 02:53:01"
            ],
            [
                "2017-09-06 06:27:15",
                "2018-03-07 09:45:48"
            ],
            [
                "2017-08-20 01:07:18",
                "2018-03-06 00:27:09"
            ],
            [
                "2017-09-24 15:17:26",
                "2018-03-01 00:08:30"
            ],
            [
                "2017-09-21 07:05:01",
                "2018-03-04 22:34:37"
            ],
            [
                "2017-12-07 02:21:13",
                "2018-02-27 20:06:06"
            ],
            [
                "2017-08-02 17:21:44",
                "2018-03-07 00:39:37"
            ],
            [
                "2017-10-10 10:05:03",
                "2018-03-19 07:34:05"
            ],
            [
                "2017-08-17 00:16:46",
                "2018-03-16 09:00:44"
            ],
            [
                "2017-11-30 11:40:56",
                "2018-03-02 14:38:49"
            ],
            [
                "2017-10-26 20:42:34",
                "2018-03-10 16:38:28"
            ],
            [
                "2017-07-15 12:48:43",
                "2018-03-18 03:23:54"
            ],
            [
                "2017-12-09 20:49:23",
                "2018-02-28 09:34:51"
            ],
            [
                "2017-12-16 15:53:06",
                "2018-03-22 18:04:54"
            ],
            [
                "2017-10-29 15:39:31",
                "2018-03-01 07:12:39"
            ],
            [
                "2017-11-22 18:29:18",
                "2018-03-09 17:56:18"
            ],
            [
                "2017-10-23 08:23:22",
                "2018-02-26 23:46:25"
            ],
            [
                "2017-12-04 12:16:10",
                "2018-03-14 23:33:47"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (student_course_enrolment:`e_learning.Student_Course_Enrolment`)\nRETURN student_course_enrolment.date_of_enrolment,student_course_enrolment.date_of_completion",
        "question": "What are all the dates of enrollment and completion in record?",
        "answers": [
            [
                "2017-10-09 07:09:02",
                "2018-02-26 07:48:52"
            ],
            [
                "2017-11-13 12:49:33",
                "2018-03-04 01:24:56"
            ],
            [
                "2017-10-17 13:50:40",
                "2018-03-22 02:53:01"
            ],
            [
                "2017-09-06 06:27:15",
                "2018-03-07 09:45:48"
            ],
            [
                "2017-08-20 01:07:18",
                "2018-03-06 00:27:09"
            ],
            [
                "2017-09-24 15:17:26",
                "2018-03-01 00:08:30"
            ],
            [
                "2017-09-21 07:05:01",
                "2018-03-04 22:34:37"
            ],
            [
                "2017-12-07 02:21:13",
                "2018-02-27 20:06:06"
            ],
            [
                "2017-08-02 17:21:44",
                "2018-03-07 00:39:37"
            ],
            [
                "2017-10-10 10:05:03",
                "2018-03-19 07:34:05"
            ],
            [
                "2017-08-17 00:16:46",
                "2018-03-16 09:00:44"
            ],
            [
                "2017-11-30 11:40:56",
                "2018-03-02 14:38:49"
            ],
            [
                "2017-10-26 20:42:34",
                "2018-03-10 16:38:28"
            ],
            [
                "2017-07-15 12:48:43",
                "2018-03-18 03:23:54"
            ],
            [
                "2017-12-09 20:49:23",
                "2018-02-28 09:34:51"
            ],
            [
                "2017-12-16 15:53:06",
                "2018-03-22 18:04:54"
            ],
            [
                "2017-10-29 15:39:31",
                "2018-03-01 07:12:39"
            ],
            [
                "2017-11-22 18:29:18",
                "2018-03-09 17:56:18"
            ],
            [
                "2017-10-23 08:23:22",
                "2018-02-26 23:46:25"
            ],
            [
                "2017-12-04 12:16:10",
                "2018-03-14 23:33:47"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (student_course_enrolment:`e_learning.Student_Course_Enrolment`)\nRETURN count(DISTINCT student_course_enrolment.student_id)",
        "question": "How many distinct students are enrolled in courses?",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (student_course_enrolment:`e_learning.Student_Course_Enrolment`)\nRETURN count(DISTINCT student_course_enrolment.student_id)",
        "question": "Find the number of distinct students enrolled in courses.",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (student_course_enrolment:`e_learning.Student_Course_Enrolment`)\nRETURN count(student_course_enrolment.course_id)",
        "question": "How many distinct courses are enrolled in by students?",
        "answers": [
            [
                20
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (student_course_enrolment:`e_learning.Student_Course_Enrolment`)\nRETURN count(student_course_enrolment.course_id)",
        "question": "Find the number of distinct courses that have enrolled students.",
        "answers": [
            [
                20
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (subjects:`e_learning.Subjects`)\nRETURN subjects.subject_name",
        "question": "List all the subject names.",
        "answers": [
            [
                "Computer Science"
            ],
            [
                "Arts"
            ],
            [
                "Language"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (subjects:`e_learning.Subjects`)\nRETURN subjects.subject_name",
        "question": "What are the names of all the subjects.",
        "answers": [
            [
                "Computer Science"
            ],
            [
                "Arts"
            ],
            [
                "Language"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (students:`e_learning.Students`)\nRETURN students.personal_name,students.family_name\nORDER BY students.family_name",
        "question": "List the personal names and family names of all the students in alphabetical order of family name.",
        "answers": [
            [
                "Alicia",
                "Carroll"
            ],
            [
                "Else",
                "Hartmann"
            ],
            [
                "Jewel",
                "Hodkiewicz"
            ],
            [
                "Karson",
                "Jaskolski"
            ],
            [
                "Marshall",
                "Johns"
            ],
            [
                "Krystel",
                "Langosh"
            ],
            [
                "Eliza",
                "Leannon"
            ],
            [
                "Mariela",
                "Legros"
            ],
            [
                "Claudia",
                "Mitchell"
            ],
            [
                "Cary",
                "O'Reilly"
            ],
            [
                "Autumn",
                "Schumm"
            ],
            [
                "Wilson",
                "Ward"
            ],
            [
                "Clotilde",
                "Windler"
            ],
            [
                "Prince",
                "Ziemann"
            ],
            [
                "Bernie",
                "Zieme"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (students:`e_learning.Students`)\nRETURN students.personal_name,students.family_name\nORDER BY students.family_name",
        "question": "What are the personal names and family names of the students? Sort the result in alphabetical order of the family name.",
        "answers": [
            [
                "Alicia",
                "Carroll"
            ],
            [
                "Else",
                "Hartmann"
            ],
            [
                "Jewel",
                "Hodkiewicz"
            ],
            [
                "Karson",
                "Jaskolski"
            ],
            [
                "Marshall",
                "Johns"
            ],
            [
                "Krystel",
                "Langosh"
            ],
            [
                "Eliza",
                "Leannon"
            ],
            [
                "Mariela",
                "Legros"
            ],
            [
                "Claudia",
                "Mitchell"
            ],
            [
                "Cary",
                "O'Reilly"
            ],
            [
                "Autumn",
                "Schumm"
            ],
            [
                "Wilson",
                "Ward"
            ],
            [
                "Clotilde",
                "Windler"
            ],
            [
                "Prince",
                "Ziemann"
            ],
            [
                "Bernie",
                "Zieme"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (student_tests_taken:`e_learning.Student_Tests_Taken`)\nRETURN student_tests_taken.test_result,count(*)\nORDER BY student_tests_taken.test_result DESC",
        "question": "List each test result and its count in descending order of count.",
        "answers": [
            [
                "Pass",
                8
            ],
            [
                "Fail",
                7
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (student_tests_taken:`e_learning.Student_Tests_Taken`)\nRETURN student_tests_taken.test_result,count(*)\nORDER BY student_tests_taken.test_result DESC",
        "question": "For each distinct test result, find the number of students who got the result.",
        "answers": [
            [
                "Pass",
                8
            ],
            [
                "Fail",
                7
            ]
        ]
    }
]