[
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN wrestler.Name\nORDER BY wrestler.Days_held ASC\nLIMIT 1",
        "question": "What is the name of the wrestler with the fewest days held?",
        "answers": [
            [
                "El Samurai"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN wrestler.Name\nORDER BY wrestler.Days_held ASC\nLIMIT 1",
        "question": "Return the name of the wrestler who had the lowest number of days held.",
        "answers": [
            [
                "El Samurai"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nWHERE wrestler.Location <> 'Tokyo , Japan'\nRETURN DISTINCT wrestler.Reign",
        "question": "What are the distinct reigns of wrestlers whose location is not \"Tokyo,Japan\" ?",
        "answers": [
            [
                "1"
            ],
            [
                "2"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nWHERE wrestler.Location <> 'Tokyo , Japan'\nRETURN DISTINCT wrestler.Reign",
        "question": "Give the different reigns of wrestlers who are not located in Tokyo, Japan.",
        "answers": [
            [
                "1"
            ],
            [
                "2"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN wrestler.Name,wrestler.Location",
        "question": "What are the names and location of the wrestlers?",
        "answers": [
            [
                "Rey Misterio Sr.",
                "Tijuana , Mexico"
            ],
            [
                "Fishman",
                "Tijuana , Mexico"
            ],
            [
                "Villa\u00f1o IV",
                "Tijuana , Mexico"
            ],
            [
                "Gran Hamada",
                "Tokyo , Japan"
            ],
            [
                "El Samurai",
                "Tokyo , Japan"
            ],
            [
                "The Great Sasuke \u00a7",
                "Tokyo , Japan"
            ],
            [
                "\u00daltimo Drag\u00f3n \u00a7",
                "Osaka , Japan"
            ],
            [
                "Jushin Liger \u00a7",
                "Tokyo , Japan"
            ],
            [
                "El Samurai \u00a7",
                "Sapporo , Japan"
            ],
            [
                "Shinjiro Otani \u00a7",
                "Nagoya , Japan"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN wrestler.Name,wrestler.Location",
        "question": "Give the names and locations of all wrestlers.",
        "answers": [
            [
                "Rey Misterio Sr.",
                "Tijuana , Mexico"
            ],
            [
                "Fishman",
                "Tijuana , Mexico"
            ],
            [
                "Villa\u00f1o IV",
                "Tijuana , Mexico"
            ],
            [
                "Gran Hamada",
                "Tokyo , Japan"
            ],
            [
                "El Samurai",
                "Tokyo , Japan"
            ],
            [
                "The Great Sasuke \u00a7",
                "Tokyo , Japan"
            ],
            [
                "\u00daltimo Drag\u00f3n \u00a7",
                "Osaka , Japan"
            ],
            [
                "Jushin Liger \u00a7",
                "Tokyo , Japan"
            ],
            [
                "El Samurai \u00a7",
                "Sapporo , Japan"
            ],
            [
                "Shinjiro Otani \u00a7",
                "Nagoya , Japan"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (elimination:`wrestler.Elimination`)\nWHERE elimination.Team = 'Team Orton'\nRETURN elimination.Elimination_Move",
        "question": "What are the elimination moves of wrestlers whose team is \"Team Orton\"?",
        "answers": [
            [
                "Go To Sleep"
            ],
            [
                "Spear"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (elimination:`wrestler.Elimination`)\nWHERE elimination.Team = 'Team Orton'\nRETURN elimination.Elimination_Move",
        "question": "Return the elimination movies of wrestlers on Team Orton.",
        "answers": [
            [
                "Go To Sleep"
            ],
            [
                "Spear"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (T1:`wrestler.Elimination`)-[]-(T2:`wrestler.wrestler`)\nRETURN T2.Name,T1.Elimination_Move",
        "question": "What are the names of wrestlers and the elimination moves?",
        "answers": [
            [
                "Rey Misterio Sr.",
                "Go To Sleep"
            ],
            [
                "Fishman",
                "Paydirt"
            ],
            [
                "Gran Hamada",
                "Rope hung DDT"
            ],
            [
                "El Samurai",
                "Silver Spoon DDT"
            ],
            [
                "\u00daltimo Drag\u00f3n \u00a7",
                "World's Strongest Slam"
            ],
            [
                "El Samurai \u00a7",
                "Spear"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (T1:`wrestler.Elimination`)-[]-(T2:`wrestler.wrestler`)\nRETURN T2.Name,T1.Elimination_Move",
        "question": "Give the names of wrestlers and their elimination moves.",
        "answers": [
            [
                "Rey Misterio Sr.",
                "Go To Sleep"
            ],
            [
                "Fishman",
                "Paydirt"
            ],
            [
                "Gran Hamada",
                "Rope hung DDT"
            ],
            [
                "El Samurai",
                "Silver Spoon DDT"
            ],
            [
                "\u00daltimo Drag\u00f3n \u00a7",
                "World's Strongest Slam"
            ],
            [
                "El Samurai \u00a7",
                "Spear"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (T1:`wrestler.Elimination`)-[]-(T2:`wrestler.wrestler`)\nRETURN T2.Name,T1.Team\nORDER BY T2.Days_held DESC",
        "question": "List the names of wrestlers and the teams in elimination in descending order of days held.",
        "answers": [
            [
                "Gran Hamada",
                "Team Batista"
            ],
            [
                "\u00daltimo Drag\u00f3n \u00a7",
                "Team Batista"
            ],
            [
                "El Samurai \u00a7",
                "Team Orton"
            ],
            [
                "Rey Misterio Sr.",
                "Team Orton"
            ],
            [
                "Fishman",
                "Team Batista"
            ],
            [
                "El Samurai",
                "Team Batista"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (T1:`wrestler.Elimination`)-[]-(T2:`wrestler.wrestler`)\nRETURN T2.Name,T1.Team\nORDER BY T2.Days_held DESC",
        "question": "What are the names of wrestlers and their teams in elimination, ordered descending by days held?",
        "answers": [
            [
                "Gran Hamada",
                "Team Batista"
            ],
            [
                "\u00daltimo Drag\u00f3n \u00a7",
                "Team Batista"
            ],
            [
                "El Samurai \u00a7",
                "Team Orton"
            ],
            [
                "Rey Misterio Sr.",
                "Team Orton"
            ],
            [
                "Fishman",
                "Team Batista"
            ],
            [
                "El Samurai",
                "Team Batista"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (T1:`wrestler.Elimination`)-[]-(T2:`wrestler.wrestler`)\nRETURN T1.Time\nORDER BY T2.Days_held DESC\nLIMIT 1",
        "question": "List the time of elimination of the wrestlers with largest days held.",
        "answers": [
            [
                "10:45"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (T1:`wrestler.Elimination`)-[]-(T2:`wrestler.wrestler`)\nRETURN T1.Time\nORDER BY T2.Days_held DESC\nLIMIT 1",
        "question": "What is the time of elimination for the wrestler with the most days held?",
        "answers": [
            [
                "10:45"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (T1:`wrestler.Elimination`)-[]-(T2:`wrestler.wrestler`)\nWHERE T2.Days_held > '50'\nRETURN T1.Time",
        "question": "Show times of elimination of wrestlers with days held more than 50.",
        "answers": [
            [
                "10:45"
            ],
            [
                "14:22"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (T1:`wrestler.Elimination`)-[]-(T2:`wrestler.wrestler`)\nWHERE T2.Days_held > '50'\nRETURN T1.Time",
        "question": "What are the times of elimination for wrestlers with over 50 days held?",
        "answers": [
            [
                "10:45"
            ],
            [
                "14:22"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (elimination:`wrestler.Elimination`)\nRETURN elimination.Team,count(*)",
        "question": "Show different teams in eliminations and the number of eliminations from each team.",
        "answers": [
            [
                "Team Orton",
                2
            ],
            [
                "Team Batista",
                4
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (elimination:`wrestler.Elimination`)\nRETURN elimination.Team,count(*)",
        "question": "How many eliminations did each team have?",
        "answers": [
            [
                "Team Orton",
                2
            ],
            [
                "Team Batista",
                4
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (elimination:`wrestler.Elimination`)\nWITH elimination.Team AS Team, count(*) AS count\nWHERE count  > 3\nRETURN Team",
        "question": "Show teams that have suffered more than three eliminations.",
        "answers": [
            [
                "Team Batista"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (elimination:`wrestler.Elimination`)\nWITH elimination.Team AS Team, count(*) AS count\nWHERE count  > 3\nRETURN Team",
        "question": "Which teams had more than 3 eliminations?",
        "answers": [
            [
                "Team Batista"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN wrestler.Reign,wrestler.Days_held",
        "question": "Show the reign and days held of wrestlers.",
        "answers": [
            [
                "1",
                "344"
            ],
            [
                "1",
                "113"
            ],
            [
                "1",
                "1285"
            ],
            [
                "1",
                "960"
            ],
            [
                "1",
                "1"
            ],
            [
                "1",
                "99"
            ],
            [
                "1",
                "54"
            ],
            [
                "1",
                "183"
            ],
            [
                "2",
                "35"
            ],
            [
                "1",
                "56"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN wrestler.Reign,wrestler.Days_held",
        "question": "What are the reigns and days held of all wrestlers?",
        "answers": [
            [
                "1",
                "344"
            ],
            [
                "1",
                "113"
            ],
            [
                "1",
                "1285"
            ],
            [
                "1",
                "960"
            ],
            [
                "1",
                "1"
            ],
            [
                "1",
                "99"
            ],
            [
                "1",
                "54"
            ],
            [
                "1",
                "183"
            ],
            [
                "2",
                "35"
            ],
            [
                "1",
                "56"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nWHERE wrestler.Days_held < '100'\nRETURN wrestler.Name",
        "question": "What are the names of wrestlers days held less than 100?",
        "answers": [
            [
                "El Samurai"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nWHERE wrestler.Days_held < '100'\nRETURN wrestler.Name",
        "question": "Return the names of wrestlers with fewer than 100 days held.",
        "answers": [
            [
                "El Samurai"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nWITH count(*) AS count, wrestler.Location AS Location\nWHERE count  > 2\nRETURN Location",
        "question": "List the locations that are shared by more than two wrestlers.",
        "answers": [
            [
                "Tijuana , Mexico"
            ],
            [
                "Tokyo , Japan"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nWITH count(*) AS count, wrestler.Location AS Location\nWHERE count  > 2\nRETURN Location",
        "question": "Which locations are shared by more than two wrestlers?",
        "answers": [
            [
                "Tijuana , Mexico"
            ],
            [
                "Tokyo , Japan"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nWHERE NOT (wrestler)-[]-(:`wrestler.Elimination`)    \nRETURN wrestler.Name",
        "question": "List the names of wrestlers that have not been eliminated.",
        "answers": [
            [
                "Villa\u00f1o IV"
            ],
            [
                "The Great Sasuke \u00a7"
            ],
            [
                "Jushin Liger \u00a7"
            ],
            [
                "Shinjiro Otani \u00a7"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nWHERE NOT (wrestler)-[]-(:`wrestler.Elimination`)    \nRETURN wrestler.Name",
        "question": "What are the names of wrestlers who have never been eliminated?",
        "answers": [
            [
                "Villa\u00f1o IV"
            ],
            [
                "The Great Sasuke \u00a7"
            ],
            [
                "Jushin Liger \u00a7"
            ],
            [
                "Shinjiro Otani \u00a7"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (elimination:`wrestler.Elimination`)\nRETURN count(DISTINCT elimination.Team)",
        "question": "What is the number of distinct teams that suffer elimination?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (elimination:`wrestler.Elimination`)\nRETURN count(DISTINCT elimination.Team)",
        "question": "How many different teams have had eliminated wrestlers?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (elimination:`wrestler.Elimination`)\nWHERE elimination.Eliminated_By = 'Punk' OR elimination.Eliminated_By = 'Orton'\nRETURN elimination.Time",
        "question": "Show the times of elimination by \"Punk\" or \"Orton\".",
        "answers": [
            [
                "00:11"
            ],
            [
                "10:45"
            ]
        ]
    },
    {
        "db_id": "wrestler",
        "query": "MATCH (elimination:`wrestler.Elimination`)\nWHERE elimination.Eliminated_By = 'Punk' OR elimination.Eliminated_By = 'Orton'\nRETURN elimination.Time",
        "question": "What are the times of elimination for any instances in which the elimination was done by Punk or Orton?",
        "answers": [
            [
                "00:11"
            ],
            [
                "10:45"
            ]
        ]
    },
    {
        "db_id": "school_finance",
        "query": "MATCH (school:`school_finance.School`)\nRETURN count(*)",
        "question": "How many schools are there?",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "school_finance",
        "query": "MATCH (school:`school_finance.School`)\nRETURN count(*)",
        "question": "Count the number of schools.",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "school_finance",
        "query": "MATCH (school:`school_finance.School`)\nRETURN school.School_name\nORDER BY school.School_name",
        "question": "Show all school names in alphabetical order.",
        "answers": [
            [
                "Bremen"
            ],
            [
                "Culver Community"
            ],
            [
                "Glenn"
            ],
            [
                "Jimtown"
            ],
            [
                "Knox Community"
            ],
            [
                "LaVille"
            ],
            [
                "New Prairie 1"
            ],
            [
                "Triton"
            ]
        ]
    },
    {
        "db_id": "school_finance",
        "query": "MATCH (school:`school_finance.School`)\nRETURN school.School_name,school.Location,school.Mascot",
        "question": "List the name, location, mascot for all schools.",
        "answers": [
            [
                "Bremen",
                "Bremen",
                "Lions"
            ],
            [
                "Culver Community",
                "Culver",
                "Cavaliers"
            ],
            [
                "Glenn",
                "Walkerton",
                "Falcons"
            ],
            [
                "Jimtown",
                "Elkhart",
                "Jimmies"
            ],
            [
                "Knox Community",
                "Knox",
                "Redskins"
            ],
            [
                "LaVille",
                "Lakeville",
                "Lancers"
            ],
            [
                "New Prairie 1",
                "New Carlisle",
                "Cougars"
            ],
            [
                "Triton",
                "Bourbon",
                "Trojans"
            ]
        ]
    },
    {
        "db_id": "school_finance",
        "query": "MATCH (school:`school_finance.School`)\nWITH avg(school.Enrollment) AS enrollment\nMATCH (school:`school_finance.School`)\nWHERE  school.Enrollment >  enrollment \nRETURN school.Mascot",
        "question": "What are the mascots for schools with enrollments above the average?",
        "answers": [
            [
                "Falcons"
            ],
            [
                "Jimmies"
            ],
            [
                "Redskins"
            ],
            [
                "Cougars"
            ]
        ]
    },
    {
        "db_id": "school_finance",
        "query": "MATCH (school:`school_finance.School`)\nRETURN school.School_name\nORDER BY school.Enrollment\nLIMIT 1",
        "question": "List the name of the school with the smallest enrollment.",
        "answers": [
            [
                "Culver Community"
            ]
        ]
    },
    {
        "db_id": "school_finance",
        "query": "MATCH (school:`school_finance.School`)\nRETURN avg(school.Enrollment),max(school.Enrollment),min(school.Enrollment)",
        "question": "Show the average, maximum, minimum enrollment of all schools.",
        "answers": [
            [
                519.375,
                852,
                287
            ]
        ]
    },
    {
        "db_id": "school_finance",
        "query": "MATCH (endowment:`school_finance.endowment`)\nRETURN endowment.amount,endowment.donator_name\nORDER BY endowment.amount DESC\nLIMIT 1",
        "question": "List the amount and donor name for the largest amount of donation.",
        "answers": [
            [
                9.83,
                "San Jos\u00e9 de Ocoa"
            ]
        ]
    },
    {
        "db_id": "school_finance",
        "query": "MATCH (budget:`school_finance.budget`)\nWHERE budget.Budgeted > 3000 AND budget.Year <= 2001\nRETURN count(*)",
        "question": "How many budgets are above 3000 in year 2001 or before?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "school_finance",
        "query": "MATCH (budget:`school_finance.budget`)\nWHERE budget.Budgeted > 3000 AND budget.Year <= 2001\nRETURN count(*)",
        "question": "Count the number of budgets in year 2001 or before whose budgeted amount is greater than 3000",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "school_finance",
        "query": "MATCH (endowment:`school_finance.endowment`)\nRETURN DISTINCT endowment.donator_name",
        "question": "Show all donor names.",
        "answers": [
            [
                "Monte Plata"
            ],
            [
                "San Jos\u00e9 de Ocoa"
            ],
            [
                "Distrito Nacional"
            ],
            [
                "Valverde"
            ],
            [
                "San Crist\u00f3bal"
            ],
            [
                "Santo Domingo Este"
            ],
            [
                "Santiago"
            ],
            [
                "Duarte"
            ],
            [
                "Com. Dom. En Estados Unidos"
            ],
            [
                "La Vega"
            ],
            [
                "Peravia"
            ]
        ]
    },
    {
        "db_id": "school_finance",
        "query": "MATCH (budget:`school_finance.budget`)\nWHERE budget.Budgeted < budget.Invested\nRETURN count(*)",
        "question": "How many budget record has a budget amount smaller than the invested amount?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "protein_institute",
        "query": "MATCH (building:`protein_institute.building`)\nRETURN building.Name,building.Street_address,building.Floors\nORDER BY building.Floors",
        "question": "Show the name, street address, and number of floors for all buildings ordered by the number of floors.",
        "answers": [
            [
                "Tampa City Hall",
                "315 John F. Kennedy Boulevard",
                10
            ],
            [
                "Citizens Bank Building",
                "701 North Franklin Street",
                12
            ],
            [
                "Floridan Hotel",
                "905 Franklin Street",
                17
            ],
            [
                "Franklin Exchange Building",
                "655 North Franklin Street",
                22
            ],
            [
                "Park Tower",
                "400 North Tampa Street",
                36
            ],
            [
                "One Tampa City Center",
                "201 North Franklin Street",
                39
            ],
            [
                "Bank of America Tower",
                "101 East Kennedy Boulevard",
                42
            ],
            [
                "100 North Tampa",
                "100 North Tampa Street",
                42
            ]
        ]
    },
    {
        "db_id": "protein_institute",
        "query": "MATCH (building:`protein_institute.building`)\nRETURN building.Name\nORDER BY building.Height_feet DESC\nLIMIT 1",
        "question": "What is the name of the tallest building?",
        "answers": [
            [
                "100 North Tampa"
            ]
        ]
    },
    {
        "db_id": "protein_institute",
        "query": "MATCH (building:`protein_institute.building`)\nRETURN avg(building.Floors),max(building.Floors),min(building.Floors)",
        "question": "What are the average, maximum, and minimum number of floors for all buildings?",
        "answers": [
            [
                27.5,
                42,
                10
            ]
        ]
    },
    {
        "db_id": "protein_institute",
        "query": "MATCH (building:`protein_institute.building`)\nWHERE building.Height_feet >= 200 AND building.Floors >= 20\nRETURN building.Name",
        "question": "List the names of buildings with at least 200 feet of height and with at least 20 floors.",
        "answers": [
            [
                "Franklin Exchange Building"
            ],
            [
                "Park Tower"
            ],
            [
                "One Tampa City Center"
            ],
            [
                "Bank of America Tower"
            ],
            [
                "100 North Tampa"
            ]
        ]
    },
    {
        "db_id": "protein_institute",
        "query": "MATCH (institution:`protein_institute.Institution`)\nWHERE institution.Founded > 1990 AND institution.Type = 'Private'\nRETURN institution.Institution,institution.Location",
        "question": "Show the names and locations of institutions that are founded after 1990 and have the type \"Private\".",
        "answers": [
            [
                "Ave Maria University",
                "Ave Maria, Florida"
            ],
            [
                "Lindenwood University\u2013Belleville",
                "Belleville, Illinois"
            ]
        ]
    },
    {
        "db_id": "protein_institute",
        "query": "MATCH (institution:`protein_institute.Institution`)\nWHERE institution.Founded > 1990 AND institution.Enrollment >= 1000\nRETURN institution.Type",
        "question": "Show the institution type with an institution founded after 1990 and an institution with at least 1000 enrollment.",
        "answers": [
            [
                "Private"
            ],
            [
                "Private"
            ]
        ]
    },
    {
        "db_id": "protein_institute",
        "query": "MATCH (building:`protein_institute.building`)\nWHERE NOT (building)-[]-(:`protein_institute.Institution`)    \nRETURN building.Name",
        "question": "Show the name of buildings that do not have any institution.",
        "answers": [
            [
                "Bank of America Tower"
            ]
        ]
    },
    {
        "db_id": "protein_institute",
        "query": "MATCH (T1:`protein_institute.building`)-[]-(T2:`protein_institute.Institution`)\nRETURN T1.Name,count(*)",
        "question": "For each building, show the name of the building and the number of institutions in it.",
        "answers": [
            [
                "Citizens Bank Building",
                2
            ],
            [
                "Tampa City Hall",
                2
            ],
            [
                "Floridan Hotel",
                1
            ],
            [
                "Franklin Exchange Building",
                2
            ],
            [
                "Park Tower",
                1
            ],
            [
                "One Tampa City Center",
                2
            ],
            [
                "100 North Tampa",
                1
            ]
        ]
    },
    {
        "db_id": "protein_institute",
        "query": "MATCH (T1:`protein_institute.building`)-[]-(T2:`protein_institute.Institution`)\nWHERE T2.Founded > 1880\nWITH T1.Name AS Name, count(*) AS count, T1.Height_feet AS Height_feet\nWHERE count  >= 2\nRETURN Name,Height_feet",
        "question": "Show the names and heights of buildings with at least two institutions founded after 1880.",
        "answers": [
            [
                "Tampa City Hall",
                160
            ],
            [
                "One Tampa City Center",
                537
            ],
            [
                "Citizens Bank Building",
                145
            ]
        ]
    },
    {
        "db_id": "protein_institute",
        "query": "MATCH (institution:`protein_institute.Institution`)\nRETURN DISTINCT institution.Type",
        "question": "Show all the distinct institution types.",
        "answers": [
            [
                "Private"
            ],
            [
                "Public"
            ],
            [
                "Tribal"
            ]
        ]
    },
    {
        "db_id": "protein_institute",
        "query": "MATCH (T1:`protein_institute.Institution`)-[]-(T2:`protein_institute.protein`)\nRETURN T1.Institution,count(*)",
        "question": "Show institution names along with the number of proteins for each institution.",
        "answers": [
            [
                "Dakota State University",
                1
            ],
            [
                "Haskell Indian Nations University",
                1
            ],
            [
                "Lindenwood University\u2013Belleville",
                2
            ],
            [
                "Valley City State University",
                1
            ]
        ]
    },
    {
        "db_id": "protein_institute",
        "query": "MATCH (T1:`protein_institute.Institution`)-[]-(T2:`protein_institute.protein`)\nWHERE T1.Founded > 1880 OR T1.Type = 'Private'\nRETURN count(*)",
        "question": "How many proteins are associated with an institution founded after 1880 or an institution with type \"Private\"?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "protein_institute",
        "query": "MATCH (T1:`protein_institute.Institution`)-[]-(T2:`protein_institute.protein`)\nRETURN T2.protein_name,T1.Institution",
        "question": "Show the protein name and the institution name.",
        "answers": [
            [
                "uncharacterized protein C20orf117-like",
                "Dakota State University"
            ],
            [
                "uncharacterized protein LOC578090",
                "Haskell Indian Nations University"
            ],
            [
                "Centromeric protein E, putative",
                "Lindenwood University\u2013Belleville"
            ],
            [
                "conserved hypothetical protein",
                "Lindenwood University\u2013Belleville"
            ],
            [
                "surface antigen repeat family protein",
                "Valley City State University"
            ]
        ]
    }
]