[
    {
        "question": "List the companies and the investors of entrepreneurs.",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN entrepreneur.Company,entrepreneur.Investor",
        "db_id": "entrepreneur",
        "answers": [
            [
                "Umbrolly",
                "Duncan Bannatyne"
            ],
            [
                "Grails Ltd",
                "Doug Richard"
            ],
            [
                "Le Beanock",
                "Rachel Elnaugh"
            ],
            [
                "IV Cam",
                "Peter Jones"
            ],
            [
                "Mycorrhizal Systems",
                "Simon Woodroffe"
            ],
            [
                "Elizabeth Galton Ltd",
                "Duncan Bannatyne"
            ]
        ]
    },
    {
        "question": "Return the average money requested across all entrepreneurs.",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN avg(entrepreneur.Money_Requested)",
        "db_id": "entrepreneur",
        "answers": [
            [
                93166.66666666667
            ]
        ]
    },
    {
        "question": "Return the names of people, ordered by weight ascending.",
        "query": "MATCH (people:`entrepreneur.people`)\nRETURN people.Name\nORDER BY people.Weight ASC",
        "db_id": "entrepreneur",
        "answers": [
            [
                "Fabrizio Buonocore"
            ],
            [
                "Leonardo Binchi"
            ],
            [
                "Alberto Angelini"
            ],
            [
                "Roberto Calcaterra"
            ],
            [
                "Marco Gerini"
            ],
            [
                "Maurizio Felugo"
            ],
            [
                "Francesco Postiglione"
            ],
            [
                "Goran Fiorentini"
            ]
        ]
    },
    {
        "question": "Return the names of entrepreneurs.",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T2.Name",
        "db_id": "entrepreneur",
        "answers": [
            [
                "Francesco Postiglione"
            ],
            [
                "Leonardo Binchi"
            ],
            [
                "Fabrizio Buonocore"
            ],
            [
                "Roberto Calcaterra"
            ],
            [
                "Goran Fiorentini"
            ],
            [
                "Maurizio Felugo"
            ]
        ]
    },
    {
        "question": "What are the names of entrepreneurs whose investor is not \"Rachel Elnaugh\"?",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nWHERE T1.Investor <> 'Rachel Elnaugh'\nRETURN T2.Name",
        "db_id": "entrepreneur",
        "answers": [
            [
                "Francesco Postiglione"
            ],
            [
                "Leonardo Binchi"
            ],
            [
                "Roberto Calcaterra"
            ],
            [
                "Goran Fiorentini"
            ],
            [
                "Maurizio Felugo"
            ]
        ]
    },
    {
        "question": "Return the weight of the shortest person.",
        "query": "MATCH (people:`entrepreneur.people`)\nRETURN people.Weight\nORDER BY people.Height ASC\nLIMIT 1",
        "db_id": "entrepreneur",
        "answers": [
            [
                75.0
            ]
        ]
    },
    {
        "question": "Return the name of the heaviest entrepreneur.",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T2.Name\nORDER BY T2.Weight DESC\nLIMIT 1",
        "db_id": "entrepreneur",
        "answers": [
            [
                "Goran Fiorentini"
            ]
        ]
    },
    {
        "question": "What are the dates of birth of entrepreneurs with investor \"Simon Woodroffe\" or \"Peter Jones\"?",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nWHERE T1.Investor = 'Simon Woodroffe' OR T1.Investor = 'Peter Jones'\nRETURN T2.Date_of_Birth",
        "db_id": "entrepreneur",
        "answers": [
            [
                "1972-02-06"
            ],
            [
                "1981-11-21"
            ]
        ]
    },
    {
        "question": "Return the weights of entrepreneurs, ordered descending by amount of money requested.",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T2.Weight\nORDER BY T1.Money_Requested DESC",
        "db_id": "entrepreneur",
        "answers": [
            [
                80.0
            ],
            [
                57.0
            ],
            [
                76.0
            ],
            [
                89.0
            ],
            [
                45.0
            ],
            [
                67.0
            ]
        ]
    },
    {
        "question": "What is the investor that has invested in the most number of entrepreneurs?",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nWITH count(entrepreneur.Investor) AS count, entrepreneur.Investor AS Investor\nRETURN Investor\nORDER BY count DESC\nLIMIT 1",
        "db_id": "entrepreneur",
        "answers": [
            [
                "Duncan Bannatyne"
            ]
        ]
    },
    {
        "question": "Return the investors who have invested in two or more entrepreneurs.",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nWITH count(*) AS count, entrepreneur.Investor AS Investor\nWHERE count  >= 2\nRETURN Investor",
        "db_id": "entrepreneur",
        "answers": [
            [
                "Duncan Bannatyne"
            ]
        ]
    },
    {
        "question": "List the names of people that are not entrepreneurs.",
        "query": "MATCH (people:`entrepreneur.people`)\nWHERE NOT (people:`entrepreneur.people`)-[]-(:`entrepreneur.entrepreneur`)\nRETURN people.Name",
        "db_id": "entrepreneur",
        "answers": [
            [
                "Marco Gerini"
            ],
            [
                "Alberto Angelini"
            ]
        ]
    },
    {
        "question": "Count the number of different companies.",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN count(DISTINCT entrepreneur.Company)",
        "db_id": "entrepreneur",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "question": "Show the company of the tallest entrepreneur.",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T1.Company\nORDER BY T2.Height DESC\nLIMIT 1",
        "db_id": "entrepreneur",
        "answers": [
            [
                "Elizabeth Galton Ltd"
            ]
        ]
    },
    {
        "question": "List the number of people injured by perpetrators in ascending order.",
        "query": "MATCH (perpetrator:`perpetrator.perpetrator`)\nRETURN perpetrator.Injured\nORDER BY perpetrator.Injured ASC",
        "db_id": "perpetrator",
        "answers": [
            [
                0
            ],
            [
                3
            ],
            [
                16
            ],
            [
                37
            ],
            [
                80
            ]
        ]
    },
    {
        "question": "What is the location of the perpetrator with the largest kills.",
        "query": "MATCH (perpetrator:`perpetrator.perpetrator`)\nRETURN perpetrator.Location\nORDER BY perpetrator.Killed DESC\nLIMIT 1",
        "db_id": "perpetrator",
        "answers": [
            [
                "Uiryeong"
            ]
        ]
    },
    {
        "question": "What are the names of perpetrators whose country is not \"China\"?",
        "query": "MATCH (T1:`perpetrator.people`)-[]-(T2:`perpetrator.perpetrator`)\nWHERE T2.Country <> 'China'\nRETURN T1.Name",
        "db_id": "perpetrator",
        "answers": [
            [
                "Ron Baxter"
            ],
            [
                "Rob Cunningham"
            ],
            [
                "Henry Johnson"
            ]
        ]
    },
    {
        "question": "What is the name of the perpetrator with the biggest weight.",
        "query": "MATCH (T1:`perpetrator.people`)-[]-(T2:`perpetrator.perpetrator`)\nRETURN T1.Name\nORDER BY T1.Weight DESC\nLIMIT 1",
        "db_id": "perpetrator",
        "answers": [
            [
                "Tyrone Brayan"
            ]
        ]
    },
    {
        "question": "What are the names of perpetrators in country \"China\" or \"Japan\"?",
        "query": "MATCH (T1:`perpetrator.people`)-[]-(T2:`perpetrator.perpetrator`)\nWHERE T2.Country = 'China' OR T2.Country = 'Japan'\nRETURN T1.Name",
        "db_id": "perpetrator",
        "answers": [
            [
                "Tyrone Brayan"
            ],
            [
                "Rob Cunningham"
            ],
            [
                "Ovie Dotson"
            ]
        ]
    },
    {
        "question": "What are the countries of perpetrators? Show each country and the corresponding number of perpetrators there.",
        "query": "MATCH (perpetrator:`perpetrator.perpetrator`)\nWITH perpetrator.Country AS Country, count(perpetrator.Country) AS count\nRETURN Country,count",
        "db_id": "perpetrator",
        "answers": [
            [
                "South Korea",
                1
            ],
            [
                "China",
                2
            ],
            [
                "Japan",
                1
            ],
            [
                "India",
                1
            ]
        ]
    },
    {
        "question": "What is the country that has the most perpetrators?",
        "query": "MATCH (perpetrator:`perpetrator.perpetrator`)\nWITH perpetrator.Country AS Country, count(perpetrator.Country) AS count\nRETURN Country,count\nORDER BY count DESC\nLIMIT 1",
        "db_id": "perpetrator",
        "answers": [
            [
                "China",
                2
            ]
        ]
    },
    {
        "question": "List the names of perpetrators in descending order of the year.",
        "query": "MATCH (T1:`perpetrator.people`)-[]-(T2:`perpetrator.perpetrator`)\nRETURN T1.Name\nORDER BY T2.Year DESC",
        "db_id": "perpetrator",
        "answers": [
            [
                "Tyrone Brayan"
            ],
            [
                "Ovie Dotson"
            ],
            [
                "Ron Baxter"
            ],
            [
                "Henry Johnson"
            ],
            [
                "Rob Cunningham"
            ]
        ]
    },
    {
        "question": "List the names of people that are not perpetrators.",
        "query": "MATCH (people:`perpetrator.people`)\nWHERE NOT (people:`perpetrator.people`)-[]-(:`perpetrator.perpetrator`)\nRETURN people.Name",
        "db_id": "perpetrator",
        "answers": [
            [
                "Brent Boyd"
            ],
            [
                "John Danks"
            ],
            [
                "Gary Goodner"
            ],
            [
                "Jim Krivacs"
            ],
            [
                "John Moore"
            ],
            [
                "Mike Murphy"
            ]
        ]
    },
    {
        "question": "Show the date of the tallest perpetrator.",
        "query": "MATCH (T1:`perpetrator.people`)-[]-(T2:`perpetrator.perpetrator`)\nRETURN T2.Date\nORDER BY T1.Height DESC\nLIMIT 1",
        "db_id": "perpetrator",
        "answers": [
            [
                "05.21 May 21"
            ]
        ]
    },
    {
        "question": "Report the name of all campuses in Los Angeles county.",
        "query": "MATCH (campuses:`csu_1.Campuses`)\nWHERE campuses.County = 'Los Angeles'\nRETURN campuses.Campus",
        "db_id": "csu_1",
        "answers": [
            [
                "California State University-Dominguez Hills"
            ],
            [
                "Long Beach State University"
            ],
            [
                "California State University-Los Angeles"
            ],
            [
                "California State University-Northridge"
            ],
            [
                "California State Polytechnic University-Pomona"
            ]
        ]
    },
    {
        "question": "Find all the campuses opened in 1958.",
        "query": "MATCH (campuses:`csu_1.Campuses`)\nWHERE campuses.Year = 1958\nRETURN campuses.Campus",
        "db_id": "csu_1",
        "answers": [
            [
                "California State University-Northridge"
            ]
        ]
    },
    {
        "question": "Find the name of the campuses that is in Northridge, Los Angeles or in San Francisco, San Francisco.",
        "query": "MATCH (campuses:`csu_1.Campuses`)\nWHERE campuses.Location = 'Northridge' AND campuses.County = 'Los Angeles'\nRETURN campuses.Campus  AS campus \nUNION\nMATCH (campuses:`csu_1.Campuses`)\nWHERE campuses.Location = 'San Francisco' AND campuses.County = 'San Francisco'\nRETURN campuses.Campus  AS campus",
        "db_id": "csu_1",
        "answers": [
            [
                "California State University-Northridge"
            ],
            [
                "San Francisco State University"
            ]
        ]
    },
    {
        "question": "What is the number of faculty lines in campus \"Long Beach State University\" in 2002?",
        "query": "MATCH (T1:`csu_1.faculty`)-[]-(T2:`csu_1.Campuses`)\nWHERE T1.Year = 2002 AND T2.Campus = 'Long Beach State University'\nRETURN T1.Faculty",
        "db_id": "csu_1",
        "answers": [
            [
                1429.0
            ]
        ]
    },
    {
        "question": "What is the number of faculty at Long Beach State University in 2002?",
        "query": "MATCH (T1:`csu_1.faculty`)-[]-(T2:`csu_1.Campuses`)\nWHERE T1.Year = 2002 AND T2.Campus = 'Long Beach State University'\nRETURN T1.Faculty",
        "db_id": "csu_1",
        "answers": [
            [
                1429.0
            ]
        ]
    },
    {
        "question": "How many faculty lines are there in \"San Francisco State University\" in year 2004?",
        "query": "MATCH (T1:`csu_1.faculty`)-[]-(T2:`csu_1.Campuses`)\nWHERE T1.Year = 2004 AND T2.Campus = 'San Francisco State University'\nRETURN T1.Faculty",
        "db_id": "csu_1",
        "answers": [
            [
                1083.3
            ]
        ]
    },
    {
        "question": "Count the number of candidates.",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN count(*)",
        "db_id": "candidate_poll",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "question": "Which poll resource provided the most number of candidate information?",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nWITH candidate.Poll_Source AS Poll_Source, count(candidate.Poll_Source) AS count\nRETURN Poll_Source\nORDER BY count DESC\nLIMIT 1",
        "db_id": "candidate_poll",
        "answers": [
            [
                "Newsweek Poll"
            ]
        ]
    },
    {
        "question": "Return the top 3 greatest support rates.",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN candidate.Support_rate\nORDER BY candidate.Support_rate DESC\nLIMIT 3",
        "db_id": "candidate_poll",
        "answers": [
            [
                0.33
            ],
            [
                0.25
            ],
            [
                0.24
            ]
        ]
    },
    {
        "question": "Find the id of the candidate who got the lowest oppose rate.",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN candidate.Candidate_ID\nORDER BY candidate.Oppose_rate\nLIMIT 1",
        "db_id": "candidate_poll",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "Please list support, consider, and oppose rates for each candidate in ascending order by unsure rate.",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN candidate.Support_rate,candidate.Consider_rate,candidate.Oppose_rate\nORDER BY candidate.Unsure_rate",
        "db_id": "candidate_poll",
        "answers": [
            [
                0.25,
                0.3,
                0.43
            ],
            [
                0.33,
                0.2,
                0.45
            ],
            [
                0.24,
                0.27,
                0.43
            ],
            [
                0.18,
                0.34,
                0.44
            ],
            [
                0.24,
                0.3,
                0.32
            ],
            [
                0.17,
                0.42,
                0.32
            ]
        ]
    },
    {
        "question": "Return the poll source corresponding to the candidate who has the oppose rate.",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN candidate.Poll_Source\nORDER BY candidate.Oppose_rate DESC\nLIMIT 1",
        "db_id": "candidate_poll",
        "answers": [
            [
                "Newsweek Poll"
            ]
        ]
    },
    {
        "question": "List all people names in the order of their date of birth from old to young.",
        "query": "MATCH (people:`candidate_poll.people`)\nRETURN people.Name\nORDER BY people.Date_of_Birth",
        "db_id": "candidate_poll",
        "answers": [
            [
                "Vincent Montm\u00e9at"
            ],
            [
                "St\u00e9phane Antiga"
            ],
            [
                "Laurent Capet"
            ],
            [
                "Hubert Henno"
            ],
            [
                "Frantz Granvorka"
            ],
            [
                "Dominique Daquin"
            ],
            [
                "Lo\u00efc De Kergret"
            ],
            [
                "Philippe Bar\u00e7a-Cysique"
            ],
            [
                "Guillaume Samica"
            ]
        ]
    },
    {
        "question": "Find the average height and weight for all males (sex is M).",
        "query": "MATCH (people:`candidate_poll.people`)\nWHERE people.Sex = 'M'\nRETURN avg(people.Height),avg(people.Weight)",
        "db_id": "candidate_poll",
        "answers": [
            [
                195.14285714285714,
                86.71428571428571
            ]
        ]
    },
    {
        "question": "find the names of people who are taller than 200 or lower than 190.",
        "query": "MATCH (people:`candidate_poll.people`)\nWHERE people.Height > 200 OR people.Height < 190\nRETURN people.Name",
        "db_id": "candidate_poll",
        "answers": [
            [
                "Hubert Henno"
            ],
            [
                "Laurent Capet"
            ]
        ]
    },
    {
        "question": "what are the names of people who did not participate in the candidate election.",
        "query": "MATCH (people:`candidate_poll.people`)\nWHERE NOT (people:`candidate_poll.people`)-[]-(:`candidate_poll.candidate`)\nRETURN people.Name",
        "db_id": "candidate_poll",
        "answers": [
            [
                "Dominique Daquin"
            ],
            [
                "Frantz Granvorka"
            ],
            [
                "Philippe Bar\u00e7a-Cysique"
            ]
        ]
    },
    {
        "question": "Count the number of people of each sex who have a weight higher than 85.",
        "query": "MATCH (people:`candidate_poll.people`)\nWHERE people.Weight > 85\nWITH people.Sex AS Sex, count(people.Sex) AS count\nRETURN count,Sex",
        "db_id": "candidate_poll",
        "answers": [
            [
                2,
                "F"
            ],
            [
                4,
                "M"
            ]
        ]
    },
    {
        "question": "find the highest support percentage, lowest consider rate and oppose rate of all candidates.",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN max(candidate.Support_rate),min(candidate.Consider_rate),min(candidate.Oppose_rate)",
        "db_id": "candidate_poll",
        "answers": [
            [
                0.33,
                0.2,
                0.32
            ]
        ]
    },
    {
        "question": "Find the titles of all movies directed by steven spielberg.",
        "query": "MATCH (movie:`movie_1.Movie`)\nWHERE movie.director = 'Steven Spielberg'\nRETURN movie.title",
        "db_id": "movie_1",
        "answers": [
            [
                "E.T."
            ],
            [
                "Raiders of the Lost Ark"
            ]
        ]
    },
    {
        "question": "Count the number of countries.",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN count(*)",
        "db_id": "county_public_safety",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "question": "List the names of counties in descending order of population.",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Name\nORDER BY county_public_safety.Population DESC",
        "db_id": "county_public_safety",
        "answers": [
            [
                "Burnaby"
            ],
            [
                "Abbotsford"
            ],
            [
                "Chilliwack"
            ],
            [
                "Campbell River"
            ],
            [
                "Central Saanich"
            ],
            [
                "Castlegar"
            ]
        ]
    },
    {
        "question": "List the distinct police forces of counties whose location is not on east side.",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nWHERE county_public_safety.Location <> 'East'\nRETURN DISTINCT county_public_safety.Police_force",
        "db_id": "county_public_safety",
        "answers": [
            [
                "RCMP"
            ]
        ]
    },
    {
        "question": "Return the minimum and maximum crime rates across all counties.",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN min(county_public_safety.Crime_rate),max(county_public_safety.Crime_rate)",
        "db_id": "county_public_safety",
        "answers": [
            [
                49.0,
                178.0
            ]
        ]
    },
    {
        "question": "Show the crime rates of counties in ascending order of number of police officers.",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Crime_rate\nORDER BY county_public_safety.Police_officers ASC",
        "db_id": "county_public_safety",
        "answers": [
            [
                150.0
            ],
            [
                49.0
            ],
            [
                178.0
            ],
            [
                174.0
            ],
            [
                118.0
            ],
            [
                123.0
            ]
        ]
    },
    {
        "question": "Return the names of cities, ordered alphabetically.",
        "query": "MATCH (city:`county_public_safety.city`)\nRETURN city.Name\nORDER BY city.Name ASC",
        "db_id": "county_public_safety",
        "answers": [
            [
                "Adjuntas"
            ],
            [
                "Aguada"
            ],
            [
                "Aguadilla"
            ],
            [
                "Aguas Buenas"
            ],
            [
                "Aibonito"
            ],
            [
                "Arecibo"
            ],
            [
                "Arroyo"
            ],
            [
                "A\u00f1asco"
            ],
            [
                "Barceloneta"
            ],
            [
                "Barranquitas"
            ],
            [
                "Bayam\u00f3n"
            ],
            [
                "Cabo Rojo"
            ],
            [
                "Caguas"
            ],
            [
                "Camuy"
            ],
            [
                "Can\u00f3vanas"
            ],
            [
                "Carolina"
            ],
            [
                "Cata\u00f1o"
            ]
        ]
    },
    {
        "question": "Return the hispanic percentage for cities in which the black percentage is greater than 10.",
        "query": "MATCH (city:`county_public_safety.city`)\nWHERE city.Black > 10\nRETURN city.Hispanic",
        "db_id": "county_public_safety",
        "answers": [
            [
                99.5
            ],
            [
                99.1
            ],
            [
                99.0
            ],
            [
                99.1
            ],
            [
                99.2
            ],
            [
                98.6
            ],
            [
                99.0
            ]
        ]
    },
    {
        "question": "List the name of the county with the largest population.",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Name\nORDER BY county_public_safety.Population DESC\nLIMIT 1",
        "db_id": "county_public_safety",
        "answers": [
            [
                "Burnaby"
            ]
        ]
    },
    {
        "question": "List the names of the city with the top 5 white percentages.",
        "query": "MATCH (city:`county_public_safety.city`)\nRETURN city.Name\nORDER BY city.White DESC\nLIMIT 5",
        "db_id": "county_public_safety",
        "answers": [
            [
                "Adjuntas"
            ],
            [
                "Camuy"
            ],
            [
                "Aguada"
            ],
            [
                "Barranquitas"
            ],
            [
                "Arecibo"
            ]
        ]
    },
    {
        "question": "Show names of cities and names of counties they are in.",
        "query": "MATCH (T1:`county_public_safety.city`)-[]-(T2:`county_public_safety.county_public_safety`)\nRETURN T1.Name,T2.Name",
        "db_id": "county_public_safety",
        "answers": [
            [
                "Aguadilla",
                "Abbotsford"
            ],
            [
                "Aguada",
                "Abbotsford"
            ],
            [
                "Adjuntas",
                "Abbotsford"
            ],
            [
                "Aibonito",
                "Burnaby"
            ],
            [
                "Aguas Buenas",
                "Burnaby"
            ],
            [
                "Barceloneta",
                "Campbell River"
            ],
            [
                "Bayam\u00f3n",
                "Campbell River"
            ],
            [
                "Arecibo",
                "Campbell River"
            ],
            [
                "A\u00f1asco",
                "Campbell River"
            ],
            [
                "Barranquitas",
                "Campbell River"
            ],
            [
                "Arroyo",
                "Campbell River"
            ],
            [
                "Cabo Rojo",
                "Castlegar"
            ],
            [
                "Caguas",
                "Castlegar"
            ],
            [
                "Can\u00f3vanas",
                "Central Saanich"
            ],
            [
                "Camuy",
                "Central Saanich"
            ],
            [
                "Carolina",
                "Chilliwack"
            ],
            [
                "Cata\u00f1o",
                "Chilliwack"
            ]
        ]
    },
    {
        "question": "Show white percentages of cities and the crime rates of counties they are in.",
        "query": "MATCH (T1:`county_public_safety.city`)-[]-(T2:`county_public_safety.county_public_safety`)\nRETURN T1.White,T2.Crime_rate",
        "db_id": "county_public_safety",
        "answers": [
            [
                83.0,
                118.0
            ],
            [
                86.6,
                118.0
            ],
            [
                93.1,
                118.0
            ],
            [
                83.5,
                123.0
            ],
            [
                72.5,
                123.0
            ],
            [
                80.7,
                178.0
            ],
            [
                78.3,
                178.0
            ],
            [
                84.5,
                178.0
            ],
            [
                82.0,
                178.0
            ],
            [
                86.0,
                178.0
            ],
            [
                53.5,
                178.0
            ],
            [
                84.1,
                150.0
            ],
            [
                76.1,
                150.0
            ],
            [
                61.2,
                49.0
            ],
            [
                87.9,
                49.0
            ],
            [
                64.3,
                174.0
            ],
            [
                70.7,
                174.0
            ]
        ]
    },
    {
        "question": "Show the crime rate of counties with a city having white percentage more than 90.",
        "query": "MATCH (T1:`county_public_safety.city`)-[]-(T2:`county_public_safety.county_public_safety`)\nWHERE T1.White > 90\nRETURN T2.Crime_rate",
        "db_id": "county_public_safety",
        "answers": [
            [
                118.0
            ]
        ]
    },
    {
        "question": "Please show the police forces and the number of counties with each police force.",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nWITH county_public_safety.Police_force AS Police_force, count(county_public_safety.Police_force) AS count\nRETURN Police_force,count",
        "db_id": "county_public_safety",
        "answers": [
            [
                "Abbotsford Police Department",
                1
            ],
            [
                "RCMP",
                4
            ],
            [
                "Central Saanich Police",
                1
            ]
        ]
    },
    {
        "question": "What is the location shared by most counties?",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nWITH county_public_safety.Location AS Location, count(county_public_safety.Location) AS count\nRETURN Location\nORDER BY count DESC\nLIMIT 1",
        "db_id": "county_public_safety",
        "answers": [
            [
                "East"
            ]
        ]
    },
    {
        "question": "Which location has the most corresponding counties?",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nWITH county_public_safety.Location AS Location, count(county_public_safety.Location) AS count\nRETURN Location\nORDER BY count DESC\nLIMIT 1",
        "db_id": "county_public_safety",
        "answers": [
            [
                "East"
            ]
        ]
    }
]