[
    {
        "db_id": "wedding",
        "query": "MATCH (church:`wedding.church`)\nRETURN church.Name,church.Open_Date,church.Organized_by",
        "question": "Show the name, open date, and organizer for all churches.",
        "answers": [
            [
                "Pure Church of Christ",
                1831,
                "Wycam Clark"
            ],
            [
                "Independent Church",
                1832,
                "\u2013 Hoton"
            ],
            [
                "Church of Christ",
                1836,
                "Ezra Booth"
            ],
            [
                "Church of Christ (Parrishite)",
                1837,
                "Warren Parrish"
            ],
            [
                "Alston Church",
                1839,
                "Isaac Russell"
            ],
            [
                "Church of Christ",
                1830,
                "William Chubby"
            ],
            [
                "Church of Jesus Christ, the Bride, the Lamb's Wife",
                1840,
                "George M. Hinkle"
            ],
            [
                "Church of Christ",
                1842,
                "Hiram Page"
            ],
            [
                "True Church of Jesus Christ of Latter Day Saints",
                1844,
                "William Law"
            ]
        ]
    },
    {
        "db_id": "wedding",
        "query": "MATCH (church:`wedding.church`)\nRETURN church.Name\nORDER BY church.Open_Date DESC",
        "question": "List all church names in descending order of opening date.",
        "answers": [
            [
                "True Church of Jesus Christ of Latter Day Saints"
            ],
            [
                "Church of Christ"
            ],
            [
                "Church of Jesus Christ, the Bride, the Lamb's Wife"
            ],
            [
                "Alston Church"
            ],
            [
                "Church of Christ (Parrishite)"
            ],
            [
                "Church of Christ"
            ],
            [
                "Independent Church"
            ],
            [
                "Pure Church of Christ"
            ],
            [
                "Church of Christ"
            ]
        ]
    },
    {
        "db_id": "wedding",
        "query": "MATCH (church:`wedding.church`)\nWITH count(*) AS count, church.Open_Date AS Open_Date\nWHERE count  >= 2\nRETURN Open_Date",
        "question": "Show the opening year in whcih at least two churches opened.",
        "answers": []
    },
    {
        "db_id": "wedding",
        "query": "MATCH (church:`wedding.church`)\nWHERE 1830<=church.Open_Date<=1840\nRETURN church.Organized_by,church.Name",
        "question": "Show the organizer and name for churches that opened between 1830 and 1840.",
        "answers": [
            [
                "Wycam Clark",
                "Pure Church of Christ"
            ],
            [
                "\u2013 Hoton",
                "Independent Church"
            ],
            [
                "Ezra Booth",
                "Church of Christ"
            ],
            [
                "Warren Parrish",
                "Church of Christ (Parrishite)"
            ],
            [
                "Isaac Russell",
                "Alston Church"
            ],
            [
                "William Chubby",
                "Church of Christ"
            ],
            [
                "George M. Hinkle",
                "Church of Jesus Christ, the Bride, the Lamb's Wife"
            ]
        ]
    },
    {
        "db_id": "wedding",
        "query": "MATCH (church:`wedding.church`)\nRETURN church.Open_Date,count(*)",
        "question": "Show all opening years and the number of churches that opened in that year.",
        "answers": [
            [
                1831,
                1
            ],
            [
                1832,
                1
            ],
            [
                1836,
                1
            ],
            [
                1837,
                1
            ],
            [
                1839,
                1
            ],
            [
                1830,
                1
            ],
            [
                1840,
                1
            ],
            [
                1842,
                1
            ],
            [
                1844,
                1
            ]
        ]
    },
    {
        "db_id": "wedding",
        "query": "MATCH (church:`wedding.church`)\nRETURN church.Name,church.Open_Date\nORDER BY church.Open_Date DESC\nLIMIT 3",
        "question": "Show the name and opening year for three churches that opened most recently.",
        "answers": [
            [
                "True Church of Jesus Christ of Latter Day Saints",
                1844
            ],
            [
                "Church of Christ",
                1842
            ],
            [
                "Church of Jesus Christ, the Bride, the Lamb's Wife",
                1840
            ]
        ]
    },
    {
        "db_id": "wedding",
        "query": "MATCH (people:`wedding.people`)\nWHERE people.Is_Male = 'F' AND people.Age > 30\nRETURN count(*)",
        "question": "How many female people are older than 30 in our record?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "wedding",
        "query": "MATCH (people:`wedding.people`)\nRETURN min(people.Age),max(people.Age),avg(people.Age)",
        "question": "Show the minimum, maximum, and average age for all people.",
        "answers": [
            [
                25,
                36,
                30.166666666666668
            ]
        ]
    },
    {
        "db_id": "wedding",
        "query": "MATCH (people:`wedding.people`)\nWITH avg(people.Age) AS age\nMATCH (people:`wedding.people`)\nWHERE  people.Age <  age \nRETURN people.Name,people.Country",
        "question": "Show the name and country for all people whose age is smaller than the average.",
        "answers": [
            [
                "Ricky Barnes",
                "United States"
            ],
            [
                "Summer Duval",
                "United States"
            ],
            [
                "Todd Hamilton",
                "United States"
            ],
            [
                "Annie Mediate",
                "United States"
            ],
            [
                "Adam Scott",
                "Australia"
            ],
            [
                "Danny Toms",
                "United States"
            ]
        ]
    },
    {
        "db_id": "wedding",
        "query": "MATCH (T1:`wedding.church`)-[T2:`wedding.wedding`]-()\nWITH T1.Name AS Name, count(*) AS count\nWHERE count  >= 2\nRETURN Name",
        "question": "Show all church names that have hosted least two weddings.",
        "answers": []
    },
    {
        "db_id": "wedding",
        "query": "MATCH (T2:`wedding.people`)-[T1:`wedding.wedding`]-()\nWHERE T1.Year = 2016 AND T2.Is_Male = 'F' AND T2.Country = 'Canada'\nRETURN T2.Name",
        "question": "Show the names for all females from Canada having a wedding in year 2016.",
        "answers": []
    },
    {
        "db_id": "wedding",
        "query": "MATCH (people:`wedding.people`)\nRETURN people.Country,count(*)",
        "question": "Show all countries and the number of people from each country.",
        "answers": [
            [
                "Canada",
                1
            ],
            [
                "Sweden",
                1
            ],
            [
                "United States",
                8
            ],
            [
                "Northern Ireland",
                1
            ],
            [
                "Australia",
                1
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nRETURN count(*)",
        "question": "How many artists do we have?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nRETURN count(*)",
        "question": "Count the number of artists.",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nRETURN artist.Name,artist.Age,artist.Country\nORDER BY artist.Year_Join",
        "question": "Show all artist name, age, and country ordered by the yeared they joined.",
        "answers": [
            [
                "Larry Nelson",
                50,
                "United States"
            ],
            [
                "Jeff Sluman",
                57,
                "United States"
            ],
            [
                "John Daly",
                46,
                "United States"
            ],
            [
                "Paul Azinger",
                47,
                "United States"
            ],
            [
                "Nick Price",
                48,
                "Zimbabwe"
            ],
            [
                "Mark Brooks",
                48,
                "United States"
            ],
            [
                "Vijay Singh",
                45,
                "Fiji"
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nRETURN artist.Name,artist.Age,artist.Country\nORDER BY artist.Year_Join",
        "question": "What are the names, ages, and countries of artists, sorted by the year they joined?",
        "answers": [
            [
                "Larry Nelson",
                50,
                "United States"
            ],
            [
                "Jeff Sluman",
                57,
                "United States"
            ],
            [
                "John Daly",
                46,
                "United States"
            ],
            [
                "Paul Azinger",
                47,
                "United States"
            ],
            [
                "Nick Price",
                48,
                "Zimbabwe"
            ],
            [
                "Mark Brooks",
                48,
                "United States"
            ],
            [
                "Vijay Singh",
                45,
                "Fiji"
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nRETURN DISTINCT artist.Country",
        "question": "What are all distinct country for artists?",
        "answers": [
            [
                "Fiji"
            ],
            [
                "United States"
            ],
            [
                "Zimbabwe"
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nRETURN DISTINCT artist.Country",
        "question": "Return the different countries for artists.",
        "answers": [
            [
                "Fiji"
            ],
            [
                "United States"
            ],
            [
                "Zimbabwe"
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nWHERE artist.Country <> 'United States'\nRETURN artist.Name,artist.Year_Join",
        "question": "Show all artist names and the year joined who are not from United States.",
        "answers": [
            [
                "Vijay Singh",
                1998
            ],
            [
                "Nick Price",
                1994
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nWHERE artist.Country <> 'United States'\nRETURN artist.Name,artist.Year_Join",
        "question": "What are the names and year of joining for artists that do not have the country \"United States\"?",
        "answers": [
            [
                "Vijay Singh",
                1998
            ],
            [
                "Nick Price",
                1994
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nWHERE artist.Age > 46 AND artist.Year_Join > 1990\nRETURN count(*)",
        "question": "How many artists are above age 46 and joined after 1990?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nWHERE artist.Age > 46 AND artist.Year_Join > 1990\nRETURN count(*)",
        "question": "Count the number of artists who are older than 46 and joined after 1990.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nWHERE artist.Country = 'United States'\nRETURN avg(artist.Age),min(artist.Age)",
        "question": "What is the average and minimum age of all artists from United States.",
        "answers": [
            [
                49.6,
                46
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nWHERE artist.Country = 'United States'\nRETURN avg(artist.Age),min(artist.Age)",
        "question": "Return the average and minimum ages across artists from the United States.",
        "answers": [
            [
                49.6,
                46
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nRETURN artist.Name\nORDER BY artist.Year_Join DESC\nLIMIT 1",
        "question": "What is the name of the artist who joined latest?",
        "answers": [
            [
                "Vijay Singh"
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nRETURN artist.Name\nORDER BY artist.Year_Join DESC\nLIMIT 1",
        "question": "Return the name of the artist who has the latest join year.",
        "answers": [
            [
                "Vijay Singh"
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (exhibition:`theme_gallery.exhibition`)\nWHERE exhibition.Year >= 2005\nRETURN count(*)",
        "question": "How many exhibition are there in year 2005 or after?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (exhibition:`theme_gallery.exhibition`)\nWHERE exhibition.Year >= 2005\nRETURN count(*)",
        "question": "Count the number of exhibitions that happened in or after 2005.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (exhibition:`theme_gallery.exhibition`)\nWHERE exhibition.Ticket_Price < 15\nRETURN exhibition.Theme,exhibition.Year",
        "question": "Show theme and year for all exhibitions with ticket prices lower than 15.",
        "answers": [
            [
                "Santa Claus and Rudolph the Red-Nosed Reindeer",
                2006
            ],
            [
                "Summer",
                2009
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (exhibition:`theme_gallery.exhibition`)\nWHERE exhibition.Ticket_Price < 15\nRETURN exhibition.Theme,exhibition.Year",
        "question": "What are the theme and year for all exhibitions that have a ticket price under 15?",
        "answers": [
            [
                "Santa Claus and Rudolph the Red-Nosed Reindeer",
                2006
            ],
            [
                "Summer",
                2009
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (T1:`theme_gallery.exhibition`)-[]-(T2:`theme_gallery.artist`)\nRETURN T2.Name,count(*)",
        "question": "Show all artist names and the number of exhibitions for each artist.",
        "answers": [
            [
                "Vijay Singh",
                2
            ],
            [
                "John Daly",
                1
            ],
            [
                "Paul Azinger",
                1
            ],
            [
                "Jeff Sluman",
                1
            ],
            [
                "Nick Price",
                1
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (T1:`theme_gallery.exhibition`)-[]-(T2:`theme_gallery.artist`)\nRETURN T2.Name,count(*)",
        "question": "How many exhibitions has each artist had?",
        "answers": [
            [
                "Vijay Singh",
                2
            ],
            [
                "John Daly",
                1
            ],
            [
                "Paul Azinger",
                1
            ],
            [
                "Jeff Sluman",
                1
            ],
            [
                "Nick Price",
                1
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (T1:`theme_gallery.exhibition`)-[]-(T2:`theme_gallery.artist`)\nWITH count(T1.Artist_ID) AS cnt, T2\nRETURN T2.Name,T2.Country\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the name and country for the artist with most number of exhibitions?",
        "answers": [
            [
                "Vijay Singh",
                "Fiji"
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (T1:`theme_gallery.exhibition`)-[]-(T2:`theme_gallery.artist`)\nWITH count(T1.Artist_ID) AS cnt, T2\nRETURN T2.Name,T2.Country\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Return the name and country corresponding to the artist who has had the most exhibitions.",
        "answers": [
            [
                "Vijay Singh",
                "Fiji"
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nWHERE NOT (artist)-[]-(:`theme_gallery.exhibition`)    \nRETURN artist.Name",
        "question": "Show names for artists without any exhibition.",
        "answers": [
            [
                "Mark Brooks"
            ],
            [
                "Larry Nelson"
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (artist:`theme_gallery.artist`)\nWHERE NOT (artist)-[]-(:`theme_gallery.exhibition`)    \nRETURN artist.Name",
        "question": "What are the names of artists that have not had any exhibitions?",
        "answers": [
            [
                "Mark Brooks"
            ],
            [
                "Larry Nelson"
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (exhibition:`theme_gallery.exhibition`)\nRETURN exhibition.Theme,exhibition.Year\nORDER BY exhibition.Ticket_Price DESC",
        "question": "Show theme and year for all exhibitions in an descending order of ticket price.",
        "answers": [
            [
                "Spring",
                2008
            ],
            [
                "Santa Claus",
                2004
            ],
            [
                "Christmas stocking",
                2005
            ],
            [
                "Christmas Tree",
                2007
            ],
            [
                "Santa Claus and Rudolph the Red-Nosed Reindeer",
                2006
            ],
            [
                "Summer",
                2009
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (exhibition:`theme_gallery.exhibition`)\nRETURN exhibition.Theme,exhibition.Year\nORDER BY exhibition.Ticket_Price DESC",
        "question": "What are the themes and years for exhibitions, sorted by ticket price descending?",
        "answers": [
            [
                "Spring",
                2008
            ],
            [
                "Santa Claus",
                2004
            ],
            [
                "Christmas stocking",
                2005
            ],
            [
                "Christmas Tree",
                2007
            ],
            [
                "Santa Claus and Rudolph the Red-Nosed Reindeer",
                2006
            ],
            [
                "Summer",
                2009
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (T1:`theme_gallery.exhibition_record`)-[]-(T2:`theme_gallery.exhibition`)\nWHERE T2.Year = 2004\nRETURN T2.Theme,T1.Date,T1.Attendance",
        "question": "What is the theme, date, and attendance for the exhibition in year 2004?",
        "answers": [
            [
                "Santa Claus",
                "December 2",
                965
            ],
            [
                "Santa Claus",
                "December 7",
                2983
            ],
            [
                "Santa Claus",
                "December 5",
                1098
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (T1:`theme_gallery.exhibition_record`)-[]-(T2:`theme_gallery.exhibition`)\nWHERE T2.Year = 2004\nRETURN T2.Theme,T1.Date,T1.Attendance",
        "question": "Return the themes, dates, and attendance for exhibitions that happened in 2004.",
        "answers": [
            [
                "Santa Claus",
                "December 2",
                965
            ],
            [
                "Santa Claus",
                "December 7",
                2983
            ],
            [
                "Santa Claus",
                "December 5",
                1098
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (T1:`theme_gallery.exhibition_record`)-[]-(T2:`theme_gallery.exhibition`)\nWHERE T1.Attendance > 100 OR T2.Ticket_Price < 10\nRETURN count(*)",
        "question": "How many exhibitions have a attendance more than 100 or have a ticket price below 10?",
        "answers": [
            [
                13
            ]
        ]
    },
    {
        "db_id": "theme_gallery",
        "query": "MATCH (T1:`theme_gallery.exhibition_record`)-[]-(T2:`theme_gallery.exhibition`)\nWHERE T1.Attendance > 100 OR T2.Ticket_Price < 10\nRETURN count(*)",
        "question": "Count the number of exhibitions that have had an attendnance of over 100 or a ticket prices under 10.",
        "answers": [
            [
                13
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (item:`epinions_1.item`)\nWHERE item.title = 'orange'\nRETURN item.i_id",
        "question": "Find the id of the item whose title is \"orange\".",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (review:`epinions_1.review`)\nRETURN count(*)",
        "question": "Find the number of reviews.",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (review:`epinions_1.review`)\nRETURN min(review.rank)",
        "question": "Find the highest rank of all reviews.",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (review:`epinions_1.review`)\nRETURN count(DISTINCT review.u_id)",
        "question": "How many different users wrote some reviews?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (review:`epinions_1.review`)\nRETURN count(DISTINCT review.i_id)",
        "question": "How many different items were reviewed by some users?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (item:`epinions_1.item`)\nWHERE NOT (item)-[]-(:`epinions_1.review`)    \nRETURN count(*)",
        "question": "Find the number of items that did not receive any review.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (useracct:`epinions_1.useracct`)\nWHERE NOT (useracct)-[]-(:`epinions_1.review`)    \nRETURN useracct.name",
        "question": "Find the names of users who did not leave any review.",
        "answers": [
            [
                "Terry"
            ],
            [
                "Nancy"
            ],
            [
                "Rosie"
            ],
            [
                "Roxi"
            ],
            [
                "Emily"
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (T1:`epinions_1.item`)-[]-(T2:`epinions_1.review`)\nWHERE T2.rating = 10\nRETURN T1.title",
        "question": "Find the names of goods that receive a rating of 10.",
        "answers": [
            [
                "orange"
            ],
            [
                "cup"
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (T1:`epinions_1.item`)-[]-(T2:`epinions_1.review`)\nWHERE T2.rating < 5\nRETURN T1.title",
        "question": "Find the titles of items that received any rating below 5.",
        "answers": []
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (item:`epinions_1.item`)\nRETURN item.title\nORDER BY item.title",
        "question": "List the titles of all items in alphabetic order .",
        "answers": [
            [
                "apple"
            ],
            [
                "avocado"
            ],
            [
                "blue hoodie"
            ],
            [
                "comb"
            ],
            [
                "cup"
            ],
            [
                "orange"
            ],
            [
                "pear"
            ],
            [
                "shampoo"
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (T1:`epinions_1.useracct`)-[]-(T2:`epinions_1.review`)\nWITH count(T1.u_id) AS cnt, T1\nRETURN T1.name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Find the name of the user who gives the most reviews.",
        "answers": [
            [
                "Mark"
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (T1:`epinions_1.useracct`)-[]-(T2:`epinions_1.review`)\nRETURN T1.name,count(*)",
        "question": "For each user, find their name and the number of reviews written by them.",
        "answers": [
            [
                "Helen",
                3
            ],
            [
                "Mark",
                4
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (T1:`epinions_1.useracct`)-[]-(T2:`epinions_1.review`)\nRETURN T1.name\nORDER BY T2.rating DESC\nLIMIT 1",
        "question": "Find the name of the user who gave the highest rating.",
        "answers": [
            [
                "Helen"
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (item:`epinions_1.item`)\nWHERE NOT (item)-[]-(:`epinions_1.review`)    \nRETURN item.title",
        "question": "Find the names of the items that did not receive any review.",
        "answers": [
            [
                "pear"
            ],
            [
                "apple"
            ],
            [
                "blue hoodie"
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (useracct:`epinions_1.useracct`)\nWHERE NOT (useracct)-[]-(:`epinions_1.review`)    \nRETURN count(*)",
        "question": "Find the number of users who did not write any review.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "epinions_1",
        "query": "MATCH (item:`epinions_1.item`)\nWHERE NOT (item)-[]-(:`epinions_1.review`)    \nRETURN count(*)",
        "question": "Find the number of items without any review.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "riding_club",
        "query": "MATCH (player:`riding_club.player`)\nRETURN player.Player_name\nORDER BY player.Votes ASC",
        "question": "List the names of players in ascending order of votes.",
        "answers": [
            [
                "Mohamed Alli"
            ],
            [
                "Sean Robert"
            ],
            [
                "Ron Strynadka"
            ],
            [
                "Ross C. Martin"
            ],
            [
                "Rachel Heinrichs"
            ],
            [
                "Matt Schaubroeck"
            ],
            [
                "Jean Luc Bouch\u00e9"
            ],
            [
                "Fiona Shiells"
            ],
            [
                "Niki Ashton"
            ],
            [
                "Patricia Cordner"
            ],
            [
                "Ross Eadie"
            ],
            [
                "Pat Martin"
            ],
            [
                "Judy Wasylycia-Leis"
            ],
            [
                "Jim Maloway"
            ]
        ]
    },
    {
        "db_id": "riding_club",
        "query": "MATCH (player:`riding_club.player`)\nRETURN player.Gender,player.Occupation",
        "question": "What are the gender and occupation of players?",
        "answers": [
            [
                "M",
                "Locomotive Engineer"
            ],
            [
                "F",
                "Ministerial Assistant"
            ],
            [
                "F",
                "Researcher"
            ],
            [
                "M",
                "Retired"
            ],
            [
                "M",
                "Small Businessman"
            ],
            [
                "M",
                "Self Employed / Consultant"
            ],
            [
                "M",
                "Distribution Centre Associate"
            ],
            [
                "M",
                "Design Coordinator"
            ],
            [
                "M",
                "Student"
            ],
            [
                "F",
                "Retired"
            ],
            [
                "M",
                "Parliamentarian"
            ],
            [
                "F",
                "Parliamentarian"
            ],
            [
                "M",
                "Product Consultant - MLCC"
            ],
            [
                "F",
                "Student"
            ]
        ]
    }
]