[
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (accounts:`customers_and_invoices.Accounts`)\nRETURN count(*)",
        "question": "How many accounts are there?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (accounts:`customers_and_invoices.Accounts`)\nRETURN count(DISTINCT accounts.customer_id)",
        "question": "How many customers have opened an account?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (accounts:`customers_and_invoices.Accounts`)\nRETURN count(DISTINCT accounts.customer_id)",
        "question": "Count the number of customers who have an account.",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (accounts:`customers_and_invoices.Accounts`)\nRETURN accounts.account_id,accounts.date_account_opened,accounts.account_name,accounts.other_account_details",
        "question": "Show the id, the date of account opened, the account name, and other account detail for all accounts.",
        "answers": [
            [
                1,
                "2016-07-30 22:22:24",
                "900",
                "Regular"
            ],
            [
                2,
                "2017-05-29 16:45:17",
                "520",
                "VIP"
            ],
            [
                3,
                "2012-05-04 18:50:32",
                "323",
                "Regular"
            ],
            [
                4,
                "2011-03-29 15:06:59",
                "390",
                "VIP"
            ],
            [
                5,
                "2014-08-11 18:15:14",
                "935",
                "Regular"
            ],
            [
                6,
                "2014-05-30 12:16:52",
                "371",
                "Regular"
            ],
            [
                7,
                "2015-11-03 08:04:15",
                "398",
                "VIP"
            ],
            [
                8,
                "2009-06-13 11:41:52",
                "710",
                "Regular"
            ],
            [
                9,
                "2010-10-22 13:33:45",
                "337",
                "Regular"
            ],
            [
                10,
                "2016-04-25 21:49:17",
                "429",
                "VIP"
            ],
            [
                11,
                "2012-07-09 23:40:15",
                "191",
                "VIP"
            ],
            [
                12,
                "2015-02-02 09:47:08",
                "601",
                "Regular"
            ],
            [
                13,
                "2010-06-16 09:35:00",
                "272",
                "Regular"
            ],
            [
                14,
                "2014-12-28 07:29:42",
                "861",
                "VIP"
            ],
            [
                15,
                "2008-05-04 22:15:56",
                "662",
                "VIP"
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (accounts:`customers_and_invoices.Accounts`)\nRETURN accounts.account_id,accounts.date_account_opened,accounts.account_name,accounts.other_account_details",
        "question": "What are the ids, date opened, name, and other details for all accounts?",
        "answers": [
            [
                1,
                "2016-07-30 22:22:24",
                "900",
                "Regular"
            ],
            [
                2,
                "2017-05-29 16:45:17",
                "520",
                "VIP"
            ],
            [
                3,
                "2012-05-04 18:50:32",
                "323",
                "Regular"
            ],
            [
                4,
                "2011-03-29 15:06:59",
                "390",
                "VIP"
            ],
            [
                5,
                "2014-08-11 18:15:14",
                "935",
                "Regular"
            ],
            [
                6,
                "2014-05-30 12:16:52",
                "371",
                "Regular"
            ],
            [
                7,
                "2015-11-03 08:04:15",
                "398",
                "VIP"
            ],
            [
                8,
                "2009-06-13 11:41:52",
                "710",
                "Regular"
            ],
            [
                9,
                "2010-10-22 13:33:45",
                "337",
                "Regular"
            ],
            [
                10,
                "2016-04-25 21:49:17",
                "429",
                "VIP"
            ],
            [
                11,
                "2012-07-09 23:40:15",
                "191",
                "VIP"
            ],
            [
                12,
                "2015-02-02 09:47:08",
                "601",
                "Regular"
            ],
            [
                13,
                "2010-06-16 09:35:00",
                "272",
                "Regular"
            ],
            [
                14,
                "2014-12-28 07:29:42",
                "861",
                "VIP"
            ],
            [
                15,
                "2008-05-04 22:15:56",
                "662",
                "VIP"
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T1:`customers_and_invoices.Accounts`)-[]-(T2:`customers_and_invoices.Customers`)\nWHERE T2.customer_first_name = 'Meaghan'\nRETURN T1.account_id,T1.date_account_opened,T1.account_name,T1.other_account_details",
        "question": "Show the id, the account name, and other account details for all accounts by the customer with first name 'Meaghan'.",
        "answers": [
            [
                3,
                "2012-05-04 18:50:32",
                "323",
                "Regular"
            ],
            [
                9,
                "2010-10-22 13:33:45",
                "337",
                "Regular"
            ],
            [
                1,
                "2016-07-30 22:22:24",
                "900",
                "Regular"
            ],
            [
                12,
                "2015-02-02 09:47:08",
                "601",
                "Regular"
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T1:`customers_and_invoices.Customers`)-[]-(T2:`customers_and_invoices.Accounts`)\nRETURN DISTINCT T1.customer_first_name,T1.customer_last_name,T1.phone_number",
        "question": "Show the unique first names, last names, and phone numbers for all customers with any account.",
        "answers": [
            [
                "Meaghan",
                "Keeling",
                "06015518212"
            ],
            [
                "Joesph",
                "Schaefer",
                "(488)524-5345"
            ],
            [
                "Ruby",
                "Boyle",
                "1-546-302-5676"
            ],
            [
                "Jensen",
                "Muller",
                "(650)406-8761"
            ],
            [
                "Kieran",
                "Auer",
                "(157)046-6255x98627"
            ],
            [
                "Abbey",
                "Ruecker",
                "1-344-593-4896x425"
            ],
            [
                "Vesta",
                "Leuschke",
                "+69(0)7149212554"
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T1:`customers_and_invoices.Customers`)-[]-(T2:`customers_and_invoices.Accounts`)\nRETURN DISTINCT T1.customer_first_name,T1.customer_last_name,T1.phone_number",
        "question": "What are the distinct first names, last names, and phone numbers for customers with accounts?",
        "answers": [
            [
                "Meaghan",
                "Keeling",
                "06015518212"
            ],
            [
                "Joesph",
                "Schaefer",
                "(488)524-5345"
            ],
            [
                "Ruby",
                "Boyle",
                "1-546-302-5676"
            ],
            [
                "Jensen",
                "Muller",
                "(650)406-8761"
            ],
            [
                "Kieran",
                "Auer",
                "(157)046-6255x98627"
            ],
            [
                "Abbey",
                "Ruecker",
                "1-344-593-4896x425"
            ],
            [
                "Vesta",
                "Leuschke",
                "+69(0)7149212554"
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (accounts:`customers_and_invoices.Accounts`)\nRETURN count(*),accounts.customer_id",
        "question": "How many accounts does each customer have? List the number and customer id.",
        "answers": [
            [
                4,
                8
            ],
            [
                1,
                3
            ],
            [
                3,
                15
            ],
            [
                1,
                12
            ],
            [
                4,
                13
            ],
            [
                1,
                9
            ],
            [
                1,
                6
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (accounts:`customers_and_invoices.Accounts`)\nRETURN count(*),accounts.customer_id",
        "question": "Count the number of accounts corresponding to each customer id.",
        "answers": [
            [
                4,
                8
            ],
            [
                1,
                3
            ],
            [
                3,
                15
            ],
            [
                1,
                12
            ],
            [
                4,
                13
            ],
            [
                1,
                9
            ],
            [
                1,
                6
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T1:`customers_and_invoices.Accounts`)-[]-(T2:`customers_and_invoices.Customers`)\nRETURN T1.customer_id,T2.customer_first_name,T2.customer_last_name,count(*)",
        "question": "Show id, first name and last name for all customers and the number of accounts.",
        "answers": [
            [
                8,
                "Meaghan",
                "Keeling",
                4
            ],
            [
                3,
                "Joesph",
                "Schaefer",
                1
            ],
            [
                15,
                "Ruby",
                "Boyle",
                3
            ],
            [
                12,
                "Jensen",
                "Muller",
                1
            ],
            [
                13,
                "Kieran",
                "Auer",
                4
            ],
            [
                9,
                "Abbey",
                "Ruecker",
                1
            ],
            [
                6,
                "Vesta",
                "Leuschke",
                1
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T1:`customers_and_invoices.Accounts`)-[]-(T2:`customers_and_invoices.Customers`)\nRETURN T1.customer_id,T2.customer_first_name,T2.customer_last_name,count(*)",
        "question": "What are the the full names and ids for all customers, and how many accounts does each have?",
        "answers": [
            [
                8,
                "Meaghan",
                "Keeling",
                4
            ],
            [
                3,
                "Joesph",
                "Schaefer",
                1
            ],
            [
                15,
                "Ruby",
                "Boyle",
                3
            ],
            [
                12,
                "Jensen",
                "Muller",
                1
            ],
            [
                13,
                "Kieran",
                "Auer",
                4
            ],
            [
                9,
                "Abbey",
                "Ruecker",
                1
            ],
            [
                6,
                "Vesta",
                "Leuschke",
                1
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T1:`customers_and_invoices.Accounts`)-[]-(T2:`customers_and_invoices.Customers`)\nWITH count(*) AS count, T2.customer_first_name AS customer_first_name, T1.customer_id AS customer_id\nWHERE count  >= 2\nRETURN customer_first_name,customer_id",
        "question": "Show first name and id for all customers with at least 2 accounts.",
        "answers": [
            [
                "Meaghan",
                8
            ],
            [
                "Ruby",
                15
            ],
            [
                "Kieran",
                13
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T1:`customers_and_invoices.Accounts`)-[]-(T2:`customers_and_invoices.Customers`)\nWITH count(*) AS count, T2.customer_first_name AS customer_first_name, T1.customer_id AS customer_id\nWHERE count  >= 2\nRETURN customer_first_name,customer_id",
        "question": "What are the first names and ids for customers who have two or more accounts?",
        "answers": [
            [
                "Meaghan",
                8
            ],
            [
                "Ruby",
                15
            ],
            [
                "Kieran",
                13
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (customers:`customers_and_invoices.Customers`)\nRETURN count(*)",
        "question": "Show the number of customers.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (customers:`customers_and_invoices.Customers`)\nRETURN count(*)",
        "question": "Count the number of customers.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (customers:`customers_and_invoices.Customers`)\nRETURN customers.gender,count(*)",
        "question": "Show the number of customers for each gender.",
        "answers": [
            [
                "1",
                6
            ],
            [
                "0",
                9
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (customers:`customers_and_invoices.Customers`)\nRETURN customers.gender,count(*)",
        "question": "How many customers are there of each gender?",
        "answers": [
            [
                "1",
                6
            ],
            [
                "0",
                9
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T2:`customers_and_invoices.Accounts`)-[T1:`customers_and_invoices.Financial_Transactions`]-()\nWITH count(*) AS count, T2.account_name AS account_name, T1.account_id AS account_id\nWHERE count  >= 4\nRETURN account_id,account_name",
        "question": "Show the account id and name with at least 4 transactions.",
        "answers": [
            [
                9,
                "337"
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T2:`customers_and_invoices.Accounts`)-[T1:`customers_and_invoices.Financial_Transactions`]-()\nWITH count(*) AS count, T2.account_name AS account_name, T1.account_id AS account_id\nWHERE count  >= 4\nRETURN account_id,account_name",
        "question": "What are the ids and names of accounts with 4 or more transactions?",
        "answers": [
            [
                9,
                "337"
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (products:`customers_and_invoices.Products`)\nRETURN DISTINCT products.product_size",
        "question": "Show all product sizes.",
        "answers": [
            [
                "Medium"
            ],
            [
                "Small"
            ],
            [
                "Large"
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (products:`customers_and_invoices.Products`)\nRETURN DISTINCT products.product_size",
        "question": "What are the different product sizes?",
        "answers": [
            [
                "Medium"
            ],
            [
                "Small"
            ],
            [
                "Large"
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (products:`customers_and_invoices.Products`)\nRETURN DISTINCT products.product_color",
        "question": "Show all product colors.",
        "answers": [
            [
                "Red"
            ],
            [
                "Yellow"
            ],
            [
                "Black"
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (products:`customers_and_invoices.Products`)\nRETURN DISTINCT products.product_color",
        "question": "What are the different product colors?",
        "answers": [
            [
                "Red"
            ],
            [
                "Yellow"
            ],
            [
                "Black"
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T2:`customers_and_invoices.Invoices`)-[T1:`customers_and_invoices.Financial_Transactions`]-()\nWITH T2, count(T1.invoice_number) AS cnt\nRETURN T2.invoice_number,T2.invoice_date\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the invoice number and invoice date for the invoice with most number of transactions?",
        "answers": [
            [
                12,
                "2018-03-15 21:24:13"
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T2:`customers_and_invoices.Invoices`)-[T1:`customers_and_invoices.Financial_Transactions`]-()\nWITH T2, count(T1.invoice_number) AS cnt\nRETURN T2.invoice_number,T2.invoice_date\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the invoice number and invoice date corresponding to the invoice with the greatest number of transactions?",
        "answers": [
            [
                12,
                "2018-03-15 21:24:13"
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (invoices:`customers_and_invoices.Invoices`)\nRETURN count(*)",
        "question": "Count the number of invoices.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T1:`customers_and_invoices.Invoices`)-[]-(T2:`customers_and_invoices.Orders`)\nRETURN T1.invoice_date,T1.order_id,T2.order_details",
        "question": "Show invoice dates and order id and details for all invoices.",
        "answers": [
            [
                "2018-03-01 16:40:48",
                9,
                null
            ],
            [
                "2018-03-20 00:21:41",
                9,
                null
            ],
            [
                "2018-03-05 08:47:33",
                3,
                null
            ],
            [
                "2018-02-28 19:01:06",
                9,
                null
            ],
            [
                "2018-03-07 02:04:32",
                13,
                null
            ],
            [
                "2018-03-16 21:57:43",
                8,
                null
            ],
            [
                "2018-03-13 07:27:38",
                10,
                null
            ],
            [
                "2018-03-19 17:06:30",
                10,
                null
            ],
            [
                "2018-03-16 11:01:06",
                12,
                null
            ],
            [
                "2018-03-01 01:44:08",
                11,
                null
            ],
            [
                "2018-03-23 04:59:28",
                5,
                null
            ],
            [
                "2018-03-15 21:24:13",
                3,
                null
            ],
            [
                "2018-03-03 20:44:06",
                3,
                null
            ],
            [
                "2018-03-19 22:38:10",
                4,
                null
            ],
            [
                "2018-03-15 09:38:49",
                14,
                null
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T1:`customers_and_invoices.Invoices`)-[]-(T2:`customers_and_invoices.Orders`)\nRETURN T1.invoice_date,T1.order_id,T2.order_details",
        "question": "What are the invoice dates, order ids, and order details for all invoices?",
        "answers": [
            [
                "2018-03-01 16:40:48",
                9,
                null
            ],
            [
                "2018-03-20 00:21:41",
                9,
                null
            ],
            [
                "2018-03-05 08:47:33",
                3,
                null
            ],
            [
                "2018-02-28 19:01:06",
                9,
                null
            ],
            [
                "2018-03-07 02:04:32",
                13,
                null
            ],
            [
                "2018-03-16 21:57:43",
                8,
                null
            ],
            [
                "2018-03-13 07:27:38",
                10,
                null
            ],
            [
                "2018-03-19 17:06:30",
                10,
                null
            ],
            [
                "2018-03-16 11:01:06",
                12,
                null
            ],
            [
                "2018-03-01 01:44:08",
                11,
                null
            ],
            [
                "2018-03-23 04:59:28",
                5,
                null
            ],
            [
                "2018-03-15 21:24:13",
                3,
                null
            ],
            [
                "2018-03-03 20:44:06",
                3,
                null
            ],
            [
                "2018-03-19 22:38:10",
                4,
                null
            ],
            [
                "2018-03-15 09:38:49",
                14,
                null
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (invoices:`customers_and_invoices.Invoices`)\nRETURN invoices.order_id,count(*)",
        "question": "Show the order ids and the number of invoices for each order.",
        "answers": [
            [
                9,
                3
            ],
            [
                3,
                3
            ],
            [
                13,
                1
            ],
            [
                8,
                1
            ],
            [
                10,
                2
            ],
            [
                12,
                1
            ],
            [
                11,
                1
            ],
            [
                5,
                1
            ],
            [
                4,
                1
            ],
            [
                14,
                1
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (invoices:`customers_and_invoices.Invoices`)\nRETURN invoices.order_id,count(*)",
        "question": "How many invoices correspond to each order id?",
        "answers": [
            [
                9,
                3
            ],
            [
                3,
                3
            ],
            [
                13,
                1
            ],
            [
                8,
                1
            ],
            [
                10,
                2
            ],
            [
                12,
                1
            ],
            [
                11,
                1
            ],
            [
                5,
                1
            ],
            [
                4,
                1
            ],
            [
                14,
                1
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (T1:`customers_and_invoices.Invoices`)-[]-(T2:`customers_and_invoices.Orders`)\nWITH count(*) AS count, T2.order_details AS order_details, T2.order_id AS order_id\nWHERE count  > 2\nRETURN order_id,order_details",
        "question": "What is the order id and order details for the order more than two invoices.",
        "answers": [
            [
                9,
                null
            ],
            [
                3,
                null
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (order_items:`customers_and_invoices.Order_Items`)\nRETURN order_items.order_id,count(*)",
        "question": "Show the order ids and the number of items in each order.",
        "answers": [
            [
                4,
                3
            ],
            [
                15,
                2
            ],
            [
                1,
                2
            ],
            [
                2,
                1
            ],
            [
                13,
                4
            ],
            [
                10,
                1
            ],
            [
                14,
                1
            ],
            [
                12,
                1
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (order_items:`customers_and_invoices.Order_Items`)\nRETURN order_items.order_id,count(*)",
        "question": "How many order items correspond to each order id?",
        "answers": [
            [
                4,
                3
            ],
            [
                15,
                2
            ],
            [
                1,
                2
            ],
            [
                2,
                1
            ],
            [
                13,
                4
            ],
            [
                10,
                1
            ],
            [
                14,
                1
            ],
            [
                12,
                1
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (order_items:`customers_and_invoices.Order_Items`)\nRETURN order_items.product_id,count(DISTINCT order_items.order_id)",
        "question": "Show the product ids and the number of unique orders containing each product.",
        "answers": [
            [
                4,
                2
            ],
            [
                10,
                1
            ],
            [
                5,
                2
            ],
            [
                3,
                1
            ],
            [
                14,
                3
            ],
            [
                12,
                1
            ],
            [
                15,
                1
            ],
            [
                9,
                1
            ],
            [
                7,
                1
            ],
            [
                13,
                1
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (order_items:`customers_and_invoices.Order_Items`)\nRETURN order_items.product_id,count(DISTINCT order_items.order_id)",
        "question": "How many distinct order ids correspond to each product?",
        "answers": [
            [
                4,
                2
            ],
            [
                10,
                1
            ],
            [
                5,
                2
            ],
            [
                3,
                1
            ],
            [
                14,
                3
            ],
            [
                12,
                1
            ],
            [
                15,
                1
            ],
            [
                9,
                1
            ],
            [
                7,
                1
            ],
            [
                13,
                1
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (order_items:`customers_and_invoices.Order_Items`)\nRETURN order_items.order_id,count(DISTINCT order_items.product_id)",
        "question": "Show order ids and the number of products in each order.",
        "answers": [
            [
                4,
                3
            ],
            [
                15,
                2
            ],
            [
                1,
                2
            ],
            [
                2,
                1
            ],
            [
                13,
                3
            ],
            [
                10,
                1
            ],
            [
                14,
                1
            ],
            [
                12,
                1
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (order_items:`customers_and_invoices.Order_Items`)\nRETURN order_items.order_id,count(DISTINCT order_items.product_id)",
        "question": "How many different products correspond to each order id?",
        "answers": [
            [
                4,
                3
            ],
            [
                15,
                2
            ],
            [
                1,
                2
            ],
            [
                2,
                1
            ],
            [
                13,
                3
            ],
            [
                10,
                1
            ],
            [
                14,
                1
            ],
            [
                12,
                1
            ]
        ]
    },
    {
        "db_id": "wedding",
        "query": "MATCH (church:`wedding.church`)\nWHERE church.Open_Date < 1850\nRETURN count(*)",
        "question": "How many churches opened before 1850 are there?",
        "answers": [
            [
                9
            ]
        ]
    }
]