[
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.conference`)\nWHERE t1.name = 'VLDB'\nRETURN t2.citation_num",
        "question": "return me the citations of each paper in the VLDB conference .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.conference`)\nWHERE t1.name = 'VLDB'\nRETURN count(DISTINCT t2.title),t2.year",
        "question": "return me the number of papers published in the VLDB conference in each year .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.domain`)-[t1:`academic.domain_publication`]-(t3:`academic.publication`)\nWHERE t2.name = 'Databases'\nRETURN t3.title\nORDER BY t3.citation_num DESC\nLIMIT 1",
        "question": "return me the paper in Databases area with the most citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.journal`)\nWHERE t1.name = 'PVLDB'\nRETURN t2.title\nORDER BY t2.citation_num DESC\nLIMIT 1",
        "question": "return me the paper in PVLDB with the most citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.conference`)\nWHERE t1.name = 'VLDB'\nRETURN t2.title\nORDER BY t2.citation_num DESC\nLIMIT 1",
        "question": "return me the paper in VLDB conference with the most citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (publication:`academic.publication`)\nWHERE publication.year > 2000\nRETURN publication.title\nORDER BY publication.citation_num DESC\nLIMIT 1",
        "question": "return me the paper after 2000 with the most citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.domain`)-[t1:`academic.domain_publication`]-(t3:`academic.publication`)\nWHERE t2.name = 'Databases' AND t3.year > 2000\nRETURN t3.title\nORDER BY t3.citation_num DESC\nLIMIT 1",
        "question": "return me the paper after 2000 in Databases area with the most citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.journal`)\nWHERE t1.name = 'PVLDB' AND t2.year > 2000\nRETURN t2.title\nORDER BY t2.citation_num DESC\nLIMIT 1",
        "question": "return me the paper after 2000 in PVLDB with the most citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.conference`)\nWHERE t1.name = 'VLDB' AND t2.year > 2000\nRETURN t2.title\nORDER BY t2.citation_num DESC\nLIMIT 1",
        "question": "return me the paper after 2000 in VLDB conference with the most citations .",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (movie:`imdb.movie`)\nWHERE movie.title = 'The Imitation Game'\nRETURN movie.release_year",
        "question": "What year is the movie \" The Imitation Game \" from ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (movie:`imdb.movie`)\nWHERE movie.title = 'The Imitation Game'\nRETURN movie.release_year",
        "question": "What year was the movie \" The Imitation Game \" produced",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.name = 'Benedict Cumberbatch'\nRETURN actor.birth_year",
        "question": "What year was \" Benedict Cumberbatch \" born ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.name = 'Benedict Cumberbatch'\nRETURN actor.birth_year",
        "question": "In what year was \" Benedict Cumberbatch \" born",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.name = 'Christoph Waltz'\nRETURN actor.nationality",
        "question": "What is the nationality of the actress \" Christoph Waltz \" ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.name = 'Christoph Waltz'\nRETURN actor.nationality",
        "question": "What is the nationality of the actor \" Christoph Waltz \" ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (movie:`imdb.movie`)\nWHERE movie.release_year = 2015\nRETURN movie.title",
        "question": "Find all movies produced in 2015",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_city = 'Tehran'\nRETURN actor.name",
        "question": "Find all actors born in \" Tehran \"",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_city = 'Tehran'\nRETURN actor.name",
        "question": "Which actors were born in Tehran",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.nationality = 'Afghanistan'\nRETURN actor.name",
        "question": "Find all actors who are from Afghanistan",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.nationality = 'Afghanistan'\nRETURN actor.name",
        "question": "Find all actors from Afghanistan",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.nationality = 'Afghanistan'\nRETURN actor.name",
        "question": "Give me the name of all the actors from Afghanistan",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_year = 1984\nRETURN actor.name",
        "question": "Find all actors who were born in 1984",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.name = 'actor_name0'\nRETURN actor.birth_year",
        "question": "When was \" Kevin Spacey \" born ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.name = 'actor_name0'\nRETURN actor.birth_year",
        "question": "In what year was \" Kevin Spacey \" born ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (director:`imdb.director`)\nWHERE director.name = 'director_name0'\nRETURN director.birth_city",
        "question": "Where is the birth place of \" Kevin Spacey \"",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (director:`imdb.director`)\nWHERE director.name = 'director_name0'\nRETURN director.birth_city",
        "question": "In what city was \" Kevin Spacey \" born ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (director:`imdb.director`)\nWHERE director.name = 'director_name0'\nRETURN director.nationality",
        "question": "What is the nationality of \" Kevin Spacey \" ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (movie:`imdb.movie`)\nWHERE movie.title = 'Finding Nemo'\nRETURN movie.budget",
        "question": "How much was the budget of \" Finding Nemo \"",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t2.name = 'Steven Spielberg' AND t3.release_year > 2006\nRETURN t3.title",
        "question": "Find all movies directed by \" Steven Spielberg \" after 2006",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t3.title = 'James Bond'\nRETURN t2.name",
        "question": "Who is the director of the movie \" James Bond \" ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t3.title = 'James Bond'\nRETURN t2.name",
        "question": "Who directed the movie \" James Bond \" ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t3.title = 'James Bond'\nRETURN t2.name",
        "question": "List \" James Bond \" directors",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.genre`)-[]-(t1:`imdb.classification`)-[]-(t3:`imdb.movie`)\nWHERE t3.title = 'Jurassic Park'\nRETURN t2.genre",
        "question": "What is the genre of the movie \" Jurassic Park \" ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t3.release_year = 2015 AND t3.title = 'Joy'\nRETURN t2.name",
        "question": "Who was the director of the movie Joy from 2015 ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t1:`imdb.movie`)-[t3:`imdb.written_by`]-(t2:`imdb.writer`)\nWHERE t2.name = \"Matt Damon\"\nRETURN t1.title",
        "question": "Find all movies written by \" Matt Damon \"",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (movie:`imdb.movie`)\nWHERE movie.release_year = 2007 AND movie.title = 'Juno'\nRETURN movie.budget",
        "question": "What was the budget of the movie Juno from 2007 ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.genre`)-[]-(t1:`imdb.classification`)-[]-(t3:`imdb.movie`)\nWHERE t2.genre = \"Sci-Fi\" AND t3.release_year = 2010\nRETURN t3.title",
        "question": "Find all Sci-Fi produced in year 2010",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.genre`)-[]-(t1:`imdb.classification`)-[]-(t3:`imdb.movie`)\nWHERE t2.genre = \"Sci-Fi\" AND t3.release_year = 2010\nRETURN t3.title",
        "question": "List all the Sci-Fi movies which released in 2010",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_city = 'Austin' AND actor.birth_year > 1980\nRETURN actor.name",
        "question": "Find all actors born in \" Austin \" after 1980",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_city = 'Austin' AND actor.birth_year > 1980\nRETURN actor.name",
        "question": "Who are the actors born in \" Austin \" after 1980 ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_city = 'Austin' AND actor.birth_year > 1980\nRETURN actor.name",
        "question": "Find all actors from Austin born after 1980",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t2.birth_city = 'Los Angeles'\nRETURN t3.title",
        "question": "Find all movies by directors born in \" Los Angeles \"",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_city = 'New York City' AND actor.birth_year = 1984\nRETURN actor.name",
        "question": "Find all actors who were born in \" New York City \" in 1984",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.tags`)-[]-(t1:`imdb.keyword`)-[]-(t3:`imdb.movie`)\nWHERE t1.keyword = 'nuclear weapons'\nRETURN t3.title",
        "question": "Find all movies about nuclear weapons",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.tags`)-[]-(t1:`imdb.keyword`)-[]-(t3:`imdb.movie`)\nWHERE t1.keyword = 'nuclear weapons'\nRETURN t3.title",
        "question": "What are the movies related to nuclear weapons",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t2.name = 'Alfred Hitchcock'\nRETURN t3.title",
        "question": "Which movies did \" Alfred Hitchcock \" direct ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t1:`imdb.producer`)-[]-(t3:`imdb.made_by`)-[]-(t2:`imdb.tv_series`)\nWHERE t1.name = 'Shonda Rhimes'\nRETURN t2.title",
        "question": "What are all the tv series created by \" Shonda Rhimes \" ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t1:`imdb.movie`)-[t3:`imdb.written_by`]-(t2:`imdb.writer`)\nWHERE t1.title = 'The Truman Show'\nRETURN t2.name",
        "question": "Who is the writer of the movie \" The Truman Show \"",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t1:`imdb.movie`)-[t3:`imdb.written_by`]-(t2:`imdb.writer`)\nWHERE t1.title = 'The Truman Show'\nRETURN t2.name",
        "question": "Who is the writer of \" The Truman Show \"",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.tv_series`)\nWHERE t3.release_year = 2013 AND t3.title = 'House of Cards'\nRETURN t2.name",
        "question": "Who is the director of the tv series \" House of Cards \" from 2013 ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_city = 'Austin' AND actor.gender = 'female'\nRETURN actor.name",
        "question": "Find all the female actors from Austin",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_year > 1980 AND actor.nationality = 'Italy'\nRETURN actor.name",
        "question": "Find all actors from Italy born after 1980",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_city = 'New York City' AND actor.birth_year > 1980 AND actor.gender = 'female'\nRETURN actor.name",
        "question": "Find all the female actors born in \" New York City \" after 1980",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (director:`imdb.director`)\nWHERE director.nationality = 'Afghanistan'\nRETURN director.name",
        "question": "Find all the directors who are from Afghanistan",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t3.title = 'The Past'\nRETURN t2.birth_city",
        "question": "where is the director of \" The Past \" from",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t5:`imdb.director`)-[]-(t2:`imdb.directed_by`)-[]-(t4:`imdb.movie`)-[]-(t1:`imdb.classification`)-[]-(t3:`imdb.genre`)\nWHERE t5.name = 'Asghar Farhadi'\nRETURN t3.genre",
        "question": "what are the genres of movies directed by \" Asghar Farhadi \"",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t3:`imdb.director`)-[]-(t2:`imdb.directed_by`)-[]-(t4:`imdb.movie`)-[]-(t5:`imdb.tags`)-[]-(t1:`imdb.keyword`)\nWHERE t1.keyword = 'nuclear weapons'\nRETURN t3.name",
        "question": "List all the directors of movies about nuclear weapons",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t2.name = 'Steven Spielberg'\nRETURN count(DISTINCT t3.title)",
        "question": "How many movies did \" Steven Spielberg \" direct ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "imdb",
        "query": "MATCH (movie:`imdb.movie`)\nWHERE movie.release_year = 2013\nRETURN count(DISTINCT movie.title)",
        "question": "How many movies were produced in the year 2013 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "imdb",
        "query": "MATCH (movie:`imdb.movie`)\nWHERE movie.release_year = 2013\nRETURN count(DISTINCT movie.title)",
        "question": "What is the number of movies produced in 2013 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t2.name = 'Woody Allen'\nRETURN count(DISTINCT t3.title),t3.release_year",
        "question": "What is the number of movies directed by \" Woody Allen \" per year ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_city = 'Los Angeles' AND actor.birth_year > 2000\nRETURN count(DISTINCT actor.name)",
        "question": "How many actors were born in \" Los Angeles \" after 2000 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.tags`)-[]-(t1:`imdb.keyword`)-[]-(t3:`imdb.movie`)\nWHERE t1.keyword = 'Iraq war' AND t3.release_year = 2015\nRETURN count(DISTINCT t3.title)",
        "question": "How many movies about Iraq war were produced in 2015 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.tags`)-[]-(t1:`imdb.keyword`)-[]-(t3:`imdb.movie`)\nWHERE t1.keyword = 'Persians' AND t3.release_year > 1990\nRETURN count(DISTINCT t3.title)",
        "question": "How many movies about Persians were released after 1990 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t2.name = 'Quentin Tarantino' AND t3.release_year > 2010\nRETURN count(DISTINCT t3.title)",
        "question": "How many movies did \" Quentin Tarantino \" direct after 2010 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t2.name = 'Quentin Tarantino' AND t3.release_year < 2010\nRETURN count(DISTINCT t3.title)",
        "question": "How many movies did \" Quentin Tarantino \" direct before 2010 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t3:`imdb.director`)-[]-(t2:`imdb.directed_by`)-[]-(t4:`imdb.movie`)-[]-(t5:`imdb.made_by`)-[]-(t1:`imdb.producer`)\nWHERE t3.name = 'Quentin Tarantino' AND t4.release_year < 2010 AND t4.release_year > 2002\nRETURN count(DISTINCT t4.title)",
        "question": "How many movies did \" Quentin Tarantino \" direct before 2002 and after 2010 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "imdb",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_city = 'New York City' AND actor.birth_year > 1980 AND actor.gender = 'female'\nRETURN count(DISTINCT actor.name)",
        "question": "How many female actors were born in \" New York City \" after 1980 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t5:`imdb.director`)-[]-(t2:`imdb.directed_by`)-[]-(t1:`imdb.directed_by`)-[]-(t4:`imdb.movie`)-[]-(t3:`imdb.movie`)\nWHERE t4.title = 'Revolutionary Road'\nRETURN t3.title",
        "question": "What movies have the same director as the movie \" Revolutionary Road \" ?",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t2.name = 'Quentin Tarantino'\nRETURN t3.budget,t3.title\nORDER BY t3.release_year DESC\nLIMIT 1",
        "question": "Find the name and budget of the latest movie by \" Quentin Tarantino \"",
        "answers": []
    },
    {
        "db_id": "imdb",
        "query": "MATCH (t2:`imdb.director`)-[]-(t1:`imdb.directed_by`)-[]-(t3:`imdb.movie`)\nWHERE t2.name = 'Jim Jarmusch'\nRETURN t3.title\nORDER BY t3.release_year DESC\nLIMIT 1",
        "question": "What is the latest movie by \" Jim Jarmusch \"",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t1.NAME = 'buttercup kitchen'\nRETURN count(*)",
        "question": "how many buttercup kitchen are there in san francisco ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)\nWHERE t2.REGION = 'bay area' AND t1.FOOD_TYPE = 'chinese'\nRETURN count(*)",
        "question": "how many chinese restaurants are there in the bay area ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)\nWHERE t2.REGION = 'bay area' AND t1.FOOD_TYPE = 'chinese'\nRETURN count(*)",
        "question": "how many places for chinese food are there in the bay area ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)\nWHERE t2.REGION = 'bay area' AND t1.FOOD_TYPE = 'chinese'\nRETURN count(*)",
        "question": "how many chinese places are there in the bay area ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)\nWHERE t2.REGION = 'bay area' AND t1.FOOD_TYPE = 'chinese'\nRETURN count(*)",
        "question": "how many places for chinese are there in the bay area ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)\nWHERE t2.COUNTY = 'santa cruz county' AND t1.NAME = 'jamerican cuisine'\nRETURN count(*)",
        "question": "how many jamerican cuisine are there in santa cruz county ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t1.NAME = 'jamerican cuisine'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is jamerican cuisine ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)-[]-(t3:`restaurants.LOCATION`)\nWHERE t2.REGION = 'bay area' AND t1.NAME = 'denny'\nRETURN t3.HOUSE_NUMBER,t1.NAME",
        "question": "where is denny in the bay area ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'bethel island' AND t2.STREET_NAME = 'bethel island rd' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "what are some good restaurants on bethel island rd in bethel island ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'bethel island' AND t2.STREET_NAME = 'bethel island rd' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some good restaurants on bethel island rd in bethel island ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'bethel island' AND t2.STREET_NAME = 'bethel island rd' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a good restaurant on bethel island rd in bethel island ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'bethel island' AND t2.STREET_NAME = 'bethel island rd' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "what is a good restaurant on bethel island rd in bethel island ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'alameda'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where can we find a restaurant in alameda ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'alameda'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a restaurant in alameda ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'alameda'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where can we find some restaurants in alameda ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'alameda'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is a restaurant in alameda ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'alameda'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some restaurants in alameda ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t1.FOOD_TYPE = 'french' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some restaurants good for french food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t1.FOOD_TYPE = 'french' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where are some restaurants good for french food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'palo alto' AND t1.FOOD_TYPE = 'french'\nRETURN count(*)",
        "question": "how many places for french food are there in palo alto ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'palo alto' AND t1.FOOD_TYPE = 'french'\nRETURN count(*)",
        "question": "how many french restaurants are there in palo alto ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'palo alto' AND t1.FOOD_TYPE = 'french'\nRETURN count(*)",
        "question": "how many french restaurant are there in palo alto ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'palo alto' AND t1.FOOD_TYPE = 'french'\nRETURN count(*)",
        "question": "how many places for french are there in palo alto ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)\nWHERE t2.COUNTY = 'yolo county' AND t1.FOOD_TYPE = 'italian'\nRETURN count(*)",
        "question": "how many italian restaurants are in the yolo county ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'french'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where can i eat french food in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)\nWHERE t2.REGION = 'bay area' AND t1.NAME = 'denny'\nRETURN count(*)",
        "question": "how many denny are there in the bay area ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'alameda' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a good restaurant in alameda ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'alameda' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "what are some good restaurants in alameda ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'alameda' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "what is a good restaurant in alameda ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'alameda' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some good restaurants in alameda ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is a good restaurant on buchanan in san francisco for arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where are some good arabics on buchanan in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is a good arabic restaurant on buchanan in san francisco ?",
        "answers": []
    }
]