[
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.election`)-[]-(T2:`election.party`)\nWHERE T2.Party = 'Democratic'\nRETURN T1.Committee",
        "question": "Return all the committees that have delegates from Democratic party.",
        "answers": [
            [
                "Appropriations"
            ],
            [
                "Appropriations"
            ],
            [
                "Economic Matters"
            ],
            [
                "Environmental Matters"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.election`)-[]-(T2:`election.party`)\nWHERE T2.Party = 'Democratic'\nRETURN T1.Committee",
        "question": "Which committees have delegates from the Democratic party?",
        "answers": [
            [
                "Appropriations"
            ],
            [
                "Appropriations"
            ],
            [
                "Economic Matters"
            ],
            [
                "Environmental Matters"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.county`)-[]-(T2:`election.election`)\nRETURN T1.County_name,count(*)",
        "question": "Show the name of each county along with the corresponding number of delegates from that county.",
        "answers": [
            [
                "Howard",
                3
            ],
            [
                "Baltimore County",
                2
            ],
            [
                "Colony",
                2
            ],
            [
                "Mansfield",
                1
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.county`)-[]-(T2:`election.election`)\nRETURN T1.County_name,count(*)",
        "question": "For each county, find the name of the county and the number of delegates from that county.",
        "answers": [
            [
                "Howard",
                3
            ],
            [
                "Baltimore County",
                2
            ],
            [
                "Colony",
                2
            ],
            [
                "Mansfield",
                1
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name\nORDER BY county.Population ASC",
        "question": "Return the names of all counties sorted by population in ascending order.",
        "answers": [
            [
                "Manning"
            ],
            [
                "Howard"
            ],
            [
                "Colony"
            ],
            [
                "Mansfield"
            ],
            [
                "Baltimore County"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name\nORDER BY county.Population ASC",
        "question": "Sort the names of all counties in ascending order of population.",
        "answers": [
            [
                "Manning"
            ],
            [
                "Howard"
            ],
            [
                "Colony"
            ],
            [
                "Mansfield"
            ],
            [
                "Baltimore County"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name\nORDER BY county.County_name DESC",
        "question": "Return the names of all counties sorted by county name in descending alphabetical order.",
        "answers": [
            [
                "Mansfield"
            ],
            [
                "Manning"
            ],
            [
                "Howard"
            ],
            [
                "Colony"
            ],
            [
                "Baltimore County"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name\nORDER BY county.County_name DESC",
        "question": "Sort the names of all counties in descending alphabetical order.",
        "answers": [
            [
                "Mansfield"
            ],
            [
                "Manning"
            ],
            [
                "Howard"
            ],
            [
                "Colony"
            ],
            [
                "Baltimore County"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name\nORDER BY county.Population DESC\nLIMIT 1",
        "question": "Show the name of the county with the biggest population.",
        "answers": [
            [
                "Baltimore County"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name\nORDER BY county.Population DESC\nLIMIT 1",
        "question": "Which county has the largest population? Give me the name of the county.",
        "answers": [
            [
                "Baltimore County"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name\nORDER BY county.Population ASC\nLIMIT 3",
        "question": "Show the 3 counties with the smallest population.",
        "answers": [
            [
                "Manning"
            ],
            [
                "Howard"
            ],
            [
                "Colony"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name\nORDER BY county.Population ASC\nLIMIT 3",
        "question": "What are the 3 counties that have the smallest population? Give me the county names.",
        "answers": [
            [
                "Manning"
            ],
            [
                "Howard"
            ],
            [
                "Colony"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.county`)-[]-(T2:`election.election`)\nWITH count(*) AS count, T1.County_name AS County_name\nWHERE count  >= 2\nRETURN County_name",
        "question": "Show the names of counties that have at least two delegates.",
        "answers": [
            [
                "Howard"
            ],
            [
                "Baltimore County"
            ],
            [
                "Colony"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.county`)-[]-(T2:`election.election`)\nWITH count(*) AS count, T1.County_name AS County_name\nWHERE count  >= 2\nRETURN County_name",
        "question": "Which counties have two or more delegates? Give me the county names.",
        "answers": [
            [
                "Howard"
            ],
            [
                "Baltimore County"
            ],
            [
                "Colony"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (party:`election.party`)\nWITH count(*) AS count, party.Party AS Party\nWHERE count  >= 2\nRETURN Party",
        "question": "Show the name of the party that has at least two records.",
        "answers": [
            [
                "Democratic"
            ],
            [
                "Independence"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (party:`election.party`)\nWITH count(*) AS count, party.Party AS Party\nWHERE count  >= 2\nRETURN Party",
        "question": "Which party has two or more records?",
        "answers": [
            [
                "Democratic"
            ],
            [
                "Independence"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.election`)-[]-(T2:`election.party`)\nWITH count(T1.Party) AS cnt, T2\nRETURN T2.Party\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Show the name of the party that has the most delegates.",
        "answers": [
            [
                "Democratic"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.election`)-[]-(T2:`election.party`)\nWITH count(T1.Party) AS cnt, T2\nRETURN T2.Party\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Which party has the largest number of delegates?",
        "answers": [
            [
                "Democratic"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (party:`election.party`)\nWHERE NOT (party)-[]-(:`election.election`)    \nRETURN party.Party",
        "question": "What are the names of parties that do not have delegates in election?",
        "answers": [
            [
                "Democratic"
            ],
            [
                "Independence"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (party:`election.party`)\nWHERE NOT (party)-[]-(:`election.election`)    \nRETURN party.Party",
        "question": "Which parties did not have any delegates in elections?",
        "answers": [
            [
                "Democratic"
            ],
            [
                "Independence"
            ]
        ]
    },
    {
        "db_id": "news_report",
        "query": "MATCH (journalist:`news_report.journalist`)\nRETURN count(*)",
        "question": "How many journalists are there?",
        "answers": [
            [
                11
            ]
        ]
    },
    {
        "db_id": "news_report",
        "query": "MATCH (journalist:`news_report.journalist`)\nRETURN journalist.Name\nORDER BY journalist.Years_working ASC",
        "question": "List the names of journalists in ascending order of years working.",
        "answers": [
            [
                "Tom Briggs"
            ],
            [
                "Ray Ferris"
            ],
            [
                "Fred Keenor"
            ],
            [
                "George Gilchrist"
            ],
            [
                "Fred Chandler"
            ],
            [
                "John Meaney"
            ],
            [
                "Jack Meaney"
            ],
            [
                "Frank Mitcheson"
            ],
            [
                "Herbert Swindells"
            ],
            [
                "Tony Waddington"
            ],
            [
                "Jackie Waring"
            ]
        ]
    },
    {
        "db_id": "news_report",
        "query": "MATCH (journalist:`news_report.journalist`)\nRETURN journalist.Nationality,journalist.Age",
        "question": "What are the nationalities and ages of journalists?",
        "answers": [
            [
                "England",
                "37"
            ],
            [
                "Wales",
                "27"
            ],
            [
                "England",
                "28"
            ],
            [
                "England",
                "43"
            ],
            [
                "England",
                "34"
            ],
            [
                "Northern Ireland",
                "29"
            ],
            [
                "England",
                "28"
            ],
            [
                "England",
                "43"
            ],
            [
                "England",
                "37"
            ],
            [
                "England",
                "33"
            ],
            [
                "England",
                "25"
            ]
        ]
    },
    {
        "db_id": "news_report",
        "query": "MATCH (journalist:`news_report.journalist`)\nWHERE journalist.Nationality = 'England' OR journalist.Nationality = 'Wales'\nRETURN journalist.Name",
        "question": "Show the names of journalists from \"England\" or \"Wales\".",
        "answers": [
            [
                "Herbert Swindells"
            ],
            [
                "Fred Keenor"
            ],
            [
                "George Gilchrist"
            ],
            [
                "Jackie Waring"
            ],
            [
                "Fred Chandler"
            ],
            [
                "John Meaney"
            ],
            [
                "Tony Waddington"
            ],
            [
                "Jack Meaney"
            ],
            [
                "Frank Mitcheson"
            ],
            [
                "Tom Briggs"
            ]
        ]
    },
    {
        "db_id": "news_report",
        "query": "MATCH (journalist:`news_report.journalist`)\nRETURN journalist.Nationality\nORDER BY journalist.Years_working DESC\nLIMIT 1",
        "question": "What is the nationality of the journalist with the largest number of years working?",
        "answers": [
            [
                "England"
            ]
        ]
    },
    {
        "db_id": "news_report",
        "query": "MATCH (journalist:`news_report.journalist`)\nRETURN journalist.Nationality,count(*)",
        "question": "Show the different nationalities and the number of journalists of each nationality.",
        "answers": [
            [
                "England",
                9
            ],
            [
                "Wales",
                1
            ],
            [
                "Northern Ireland",
                1
            ]
        ]
    },
    {
        "db_id": "news_report",
        "query": "MATCH (event:`news_report.event`)\nRETURN event.Date,event.Name,event.Venue\nORDER BY event.Event_Attendance DESC",
        "question": "Show the dates, places, and names of events in descending order of the attendance.",
        "answers": [
            [
                "13 October 2008",
                "Olympia Games Openning",
                "Marathon"
            ],
            [
                "20 June 2018",
                "Global Awarding",
                "Platense"
            ],
            [
                "7 October 2010",
                "Public Debating",
                "Motagua"
            ],
            [
                "11 October 2007",
                "Government Hearing",
                "Victoria"
            ],
            [
                "9 April 2014",
                "Special Exhibition",
                "Hispano"
            ]
        ]
    },
    {
        "db_id": "news_report",
        "query": "MATCH (T2:`news_report.event`)-[T1:`news_report.news_report`]-(T3:`news_report.journalist`)\nRETURN T3.Name,T2.Date",
        "question": "Show the names of journalists and the dates of the events they reported.",
        "answers": [
            [
                "Ray Ferris",
                "13 October 2008"
            ],
            [
                "Jackie Waring",
                "13 October 2008"
            ],
            [
                "Jackie Waring",
                "11 October 2007"
            ],
            [
                "Herbert Swindells",
                "7 October 2010"
            ],
            [
                "Tony Waddington",
                "20 June 2018"
            ],
            [
                "Tom Briggs",
                "9 April 2014"
            ],
            [
                "John Meaney",
                "9 April 2014"
            ]
        ]
    },
    {
        "db_id": "news_report",
        "query": "MATCH (T2:`news_report.event`)-[T1:`news_report.news_report`]-(T3:`news_report.journalist`)\nRETURN T3.Name,T2.Name\nORDER BY T2.Event_Attendance ASC",
        "question": "Show the names of journalists and the names of the events they reported in ascending order",
        "answers": [
            [
                "Tom Briggs",
                "Special Exhibition"
            ],
            [
                "John Meaney",
                "Special Exhibition"
            ],
            [
                "Jackie Waring",
                "Government Hearing"
            ],
            [
                "Herbert Swindells",
                "Public Debating"
            ],
            [
                "Tony Waddington",
                "Global Awarding"
            ],
            [
                "Ray Ferris",
                "Olympia Games Openning"
            ],
            [
                "Jackie Waring",
                "Olympia Games Openning"
            ]
        ]
    },
    {
        "db_id": "news_report",
        "query": "MATCH (T2:`news_report.event`)-[T1:`news_report.news_report`]-(T3:`news_report.journalist`)\nRETURN T3.Name,count(*)",
        "question": "Show the names of journalists and the number of events they reported.",
        "answers": [
            [
                "Ray Ferris",
                1
            ],
            [
                "Jackie Waring",
                2
            ],
            [
                "Herbert Swindells",
                1
            ],
            [
                "Tony Waddington",
                1
            ],
            [
                "Tom Briggs",
                1
            ],
            [
                "John Meaney",
                1
            ]
        ]
    },
    {
        "db_id": "news_report",
        "query": "MATCH (T2:`news_report.event`)-[T1:`news_report.news_report`]-(T3:`news_report.journalist`)\nWITH T3.Name AS Name, count(*) AS count\nWHERE count  > 1\nRETURN Name",
        "question": "Show the names of journalists that have reported more than one event.",
        "answers": [
            [
                "Jackie Waring"
            ]
        ]
    },
    {
        "db_id": "news_report",
        "query": "MATCH (event:`news_report.event`)\nRETURN avg(event.Event_Attendance),max(event.Event_Attendance)",
        "question": "what are the average and maximum attendances of all events?",
        "answers": [
            [
                2255.0,
                6650
            ]
        ]
    },
    {
        "db_id": "news_report",
        "query": "MATCH (event:`news_report.event`)\nRETURN event.Venue,event.Name\nORDER BY event.Event_Attendance DESC\nLIMIT 2",
        "question": "List the event venues and names that have the top 2 most number of people attended.",
        "answers": [
            [
                "Marathon",
                "Olympia Games Openning"
            ],
            [
                "Platense",
                "Global Awarding"
            ]
        ]
    },
    {
        "db_id": "restaurant_1",
        "query": "MATCH (restaurant:`restaurant_1.Restaurant`)\nRETURN restaurant.ResName",
        "question": "Show me all the restaurants.",
        "answers": [
            [
                "Subway"
            ],
            [
                "Honeygrow"
            ]
        ]
    },
    {
        "db_id": "restaurant_1",
        "query": "MATCH (restaurant_type:`restaurant_1.Restaurant_Type`)\nRETURN restaurant_type.ResTypeName",
        "question": "List all restaurant types.",
        "answers": [
            [
                "Sandwich"
            ],
            [
                "Stir-fry"
            ]
        ]
    },
    {
        "db_id": "restaurant_1",
        "query": "MATCH (restaurant:`restaurant_1.Restaurant`)\nRETURN restaurant.ResName,restaurant.Rating\nORDER BY restaurant.Rating DESC\nLIMIT 1",
        "question": "Which restaurants have highest rating? List the restaurant name and its rating.",
        "answers": [
            [
                "Honeygrow",
                4
            ]
        ]
    },
    {
        "db_id": "restaurant_1",
        "query": "MATCH (student:`restaurant_1.Student`)\nWHERE student.Major = 600\nRETURN student.Fname,student.LName",
        "question": "List all students' first names and last names who majored in 600.",
        "answers": [
            [
                "Linda",
                "Smith"
            ],
            [
                "Tracy",
                "Kim"
            ],
            [
                "Shiela",
                "Jones"
            ],
            [
                "Dinesh",
                "Kumar"
            ],
            [
                "Paul",
                "Gompers"
            ],
            [
                "Andy",
                "Schultz"
            ],
            [
                "Lisa",
                "Apap"
            ],
            [
                "Jandy",
                "Nelson"
            ],
            [
                "Eric",
                "Tai"
            ],
            [
                "Derek",
                "Lee"
            ],
            [
                "David",
                "Adams"
            ],
            [
                "Steven",
                "Davis"
            ],
            [
                "Charles",
                "Norris"
            ],
            [
                "Susan",
                "Lee"
            ],
            [
                "Mark",
                "Schwartz"
            ],
            [
                "Bruce",
                "Wilson"
            ],
            [
                "Michael",
                "Leighton"
            ],
            [
                "Arthur",
                "Pang"
            ]
        ]
    },
    {
        "db_id": "restaurant_1",
        "query": "MATCH (student:`restaurant_1.Student`)\nWHERE student.Age > 18 AND student.Major = 600\nRETURN student.Fname,student.LName",
        "question": "Which student's age is older than 18 and is majoring in 600? List each student's first and last name.",
        "answers": [
            [
                "Tracy",
                "Kim"
            ],
            [
                "Shiela",
                "Jones"
            ],
            [
                "Dinesh",
                "Kumar"
            ],
            [
                "Paul",
                "Gompers"
            ],
            [
                "Jandy",
                "Nelson"
            ],
            [
                "Eric",
                "Tai"
            ],
            [
                "David",
                "Adams"
            ],
            [
                "Steven",
                "Davis"
            ],
            [
                "Bruce",
                "Wilson"
            ],
            [
                "Michael",
                "Leighton"
            ]
        ]
    },
    {
        "db_id": "restaurant_1",
        "query": "MATCH (student:`restaurant_1.Student`)\nWHERE student.Age > 18 AND student.Major <> 600 AND student.Sex = 'F'\nRETURN student.Fname,student.LName",
        "question": "List all female students age is older than 18 who is not majoring in 600. List students' first name and last name.",
        "answers": [
            [
                "Lisa",
                "Cheng"
            ],
            [
                "Sarah",
                "Smith"
            ],
            [
                "Sarah",
                "Schmidt"
            ]
        ]
    },
    {
        "db_id": "customer_deliveries",
        "query": "MATCH (actual_orders:`customer_deliveries.Actual_Orders`)\nWHERE actual_orders.order_status_code = 'Success'\nRETURN actual_orders.actual_order_id",
        "question": "Find the ids of orders whose status is 'Success'.",
        "answers": [
            [
                1
            ],
            [
                6
            ],
            [
                7
            ],
            [
                9
            ],
            [
                10
            ]
        ]
    },
    {
        "db_id": "customer_deliveries",
        "query": "MATCH (customers:`customer_deliveries.Customers`)\nRETURN count(*)",
        "question": "Find the number of customers in total.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "customer_deliveries",
        "query": "MATCH (trucks:`customer_deliveries.Trucks`)\nRETURN trucks.truck_details\nORDER BY trucks.truck_licence_number",
        "question": "Show the details of all trucks in the order of their license number.",
        "answers": [
            [
                "Laverna"
            ],
            [
                "Kaya"
            ],
            [
                "Deon"
            ],
            [
                "Ricky"
            ],
            [
                "Randy"
            ],
            [
                "Holly"
            ],
            [
                "Rosamond"
            ],
            [
                "Frida"
            ],
            [
                "Queen"
            ],
            [
                "Rebeka"
            ],
            [
                "Luisa"
            ],
            [
                "Bud"
            ],
            [
                "Joanny"
            ],
            [
                "Efren"
            ],
            [
                "Stacy"
            ]
        ]
    },
    {
        "db_id": "customer_deliveries",
        "query": "MATCH (products:`customer_deliveries.Products`)\nRETURN products.product_name\nORDER BY products.product_price DESC\nLIMIT 1",
        "question": "Find the name of the most expensive product.",
        "answers": [
            [
                "books"
            ]
        ]
    },
    {
        "db_id": "customer_deliveries",
        "query": "MATCH (customers:`customer_deliveries.Customers`)\nWHERE customers.payment_method = 'Visa'\nRETURN customers.customer_email,customers.customer_name",
        "question": "List the names and emails of customers who payed by Visa card.",
        "answers": [
            [
                "shaniya45@example.net",
                "Ron Emard"
            ],
            [
                "dedric17@example.org",
                "Jaden Lang"
            ],
            [
                "elmira.langworth@example.org",
                "Geovanni Grady"
            ],
            [
                "reichel.winnifred@example.org",
                "Dr. Karine Farrell"
            ],
            [
                "leann.hamill@example.org",
                "Lila Howe"
            ],
            [
                "danika49@example.com",
                "Amalia Hudson DDS"
            ],
            [
                "adriana83@example.org",
                "Annabell Walsh"
            ],
            [
                "rollin95@example.net",
                "Aracely Borer V"
            ]
        ]
    },
    {
        "db_id": "customer_deliveries",
        "query": "MATCH (t1:`customer_deliveries.Customers`)-[t2:`customer_deliveries.Customer_Addresses`]-(t3:`customer_deliveries.Addresses`)\nWHERE t3.state_province_county = 'California'\nRETURN t1.customer_name,t1.customer_phone",
        "question": "Find the names and phone numbers of customers living in California state.",
        "answers": [
            [
                "Annabell Walsh",
                "(881)096-1281x6448"
            ],
            [
                "Verda Streich",
                "06730471330"
            ]
        ]
    },
    {
        "db_id": "customer_deliveries",
        "query": "MATCH (customers:`customer_deliveries.Customers`)\nRETURN customers.customer_name,customers.customer_phone,customers.customer_email\nORDER BY customers.date_became_customer",
        "question": "List the names, phone numbers, and emails of all customers sorted by their dates of becoming customers.",
        "answers": [
            [
                "Verda Streich",
                "06730471330",
                "xgraham@example.org"
            ],
            [
                "Jaden Lang",
                "361.151.3489x7272",
                "dedric17@example.org"
            ],
            [
                "Dr. Karine Farrell",
                "+49(2)0677806107",
                "reichel.winnifred@example.org"
            ],
            [
                "Ron Emard",
                "1-382-503-5179x53639",
                "shaniya45@example.net"
            ],
            [
                "Gabe Schroeder",
                "1-728-537-4293x0885",
                "alexandra91@example.net"
            ],
            [
                "Candace Schneider",
                "940.575.3682x7959",
                "tkassulke@example.com"
            ],
            [
                "Keenan Kuhic",
                "686-517-9923x348",
                "dallin76@example.org"
            ],
            [
                "Emmanuel Reilly",
                "129.959.6420",
                "gleichner.ethelyn@example.net"
            ],
            [
                "Lila Howe",
                "1-492-284-1097",
                "leann.hamill@example.org"
            ],
            [
                "Amalia Hudson DDS",
                "003-991-1506x483",
                "danika49@example.com"
            ],
            [
                "Rusty Morar",
                "1-123-197-9677x7194",
                "njenkins@example.org"
            ],
            [
                "Aracely Borer V",
                "531-617-3230",
                "rollin95@example.net"
            ],
            [
                "Patience Yundt",
                "969-208-8932x715",
                "kira82@example.com"
            ],
            [
                "Geovanni Grady",
                "1-005-644-2495",
                "elmira.langworth@example.org"
            ],
            [
                "Annabell Walsh",
                "(881)096-1281x6448",
                "adriana83@example.org"
            ]
        ]
    },
    {
        "db_id": "customer_deliveries",
        "query": "MATCH (customers:`customer_deliveries.Customers`)\nRETURN customers.customer_name\nORDER BY customers.date_became_customer\nLIMIT 5",
        "question": "Find the name of the first 5 customers.",
        "answers": [
            [
                "Verda Streich"
            ],
            [
                "Jaden Lang"
            ],
            [
                "Dr. Karine Farrell"
            ],
            [
                "Ron Emard"
            ],
            [
                "Gabe Schroeder"
            ]
        ]
    },
    {
        "db_id": "customer_deliveries",
        "query": "MATCH (customers:`customer_deliveries.Customers`)\nRETURN customers.payment_method\nORDER BY customers.payment_method DESC\nLIMIT 1",
        "question": "Find the payment method that is used most frequently.",
        "answers": [
            [
                "Visa"
            ]
        ]
    },
    {
        "db_id": "customer_deliveries",
        "query": "MATCH (delivery_routes:`customer_deliveries.Delivery_Routes`)\nRETURN delivery_routes.route_name\nORDER BY delivery_routes.route_name",
        "question": "List the names of all routes in alphabetic order.",
        "answers": [
            [
                "Abshire Ltd"
            ],
            [
                "Adams, Macejkovic and Carroll"
            ],
            [
                "Brekke, Powlowski and Fritsch"
            ],
            [
                "Gerhold Inc"
            ],
            [
                "Gorczany Group"
            ],
            [
                "Grady, King and Price"
            ],
            [
                "Hegmann-Waters"
            ],
            [
                "Heidenreich Group"
            ],
            [
                "Hermiston, Feeney and Daugherty"
            ],
            [
                "Huel, Armstrong and Senger"
            ],
            [
                "Nader, Leuschke and Huels"
            ],
            [
                "Renner-Kovacek"
            ],
            [
                "Schowalter Group"
            ],
            [
                "Streich, Spencer and Brakus"
            ],
            [
                "Torphy Ltd"
            ]
        ]
    }
]