[
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWHERE 8000<=employees.SALARY<=12000\nRETURN employees.PHONE_NUMBER",
        "question": "Return the phone numbers of employees with salaries between 8000 and 12000.",
        "answers": [
            [
                "590.423.4567"
            ],
            [
                "515.124.4569"
            ],
            [
                "515.124.4169"
            ],
            [
                "515.124.4269"
            ],
            [
                "515.127.4561"
            ],
            [
                "650.123.1234"
            ],
            [
                "650.123.2234"
            ],
            [
                "011.44.1344.429278"
            ],
            [
                "011.44.1344.619268"
            ],
            [
                "011.44.1344.429018"
            ],
            [
                "011.44.1344.129268"
            ],
            [
                "011.44.1344.345268"
            ],
            [
                "011.44.1344.478968"
            ],
            [
                "011.44.1344.498718"
            ],
            [
                "011.44.1345.429268"
            ],
            [
                "011.44.1345.929268"
            ],
            [
                "011.44.1345.829268"
            ],
            [
                "011.44.1345.729268"
            ],
            [
                "011.44.1346.129268"
            ],
            [
                "011.44.1346.229268"
            ],
            [
                "011.44.1343.929268"
            ],
            [
                "011.44.1343.829268"
            ],
            [
                "011.44.1343.729268"
            ],
            [
                "011.44.1644.429267"
            ],
            [
                "011.44.1644.429266"
            ],
            [
                "011.44.1644.429265"
            ],
            [
                "011.44.1644.429264"
            ],
            [
                "515.123.8888"
            ],
            [
                "515.123.8080"
            ],
            [
                "515.123.8181"
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWHERE '2007-11-05'<=employees.HIRE_DATE<='2009-07-05'\nRETURN employees.JOB_ID,employees.HIRE_DATE",
        "question": "Find job id and date of hire for those employees who was hired between November 5th, 2007 and July 5th, 2009.",
        "answers": []
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWHERE '2007-11-05'<=employees.HIRE_DATE<='2009-07-05'\nRETURN employees.JOB_ID,employees.HIRE_DATE",
        "question": "What are the job ids and dates of hire for employees hired after November 5th, 2007 and before July 5th, 2009?",
        "answers": []
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWHERE employees.DEPARTMENT_ID = 70 OR employees.DEPARTMENT_ID = 90\nRETURN employees.FIRST_NAME,employees.LAST_NAME",
        "question": "What are the first and last name for those employees who works either in department 70 or 90?",
        "answers": [
            [
                "Steven",
                "King"
            ],
            [
                "Neena",
                "Kochhar"
            ],
            [
                "Lex",
                "De Haan"
            ],
            [
                "Hermann",
                "Baer"
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWHERE employees.DEPARTMENT_ID = 70 OR employees.DEPARTMENT_ID = 90\nRETURN employees.FIRST_NAME,employees.LAST_NAME",
        "question": "What are the full names of employees who with in department 70 or 90?",
        "answers": [
            [
                "Steven",
                "King"
            ],
            [
                "Neena",
                "Kochhar"
            ],
            [
                "Lex",
                "De Haan"
            ],
            [
                "Hermann",
                "Baer"
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (jobs:`hr_1.jobs`)\nWHERE jobs.MIN_SALARY > 9000\nRETURN jobs.JOB_TITLE",
        "question": "display the job title of jobs which minimum salary is greater than 9000.",
        "answers": [
            [
                "President"
            ],
            [
                "Administration Vice President"
            ],
            [
                "Sales Manager"
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (jobs:`hr_1.jobs`)\nWHERE jobs.MIN_SALARY > 9000\nRETURN jobs.JOB_TITLE",
        "question": "Which job titles correspond to jobs with salaries over 9000?",
        "answers": [
            [
                "President"
            ],
            [
                "Administration Vice President"
            ],
            [
                "Sales Manager"
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (job_history:`hr_1.job_history`)\nRETURN job_history.EMPLOYEE_ID,max(job_history.END_DATE)",
        "question": "display the employee ID for each employee and the date on which he ended his previous job.",
        "answers": [
            [
                102,
                "1998-07-24"
            ],
            [
                101,
                "1997-03-15"
            ],
            [
                201,
                "1999-12-19"
            ],
            [
                114,
                "1999-12-31"
            ],
            [
                122,
                "1999-12-31"
            ],
            [
                200,
                "1998-12-31"
            ],
            [
                176,
                "1999-12-31"
            ],
            [
                0,
                "0000-00-00"
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (job_history:`hr_1.job_history`)\nRETURN job_history.EMPLOYEE_ID,max(job_history.END_DATE)",
        "question": "What are the employee ids for each employee and final dates of employment at their last job?",
        "answers": [
            [
                102,
                "1998-07-24"
            ],
            [
                101,
                "1997-03-15"
            ],
            [
                201,
                "1999-12-19"
            ],
            [
                114,
                "1999-12-31"
            ],
            [
                122,
                "1999-12-31"
            ],
            [
                200,
                "1998-12-31"
            ],
            [
                176,
                "1999-12-31"
            ],
            [
                0,
                "0000-00-00"
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWITH count(employees.COMMISSION_PCT) AS count, employees.DEPARTMENT_ID AS DEPARTMENT_ID\nWHERE count > 10\nRETURN DEPARTMENT_ID",
        "question": "display those departments where more than ten employees work who got a commission percentage.",
        "answers": [
            [
                50
            ],
            [
                80
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWITH count(employees.COMMISSION_PCT) AS count, employees.DEPARTMENT_ID AS DEPARTMENT_ID\nWHERE count > 10\nRETURN DEPARTMENT_ID",
        "question": "What are the department ids for which more than 10 employees had a commission?",
        "answers": [
            [
                50
            ],
            [
                80
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWITH employees.DEPARTMENT_ID AS DEPARTMENT_ID, count(employees.EMPLOYEE_ID) AS count\nWHERE count >= 4\nRETURN DISTINCT DEPARTMENT_ID",
        "question": "Find the ids of the departments where any manager is managing 4 or more employees.",
        "answers": [
            [
                60
            ],
            [
                100
            ],
            [
                30
            ],
            [
                50
            ],
            [
                80
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWITH employees.DEPARTMENT_ID AS DEPARTMENT_ID, count(employees.EMPLOYEE_ID) AS count\nWHERE count >= 4\nRETURN DISTINCT DEPARTMENT_ID",
        "question": "What are department ids for departments with managers managing more than 3 employees?",
        "answers": [
            [
                60
            ],
            [
                100
            ],
            [
                30
            ],
            [
                50
            ],
            [
                80
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWHERE exists(employees.COMMISSION_PCT)\nRETURN employees.DEPARTMENT_ID,avg(employees.SALARY)",
        "question": "display the average salary of employees for each department who gets a commission percentage.",
        "answers": [
            [
                90,
                19333.333333333332
            ],
            [
                60,
                5760.0
            ],
            [
                100,
                8600.0
            ],
            [
                30,
                4150.0
            ],
            [
                50,
                3475.5555555555557
            ],
            [
                80,
                8955.882352941177
            ],
            [
                0,
                7000.0
            ],
            [
                10,
                4400.0
            ],
            [
                20,
                9500.0
            ],
            [
                40,
                6500.0
            ],
            [
                70,
                10000.0
            ],
            [
                110,
                10150.0
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWHERE exists(employees.COMMISSION_PCT)\nRETURN employees.DEPARTMENT_ID,avg(employees.SALARY)",
        "question": "What is the average salary of employees who have a commission percentage that is not null?",
        "answers": [
            [
                90,
                19333.333333333332
            ],
            [
                60,
                5760.0
            ],
            [
                100,
                8600.0
            ],
            [
                30,
                4150.0
            ],
            [
                50,
                3475.5555555555557
            ],
            [
                80,
                8955.882352941177
            ],
            [
                0,
                7000.0
            ],
            [
                10,
                4400.0
            ],
            [
                20,
                9500.0
            ],
            [
                40,
                6500.0
            ],
            [
                70,
                10000.0
            ],
            [
                110,
                10150.0
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (locations:`hr_1.locations`)\nRETURN locations.COUNTRY_ID,count(*)",
        "question": "display the country ID and number of cities for each country.",
        "answers": [
            [
                "IT",
                2
            ],
            [
                "JP",
                2
            ],
            [
                "US",
                4
            ],
            [
                "CA",
                2
            ],
            [
                "CN",
                1
            ],
            [
                "IN",
                1
            ],
            [
                "AU",
                1
            ],
            [
                "SG",
                1
            ],
            [
                "UK",
                2
            ],
            [
                "Ox",
                1
            ],
            [
                "DE",
                1
            ],
            [
                "BR",
                1
            ],
            [
                "CH",
                2
            ],
            [
                "NL",
                1
            ],
            [
                "\"",
                1
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (locations:`hr_1.locations`)\nRETURN locations.COUNTRY_ID,count(*)",
        "question": "Give the country id and corresponding count of cities in each country.",
        "answers": [
            [
                "IT",
                2
            ],
            [
                "JP",
                2
            ],
            [
                "US",
                4
            ],
            [
                "CA",
                2
            ],
            [
                "CN",
                1
            ],
            [
                "IN",
                1
            ],
            [
                "AU",
                1
            ],
            [
                "SG",
                1
            ],
            [
                "UK",
                2
            ],
            [
                "Ox",
                1
            ],
            [
                "DE",
                1
            ],
            [
                "BR",
                1
            ],
            [
                "CH",
                2
            ],
            [
                "NL",
                1
            ],
            [
                "\"",
                1
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (job_history:`hr_1.job_history`)\nWITH count(*) AS count, job_history.EMPLOYEE_ID AS EMPLOYEE_ID\nWHERE count  >= 2\nRETURN EMPLOYEE_ID",
        "question": "display the ID for those employees who did two or more jobs in the past.",
        "answers": [
            [
                101
            ],
            [
                200
            ],
            [
                176
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (job_history:`hr_1.job_history`)\nWITH count(*) AS count, job_history.EMPLOYEE_ID AS EMPLOYEE_ID\nWHERE count  >= 2\nRETURN EMPLOYEE_ID",
        "question": "What are the employee ids for employees who have held two or more jobs?",
        "answers": [
            [
                101
            ],
            [
                200
            ],
            [
                176
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (T1:`hr_1.employees`)-[]-(T2:`hr_1.departments`)\nRETURN T2.DEPARTMENT_NAME,count(*)",
        "question": "display the department name and number of employees in each of the department.",
        "answers": [
            [
                "Administration",
                1
            ],
            [
                "Marketing",
                2
            ],
            [
                "Purchasing",
                6
            ],
            [
                "Human Resources",
                1
            ],
            [
                "Shipping",
                45
            ],
            [
                "IT",
                5
            ],
            [
                "Public Relations",
                1
            ],
            [
                "Sales",
                34
            ],
            [
                "Executive",
                3
            ],
            [
                "Finance",
                6
            ],
            [
                "Accounting",
                2
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (T1:`hr_1.employees`)-[]-(T2:`hr_1.departments`)\nRETURN T2.DEPARTMENT_NAME,count(*)",
        "question": "Give the name of each department and the number of employees in each.",
        "answers": [
            [
                "Administration",
                1
            ],
            [
                "Marketing",
                2
            ],
            [
                "Purchasing",
                6
            ],
            [
                "Human Resources",
                1
            ],
            [
                "Shipping",
                45
            ],
            [
                "IT",
                5
            ],
            [
                "Public Relations",
                1
            ],
            [
                "Sales",
                34
            ],
            [
                "Executive",
                3
            ],
            [
                "Finance",
                6
            ],
            [
                "Accounting",
                2
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nRETURN min(employees.SALARY),employees.DEPARTMENT_ID",
        "question": "return the smallest salary for every departments.",
        "answers": [
            [
                17000,
                90
            ],
            [
                4200,
                60
            ],
            [
                6900,
                100
            ],
            [
                2500,
                30
            ],
            [
                2100,
                50
            ],
            [
                6100,
                80
            ],
            [
                7000,
                0
            ],
            [
                4400,
                10
            ],
            [
                6000,
                20
            ],
            [
                6500,
                40
            ],
            [
                10000,
                70
            ],
            [
                8300,
                110
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nRETURN min(employees.SALARY),employees.DEPARTMENT_ID",
        "question": "What is the minimum salary in each department?",
        "answers": [
            [
                17000,
                90
            ],
            [
                4200,
                60
            ],
            [
                6900,
                100
            ],
            [
                2500,
                30
            ],
            [
                2100,
                50
            ],
            [
                6100,
                80
            ],
            [
                7000,
                0
            ],
            [
                4400,
                10
            ],
            [
                6000,
                20
            ],
            [
                6500,
                40
            ],
            [
                10000,
                70
            ],
            [
                8300,
                110
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWITH avg(employees.SALARY) AS salary\nMATCH (employees:`hr_1.employees`)\nWHERE  employees.SALARY >  salary \nRETURN employees.EMPLOYEE_ID",
        "question": "Find the employee id for all employees who earn more than the average salary.",
        "answers": [
            [
                100
            ],
            [
                101
            ],
            [
                102
            ],
            [
                103
            ],
            [
                108
            ],
            [
                109
            ],
            [
                110
            ],
            [
                111
            ],
            [
                112
            ],
            [
                113
            ],
            [
                114
            ],
            [
                120
            ],
            [
                121
            ],
            [
                122
            ],
            [
                123
            ],
            [
                145
            ],
            [
                146
            ],
            [
                147
            ],
            [
                148
            ],
            [
                149
            ],
            [
                150
            ],
            [
                151
            ],
            [
                152
            ],
            [
                153
            ],
            [
                154
            ],
            [
                155
            ],
            [
                156
            ],
            [
                157
            ],
            [
                158
            ],
            [
                159
            ],
            [
                160
            ],
            [
                161
            ],
            [
                162
            ],
            [
                163
            ],
            [
                164
            ],
            [
                165
            ],
            [
                168
            ],
            [
                169
            ],
            [
                170
            ],
            [
                171
            ],
            [
                172
            ],
            [
                174
            ],
            [
                175
            ],
            [
                176
            ],
            [
                177
            ],
            [
                178
            ],
            [
                201
            ],
            [
                203
            ],
            [
                204
            ],
            [
                205
            ],
            [
                206
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWITH avg(employees.SALARY) AS salary\nMATCH (employees:`hr_1.employees`)\nWHERE  employees.SALARY >  salary \nRETURN employees.EMPLOYEE_ID",
        "question": "What are the employee ids for employees who make more than the average?",
        "answers": [
            [
                100
            ],
            [
                101
            ],
            [
                102
            ],
            [
                103
            ],
            [
                108
            ],
            [
                109
            ],
            [
                110
            ],
            [
                111
            ],
            [
                112
            ],
            [
                113
            ],
            [
                114
            ],
            [
                120
            ],
            [
                121
            ],
            [
                122
            ],
            [
                123
            ],
            [
                145
            ],
            [
                146
            ],
            [
                147
            ],
            [
                148
            ],
            [
                149
            ],
            [
                150
            ],
            [
                151
            ],
            [
                152
            ],
            [
                153
            ],
            [
                154
            ],
            [
                155
            ],
            [
                156
            ],
            [
                157
            ],
            [
                158
            ],
            [
                159
            ],
            [
                160
            ],
            [
                161
            ],
            [
                162
            ],
            [
                163
            ],
            [
                164
            ],
            [
                165
            ],
            [
                168
            ],
            [
                169
            ],
            [
                170
            ],
            [
                171
            ],
            [
                172
            ],
            [
                174
            ],
            [
                175
            ],
            [
                176
            ],
            [
                177
            ],
            [
                178
            ],
            [
                201
            ],
            [
                203
            ],
            [
                204
            ],
            [
                205
            ],
            [
                206
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (T1:`hr_1.employees`)-[]-(T2:`hr_1.departments`)\nRETURN DISTINCT T2.DEPARTMENT_NAME",
        "question": "find the name of all departments that do actually have one or more employees assigned to them.",
        "answers": [
            [
                "Administration"
            ],
            [
                "Marketing"
            ],
            [
                "Purchasing"
            ],
            [
                "Human Resources"
            ],
            [
                "Shipping"
            ],
            [
                "IT"
            ],
            [
                "Public Relations"
            ],
            [
                "Sales"
            ],
            [
                "Executive"
            ],
            [
                "Finance"
            ],
            [
                "Accounting"
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (T1:`hr_1.employees`)-[]-(T2:`hr_1.departments`)\nRETURN DISTINCT T2.DEPARTMENT_NAME",
        "question": "What are the names of departments that have at least one employee.",
        "answers": [
            [
                "Administration"
            ],
            [
                "Marketing"
            ],
            [
                "Purchasing"
            ],
            [
                "Human Resources"
            ],
            [
                "Shipping"
            ],
            [
                "IT"
            ],
            [
                "Public Relations"
            ],
            [
                "Sales"
            ],
            [
                "Executive"
            ],
            [
                "Finance"
            ],
            [
                "Accounting"
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (job_history:`hr_1.job_history`)\nWITH count(*) AS count, job_history.EMPLOYEE_ID AS EMPLOYEE_ID\nWHERE count  >= 2\nRETURN EMPLOYEE_ID",
        "question": "What are the employee ids for those who had two or more jobs.",
        "answers": [
            [
                101
            ],
            [
                200
            ],
            [
                176
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWITH employees.DEPARTMENT_ID AS DEPARTMENT_ID, count(employees.EMPLOYEE_ID) AS count\nWHERE count >= 4\nRETURN DISTINCT DEPARTMENT_ID",
        "question": "What are the unique ids of those departments where any manager is managing 4 or more employees.",
        "answers": [
            [
                60
            ],
            [
                100
            ],
            [
                30
            ],
            [
                50
            ],
            [
                80
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWITH employees.DEPARTMENT_ID AS DEPARTMENT_ID, count(employees.EMPLOYEE_ID) AS count\nWHERE count >= 4\nRETURN DISTINCT DEPARTMENT_ID",
        "question": "Give the distinct department ids of departments in which a manager is in charge of 4 or more employees?",
        "answers": [
            [
                60
            ],
            [
                100
            ],
            [
                30
            ],
            [
                50
            ],
            [
                80
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWITH employees.JOB_ID AS JOB_ID, avg(employees.SALARY) AS avg\nWHERE avg > 8000\nRETURN JOB_ID",
        "question": "Find the job ID for those jobs which average salary is above 8000.",
        "answers": [
            [
                "AD_PRES"
            ],
            [
                "AD_VP"
            ],
            [
                "FI_MGR"
            ],
            [
                "PU_MAN"
            ],
            [
                "SA_MAN"
            ],
            [
                "SA_REP"
            ],
            [
                "MK_MAN"
            ],
            [
                "PR_REP"
            ],
            [
                "AC_MGR"
            ],
            [
                "AC_ACCOUNT"
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWITH employees.JOB_ID AS JOB_ID, avg(employees.SALARY) AS avg\nWHERE avg > 8000\nRETURN JOB_ID",
        "question": "What are the job ids corresponding to jobs with average salary above 8000?",
        "answers": [
            [
                "AD_PRES"
            ],
            [
                "AD_VP"
            ],
            [
                "FI_MGR"
            ],
            [
                "PU_MAN"
            ],
            [
                "SA_MAN"
            ],
            [
                "SA_REP"
            ],
            [
                "MK_MAN"
            ],
            [
                "PR_REP"
            ],
            [
                "AC_MGR"
            ],
            [
                "AC_ACCOUNT"
            ]
        ]
    }
]