[
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nWHERE NOT (film)-[]-(:`film_rank.film_market_estimation`)    \nRETURN film.Title",
        "question": "What are the titles of films that do not have a film market estimation?",
        "answers": [
            [
                "Porky's"
            ],
            [
                "Star Trek II: The Wrath of Khan"
            ],
            [
                "48 Hrs"
            ],
            [
                "Poltergeist"
            ],
            [
                "The Best Little Whorehouse in Texas"
            ],
            [
                "Annie"
            ],
            [
                "The Verdict"
            ],
            [
                "Gandhi"
            ],
            [
                "First Blood"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nWITH film.Studio AS Studio, avg(film.Gross_in_dollar) AS avg\nWHERE avg >= 4500000\nRETURN Studio",
        "question": "List the studios which average gross is above 4500000.",
        "answers": [
            [
                "Universal"
            ],
            [
                "Columbia"
            ],
            [
                "Paramount / Lorimar"
            ],
            [
                "United Artists"
            ],
            [
                "20th Century Fox"
            ],
            [
                "Paramount"
            ],
            [
                "MGM"
            ],
            [
                "Universal / RKO"
            ],
            [
                "Columbia / Rastar"
            ],
            [
                "Orion / Carolco"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nWITH film.Studio AS Studio, avg(film.Gross_in_dollar) AS avg\nWHERE avg >= 4500000\nRETURN Studio",
        "question": "Which studios have an average gross of over 4500000?",
        "answers": [
            [
                "Universal"
            ],
            [
                "Columbia"
            ],
            [
                "Paramount / Lorimar"
            ],
            [
                "United Artists"
            ],
            [
                "20th Century Fox"
            ],
            [
                "Paramount"
            ],
            [
                "MGM"
            ],
            [
                "Universal / RKO"
            ],
            [
                "Columbia / Rastar"
            ],
            [
                "Orion / Carolco"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (ref_calendar:`cre_Doc_Tracking_DB.Ref_Calendar`)\nRETURN count(*)",
        "question": "Count the number of all the calendar items.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (ref_calendar:`cre_Doc_Tracking_DB.Ref_Calendar`)\nRETURN ref_calendar.Calendar_Date,ref_calendar.Day_Number",
        "question": "Show all calendar dates and day Numbers.",
        "answers": [
            [
                "1972-03-31 09:47:22",
                5
            ],
            [
                "1976-06-15 03:40:06",
                7
            ],
            [
                "1985-05-13 12:19:43",
                7
            ],
            [
                "1986-10-14 17:53:39",
                1
            ],
            [
                "1987-11-05 06:11:22",
                3
            ],
            [
                "1988-02-01 14:41:52",
                8
            ],
            [
                "1994-11-15 03:49:54",
                9
            ],
            [
                "1995-01-01 03:52:11",
                1
            ],
            [
                "1997-03-10 15:24:00",
                7
            ],
            [
                "2007-05-28 16:28:48",
                2
            ],
            [
                "2008-06-08 12:45:38",
                3
            ],
            [
                "2009-08-18 03:29:08",
                8
            ],
            [
                "2010-11-26 19:22:50",
                7
            ],
            [
                "2012-07-03 09:48:46",
                7
            ],
            [
                "2017-01-06 23:17:22",
                8
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (ref_calendar:`cre_Doc_Tracking_DB.Ref_Calendar`)\nRETURN ref_calendar.Calendar_Date,ref_calendar.Day_Number",
        "question": "What are all the calendar dates and day Numbers?",
        "answers": [
            [
                "1972-03-31 09:47:22",
                5
            ],
            [
                "1976-06-15 03:40:06",
                7
            ],
            [
                "1985-05-13 12:19:43",
                7
            ],
            [
                "1986-10-14 17:53:39",
                1
            ],
            [
                "1987-11-05 06:11:22",
                3
            ],
            [
                "1988-02-01 14:41:52",
                8
            ],
            [
                "1994-11-15 03:49:54",
                9
            ],
            [
                "1995-01-01 03:52:11",
                1
            ],
            [
                "1997-03-10 15:24:00",
                7
            ],
            [
                "2007-05-28 16:28:48",
                2
            ],
            [
                "2008-06-08 12:45:38",
                3
            ],
            [
                "2009-08-18 03:29:08",
                8
            ],
            [
                "2010-11-26 19:22:50",
                7
            ],
            [
                "2012-07-03 09:48:46",
                7
            ],
            [
                "2017-01-06 23:17:22",
                8
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (ref_document_types:`cre_Doc_Tracking_DB.Ref_Document_Types`)\nRETURN count(*)",
        "question": "Show the number of document types.",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (ref_document_types:`cre_Doc_Tracking_DB.Ref_Document_Types`)\nRETURN ref_document_types.Document_Type_Code,ref_document_types.Document_Type_Name",
        "question": "List all document type codes and document type names.",
        "answers": [
            [
                "CV",
                "CV"
            ],
            [
                "BK",
                "Book"
            ],
            [
                "PR",
                "Paper"
            ],
            [
                "RV",
                "Review"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (ref_document_types:`cre_Doc_Tracking_DB.Ref_Document_Types`)\nRETURN ref_document_types.Document_Type_Code,ref_document_types.Document_Type_Name",
        "question": "What are all the document type codes and document type names?",
        "answers": [
            [
                "CV",
                "CV"
            ],
            [
                "BK",
                "Book"
            ],
            [
                "PR",
                "Paper"
            ],
            [
                "RV",
                "Review"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (all_documents:`cre_Doc_Tracking_DB.All_Documents`)\nWHERE all_documents.Document_Name = \"Marry CV\"\nRETURN all_documents.Date_Stored",
        "question": "What is the date when the document \"Marry CV\" was stored?",
        "answers": [
            [
                "1986-10-14 17:53:39"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (all_documents:`cre_Doc_Tracking_DB.All_Documents`)\nWHERE all_documents.Document_Name = \"Marry CV\"\nRETURN all_documents.Date_Stored",
        "question": "When was the document named \"Marry CV\" stored? Give me the date.",
        "answers": [
            [
                "1986-10-14 17:53:39"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (T1:`cre_Doc_Tracking_DB.All_Documents`)-[]-(T2:`cre_Doc_Tracking_DB.Ref_Calendar`)\nRETURN T2.Day_Number,T1.Date_Stored",
        "question": "What is the day Number and date of all the documents?",
        "answers": [
            [
                7,
                "1976-06-15 03:40:06"
            ],
            [
                1,
                "1986-10-14 17:53:39"
            ],
            [
                3,
                "2008-06-08 12:45:38"
            ],
            [
                7,
                "2012-07-03 09:48:46"
            ],
            [
                7,
                "2012-07-03 09:48:46"
            ],
            [
                1,
                "1995-01-01 03:52:11"
            ],
            [
                3,
                "2008-06-08 12:45:38"
            ],
            [
                3,
                "1987-11-05 06:11:22"
            ],
            [
                3,
                "2008-06-08 12:45:38"
            ],
            [
                7,
                "1997-03-10 15:24:00"
            ],
            [
                7,
                "1997-03-10 15:24:00"
            ],
            [
                8,
                "2009-08-18 03:29:08"
            ],
            [
                7,
                "1976-06-15 03:40:06"
            ],
            [
                7,
                "1976-06-15 03:40:06"
            ],
            [
                7,
                "1997-03-10 15:24:00"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (T1:`cre_Doc_Tracking_DB.All_Documents`)-[]-(T2:`cre_Doc_Tracking_DB.Ref_Calendar`)\nRETURN T2.Day_Number,T1.Date_Stored",
        "question": "Return the day Number and stored date for all the documents.",
        "answers": [
            [
                7,
                "1976-06-15 03:40:06"
            ],
            [
                1,
                "1986-10-14 17:53:39"
            ],
            [
                3,
                "2008-06-08 12:45:38"
            ],
            [
                7,
                "2012-07-03 09:48:46"
            ],
            [
                7,
                "2012-07-03 09:48:46"
            ],
            [
                1,
                "1995-01-01 03:52:11"
            ],
            [
                3,
                "2008-06-08 12:45:38"
            ],
            [
                3,
                "1987-11-05 06:11:22"
            ],
            [
                3,
                "2008-06-08 12:45:38"
            ],
            [
                7,
                "1997-03-10 15:24:00"
            ],
            [
                7,
                "1997-03-10 15:24:00"
            ],
            [
                8,
                "2009-08-18 03:29:08"
            ],
            [
                7,
                "1976-06-15 03:40:06"
            ],
            [
                7,
                "1976-06-15 03:40:06"
            ],
            [
                7,
                "1997-03-10 15:24:00"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (T1:`cre_Doc_Tracking_DB.All_Documents`)-[]-(T2:`cre_Doc_Tracking_DB.Ref_Document_Types`)\nWHERE T1.Document_Name = \"How to read a book\"\nRETURN T2.Document_Type_Name",
        "question": "What is the document type name for the document with name \"How to read a book\"?",
        "answers": [
            [
                "Book"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (T1:`cre_Doc_Tracking_DB.All_Documents`)-[]-(T2:`cre_Doc_Tracking_DB.Ref_Document_Types`)\nWHERE T1.Document_Name = \"How to read a book\"\nRETURN T2.Document_Type_Name",
        "question": "Find the document type name of the document named \"How to read a book\".",
        "answers": [
            [
                "Book"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (ref_locations:`cre_Doc_Tracking_DB.Ref_Locations`)\nRETURN count(*)",
        "question": "Show the number of locations.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (ref_locations:`cre_Doc_Tracking_DB.Ref_Locations`)\nRETURN ref_locations.Location_Code,ref_locations.Location_Name",
        "question": "List all location codes and location names.",
        "answers": [
            [
                "b",
                "Brazil"
            ],
            [
                "c",
                "Canada"
            ],
            [
                "e",
                "Edinburgh"
            ],
            [
                "n",
                "Nanjing"
            ],
            [
                "x",
                "Xiamen"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (roles:`cre_Doc_Tracking_DB.Roles`)\nRETURN count(*)",
        "question": "Count the total number of roles listed.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (roles:`cre_Doc_Tracking_DB.Roles`)\nRETURN roles.Role_Code,roles.Role_Name,roles.Role_Description",
        "question": "List all role codes, role names, and role descriptions.",
        "answers": [
            [
                "MG",
                "Manager",
                "Vero harum corrupti odit ipsa vero et odio. Iste et recusandae temporibus maxime. Magni aspernatur fugit quis explicabo totam esse corrupti."
            ],
            [
                "ED",
                "Editor",
                "Itaque dolor ut nemo rerum vitae provident. Vel laborum ipsum velit sint. Et est omnis dignissimos."
            ],
            [
                "PT",
                "Photo",
                "Aut modi nihil molestias temporibus sit rerum. Sit neque eaque odio omnis incidunt."
            ],
            [
                "PR",
                "Proof Reader",
                "Ut sed quae eaque mollitia qui hic. Natus ea expedita et odio illum fugiat qui natus. Consequatur velit ut dolorem cum ullam esse deserunt dignissimos. Enim non non rem officiis quis."
            ],
            [
                "HR",
                "Human Resource",
                "Et totam est quibusdam aspernatur ut. Vitae perferendis eligendi voluptatem molestiae rem ut enim. Ipsum expedita quae earum unde est. Repellendus ut ipsam nihil accusantium sit. Magni accusantium numquam quod et."
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (roles:`cre_Doc_Tracking_DB.Roles`)\nWHERE roles.Role_Name = \"Proof Reader\"\nRETURN roles.Role_Description",
        "question": "Show the description for role name \"Proof Reader\".",
        "answers": [
            [
                "Ut sed quae eaque mollitia qui hic. Natus ea expedita et odio illum fugiat qui natus. Consequatur velit ut dolorem cum ullam esse deserunt dignissimos. Enim non non rem officiis quis."
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (roles:`cre_Doc_Tracking_DB.Roles`)\nWHERE roles.Role_Name = \"Proof Reader\"\nRETURN roles.Role_Description",
        "question": "What is the description of the role named \"Proof Reader\"?",
        "answers": [
            [
                "Ut sed quae eaque mollitia qui hic. Natus ea expedita et odio illum fugiat qui natus. Consequatur velit ut dolorem cum ullam esse deserunt dignissimos. Enim non non rem officiis quis."
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nRETURN count(*)",
        "question": "Find the number of employees we have.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nWHERE employees.Employee_Name = 'Armani'\nRETURN employees.Employee_Name,employees.Role_Code,employees.Date_of_Birth",
        "question": "Show the name, role code, and date of birth for the employee with name 'Armani'.",
        "answers": [
            [
                "Armani",
                "ED",
                "1988-12-08 06:13:33"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nRETURN employees.Role_Code,count(*)",
        "question": "Show all role codes and the number of employees in each role.",
        "answers": [
            [
                "HR",
                1
            ],
            [
                "MG",
                1
            ],
            [
                "ED",
                7
            ],
            [
                "PT",
                1
            ],
            [
                "PR",
                5
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nRETURN employees.Role_Code,count(*)",
        "question": "What is the code of each role and the number of employees in each role?",
        "answers": [
            [
                "HR",
                1
            ],
            [
                "MG",
                1
            ],
            [
                "ED",
                7
            ],
            [
                "PT",
                1
            ],
            [
                "PR",
                5
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nWITH employees.Role_Code AS Role_Code, count(*) AS count\nWHERE count  >= 3\nRETURN Role_Code",
        "question": "Show all role codes with at least 3 employees.",
        "answers": [
            [
                "ED"
            ],
            [
                "PR"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nWITH employees.Role_Code AS Role_Code, count(*) AS count\nWHERE count  >= 3\nRETURN Role_Code",
        "question": "What are the roles with three or more employees? Give me the role codes.",
        "answers": [
            [
                "ED"
            ],
            [
                "PR"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (document_locations:`cre_Doc_Tracking_DB.Document_Locations`)\nRETURN DISTINCT document_locations.Location_Code",
        "question": "Give me all the distinct location codes for documents.",
        "answers": [
            [
                "e"
            ],
            [
                "x"
            ],
            [
                "c"
            ],
            [
                "b"
            ],
            [
                "n"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (T1:`cre_Doc_Tracking_DB.All_Documents`)-[]-(T2:`cre_Doc_Tracking_DB.Document_Locations`)-[]-(T3:`cre_Doc_Tracking_DB.Ref_Locations`)\nWHERE T1.Document_Name = \"Robin CV\"\nRETURN T3.Location_Name",
        "question": "Show the location name for document \"Robin CV\".",
        "answers": [
            [
                "Edinburgh"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (T1:`cre_Doc_Tracking_DB.All_Documents`)-[]-(T2:`cre_Doc_Tracking_DB.Document_Locations`)-[]-(T3:`cre_Doc_Tracking_DB.Ref_Locations`)\nWHERE T1.Document_Name = \"Robin CV\"\nRETURN T3.Location_Name",
        "question": "What is the location name of the document \"Robin CV\"?",
        "answers": [
            [
                "Edinburgh"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (document_locations:`cre_Doc_Tracking_DB.Document_Locations`)\nRETURN document_locations.Location_Code,document_locations.Date_in_Location_From,document_locations.Date_in_Locaton_To",
        "question": "Show the location code, the starting date and ending data in that location for all the documents.",
        "answers": [
            [
                "e",
                "2017-01-06 23:17:22",
                "2008-06-08 12:45:38"
            ],
            [
                "x",
                "2017-01-06 23:17:22",
                "2012-07-03 09:48:46"
            ],
            [
                "c",
                "1972-03-31 09:47:22",
                "1987-11-05 06:11:22"
            ],
            [
                "c",
                "2017-01-06 23:17:22",
                "2010-11-26 19:22:50"
            ],
            [
                "x",
                "2008-06-08 12:45:38",
                "1976-06-15 03:40:06"
            ],
            [
                "x",
                "1986-10-14 17:53:39",
                "2010-11-26 19:22:50"
            ],
            [
                "b",
                "2017-01-06 23:17:22",
                "1995-01-01 03:52:11"
            ],
            [
                "b",
                "1985-05-13 12:19:43",
                "1986-10-14 17:53:39"
            ],
            [
                "b",
                "1986-10-14 17:53:39",
                "2010-11-26 19:22:50"
            ],
            [
                "x",
                "1997-03-10 15:24:00",
                "1976-06-15 03:40:06"
            ],
            [
                "e",
                "1972-03-31 09:47:22",
                "1987-11-05 06:11:22"
            ],
            [
                "e",
                "2010-11-26 19:22:50",
                "2017-01-06 23:17:22"
            ],
            [
                "n",
                "2017-01-06 23:17:22",
                "1997-03-10 15:24:00"
            ],
            [
                "x",
                "1972-03-31 09:47:22",
                "2009-08-18 03:29:08"
            ],
            [
                "e",
                "2009-08-18 03:29:08",
                "1986-10-14 17:53:39"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (document_locations:`cre_Doc_Tracking_DB.Document_Locations`)\nRETURN document_locations.Location_Code,count(*)",
        "question": "Show the location codes and the number of documents in each location.",
        "answers": [
            [
                "e",
                4
            ],
            [
                "x",
                5
            ],
            [
                "c",
                2
            ],
            [
                "b",
                3
            ],
            [
                "n",
                1
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (document_locations:`cre_Doc_Tracking_DB.Document_Locations`)\nRETURN document_locations.Location_Code\nORDER BY document_locations.Location_Code DESC\nLIMIT 1",
        "question": "Find the code of the location with the largest number of documents.",
        "answers": [
            [
                "x"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (document_locations:`cre_Doc_Tracking_DB.Document_Locations`)\nWITH count(*) AS count, document_locations.Location_Code AS Location_Code\nWHERE count  >= 3\nRETURN Location_Code",
        "question": "Show the location codes with at least 3 documents.",
        "answers": [
            [
                "e"
            ],
            [
                "x"
            ],
            [
                "b"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (documents_to_be_destroyed:`cre_Doc_Tracking_DB.Documents_to_be_Destroyed`)\nRETURN documents_to_be_destroyed.Destruction_Authorised_by_Employee_ID,count(*)",
        "question": "Show the id of each employee and the number of document destruction authorised by that employee.",
        "answers": [
            [
                156,
                2
            ],
            [
                55,
                3
            ],
            [
                183,
                3
            ],
            [
                38,
                1
            ],
            [
                123,
                1
            ],
            [
                30,
                1
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (documents_to_be_destroyed:`cre_Doc_Tracking_DB.Documents_to_be_Destroyed`)\nRETURN documents_to_be_destroyed.Destruction_Authorised_by_Employee_ID,count(*)",
        "question": "What are the id of each employee and the number of document destruction authorised by that employee?",
        "answers": [
            [
                156,
                2
            ],
            [
                55,
                3
            ],
            [
                183,
                3
            ],
            [
                38,
                1
            ],
            [
                123,
                1
            ],
            [
                30,
                1
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (documents_to_be_destroyed:`cre_Doc_Tracking_DB.Documents_to_be_Destroyed`)\nRETURN documents_to_be_destroyed.Destroyed_by_Employee_ID,count(*)",
        "question": "Show the employee ids and the number of documents destroyed by each employee.",
        "answers": [
            [
                138,
                1
            ],
            [
                173,
                3
            ],
            [
                156,
                1
            ],
            [
                136,
                2
            ],
            [
                99,
                2
            ],
            [
                38,
                1
            ],
            [
                55,
                1
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (documents_to_be_destroyed:`cre_Doc_Tracking_DB.Documents_to_be_Destroyed`)\nRETURN DISTINCT documents_to_be_destroyed.Destruction_Authorised_by_Employee_ID",
        "question": "Show the ids of all employees who have authorized destruction.",
        "answers": [
            [
                156
            ],
            [
                55
            ],
            [
                183
            ],
            [
                38
            ],
            [
                123
            ],
            [
                30
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Tracking_DB",
        "query": "MATCH (documents_to_be_destroyed:`cre_Doc_Tracking_DB.Documents_to_be_Destroyed`)\nRETURN DISTINCT documents_to_be_destroyed.Destroyed_by_Employee_ID",
        "question": "Show the ids of all employees who have destroyed a document.",
        "answers": [
            [
                138
            ],
            [
                173
            ],
            [
                156
            ],
            [
                136
            ],
            [
                99
            ],
            [
                38
            ],
            [
                55
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (club:`club_1.Club`)\nRETURN count(*)",
        "question": "Count the total number of clubs.",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (club:`club_1.Club`)\nRETURN club.ClubName",
        "question": "What are the names of all clubs?",
        "answers": [
            [
                "Bootup Baltimore"
            ],
            [
                "Hopkins Student Enterprises"
            ],
            [
                "Pen and Paper Gaming"
            ],
            [
                "Tennis Club"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (club:`club_1.Club`)\nRETURN club.ClubName",
        "question": "Give me the name of each club.",
        "answers": [
            [
                "Bootup Baltimore"
            ],
            [
                "Hopkins Student Enterprises"
            ],
            [
                "Pen and Paper Gaming"
            ],
            [
                "Tennis Club"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (student:`club_1.Student`)\nRETURN count(*)",
        "question": "Count the total number of students.",
        "answers": [
            [
                34
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (student:`club_1.Student`)\nRETURN DISTINCT student.Fname",
        "question": "What are the first names of all the students?",
        "answers": [
            [
                "Linda"
            ],
            [
                "Tracy"
            ],
            [
                "Shiela"
            ],
            [
                "Dinesh"
            ],
            [
                "Paul"
            ],
            [
                "Andy"
            ],
            [
                "Lisa"
            ],
            [
                "Jandy"
            ],
            [
                "Eric"
            ],
            [
                "Derek"
            ],
            [
                "David"
            ],
            [
                "Steven"
            ],
            [
                "Charles"
            ],
            [
                "Susan"
            ],
            [
                "Mark"
            ],
            [
                "Bruce"
            ],
            [
                "Michael"
            ],
            [
                "Arthur"
            ],
            [
                "Ian"
            ],
            [
                "George"
            ],
            [
                "Stacy"
            ],
            [
                "Jun"
            ],
            [
                "Sarah"
            ],
            [
                "William"
            ]
        ]
    }
]