[
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (bookings:`cre_Drama_Workshop_Groups.Bookings`)\nRETURN bookings.Planned_Delivery_Date,bookings.Actual_Delivery_Date",
        "question": "What are the planned delivery date and actual delivery date for each booking?",
        "answers": [
            [
                "2013-03-10 18:47:05",
                "1997-11-21 10:07:40"
            ],
            [
                "2009-07-09 09:18:38",
                "1976-01-08 07:19:23"
            ],
            [
                "1989-01-05 19:24:45",
                "1990-03-16 19:38:47"
            ],
            [
                "2017-04-27 00:16:00",
                "1996-10-24 21:15:27"
            ],
            [
                "1979-07-19 19:44:01",
                "1971-01-13 13:24:52"
            ],
            [
                "2016-06-06 20:35:14",
                "2016-04-30 11:45:39"
            ],
            [
                "2008-07-18 18:15:40",
                "1983-10-09 10:48:48"
            ],
            [
                "1973-04-02 03:10:21",
                "1983-07-01 22:10:19"
            ],
            [
                "1974-05-07 21:40:39",
                "1986-10-04 13:31:10"
            ],
            [
                "1999-05-11 01:26:06",
                "1989-11-17 00:32:13"
            ],
            [
                "1978-04-10 12:23:59",
                "1983-02-07 20:27:10"
            ],
            [
                "2014-06-05 10:19:46",
                "1985-09-02 11:34:39"
            ],
            [
                "1993-04-17 23:53:01",
                "1982-04-18 02:59:08"
            ],
            [
                "1971-06-29 03:04:47",
                "1995-12-21 05:01:38"
            ],
            [
                "1972-06-25 15:51:34",
                "2004-02-22 04:37:14"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (customers:`cre_Drama_Workshop_Groups.Customers`)\nRETURN count(*)",
        "question": "Count the number of customers recorded.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (drama_workshop_groups:`cre_Drama_Workshop_Groups.Drama_Workshop_Groups`)\nRETURN drama_workshop_groups.Store_Name",
        "question": "Show all the Store_Name of drama workshop groups.",
        "answers": [
            [
                "Amely Cafe"
            ],
            [
                "Veda Film"
            ],
            [
                "Queen Art"
            ],
            [
                "Kole Photo"
            ],
            [
                "WAT Food"
            ],
            [
                "Hansen Print"
            ],
            [
                "Roo Place"
            ],
            [
                "Uhuels Fruit"
            ],
            [
                "Harry Beef"
            ],
            [
                "Welch Flower"
            ],
            [
                "Kling Workshop"
            ],
            [
                "Orn News"
            ],
            [
                "Bednar Film"
            ],
            [
                "Kessler Exploration"
            ],
            [
                "Warino Photo"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (drama_workshop_groups:`cre_Drama_Workshop_Groups.Drama_Workshop_Groups`)\nRETURN drama_workshop_groups.Store_Name",
        "question": "What are the store names of drama workshop groups?",
        "answers": [
            [
                "Amely Cafe"
            ],
            [
                "Veda Film"
            ],
            [
                "Queen Art"
            ],
            [
                "Kole Photo"
            ],
            [
                "WAT Food"
            ],
            [
                "Hansen Print"
            ],
            [
                "Roo Place"
            ],
            [
                "Uhuels Fruit"
            ],
            [
                "Harry Beef"
            ],
            [
                "Welch Flower"
            ],
            [
                "Kling Workshop"
            ],
            [
                "Orn News"
            ],
            [
                "Bednar Film"
            ],
            [
                "Kessler Exploration"
            ],
            [
                "Warino Photo"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (invoices:`cre_Drama_Workshop_Groups.Invoices`)\nRETURN DISTINCT invoices.payment_method_code",
        "question": "What are the distinct payment method codes in all the invoices?",
        "answers": [
            [
                "MasterCard"
            ],
            [
                "Visa"
            ],
            [
                "American E"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (invoices:`cre_Drama_Workshop_Groups.Invoices`)\nRETURN DISTINCT invoices.payment_method_code",
        "question": "Show me the distinct payment method codes from the invoice record.",
        "answers": [
            [
                "MasterCard"
            ],
            [
                "Visa"
            ],
            [
                "American E"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (products:`cre_Drama_Workshop_Groups.Products`)\nWITH avg(products.Product_Price) AS product_price\nMATCH (products:`cre_Drama_Workshop_Groups.Products`)\nWHERE  products.Product_Price >  product_price \nRETURN DISTINCT products.Product_Name",
        "question": "Show all the distinct product names with price higher than the average.",
        "answers": [
            [
                "film"
            ],
            [
                "photo"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (products:`cre_Drama_Workshop_Groups.Products`)\nWITH avg(products.Product_Price) AS product_price\nMATCH (products:`cre_Drama_Workshop_Groups.Products`)\nWHERE  products.Product_Price >  product_price \nRETURN DISTINCT products.Product_Name",
        "question": "What are the distinct names of the products that cost more than the average?",
        "answers": [
            [
                "film"
            ],
            [
                "photo"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (products:`cre_Drama_Workshop_Groups.Products`)\nRETURN products.Product_Name\nORDER BY products.Product_Price DESC\nLIMIT 1",
        "question": "What is the name of the most expensive product?",
        "answers": [
            [
                "film"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (products:`cre_Drama_Workshop_Groups.Products`)\nRETURN products.Product_Name\nORDER BY products.Product_Price DESC\nLIMIT 1",
        "question": "Tell me the name of the most pricy product.",
        "answers": [
            [
                "film"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (products:`cre_Drama_Workshop_Groups.Products`)\nRETURN products.Product_Name\nORDER BY products.Product_Price ASC",
        "question": "List all product names in ascending order of price.",
        "answers": [
            [
                "photo"
            ],
            [
                "photo"
            ],
            [
                "film"
            ],
            [
                "photo"
            ],
            [
                "film"
            ],
            [
                "dinning"
            ],
            [
                "dinning"
            ],
            [
                "film"
            ],
            [
                "dinning"
            ],
            [
                "film"
            ],
            [
                "photo"
            ],
            [
                "photo"
            ],
            [
                "film"
            ],
            [
                "photo"
            ],
            [
                "film"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (products:`cre_Drama_Workshop_Groups.Products`)\nRETURN products.Product_Name\nORDER BY products.Product_Price ASC",
        "question": "Sort the names of products in ascending order of their price.",
        "answers": [
            [
                "photo"
            ],
            [
                "photo"
            ],
            [
                "film"
            ],
            [
                "photo"
            ],
            [
                "film"
            ],
            [
                "dinning"
            ],
            [
                "dinning"
            ],
            [
                "film"
            ],
            [
                "dinning"
            ],
            [
                "film"
            ],
            [
                "photo"
            ],
            [
                "photo"
            ],
            [
                "film"
            ],
            [
                "photo"
            ],
            [
                "film"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (invoices:`cre_Drama_Workshop_Groups.Invoices`)\nRETURN invoices.payment_method_code,count(*)",
        "question": "Show all payment method codes and the number of orders for each code.",
        "answers": [
            [
                "MasterCard",
                6
            ],
            [
                "Visa",
                5
            ],
            [
                "American E",
                4
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (invoices:`cre_Drama_Workshop_Groups.Invoices`)\nRETURN invoices.payment_method_code,count(*)",
        "question": "List the distinct payment method codes with the number of orders made",
        "answers": [
            [
                "MasterCard",
                6
            ],
            [
                "Visa",
                5
            ],
            [
                "American E",
                4
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (T1:`cre_Drama_Workshop_Groups.Marketing_Regions`)-[]-(T2:`cre_Drama_Workshop_Groups.Stores`)\nWHERE T2.Store_Name = \"Rob Dinning\"\nRETURN T1.Marketing_Region_Name",
        "question": "What is the name of the marketing region that the store Rob Dinning belongs to?",
        "answers": [
            [
                "Canada"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (T1:`cre_Drama_Workshop_Groups.Marketing_Regions`)-[]-(T2:`cre_Drama_Workshop_Groups.Stores`)\nWHERE T2.Store_Name = \"Rob Dinning\"\nRETURN T1.Marketing_Region_Name",
        "question": "Return the name of the marketing region the store Rob Dinning is located in.",
        "answers": [
            [
                "Canada"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (T1:`cre_Drama_Workshop_Groups.Ref_Service_Types`)-[]-(T2:`cre_Drama_Workshop_Groups.Services`)\nWHERE T2.Product_Price > 100\nRETURN T1.Service_Type_Description",
        "question": "What are the descriptions of the service types with product price above 100?",
        "answers": [
            [
                "provide photo service"
            ],
            [
                "provide dinning service"
            ],
            [
                "provide photo service"
            ],
            [
                "provide filming service"
            ],
            [
                "provide dinning service"
            ],
            [
                "provide filming service"
            ],
            [
                "provide adv promoting service"
            ],
            [
                "provide dinning service"
            ],
            [
                "provide adv promoting service"
            ],
            [
                "provide dinning service"
            ],
            [
                "provide dinning service"
            ],
            [
                "provide filming service"
            ],
            [
                "provide photo service"
            ],
            [
                "provide photo service"
            ],
            [
                "provide photo service"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (T1:`cre_Drama_Workshop_Groups.Ref_Service_Types`)-[]-(T2:`cre_Drama_Workshop_Groups.Services`)\nWHERE T2.Product_Price > 100\nRETURN T1.Service_Type_Description",
        "question": "Give me the descriptions of the service types that cost more than 100.",
        "answers": [
            [
                "provide photo service"
            ],
            [
                "provide dinning service"
            ],
            [
                "provide photo service"
            ],
            [
                "provide filming service"
            ],
            [
                "provide dinning service"
            ],
            [
                "provide filming service"
            ],
            [
                "provide adv promoting service"
            ],
            [
                "provide dinning service"
            ],
            [
                "provide adv promoting service"
            ],
            [
                "provide dinning service"
            ],
            [
                "provide dinning service"
            ],
            [
                "provide filming service"
            ],
            [
                "provide photo service"
            ],
            [
                "provide photo service"
            ],
            [
                "provide photo service"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (T1:`cre_Drama_Workshop_Groups.Ref_Service_Types`)-[]-(T2:`cre_Drama_Workshop_Groups.Services`)\nRETURN T1.Service_Type_Description,T2.Service_Type_Code,count(*)",
        "question": "What is the description, code and the corresponding count of each service type?",
        "answers": [
            [
                "provide photo service",
                "1",
                5
            ],
            [
                "provide dinning service",
                "2",
                5
            ],
            [
                "provide filming service",
                "3",
                3
            ],
            [
                "provide adv promoting service",
                "4",
                2
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (T1:`cre_Drama_Workshop_Groups.Ref_Service_Types`)-[]-(T2:`cre_Drama_Workshop_Groups.Services`)\nRETURN T1.Service_Type_Description,T2.Service_Type_Code,count(*)",
        "question": "List the description, code and the number of services for each service type.",
        "answers": [
            [
                "provide photo service",
                "1",
                5
            ],
            [
                "provide dinning service",
                "2",
                5
            ],
            [
                "provide filming service",
                "3",
                3
            ],
            [
                "provide adv promoting service",
                "4",
                2
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (T1:`cre_Drama_Workshop_Groups.Drama_Workshop_Groups`)-[]-(T2:`cre_Drama_Workshop_Groups.Services`)\nRETURN T1.Store_Phone,T1.Store_Email_Address",
        "question": "What are the phones and emails of workshop groups in which services are performed?",
        "answers": [
            [
                "492-463-5967",
                "quigley.queen@example.org"
            ],
            [
                "492-463-5967",
                "quigley.queen@example.org"
            ],
            [
                "(256)743-0310",
                "kole.torp@example.org"
            ],
            [
                "(411)133-9128",
                "watsica.hettie@example.com"
            ],
            [
                "1-764-337-3453",
                "hansen.krista@example.net"
            ],
            [
                "(422)705-5633",
                "roosevelt61@example.com"
            ],
            [
                "(636)443-4067",
                "uhuels@example.net"
            ],
            [
                "(904)958-9909x0087",
                "harry.nicolas@example.org"
            ],
            [
                "499-032-2149",
                "katherine.kling@example.org"
            ],
            [
                "+60(6)8081312118",
                "arturo.orn@example.org"
            ],
            [
                "+60(6)8081312118",
                "arturo.orn@example.org"
            ],
            [
                "1-351-773-1587x95545",
                "bednar.michael@example.org"
            ],
            [
                "1-351-773-1587x95545",
                "bednar.michael@example.org"
            ],
            [
                "1-811-875-3222",
                "waino.king@example.com"
            ],
            [
                "1-811-875-3222",
                "waino.king@example.com"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (T1:`cre_Drama_Workshop_Groups.Drama_Workshop_Groups`)-[]-(T2:`cre_Drama_Workshop_Groups.Services`)\nRETURN T1.Store_Phone,T1.Store_Email_Address",
        "question": "Give me all the phone numbers and email addresses of the workshop groups where services are performed.",
        "answers": [
            [
                "492-463-5967",
                "quigley.queen@example.org"
            ],
            [
                "492-463-5967",
                "quigley.queen@example.org"
            ],
            [
                "(256)743-0310",
                "kole.torp@example.org"
            ],
            [
                "(411)133-9128",
                "watsica.hettie@example.com"
            ],
            [
                "1-764-337-3453",
                "hansen.krista@example.net"
            ],
            [
                "(422)705-5633",
                "roosevelt61@example.com"
            ],
            [
                "(636)443-4067",
                "uhuels@example.net"
            ],
            [
                "(904)958-9909x0087",
                "harry.nicolas@example.org"
            ],
            [
                "499-032-2149",
                "katherine.kling@example.org"
            ],
            [
                "+60(6)8081312118",
                "arturo.orn@example.org"
            ],
            [
                "+60(6)8081312118",
                "arturo.orn@example.org"
            ],
            [
                "1-351-773-1587x95545",
                "bednar.michael@example.org"
            ],
            [
                "1-351-773-1587x95545",
                "bednar.michael@example.org"
            ],
            [
                "1-811-875-3222",
                "waino.king@example.com"
            ],
            [
                "1-811-875-3222",
                "waino.king@example.com"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (products:`cre_Drama_Workshop_Groups.Products`)\nWITH products.Product_Name AS Product_Name, avg(products.Product_Price) AS avg\nWHERE avg < 1000000\nRETURN Product_Name",
        "question": "What are the product names with average product price smaller than 1000000?",
        "answers": [
            [
                "dinning"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (products:`cre_Drama_Workshop_Groups.Products`)\nWITH products.Product_Name AS Product_Name, avg(products.Product_Price) AS avg\nWHERE avg < 1000000\nRETURN Product_Name",
        "question": "Find the product names whose average product price is below 1000000.",
        "answers": [
            [
                "dinning"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (drama_workshop_groups:`cre_Drama_Workshop_Groups.Drama_Workshop_Groups`)\nRETURN count(DISTINCT drama_workshop_groups.Currency_Code)",
        "question": "How many distinct currency codes are there for all drama workshop groups?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (drama_workshop_groups:`cre_Drama_Workshop_Groups.Drama_Workshop_Groups`)\nRETURN count(DISTINCT drama_workshop_groups.Currency_Code)",
        "question": "Find the number of distinct currency codes used in drama workshop groups.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "music_2",
        "query": "MATCH (albums:`music_2.Albums`)\nWHERE albums.Year = 2012\nRETURN properties(albums)",
        "question": "Find all the albums in 2012.",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (albums:`music_2.Albums`)\nWHERE albums.Year = 2012\nRETURN properties(albums)",
        "question": "return all columns of the albums created in the year of 2012.",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-()\nWHERE T2.Firstname = 'Solveig'\nRETURN DISTINCT T1.StagePosition",
        "question": "Find all the stage positions of the musicians with first name \"Solveig\"",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-()\nWHERE T2.Firstname = 'Solveig'\nRETURN DISTINCT T1.StagePosition",
        "question": "What are the different stage positions for all musicians whose first name is \"Solveig\"?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T2.Lastname = 'Heilo'\nRETURN T3.Title",
        "question": "Find all the songs performed by artist with last name \"Heilo\"",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T2.Lastname = 'Heilo'\nRETURN T3.Title",
        "question": "What are the names of the songs by the artist whose last name is \"Heilo\"?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T3.Title = 'Flash'\nRETURN count(*)",
        "question": "Hom many musicians performed in the song \"Flash\"?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T3.Title = 'Flash'\nRETURN count(*)",
        "question": "How many musicians play in the song \"Flash\"?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T2.Firstname = 'Marianne'\nRETURN T3.Title",
        "question": "Find all the songs produced by artists with first name \"Marianne\".",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T2.Firstname = 'Marianne'\nRETURN T3.Title",
        "question": "What are the names of all songs produced by the artist with the first name \"Marianne\"?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T3.Title = 'Badlands'\nRETURN T2.Firstname,T2.Lastname",
        "question": "Who performed the song named \"Badlands\"? Show the first name and the last name.",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T3.Title = 'Badlands'\nRETURN T2.Firstname,T2.Lastname",
        "question": "What are the first and last names of the artist who perfomed the song \"Badlands\"?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T3.Title = 'Badlands' AND T1.StagePosition = 'back'\nRETURN T2.Firstname,T2.Lastname",
        "question": "Who is performing in the back stage position for the song \"Badlands\"? Show the first name and the last name.",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T3.Title = 'Badlands' AND T1.StagePosition = 'back'\nRETURN T2.Firstname,T2.Lastname",
        "question": "What are the first and last names of the performer who was in the back stage position for the song \"Badlands\"?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWITH count(T2.Lastname) AS cnt, T2\nRETURN T2.Lastname\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the last name of the musician that have produced the most number of songs?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWITH count(T2.Lastname) AS cnt, T2\nRETURN T2.Lastname\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the last name of the musician who was in the most songs?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-()\nWHERE T1.StagePosition = 'back'\nWITH count(T2.Lastname) AS cnt, T2\nRETURN T2.Lastname\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the last name of the musician that has been at the back position the most?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-()\nWHERE T1.StagePosition = 'back'\nWITH count(T2.Lastname) AS cnt, T2\nRETURN T2.Lastname\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the last name of the musicians who has played back position the most?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (songs:`music_2.Songs`)\nWHERE songs.Title =~'.*[ | ]the .*'\nRETURN songs.Title",
        "question": "Find all the songs whose name contains the word \"the\".",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (songs:`music_2.Songs`)\nWHERE songs.Title =~'.*[ | ]the .*'\nRETURN songs.Title",
        "question": "What are the names of the songs whose title has the word \"the\"?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH ()-[instruments:`music_2.Instruments`]-()\nRETURN DISTINCT instruments.Instrument",
        "question": "What are all the instruments used?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH ()-[instruments:`music_2.Instruments`]-()\nRETURN DISTINCT instruments.Instrument",
        "question": "What are the different instruments listed in the database?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH ()-[instruments:`music_2.Instruments`]-()\nRETURN instruments.Instrument\nORDER BY instruments.Instrument DESC\nLIMIT 1",
        "question": "What is the most used instrument?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH ()-[instruments:`music_2.Instruments`]-()\nRETURN instruments.Instrument\nORDER BY instruments.Instrument DESC\nLIMIT 1",
        "question": "What instrument is used the most?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH ()-[instruments:`music_2.Instruments`]-()\nWHERE instruments.Instrument = 'drums'\nRETURN count(*)",
        "question": "How many songs use drums as an instrument?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "music_2",
        "query": "MATCH ()-[vocals:`music_2.Vocals`]-()\nRETURN vocals.Type\nORDER BY vocals.Type DESC\nLIMIT 1",
        "question": "Which vocal type is the most frequently appearring type?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH ()-[vocals:`music_2.Vocals`]-()\nRETURN vocals.Type\nORDER BY vocals.Type DESC\nLIMIT 1",
        "question": "What is the type of vocables that appears most frequently?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Songs`)-[T1:`music_2.Vocals`]-()\nWHERE T2.Title = 'Demon Kitty Rag'\nRETURN count(*)",
        "question": "Find the number of vocal types used in song \"Demon Kitty Rag\"?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Songs`)-[T1:`music_2.Vocals`]-()\nWHERE T2.Title = 'Demon Kitty Rag'\nRETURN count(*)",
        "question": "What are the types of vocals used in the song \"Demon Kitty Rag\"?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "music_2",
        "query": "MATCH ()-[vocals:`music_2.Vocals`]-()\nRETURN DISTINCT vocals.Type",
        "question": "What are the different types of vocals?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (albums:`music_2.Albums`)\nWHERE albums.Year = 2010\nRETURN properties(albums)",
        "question": "What are the albums produced in year 2010?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (albums:`music_2.Albums`)\nWHERE albums.Year = 2010\nRETURN properties(albums)",
        "question": "What information is there on albums from 2010?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T3.Title = 'Le Pop'\nRETURN T2.Firstname,T2.Lastname",
        "question": "Who performed the song named \"Le Pop\"?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T3.Title = 'Le Pop'\nRETURN T2.Firstname,T2.Lastname",
        "question": "What is the first and last name of artist who performed \"Le Pop\"?",
        "answers": []
    }
]