[
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (available_policies:`insurance_fnol.Available_Policies`)\nRETURN available_policies.Customer_Phone",
        "question": "What are all the phone numbers?",
        "answers": [
            [
                "+16(2)5838999222"
            ],
            [
                "242.763.9214"
            ],
            [
                "1-416-503-7735x94204"
            ],
            [
                "(777)537-7792"
            ],
            [
                "1-446-940-9907x257"
            ],
            [
                "(379)862-8274x12620"
            ],
            [
                "+85(6)1302858396"
            ],
            [
                "1-797-927-3585x9321"
            ],
            [
                "991.642.6485x822"
            ],
            [
                "813.178.8211x557"
            ],
            [
                "889-572-0609x552"
            ],
            [
                "1-138-841-3073"
            ],
            [
                "1-381-132-0127x3801"
            ],
            [
                "00481937923"
            ],
            [
                "405.090.8654x021"
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (available_policies:`insurance_fnol.Available_Policies`)\nWHERE available_policies.policy_type_code = \"Life Insurance\"\nRETURN available_policies.Customer_Phone",
        "question": "What are the customer phone numbers under the policy \"Life Insurance\"?",
        "answers": [
            [
                "+16(2)5838999222"
            ],
            [
                "991.642.6485x822"
            ],
            [
                "889-572-0609x552"
            ],
            [
                "1-138-841-3073"
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (available_policies:`insurance_fnol.Available_Policies`)\nWHERE available_policies.policy_type_code = \"Life Insurance\"\nRETURN available_policies.Customer_Phone",
        "question": "What are the phone numbers of customers using the policy with the code \"Life Insurance\"?",
        "answers": [
            [
                "+16(2)5838999222"
            ],
            [
                "991.642.6485x822"
            ],
            [
                "889-572-0609x552"
            ],
            [
                "1-138-841-3073"
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (available_policies:`insurance_fnol.Available_Policies`)\nWITH count(*) AS count, available_policies.policy_type_code AS policy_type_code\nWHERE count  > 4\nRETURN policy_type_code",
        "question": "Find the policy type used by more than 4 customers.",
        "answers": [
            [
                "Property Insurance"
            ],
            [
                "Mortgage Insurance"
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (t1:`insurance_fnol.First_Notification_of_Loss`)-[]-(t2:`insurance_fnol.Services`)\nWITH t2.Service_name AS Service_name, count(*) AS count\nWHERE count  > 2\nRETURN Service_name",
        "question": "Find the name of services that have been used for more than 2 times in first notification of loss.",
        "answers": [
            [
                "New policy application"
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (t1:`insurance_fnol.First_Notification_of_Loss`)-[]-(t2:`insurance_fnol.Services`)\nWITH t2.Service_name AS Service_name, count(*) AS count\nWHERE count  > 2\nRETURN Service_name",
        "question": "Which services have been used more than twice in first notification of loss? Return the service name.",
        "answers": [
            [
                "New policy application"
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (t1:`insurance_fnol.Customers`)-[t2:`insurance_fnol.Customers_Policies`]-()\nWHERE t1.Customer_name = \"Dayana Robel\"\nRETURN count(*)",
        "question": "How many policies are listed for the customer named \"Dayana Robel\"?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (t1:`insurance_fnol.Customers`)-[t2:`insurance_fnol.Customers_Policies`]-()\nWHERE t1.Customer_name = \"Dayana Robel\"\nRETURN count(*)",
        "question": "Count the total number of policies used by the customer named \"Dayana Robel\".",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (t1:`insurance_fnol.Customers`)-[t2:`insurance_fnol.Customers_Policies`]-()\nWITH t1, count(t1.Customer_name) AS cnt\nRETURN t1.Customer_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the name of the customer who has the most policies listed?",
        "answers": [
            [
                "Jay Chou"
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (t1:`insurance_fnol.Customers`)-[t2:`insurance_fnol.Customers_Policies`]-()\nWITH t1, count(t1.Customer_name) AS cnt\nRETURN t1.Customer_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Which customer uses the most policies? Give me the customer name.",
        "answers": [
            [
                "Jay Chou"
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (t1:`insurance_fnol.Customers`)-[t2:`insurance_fnol.Customers_Policies`]-(t3:`insurance_fnol.Available_Policies`)\nWHERE t1.Customer_name = \"Dayana Robel\"\nRETURN DISTINCT t3.policy_type_code",
        "question": "What are all the policy types of the customer named \"Dayana Robel\"?",
        "answers": [
            [
                "Mortgage Insurance"
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (services:`insurance_fnol.Services`)\nRETURN services.Service_name\nORDER BY services.Service_name",
        "question": "List all the services in the alphabetical order.",
        "answers": [
            [
                "Change a policy"
            ],
            [
                "Close a policy"
            ],
            [
                "New policy application"
            ],
            [
                "Upgrade a policy"
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (services:`insurance_fnol.Services`)\nRETURN services.Service_name\nORDER BY services.Service_name",
        "question": "Give me a list of all the service names sorted alphabetically.",
        "answers": [
            [
                "Change a policy"
            ],
            [
                "Close a policy"
            ],
            [
                "New policy application"
            ],
            [
                "Upgrade a policy"
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (services:`insurance_fnol.Services`)\nRETURN count(*)",
        "question": "Count the total number of available services.",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (settlements:`insurance_fnol.Settlements`)\nRETURN max(settlements.Settlement_Amount),min(settlements.Settlement_Amount)",
        "question": "What are the maximum and minimum settlement amount on record?",
        "answers": [
            [
                9814.39,
                1588.45
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (settlements:`insurance_fnol.Settlements`)\nRETURN max(settlements.Settlement_Amount),min(settlements.Settlement_Amount)",
        "question": "Find the maximum and minimum settlement amount.",
        "answers": [
            [
                9814.39,
                1588.45
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (customers:`insurance_fnol.Customers`)\nRETURN customers.Customer_ID,customers.Customer_name\nORDER BY customers.Customer_ID ASC",
        "question": "List all the customers in increasing order of IDs.",
        "answers": [
            [
                194,
                "America Jaskolski"
            ],
            [
                214,
                "Ellsworth Paucek"
            ],
            [
                256,
                "Mrs. Hanna Willms"
            ],
            [
                562,
                "Dr. Diana Rath"
            ],
            [
                582,
                "Selena Gerhold"
            ],
            [
                641,
                "Dayana Robel"
            ],
            [
                682,
                "Mr. Edwardo Blanda I"
            ],
            [
                756,
                "Mr. Randal Lynch III"
            ],
            [
                805,
                "Mrs. Liza Heller V"
            ],
            [
                826,
                "Mrs. Lilly Graham III"
            ],
            [
                882,
                "Miss Felicita Reichel"
            ],
            [
                892,
                "Sydnie Friesen"
            ],
            [
                923,
                "David Ross"
            ],
            [
                956,
                "Cai Zhang"
            ],
            [
                996,
                "Jay Chou"
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (customers:`insurance_fnol.Customers`)\nRETURN customers.Customer_ID,customers.Customer_name\nORDER BY customers.Customer_ID ASC",
        "question": "What is the ordered list of customer ids?",
        "answers": [
            [
                194,
                "America Jaskolski"
            ],
            [
                214,
                "Ellsworth Paucek"
            ],
            [
                256,
                "Mrs. Hanna Willms"
            ],
            [
                562,
                "Dr. Diana Rath"
            ],
            [
                582,
                "Selena Gerhold"
            ],
            [
                641,
                "Dayana Robel"
            ],
            [
                682,
                "Mr. Edwardo Blanda I"
            ],
            [
                756,
                "Mr. Randal Lynch III"
            ],
            [
                805,
                "Mrs. Liza Heller V"
            ],
            [
                826,
                "Mrs. Lilly Graham III"
            ],
            [
                882,
                "Miss Felicita Reichel"
            ],
            [
                892,
                "Sydnie Friesen"
            ],
            [
                923,
                "David Ross"
            ],
            [
                956,
                "Cai Zhang"
            ],
            [
                996,
                "Jay Chou"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nRETURN count(*)",
        "question": "How many kinds of enzymes are there?",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nRETURN count(*)",
        "question": "What is the total count of enzymes?",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nRETURN enzyme.name\nORDER BY enzyme.name DESC",
        "question": "List the name of enzymes in descending lexicographical order.",
        "answers": [
            [
                "Uroporphyrinogen III synthase"
            ],
            [
                "Uroporphyrinogen III decarboxylase"
            ],
            [
                "Protoporphyrinogen oxidase"
            ],
            [
                "PBG deaminase"
            ],
            [
                "Ferrochelatase"
            ],
            [
                "Coproporphyrinogen III oxidase"
            ],
            [
                "ALA synthase"
            ],
            [
                "ALA dehydratase"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nRETURN enzyme.name\nORDER BY enzyme.name DESC",
        "question": "What are the names of enzymes in descending order?",
        "answers": [
            [
                "Uroporphyrinogen III synthase"
            ],
            [
                "Uroporphyrinogen III decarboxylase"
            ],
            [
                "Protoporphyrinogen oxidase"
            ],
            [
                "PBG deaminase"
            ],
            [
                "Ferrochelatase"
            ],
            [
                "Coproporphyrinogen III oxidase"
            ],
            [
                "ALA synthase"
            ],
            [
                "ALA dehydratase"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nRETURN enzyme.name,enzyme.Location",
        "question": "List the names and the locations that the enzymes can make an effect.",
        "answers": [
            [
                "ALA synthase",
                "Mitochondrion"
            ],
            [
                "ALA dehydratase",
                "Cytosol"
            ],
            [
                "PBG deaminase",
                "Cytosol"
            ],
            [
                "Uroporphyrinogen III synthase",
                "Cytosol"
            ],
            [
                "Uroporphyrinogen III decarboxylase",
                "Cytosol"
            ],
            [
                "Coproporphyrinogen III oxidase",
                "Mitochondrion"
            ],
            [
                "Protoporphyrinogen oxidase",
                "Mitochondrion"
            ],
            [
                "Ferrochelatase",
                "Mitochondrion"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nRETURN enzyme.name,enzyme.Location",
        "question": "What are the names and locations of all enzymes listed?",
        "answers": [
            [
                "ALA synthase",
                "Mitochondrion"
            ],
            [
                "ALA dehydratase",
                "Cytosol"
            ],
            [
                "PBG deaminase",
                "Cytosol"
            ],
            [
                "Uroporphyrinogen III synthase",
                "Cytosol"
            ],
            [
                "Uroporphyrinogen III decarboxylase",
                "Cytosol"
            ],
            [
                "Coproporphyrinogen III oxidase",
                "Mitochondrion"
            ],
            [
                "Protoporphyrinogen oxidase",
                "Mitochondrion"
            ],
            [
                "Ferrochelatase",
                "Mitochondrion"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nRETURN max(enzyme.OMIM)",
        "question": "What is the maximum Online Mendelian Inheritance in Man (OMIM) value of the enzymes?",
        "answers": [
            [
                606938
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nRETURN max(enzyme.OMIM)",
        "question": "What is the maximum OMIM value in the database?",
        "answers": [
            [
                606938
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nWHERE enzyme.Location = 'Cytosol'\nRETURN enzyme.Product,enzyme.Chromosome,enzyme.Porphyria",
        "question": "What is the product, chromosome and porphyria related to the enzymes which take effect at the location 'Cytosol'?",
        "answers": [
            [
                "Porphobilinogen",
                "9q34",
                "ALA-Dehydratase deficiency"
            ],
            [
                "Hydroxymethyl bilane",
                "11q23.3",
                "acute intermittent porphyria"
            ],
            [
                "Uroporphyrinogen III",
                "10q25.2-q26.3",
                "congenital erythropoietic porphyria"
            ],
            [
                "Coproporphyrinogen III",
                "1p34",
                "porphyria cutanea tarda"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nWHERE enzyme.Location = 'Cytosol'\nRETURN enzyme.Product,enzyme.Chromosome,enzyme.Porphyria",
        "question": "What is the product, chromosome, and porphyria of the enzymes located at 'Cytosol'?",
        "answers": [
            [
                "Porphobilinogen",
                "9q34",
                "ALA-Dehydratase deficiency"
            ],
            [
                "Hydroxymethyl bilane",
                "11q23.3",
                "acute intermittent porphyria"
            ],
            [
                "Uroporphyrinogen III",
                "10q25.2-q26.3",
                "congenital erythropoietic porphyria"
            ],
            [
                "Coproporphyrinogen III",
                "1p34",
                "porphyria cutanea tarda"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nWHERE enzyme.Product <> 'Heme'\nRETURN enzyme.name",
        "question": "What are the names of enzymes who does not produce 'Heme'?",
        "answers": [
            [
                "ALA synthase"
            ],
            [
                "ALA dehydratase"
            ],
            [
                "PBG deaminase"
            ],
            [
                "Uroporphyrinogen III synthase"
            ],
            [
                "Uroporphyrinogen III decarboxylase"
            ],
            [
                "Coproporphyrinogen III oxidase"
            ],
            [
                "Protoporphyrinogen oxidase"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nWHERE enzyme.Product <> 'Heme'\nRETURN enzyme.name",
        "question": "What are the names of enzymes whose product is not 'Heme'?",
        "answers": [
            [
                "ALA synthase"
            ],
            [
                "ALA dehydratase"
            ],
            [
                "PBG deaminase"
            ],
            [
                "Uroporphyrinogen III synthase"
            ],
            [
                "Uroporphyrinogen III decarboxylase"
            ],
            [
                "Coproporphyrinogen III oxidase"
            ],
            [
                "Protoporphyrinogen oxidase"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (medicine:`medicine_enzyme_interaction.medicine`)\nWHERE medicine.FDA_approved = 'Yes'\nRETURN medicine.name,medicine.Trade_Name",
        "question": "What are the names and trade names of the medicines which has 'Yes' value in the FDA record?",
        "answers": [
            [
                "Aripiprazole",
                "Abilify"
            ],
            [
                "Asenapine",
                "Saphris"
            ],
            [
                "Clozapine",
                "Clozaril"
            ],
            [
                "Iloperidone",
                "Fanapt"
            ],
            [
                "Lurasidone",
                "Latuda"
            ],
            [
                "Olanzapine",
                "Zyprexa"
            ],
            [
                "Paliperidone",
                "Invega"
            ],
            [
                "Quetiapine",
                "Seroquel"
            ],
            [
                "Risperidone",
                "Risperdal"
            ],
            [
                "Ziprasidone",
                "Geodon"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (medicine:`medicine_enzyme_interaction.medicine`)\nWHERE medicine.FDA_approved = 'Yes'\nRETURN medicine.name,medicine.Trade_Name",
        "question": "What are the names and trade names of the medcines that are FDA approved?",
        "answers": [
            [
                "Aripiprazole",
                "Abilify"
            ],
            [
                "Asenapine",
                "Saphris"
            ],
            [
                "Clozapine",
                "Clozaril"
            ],
            [
                "Iloperidone",
                "Fanapt"
            ],
            [
                "Lurasidone",
                "Latuda"
            ],
            [
                "Olanzapine",
                "Zyprexa"
            ],
            [
                "Paliperidone",
                "Invega"
            ],
            [
                "Quetiapine",
                "Seroquel"
            ],
            [
                "Risperidone",
                "Risperdal"
            ],
            [
                "Ziprasidone",
                "Geodon"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T1:`medicine_enzyme_interaction.enzyme`)-[T2:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-(T3:`medicine_enzyme_interaction.medicine`)\nWHERE T3.name = 'Amisulpride' AND T2.interaction_type = 'inhibitor'\nRETURN T1.name",
        "question": "What are the names of enzymes in the medicine named 'Amisulpride' that can serve as an 'inhibitor'?",
        "answers": [
            [
                "ALA synthase"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T1:`medicine_enzyme_interaction.enzyme`)-[T2:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-(T3:`medicine_enzyme_interaction.medicine`)\nWHERE T3.name = 'Amisulpride' AND T2.interaction_type = 'inhibitor'\nRETURN T1.name",
        "question": "What are the names of the enzymes used in the medicine  Amisulpride that acts as inhibitors?",
        "answers": [
            [
                "ALA synthase"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T1:`medicine_enzyme_interaction.medicine`)-[T2:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-()\nWITH T1.name AS name, count(*) AS count, T1.id AS id\nWHERE count  >= 2\nRETURN id,name",
        "question": "What are the ids and names of the medicine that can interact with two or more enzymes?",
        "answers": [
            [
                2,
                "Aripiprazole"
            ],
            [
                3,
                "Asenapine"
            ],
            [
                8,
                "Iloperidone"
            ],
            [
                20,
                "Ziprasidone"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T1:`medicine_enzyme_interaction.medicine`)-[T2:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-()\nWITH T1.name AS name, count(*) AS count, T1.id AS id\nWHERE count  >= 2\nRETURN id,name",
        "question": "For every medicine id, what are the names of the medicines that can interact with more than one enzyme?",
        "answers": [
            [
                2,
                "Aripiprazole"
            ],
            [
                3,
                "Asenapine"
            ],
            [
                8,
                "Iloperidone"
            ],
            [
                20,
                "Ziprasidone"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T1:`medicine_enzyme_interaction.medicine`)-[T2:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-()\nWITH T1, count(T1.id) AS cnt\nRETURN T1.id,T1.name,T1.FDA_approved\nORDER BY cnt DESC",
        "question": "What are the ids, names and FDA approval status of medicines in descending order of the number of enzymes that it can interact with.",
        "answers": [
            [
                2,
                "Aripiprazole",
                "Yes"
            ],
            [
                3,
                "Asenapine",
                "Yes"
            ],
            [
                8,
                "Iloperidone",
                "Yes"
            ],
            [
                20,
                "Ziprasidone",
                "Yes"
            ],
            [
                1,
                "Amisulpride",
                "No"
            ],
            [
                4,
                "Blonanserin",
                "No"
            ],
            [
                5,
                "Carpipramine",
                "No"
            ],
            [
                6,
                "Clocapramine",
                "No"
            ],
            [
                7,
                "Clozapine",
                "Yes"
            ],
            [
                9,
                "Lurasidone",
                "Yes"
            ],
            [
                10,
                "Melperone",
                "No"
            ],
            [
                13,
                "Paliperidone",
                "Yes"
            ],
            [
                19,
                "Sulpiride",
                "No"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T1:`medicine_enzyme_interaction.medicine`)-[T2:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-()\nWITH T1, count(T1.id) AS cnt\nRETURN T1.id,T1.name,T1.FDA_approved\nORDER BY cnt DESC",
        "question": "What are the ids, names, and FDA approval status for medicines ordered by descending number of possible enzyme interactions?",
        "answers": [
            [
                2,
                "Aripiprazole",
                "Yes"
            ],
            [
                3,
                "Asenapine",
                "Yes"
            ],
            [
                8,
                "Iloperidone",
                "Yes"
            ],
            [
                20,
                "Ziprasidone",
                "Yes"
            ],
            [
                1,
                "Amisulpride",
                "No"
            ],
            [
                4,
                "Blonanserin",
                "No"
            ],
            [
                5,
                "Carpipramine",
                "No"
            ],
            [
                6,
                "Clocapramine",
                "No"
            ],
            [
                7,
                "Clozapine",
                "Yes"
            ],
            [
                9,
                "Lurasidone",
                "Yes"
            ],
            [
                10,
                "Melperone",
                "No"
            ],
            [
                13,
                "Paliperidone",
                "Yes"
            ],
            [
                19,
                "Sulpiride",
                "No"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T1:`medicine_enzyme_interaction.enzyme`)-[T2:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-()\nWHERE T2.interaction_type = 'activitor'\nWITH T1, count(T1.id) AS cnt\nRETURN T1.id,T1.name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the id and name of the enzyme with most number of medicines that can interact as 'activator'?",
        "answers": [
            [
                4,
                "Uroporphyrinogen III synthase"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T1:`medicine_enzyme_interaction.enzyme`)-[T2:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-()\nWHERE T2.interaction_type = 'activitor'\nWITH T1, count(T1.id) AS cnt\nRETURN T1.id,T1.name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the id and name of the enzyme that can interact with the most medicines as an activator?",
        "answers": [
            [
                4,
                "Uroporphyrinogen III synthase"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T2:`medicine_enzyme_interaction.medicine`)-[T1:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-(T3:`medicine_enzyme_interaction.enzyme`)\nWHERE T3.name = 'ALA synthase' AND T2.name = 'Aripiprazole'\nRETURN T1.interaction_type",
        "question": "What is the interaction type of the enzyme named 'ALA synthase' and the medicine named 'Aripiprazole'?",
        "answers": [
            [
                "inhibitor"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T2:`medicine_enzyme_interaction.medicine`)-[T1:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-(T3:`medicine_enzyme_interaction.enzyme`)\nWHERE T3.name = 'ALA synthase' AND T2.name = 'Aripiprazole'\nRETURN T1.interaction_type",
        "question": "What is the type of interaction for the enzyme named 'ALA synthase' and the medicine named 'Aripiprazole'?",
        "answers": [
            [
                "inhibitor"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (medicine:`medicine_enzyme_interaction.medicine`)\nWHERE medicine.FDA_approved = 'No'\nRETURN count(*)",
        "question": "How many medicines have the FDA approval status 'No' ?",
        "answers": [
            [
                11
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (medicine:`medicine_enzyme_interaction.medicine`)\nWHERE medicine.FDA_approved = 'No'\nRETURN count(*)",
        "question": "How many medicines were not approved by the FDA?",
        "answers": [
            [
                11
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T1:`medicine_enzyme_interaction.medicine`)-[T2:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-()\nWITH count(*) AS count, T1.id AS id, T1.Trade_Name AS Trade_Name\nWHERE count  >= 3\nRETURN id,Trade_Name",
        "question": "What is the id and trade name of the medicines can interact with at least 3 enzymes?",
        "answers": [
            [
                2,
                "Abilify"
            ],
            [
                3,
                "Saphris"
            ]
        ]
    }
]