[
    {
        "question": "Show all artist names and the number of exhibitions for each artist.",
        "query": "MATCH (T1:`theme_gallery.exhibition`)-[]-(T2:`theme_gallery.artist`)\nWITH count(T1.Artist_ID) AS count, T2.Name AS Name\nRETURN Name,count",
        "db_id": "theme_gallery",
        "answers": [
            [
                "Vijay Singh",
                2
            ],
            [
                "John Daly",
                1
            ],
            [
                "Paul Azinger",
                1
            ],
            [
                "Jeff Sluman",
                1
            ],
            [
                "Nick Price",
                1
            ]
        ]
    },
    {
        "question": "Return the name and country corresponding to the artist who has had the most exhibitions.",
        "query": "MATCH (T1:`theme_gallery.exhibition`)-[]-(T2:`theme_gallery.artist`)\nWITH count(T1.Artist_ID) AS count, T2.Country AS Country, T2.Name AS Name\nRETURN Name,Country\nORDER BY count DESC\nLIMIT 1",
        "db_id": "theme_gallery",
        "answers": [
            [
                "Vijay Singh",
                "Fiji"
            ]
        ]
    },
    {
        "question": "Show names for artists without any exhibition.",
        "query": "MATCH (artist:`theme_gallery.artist`)\nWHERE NOT (artist:`theme_gallery.artist`)-[]-(:`theme_gallery.exhibition`)\nRETURN artist.Name",
        "db_id": "theme_gallery",
        "answers": [
            [
                "Mark Brooks"
            ],
            [
                "Larry Nelson"
            ]
        ]
    },
    {
        "question": "Show theme and year for all exhibitions in an descending order of ticket price.",
        "query": "MATCH (exhibition:`theme_gallery.exhibition`)\nRETURN exhibition.Theme,exhibition.Year\nORDER BY exhibition.Ticket_Price DESC",
        "db_id": "theme_gallery",
        "answers": [
            [
                "Spring",
                2008
            ],
            [
                "Santa Claus",
                2004
            ],
            [
                "Christmas stocking",
                2005
            ],
            [
                "Christmas Tree",
                2007
            ],
            [
                "Santa Claus and Rudolph the Red-Nosed Reindeer",
                2006
            ],
            [
                "Summer",
                2009
            ]
        ]
    },
    {
        "question": "Return the themes, dates, and attendance for exhibitions that happened in 2004.",
        "query": "MATCH (T1:`theme_gallery.exhibition_record`)-[]-(T2:`theme_gallery.exhibition`)\nWHERE T2.Year = 2004\nRETURN T2.Theme,T1.Date,T1.Attendance",
        "db_id": "theme_gallery",
        "answers": [
            [
                "Santa Claus",
                "December 5",
                1098
            ],
            [
                "Santa Claus",
                "December 2",
                965
            ],
            [
                "Santa Claus",
                "December 7",
                2983
            ]
        ]
    },
    {
        "question": "Count the number of exhibitions that have had an attendnance of over 100 or a ticket prices under 10.",
        "query": "MATCH (T1:`theme_gallery.exhibition_record`)-[]-(T2:`theme_gallery.exhibition`)\nWHERE T1.Attendance > 100 OR T2.Ticket_Price < 10\nRETURN count(*)",
        "db_id": "theme_gallery",
        "answers": [
            [
                13
            ]
        ]
    },
    {
        "question": "Find the id of the item whose title is \"orange\".",
        "query": "MATCH (item:`epinions_1.item`)\nWHERE item.title = 'orange'\nRETURN item.i_id",
        "db_id": "epinions_1",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "question": "Find the number of reviews.",
        "query": "MATCH (review:`epinions_1.review`)\nRETURN count(*)",
        "db_id": "epinions_1",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "Find the highest rank of all reviews.",
        "query": "MATCH (review:`epinions_1.review`)\nRETURN min(review.rank)",
        "db_id": "epinions_1",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "question": "List the titles of all items in alphabetic order .",
        "query": "MATCH (item:`epinions_1.item`)\nRETURN item.title\nORDER BY item.title",
        "db_id": "epinions_1",
        "answers": [
            [
                "apple"
            ],
            [
                "avocado"
            ],
            [
                "blue hoodie"
            ],
            [
                "comb"
            ],
            [
                "cup"
            ],
            [
                "orange"
            ],
            [
                "pear"
            ],
            [
                "shampoo"
            ]
        ]
    },
    {
        "question": "List the names of players in ascending order of votes.",
        "query": "MATCH (player:`riding_club.player`)\nRETURN player.Player_name\nORDER BY player.Votes ASC",
        "db_id": "riding_club",
        "answers": [
            [
                "Mohamed Alli"
            ],
            [
                "Sean Robert"
            ],
            [
                "Ron Strynadka"
            ],
            [
                "Ross C. Martin"
            ],
            [
                "Rachel Heinrichs"
            ],
            [
                "Matt Schaubroeck"
            ],
            [
                "Jean Luc Bouch\u00e9"
            ],
            [
                "Fiona Shiells"
            ],
            [
                "Niki Ashton"
            ],
            [
                "Patricia Cordner"
            ],
            [
                "Ross Eadie"
            ],
            [
                "Pat Martin"
            ],
            [
                "Judy Wasylycia-Leis"
            ],
            [
                "Jim Maloway"
            ]
        ]
    },
    {
        "question": "List the name and residence for players whose occupation is not \"Researcher\".",
        "query": "MATCH (player:`riding_club.player`)\nWHERE player.Occupation <> 'Researcher'\nRETURN player.Player_name,player.Residence",
        "db_id": "riding_club",
        "answers": [
            [
                "Jean Luc Bouch\u00e9",
                "Brandon"
            ],
            [
                "Fiona Shiells",
                "Winnipeg"
            ],
            [
                "Ron Strynadka",
                "Birtle"
            ],
            [
                "Jim Maloway",
                "Winnipeg"
            ],
            [
                "Ross Eadie",
                "Winnipeg"
            ],
            [
                "Mohamed Alli",
                "Winnipeg"
            ],
            [
                "Ross C. Martin",
                "Oakbank"
            ],
            [
                "Matt Schaubroeck",
                "Winnipeg"
            ],
            [
                "Patricia Cordner",
                "Selkirk"
            ],
            [
                "Pat Martin",
                "Winnipeg"
            ],
            [
                "Judy Wasylycia-Leis",
                "Winnipeg"
            ],
            [
                "Sean Robert",
                "Winnipeg"
            ],
            [
                "Rachel Heinrichs",
                "Winnipeg"
            ]
        ]
    },
    {
        "question": "Show the names of sponsors of players whose residence is either \"Brandon\" or \"Birtle\".",
        "query": "MATCH (player:`riding_club.player`)\nWHERE player.Residence = 'Brandon' OR player.Residence = 'Birtle'\nRETURN player.Sponsor_name",
        "db_id": "riding_club",
        "answers": [
            [
                "Brandon\u2014Souris"
            ],
            [
                "Dauphin\u2014Swan River\u2014Marquette"
            ]
        ]
    },
    {
        "question": "Show different occupations along with the number of players in each occupation.",
        "query": "MATCH (player:`riding_club.player`)\nWITH player.Occupation AS Occupation, count(player.Occupation) AS count\nRETURN Occupation,count",
        "db_id": "riding_club",
        "answers": [
            [
                "Locomotive Engineer",
                1
            ],
            [
                "Ministerial Assistant",
                1
            ],
            [
                "Researcher",
                1
            ],
            [
                "Retired",
                2
            ],
            [
                "Small Businessman",
                1
            ],
            [
                "Self Employed / Consultant",
                1
            ],
            [
                "Distribution Centre Associate",
                1
            ],
            [
                "Design Coordinator",
                1
            ],
            [
                "Student",
                2
            ],
            [
                "Parliamentarian",
                2
            ],
            [
                "Product Consultant - MLCC",
                1
            ]
        ]
    },
    {
        "question": "Show the residences that have at least two players.",
        "query": "MATCH (player:`riding_club.player`)\nWITH count(*) AS count, player.Residence AS Residence\nWHERE count  >= 2\nRETURN Residence",
        "db_id": "riding_club",
        "answers": [
            [
                "Winnipeg"
            ]
        ]
    },
    {
        "question": "List the names of players that do not have coaches.",
        "query": "MATCH (player:`riding_club.player`)\nWHERE NOT (player:`riding_club.player`)-[:`riding_club.player_coach`]-()\nRETURN player.Player_name",
        "db_id": "riding_club",
        "answers": [
            [
                "Jim Maloway"
            ],
            [
                "Mohamed Alli"
            ],
            [
                "Ross C. Martin"
            ],
            [
                "Matt Schaubroeck"
            ],
            [
                "Pat Martin"
            ],
            [
                "Judy Wasylycia-Leis"
            ],
            [
                "Sean Robert"
            ]
        ]
    },
    {
        "question": "How many coaches does each club has? List the club id, name and the number of coaches.",
        "query": "MATCH (T1:`riding_club.club`)-[]-(T2:`riding_club.coach`)\nWITH count(T1.Club_ID) AS count, T1.Club_name AS Club_name, T1.Club_ID AS Club_ID\nRETURN Club_ID,Club_name,count",
        "db_id": "riding_club",
        "answers": [
            [
                1,
                "AIK",
                3
            ],
            [
                3,
                "Djurg\u00e5rdens IF",
                2
            ]
        ]
    },
    {
        "question": "Count the number of gymnasts.",
        "query": "MATCH (gymnast:`gymnast.gymnast`)\nRETURN count(*)",
        "db_id": "gymnast",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "List the total points of gymnasts in descending order.",
        "query": "MATCH (gymnast:`gymnast.gymnast`)\nRETURN gymnast.Total_Points\nORDER BY gymnast.Total_Points DESC",
        "db_id": "gymnast",
        "answers": [
            [
                58.061
            ],
            [
                57.924
            ],
            [
                57.649
            ],
            [
                57.436
            ],
            [
                57.424
            ],
            [
                57.398
            ],
            [
                57.374
            ]
        ]
    },
    {
        "question": "List the total points of gymnasts in descending order of floor exercise points.",
        "query": "MATCH (gymnast:`gymnast.gymnast`)\nRETURN gymnast.Total_Points\nORDER BY gymnast.Floor_Exercise_Points DESC",
        "db_id": "gymnast",
        "answers": [
            [
                57.436
            ],
            [
                58.061
            ],
            [
                57.924
            ],
            [
                57.424
            ],
            [
                57.398
            ],
            [
                57.374
            ],
            [
                57.649
            ]
        ]
    },
    {
        "question": "Return the average horizontal bar points across all gymnasts.",
        "query": "MATCH (gymnast:`gymnast.gymnast`)\nRETURN avg(gymnast.Horizontal_Bar_Points)",
        "db_id": "gymnast",
        "answers": [
            [
                9.603428571428571
            ]
        ]
    },
    {
        "question": "Return the names of people, ordered alphabetically.",
        "query": "MATCH (people:`gymnast.people`)\nRETURN people.Name\nORDER BY people.Name ASC",
        "db_id": "gymnast",
        "answers": [
            [
                "Ashley P\u00e9rez Cabrera"
            ],
            [
                "Clary Sermina Delgado Cid"
            ],
            [
                "Elizabeth Qui\u00f1\u00f3nez Aroyo"
            ],
            [
                "Endis de los Santos \u00c1lvarez"
            ],
            [
                "Eve Tatiana Cruz Oviedo"
            ],
            [
                "Lorraine S\u00faarez Carmona"
            ],
            [
                "Marina Castro Medina"
            ],
            [
                "Nadia Caba Rodr\u00edguez"
            ],
            [
                "Paul Hamm"
            ],
            [
                "Rosa Clarissa Ort\u00edz Melo"
            ]
        ]
    },
    {
        "question": "Return the names of the gymnasts.",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T2.Name",
        "db_id": "gymnast",
        "answers": [
            [
                "Paul Hamm"
            ],
            [
                "Lorraine S\u00faarez Carmona"
            ],
            [
                "Elizabeth Qui\u00f1\u00f3nez Aroyo"
            ],
            [
                "Nadia Caba Rodr\u00edguez"
            ],
            [
                "Clary Sermina Delgado Cid"
            ],
            [
                "Marina Castro Medina"
            ],
            [
                "Endis de los Santos \u00c1lvarez"
            ]
        ]
    },
    {
        "question": "What are the names of gymnasts whose hometown is not \"Santo Domingo\"?",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nWHERE T2.Hometown <> 'Santo Domingo'\nRETURN T2.Name",
        "db_id": "gymnast",
        "answers": [
            [
                "Lorraine S\u00faarez Carmona"
            ],
            [
                "Clary Sermina Delgado Cid"
            ],
            [
                "Endis de los Santos \u00c1lvarez"
            ]
        ]
    },
    {
        "question": "Return the age of the person with the greatest height.",
        "query": "MATCH (people:`gymnast.people`)\nRETURN people.Age\nORDER BY people.Height DESC\nLIMIT 1",
        "db_id": "gymnast",
        "answers": [
            [
                23.0
            ]
        ]
    },
    {
        "question": "List the names of the top 5 oldest people.",
        "query": "MATCH (people:`gymnast.people`)\nRETURN people.Name\nORDER BY people.Age DESC\nLIMIT 5",
        "db_id": "gymnast",
        "answers": [
            [
                "Paul Hamm"
            ],
            [
                "Endis de los Santos \u00c1lvarez"
            ],
            [
                "Rosa Clarissa Ort\u00edz Melo"
            ],
            [
                "Nadia Caba Rodr\u00edguez"
            ],
            [
                "Lorraine S\u00faarez Carmona"
            ]
        ]
    },
    {
        "question": "Return the total points of the gymnast with the lowest age.",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T1.Total_Points\nORDER BY T2.Age ASC\nLIMIT 1",
        "db_id": "gymnast",
        "answers": [
            [
                57.649
            ]
        ]
    },
    {
        "question": "What is the average age of all gymnasts?",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN avg(T2.Age)",
        "db_id": "gymnast",
        "answers": [
            [
                21.714285714285715
            ]
        ]
    },
    {
        "question": "Return the hometown that is most common among gymnasts.",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nWITH T2.Hometown AS Hometown, count(T2.Hometown) AS count\nRETURN Hometown\nORDER BY count DESC\nLIMIT 1",
        "db_id": "gymnast",
        "answers": [
            [
                "Santo Domingo"
            ]
        ]
    },
    {
        "question": "Give the hometowns from which two or more gymnasts are from.",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nWITH count(*) AS count, T2.Hometown AS Hometown\nWHERE count  >= 2\nRETURN Hometown",
        "db_id": "gymnast",
        "answers": [
            [
                "Santo Domingo"
            ]
        ]
    },
    {
        "question": "List the names of gymnasts in ascending order by their heights.",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T2.Name\nORDER BY T2.Height ASC",
        "db_id": "gymnast",
        "answers": [
            [
                "Paul Hamm"
            ],
            [
                "Elizabeth Qui\u00f1\u00f3nez Aroyo"
            ],
            [
                "Endis de los Santos \u00c1lvarez"
            ],
            [
                "Lorraine S\u00faarez Carmona"
            ],
            [
                "Clary Sermina Delgado Cid"
            ],
            [
                "Marina Castro Medina"
            ],
            [
                "Nadia Caba Rodr\u00edguez"
            ]
        ]
    },
    {
        "question": "Count the number of different hometowns of these people.",
        "query": "MATCH (people:`gymnast.people`)\nRETURN count(DISTINCT people.Hometown)",
        "db_id": "gymnast",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "question": "Show the ages of gymnasts in descending order of total points.",
        "query": "MATCH (T1:`gymnast.gymnast`)-[]-(T2:`gymnast.people`)\nRETURN T2.Age\nORDER BY T1.Total_Points DESC",
        "db_id": "gymnast",
        "answers": [
            [
                24.0
            ],
            [
                21.0
            ],
            [
                20.0
            ],
            [
                22.0
            ],
            [
                21.0
            ],
            [
                20.0
            ],
            [
                24.0
            ]
        ]
    },
    {
        "question": "Count the number of accounts.",
        "query": "MATCH (accounts:`small_bank_1.ACCOUNTS`)\nRETURN count(*)",
        "db_id": "small_bank_1",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "Find the average checking balance.",
        "query": "MATCH (checking:`small_bank_1.CHECKING`)\nRETURN avg(checking.balance)",
        "db_id": "small_bank_1",
        "answers": [
            [
                4583.428571428572
            ]
        ]
    },
    {
        "question": "List all customers\u2019 names in the alphabetical order.",
        "query": "MATCH (accounts:`small_bank_1.ACCOUNTS`)\nRETURN accounts.name\nORDER BY accounts.name",
        "db_id": "small_bank_1",
        "answers": [
            [
                "Brown"
            ],
            [
                "Granger"
            ],
            [
                "O'mahony"
            ],
            [
                "Porter"
            ],
            [
                "Wang"
            ],
            [
                "Weeks"
            ],
            [
                "Wesley"
            ]
        ]
    },
    {
        "question": "Find the number of checking accounts for each account name.",
        "query": "MATCH (T1:`small_bank_1.ACCOUNTS`)-[]-(T2:`small_bank_1.CHECKING`)\nWITH T1.name AS name, count(T1.name) AS count\nRETURN count,name",
        "db_id": "small_bank_1",
        "answers": [
            [
                1,
                "Brown"
            ],
            [
                1,
                "Wang"
            ],
            [
                1,
                "O'mahony"
            ],
            [
                1,
                "Weeks"
            ],
            [
                1,
                "Granger"
            ],
            [
                1,
                "Porter"
            ],
            [
                1,
                "Wesley"
            ]
        ]
    },
    {
        "question": "What are the names of customers with accounts, and how many checking accounts do each of them have?",
        "query": "MATCH (T1:`small_bank_1.ACCOUNTS`)-[]-(T2:`small_bank_1.CHECKING`)\nWITH T1.name AS name, count(T1.name) AS count\nRETURN count,name",
        "db_id": "small_bank_1",
        "answers": [
            [
                1,
                "Brown"
            ],
            [
                1,
                "Wang"
            ],
            [
                1,
                "O'mahony"
            ],
            [
                1,
                "Weeks"
            ],
            [
                1,
                "Granger"
            ],
            [
                1,
                "Porter"
            ],
            [
                1,
                "Wesley"
            ]
        ]
    },
    {
        "question": "Find the name and savings balance of the top 3 accounts with the highest saving balance sorted by savings balance in descending order.",
        "query": "MATCH (T1:`small_bank_1.ACCOUNTS`)-[]-(T2:`small_bank_1.SAVINGS`)\nRETURN T1.name,T2.balance\nORDER BY T2.balance DESC\nLIMIT 3",
        "db_id": "small_bank_1",
        "answers": [
            [
                "Wang",
                999999999.0
            ],
            [
                "O'mahony",
                230000.0
            ],
            [
                "Brown",
                200000.0
            ]
        ]
    },
    {
        "question": "What are names and savings balances of the three accounts with the highest savings balances?",
        "query": "MATCH (T1:`small_bank_1.ACCOUNTS`)-[]-(T2:`small_bank_1.SAVINGS`)\nRETURN T1.name,T2.balance\nORDER BY T2.balance DESC\nLIMIT 3",
        "db_id": "small_bank_1",
        "answers": [
            [
                "Wang",
                999999999.0
            ],
            [
                "O'mahony",
                230000.0
            ],
            [
                "Brown",
                200000.0
            ]
        ]
    },
    {
        "question": "List the name of browsers in descending order by market share.",
        "query": "MATCH (browser:`browser_web.browser`)\nRETURN browser.name\nORDER BY browser.market_share DESC",
        "db_id": "browser_web",
        "answers": [
            [
                "Internet Explorer"
            ],
            [
                "Firefox"
            ],
            [
                "Safari"
            ],
            [
                "Opera"
            ]
        ]
    },
    {
        "question": "List the ids, names and market shares of all browsers.",
        "query": "MATCH (browser:`browser_web.browser`)\nRETURN browser.id,browser.name,browser.market_share",
        "db_id": "browser_web",
        "answers": [
            [
                1,
                "Internet Explorer",
                28.96
            ],
            [
                2,
                "Firefox",
                18.11
            ],
            [
                3,
                "Safari",
                8.54
            ],
            [
                4,
                "Opera",
                1.2
            ]
        ]
    },
    {
        "question": "How many different kinds of clients are supported by the web clients accelerators?",
        "query": "MATCH (web_client_accelerator:`browser_web.Web_client_accelerator`)\nRETURN count(DISTINCT web_client_accelerator.Client)",
        "db_id": "browser_web",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "question": "How many accelerators are not compatible with the browsers listed ?",
        "query": "MATCH (web_client_accelerator:`browser_web.Web_client_accelerator`)\nWHERE NOT (web_client_accelerator:`browser_web.Web_client_accelerator`)-[:`browser_web.accelerator_compatible_browser`]-()\nRETURN count(*)",
        "db_id": "browser_web",
        "answers": [
            [
                14
            ]
        ]
    },
    {
        "question": "Find the number of web accelerators used for each Operating system.",
        "query": "MATCH (web_client_accelerator:`browser_web.Web_client_accelerator`)\nWITH web_client_accelerator.Operating_system AS Operating_system, count(web_client_accelerator.Operating_system) AS count\nRETURN Operating_system,count",
        "db_id": "browser_web",
        "answers": [
            [
                "Appliance (Linux)",
                1
            ],
            [
                "Windows",
                3
            ],
            [
                "Windows, Mac, Linux and Mobile devices",
                1
            ],
            [
                "Any",
                1
            ],
            [
                "Windows, except NT and 95",
                1
            ],
            [
                "Windows, Mac",
                3
            ],
            [
                "Windows, Mac and Mobile devices",
                1
            ],
            [
                "Android, Linux, Mac and Windows devices",
                1
            ],
            [
                "Unix (Linux, *BSD, Mac OS X, others), Windows",
                2
            ],
            [
                "Windows, Mac, Mobile devices",
                1
            ],
            [
                "Any system with Java 1.6 VM available",
                1
            ],
            [
                "Windows, Linux, Mac OS, Symbian, WindowsMobile",
                1
            ],
            [
                "Windows (2000 onwards)",
                1
            ],
            [
                "Unix (Linux, *BSD, Mac OS X, others)",
                1
            ]
        ]
    },
    {
        "question": "Count the number of wrestlers.",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN count(*)",
        "db_id": "wrestler",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "question": "List the names of wrestlers in descending order of days held.",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN wrestler.Name\nORDER BY wrestler.Days_held DESC",
        "db_id": "wrestler",
        "answers": [
            [
                "The Great Sasuke \u00a7"
            ],
            [
                "Gran Hamada"
            ],
            [
                "Shinjiro Otani \u00a7"
            ],
            [
                "\u00daltimo Drag\u00f3n \u00a7"
            ],
            [
                "El Samurai \u00a7"
            ],
            [
                "Rey Misterio Sr."
            ],
            [
                "Jushin Liger \u00a7"
            ],
            [
                "Villa\u00f1o IV"
            ],
            [
                "Fishman"
            ],
            [
                "El Samurai"
            ]
        ]
    },
    {
        "question": "Return the name of the wrestler who had the lowest number of days held.",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN wrestler.Name\nORDER BY wrestler.Days_held ASC\nLIMIT 1",
        "db_id": "wrestler",
        "answers": [
            [
                "El Samurai"
            ]
        ]
    },
    {
        "question": "What are the distinct reigns of wrestlers whose location is not \"Tokyo,Japan\" ?",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nWHERE wrestler.Location <> 'Tokyo , Japan'\nRETURN DISTINCT wrestler.Reign",
        "db_id": "wrestler",
        "answers": [
            [
                "1"
            ],
            [
                "2"
            ]
        ]
    },
    {
        "question": "Give the names and locations of all wrestlers.",
        "query": "MATCH (wrestler:`wrestler.wrestler`)\nRETURN wrestler.Name,wrestler.Location",
        "db_id": "wrestler",
        "answers": [
            [
                "Rey Misterio Sr.",
                "Tijuana , Mexico"
            ],
            [
                "Fishman",
                "Tijuana , Mexico"
            ],
            [
                "Villa\u00f1o IV",
                "Tijuana , Mexico"
            ],
            [
                "Gran Hamada",
                "Tokyo , Japan"
            ],
            [
                "El Samurai",
                "Tokyo , Japan"
            ],
            [
                "The Great Sasuke \u00a7",
                "Tokyo , Japan"
            ],
            [
                "\u00daltimo Drag\u00f3n \u00a7",
                "Osaka , Japan"
            ],
            [
                "Jushin Liger \u00a7",
                "Tokyo , Japan"
            ],
            [
                "El Samurai \u00a7",
                "Sapporo , Japan"
            ],
            [
                "Shinjiro Otani \u00a7",
                "Nagoya , Japan"
            ]
        ]
    },
    {
        "question": "What are the elimination moves of wrestlers whose team is \"Team Orton\"?",
        "query": "MATCH (elimination:`wrestler.Elimination`)\nWHERE elimination.Team = 'Team Orton'\nRETURN elimination.Elimination_Move",
        "db_id": "wrestler",
        "answers": [
            [
                "Go To Sleep"
            ],
            [
                "Spear"
            ]
        ]
    },
    {
        "question": "Show different teams in eliminations and the number of eliminations from each team.",
        "query": "MATCH (elimination:`wrestler.Elimination`)\nWITH count(elimination.Team) AS count, elimination.Team AS Team\nRETURN Team,count",
        "db_id": "wrestler",
        "answers": [
            [
                "Team Orton",
                2
            ],
            [
                "Team Batista",
                4
            ]
        ]
    },
    {
        "question": "Show teams that have suffered more than three eliminations.",
        "query": "MATCH (elimination:`wrestler.Elimination`)\nWITH count(*) AS count, elimination.Team AS Team\nWHERE count  > 3\nRETURN Team",
        "db_id": "wrestler",
        "answers": [
            [
                "Team Batista"
            ]
        ]
    }
]