[
    {
        "db_id": "scientist_1",
        "query": "MATCH (projects:`scientist_1.Projects`)\nWHERE 100<=projects.Hours<=300\nRETURN projects.Name",
        "question": "Find the name of projects that require between 100 and 300 hours of work.",
        "answers": [
            [
                "Winds: Studying Bernoullis Principle"
            ],
            [
                "Aerodynamics and Bridge Design"
            ],
            [
                "Aerodynamics and Gas Mileage"
            ],
            [
                "A Matter of Time"
            ],
            [
                "A Puzzling Parallax"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (projects:`scientist_1.Projects`)\nWHERE 100<=projects.Hours<=300\nRETURN projects.Name",
        "question": "What are the names of projects that require between 100 and 300 hours?",
        "answers": [
            [
                "Winds: Studying Bernoullis Principle"
            ],
            [
                "Aerodynamics and Bridge Design"
            ],
            [
                "Aerodynamics and Gas Mileage"
            ],
            [
                "A Matter of Time"
            ],
            [
                "A Puzzling Parallax"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (scientists:`scientist_1.Scientists`)\nRETURN scientists.Name\nORDER BY scientists.Name",
        "question": "List the names of all scientists sorted in alphabetical order.",
        "answers": [
            [
                "Anand Manikutty"
            ],
            [
                "Carol Smith"
            ],
            [
                "David Smith"
            ],
            [
                "Elizabeth Doe"
            ],
            [
                "Eric Goldsmith"
            ],
            [
                "George ODonnell"
            ],
            [
                "Joe Stevens"
            ],
            [
                "John Doe"
            ],
            [
                "Kumar Swamy"
            ],
            [
                "Mary-Anne Foster"
            ],
            [
                "Michael Rogers"
            ],
            [
                "Zacary Efron"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (scientists:`scientist_1.Scientists`)\nRETURN scientists.Name\nORDER BY scientists.Name",
        "question": "What are the names of all the scientists in alphabetical order?",
        "answers": [
            [
                "Anand Manikutty"
            ],
            [
                "Carol Smith"
            ],
            [
                "David Smith"
            ],
            [
                "Elizabeth Doe"
            ],
            [
                "Eric Goldsmith"
            ],
            [
                "George ODonnell"
            ],
            [
                "Joe Stevens"
            ],
            [
                "John Doe"
            ],
            [
                "Kumar Swamy"
            ],
            [
                "Mary-Anne Foster"
            ],
            [
                "Michael Rogers"
            ],
            [
                "Zacary Efron"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (T1:`scientist_1.Projects`)-[T2:`scientist_1.AssignedTo`]-()\nRETURN count(*),T1.Name",
        "question": "Find the number of scientists involved for each project name.",
        "answers": [
            [
                1,
                "Winds: Studying Bernoullis Principle"
            ],
            [
                2,
                "Aerodynamics and Gas Mileage"
            ],
            [
                1,
                "Aerodynamics and Ice Hockey"
            ],
            [
                1,
                "A Matter of Time"
            ],
            [
                1,
                "A Puzzling Parallax"
            ],
            [
                3,
                "Build Your Own Telescope"
            ],
            [
                1,
                "Juicy: Extracting Apple Juice with Pectinase"
            ],
            [
                2,
                "A Silver-Cleaning Battery"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (T1:`scientist_1.Projects`)-[T2:`scientist_1.AssignedTo`]-()\nRETURN count(*),T1.Name",
        "question": "What are the naems of all the projects, and how many scientists were assigned to each of them?",
        "answers": [
            [
                1,
                "Winds: Studying Bernoullis Principle"
            ],
            [
                2,
                "Aerodynamics and Gas Mileage"
            ],
            [
                1,
                "Aerodynamics and Ice Hockey"
            ],
            [
                1,
                "A Matter of Time"
            ],
            [
                1,
                "A Puzzling Parallax"
            ],
            [
                3,
                "Build Your Own Telescope"
            ],
            [
                1,
                "Juicy: Extracting Apple Juice with Pectinase"
            ],
            [
                2,
                "A Silver-Cleaning Battery"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (T1:`scientist_1.Projects`)-[T2:`scientist_1.AssignedTo`]-()\nWHERE T1.Hours > 300\nRETURN count(*),T1.Name",
        "question": "Find the number of scientists involved for the projects that require more than 300 hours.",
        "answers": [
            [
                1,
                "Aerodynamics and Ice Hockey"
            ],
            [
                3,
                "Build Your Own Telescope"
            ],
            [
                1,
                "Juicy: Extracting Apple Juice with Pectinase"
            ],
            [
                2,
                "A Silver-Cleaning Battery"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (T1:`scientist_1.Projects`)-[T2:`scientist_1.AssignedTo`]-()\nWHERE T1.Hours > 300\nRETURN count(*),T1.Name",
        "question": "What are the names of projects that require more than 300 hours, and how many scientists are assigned to each?",
        "answers": [
            [
                1,
                "Aerodynamics and Ice Hockey"
            ],
            [
                3,
                "Build Your Own Telescope"
            ],
            [
                1,
                "Juicy: Extracting Apple Juice with Pectinase"
            ],
            [
                2,
                "A Silver-Cleaning Battery"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (T1:`scientist_1.Scientists`)-[T2:`scientist_1.AssignedTo`]-()\nRETURN count(*),T1.Name",
        "question": "Find the number of projects which each scientist is working on and scientist's name.",
        "answers": [
            [
                1,
                "Michael Rogers"
            ],
            [
                1,
                "Anand Manikutty"
            ],
            [
                1,
                "Carol Smith"
            ],
            [
                1,
                "Joe Stevens"
            ],
            [
                1,
                "Mary-Anne Foster"
            ],
            [
                1,
                "George ODonnell"
            ],
            [
                1,
                "John Doe"
            ],
            [
                1,
                "David Smith"
            ],
            [
                1,
                "Zacary Efron"
            ],
            [
                1,
                "Eric Goldsmith"
            ],
            [
                1,
                "Elizabeth Doe"
            ],
            [
                1,
                "Kumar Swamy"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (T1:`scientist_1.Scientists`)-[T2:`scientist_1.AssignedTo`]-()\nRETURN count(*),T1.Name",
        "question": "What are the names of the scientists, and how many projects are each of them working on?",
        "answers": [
            [
                1,
                "Michael Rogers"
            ],
            [
                1,
                "Anand Manikutty"
            ],
            [
                1,
                "Carol Smith"
            ],
            [
                1,
                "Joe Stevens"
            ],
            [
                1,
                "Mary-Anne Foster"
            ],
            [
                1,
                "George ODonnell"
            ],
            [
                1,
                "John Doe"
            ],
            [
                1,
                "David Smith"
            ],
            [
                1,
                "Zacary Efron"
            ],
            [
                1,
                "Eric Goldsmith"
            ],
            [
                1,
                "Elizabeth Doe"
            ],
            [
                1,
                "Kumar Swamy"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (T2:`scientist_1.Scientists`)-[T1:`scientist_1.AssignedTo`]-()\nRETURN T2.Name",
        "question": "Find the name of scientists who are assigned to some project.",
        "answers": [
            [
                "Michael Rogers"
            ],
            [
                "Anand Manikutty"
            ],
            [
                "Carol Smith"
            ],
            [
                "Joe Stevens"
            ],
            [
                "Mary-Anne Foster"
            ],
            [
                "George ODonnell"
            ],
            [
                "John Doe"
            ],
            [
                "David Smith"
            ],
            [
                "Zacary Efron"
            ],
            [
                "Eric Goldsmith"
            ],
            [
                "Elizabeth Doe"
            ],
            [
                "Kumar Swamy"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (T2:`scientist_1.Scientists`)-[T1:`scientist_1.AssignedTo`]-()\nRETURN T2.Name",
        "question": "What are the names of scientists who are assigned to any project?",
        "answers": [
            [
                "Michael Rogers"
            ],
            [
                "Anand Manikutty"
            ],
            [
                "Carol Smith"
            ],
            [
                "Joe Stevens"
            ],
            [
                "Mary-Anne Foster"
            ],
            [
                "George ODonnell"
            ],
            [
                "John Doe"
            ],
            [
                "David Smith"
            ],
            [
                "Zacary Efron"
            ],
            [
                "Eric Goldsmith"
            ],
            [
                "Elizabeth Doe"
            ],
            [
                "Kumar Swamy"
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (T1:`scientist_1.Scientists`)-[T2:`scientist_1.AssignedTo`]-(T3:`scientist_1.Projects`)\nRETURN T1.Name,T3.Name,T3.Hours\nORDER BY T3.Name,T1.Name",
        "question": "List all the scientists' names, their projects' names, and the hours worked by that scientist on each project, in alphabetical order of project name, and then scientist name.",
        "answers": [
            [
                "Elizabeth Doe",
                "A Matter of Time",
                112
            ],
            [
                "Kumar Swamy",
                "A Puzzling Parallax",
                299
            ],
            [
                "John Doe",
                "A Silver-Cleaning Battery",
                545
            ],
            [
                "Zacary Efron",
                "A Silver-Cleaning Battery",
                545
            ],
            [
                "Anand Manikutty",
                "Aerodynamics and Gas Mileage",
                256
            ],
            [
                "Eric Goldsmith",
                "Aerodynamics and Gas Mileage",
                256
            ],
            [
                "George ODonnell",
                "Aerodynamics and Ice Hockey",
                789
            ],
            [
                "Carol Smith",
                "Build Your Own Telescope",
                6546
            ],
            [
                "David Smith",
                "Build Your Own Telescope",
                6546
            ],
            [
                "Joe Stevens",
                "Build Your Own Telescope",
                6546
            ],
            [
                "Mary-Anne Foster",
                "Juicy: Extracting Apple Juice with Pectinase",
                321
            ],
            [
                "Michael Rogers",
                "Winds: Studying Bernoullis Principle",
                156
            ]
        ]
    },
    {
        "db_id": "scientist_1",
        "query": "MATCH (T1:`scientist_1.Scientists`)-[T2:`scientist_1.AssignedTo`]-(T3:`scientist_1.Projects`)\nRETURN T1.Name,T3.Name,T3.Hours\nORDER BY T3.Name,T1.Name",
        "question": "What are the names of each scientist, the names of the projects that they work on, and the hours for each of those projects, listed in alphabetical order by project name, then scientist name.",
        "answers": [
            [
                "Elizabeth Doe",
                "A Matter of Time",
                112
            ],
            [
                "Kumar Swamy",
                "A Puzzling Parallax",
                299
            ],
            [
                "John Doe",
                "A Silver-Cleaning Battery",
                545
            ],
            [
                "Zacary Efron",
                "A Silver-Cleaning Battery",
                545
            ],
            [
                "Anand Manikutty",
                "Aerodynamics and Gas Mileage",
                256
            ],
            [
                "Eric Goldsmith",
                "Aerodynamics and Gas Mileage",
                256
            ],
            [
                "George ODonnell",
                "Aerodynamics and Ice Hockey",
                789
            ],
            [
                "Carol Smith",
                "Build Your Own Telescope",
                6546
            ],
            [
                "David Smith",
                "Build Your Own Telescope",
                6546
            ],
            [
                "Joe Stevens",
                "Build Your Own Telescope",
                6546
            ],
            [
                "Mary-Anne Foster",
                "Juicy: Extracting Apple Juice with Pectinase",
                321
            ],
            [
                "Michael Rogers",
                "Winds: Studying Bernoullis Principle",
                156
            ]
        ]
    },
    {
        "db_id": "wine_1",
        "query": "MATCH ()-[wine:`wine_1.wine`]-()\nRETURN wine.Name\nORDER BY wine.Score\nLIMIT 1",
        "question": "What is the name of the highest rated wine?",
        "answers": [
            [
                "Zinfandel"
            ]
        ]
    },
    {
        "db_id": "wine_1",
        "query": "MATCH ()-[wine:`wine_1.wine`]-()\nRETURN wine.Winery\nORDER BY wine.Score\nLIMIT 1",
        "question": "Which winery is the wine that has the highest score from?",
        "answers": [
            [
                "Renwood"
            ]
        ]
    },
    {
        "db_id": "wine_1",
        "query": "MATCH ()-[wine:`wine_1.wine`]-()\nRETURN wine.Winery\nORDER BY wine.Score\nLIMIT 1",
        "question": "What is the winery at which the wine with the highest score was made?",
        "answers": [
            [
                "Renwood"
            ]
        ]
    },
    {
        "db_id": "wine_1",
        "query": "MATCH (appellations:`wine_1.appellations`)\nWHERE appellations.County = 'Napa'\nRETURN count(*)",
        "question": "How many appelations are in Napa Country?",
        "answers": [
            [
                11
            ]
        ]
    },
    {
        "db_id": "wine_1",
        "query": "MATCH (appellations:`wine_1.appellations`)\nWHERE appellations.County = 'Napa'\nRETURN count(*)",
        "question": "Count the number of appelations in Napa County.",
        "answers": [
            [
                11
            ]
        ]
    },
    {
        "db_id": "wine_1",
        "query": "MATCH (T1:`wine_1.grapes`)-[T2:`wine_1.wine`]-()\nWHERE T1.Color = 'White' AND T2.Score > 90\nRETURN DISTINCT T1.Grape",
        "question": "Find the the grape whose white color grapes are used to produce wines with scores higher than 90.",
        "answers": [
            [
                "Chardonnay"
            ],
            [
                "Roussanne"
            ],
            [
                "Sauvignon Blanc"
            ]
        ]
    },
    {
        "db_id": "wine_1",
        "query": "MATCH (T1:`wine_1.grapes`)-[T2:`wine_1.wine`]-()\nWHERE T1.Color = 'White' AND T2.Score > 90\nRETURN DISTINCT T1.Grape",
        "question": "Find the white grape used to produce wines with scores above 90.",
        "answers": [
            [
                "Chardonnay"
            ],
            [
                "Roussanne"
            ],
            [
                "Sauvignon Blanc"
            ]
        ]
    },
    {
        "db_id": "wine_1",
        "query": "MATCH ()-[wine:`wine_1.wine`]-()\nWHERE wine.Year = 2009 AND wine.Grape = 'Zinfandel'\nRETURN avg(wine.Price),avg(wine.Cases)",
        "question": "What are the average prices and cases of wines produced in the year of 2009 and made of Zinfandel grape?",
        "answers": [
            [
                18.0,
                15000.0
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (station:`train_station.station`)\nRETURN station.Name,station.Location,station.Number_of_Platforms",
        "question": "Show the name, location, and number of platforms for all stations.",
        "answers": [
            [
                "London Waterloo",
                "London",
                19
            ],
            [
                "London Victoria",
                "London",
                19
            ],
            [
                "London Bridge",
                "London",
                12
            ],
            [
                "London Liverpool Street",
                "London",
                18
            ],
            [
                "London Euston",
                "London",
                18
            ],
            [
                "London Charing Cross",
                "London",
                6
            ],
            [
                "Birmingham New Street",
                "Birmingham",
                13
            ],
            [
                "London King's Cross",
                "London",
                12
            ],
            [
                "Glasgow Central",
                "Glasgow",
                17
            ],
            [
                "East Croydon",
                "London",
                6
            ],
            [
                "London St Pancras",
                "London",
                15
            ],
            [
                "Stratford",
                "London",
                15
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (station:`train_station.station`)\nWHERE station.Location <> 'London'\nRETURN station.Name,station.Total_Passengers",
        "question": "Show the names and total passengers for all train stations not in London.",
        "answers": [
            [
                "Birmingham New Street",
                36.331
            ],
            [
                "Glasgow Central",
                29.658
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (station:`train_station.station`)\nRETURN station.Name,station.Main_Services\nORDER BY station.Total_Passengers DESC\nLIMIT 3",
        "question": "Show the names and main services for train stations that have the top three total number of passengers.",
        "answers": [
            [
                "London Waterloo",
                "South Western Main Line West of England Main Line"
            ],
            [
                "London Victoria",
                "Brighton Main Line Chatham Main Line"
            ],
            [
                "London Bridge",
                "South Eastern Main Line Thameslink"
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (station:`train_station.station`)\nWHERE station.Number_of_Platforms >= 15 AND station.Total_Passengers > 25\nRETURN DISTINCT station.Location",
        "question": "Show all locations that have train stations with at least 15 platforms and train stations with more than 25 total passengers.",
        "answers": [
            [
                "London"
            ],
            [
                "Glasgow"
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (station:`train_station.station`)\nRETURN station.Location\nORDER BY station.Location DESC\nLIMIT 1",
        "question": "Show the location with most number of train stations.",
        "answers": [
            [
                "London"
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (train:`train_station.train`)\nRETURN train.Name,train.Time,train.Service",
        "question": "Show the name, time, and service for all trains.",
        "answers": [
            [
                "Ananthapuri Express",
                "17:15",
                "Daily"
            ],
            [
                "Guruvayur Express",
                "22:10",
                "Daily"
            ],
            [
                "Guruvayur Express",
                "4:49",
                "Daily"
            ],
            [
                "Ananthapuri Express",
                "11:35",
                "Daily"
            ],
            [
                "Jayanthi Janatha Express",
                "06:30",
                "Daily"
            ],
            [
                "Island Express",
                "11:15",
                "Daily"
            ],
            [
                "Madurai Fast Passenger",
                "21:49",
                "Daily"
            ],
            [
                "Quilon Fast Passenger",
                "04:55",
                "Daily"
            ],
            [
                "Island Express",
                "16:59",
                "Daily"
            ],
            [
                "Jayanthi Janatha Express",
                "10:38",
                "Daily"
            ],
            [
                "Parasuram Express",
                "04:20",
                "Daily"
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (train:`train_station.train`)\nRETURN count(*)",
        "question": "Show the number of trains",
        "answers": [
            [
                11
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (train:`train_station.train`)\nRETURN train.Name,train.Service\nORDER BY train.Time",
        "question": "Show the name and service for all trains in order by time.",
        "answers": [
            [
                "Parasuram Express",
                "Daily"
            ],
            [
                "Quilon Fast Passenger",
                "Daily"
            ],
            [
                "Jayanthi Janatha Express",
                "Daily"
            ],
            [
                "Jayanthi Janatha Express",
                "Daily"
            ],
            [
                "Island Express",
                "Daily"
            ],
            [
                "Ananthapuri Express",
                "Daily"
            ],
            [
                "Island Express",
                "Daily"
            ],
            [
                "Ananthapuri Express",
                "Daily"
            ],
            [
                "Madurai Fast Passenger",
                "Daily"
            ],
            [
                "Guruvayur Express",
                "Daily"
            ],
            [
                "Guruvayur Express",
                "Daily"
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (T2:`train_station.station`)-[T1:`train_station.train_station`]-()\nRETURN T2.Name,count(*)",
        "question": "Show the station name and number of trains in each station.",
        "answers": [
            [
                "London Waterloo",
                3
            ],
            [
                "London Victoria",
                1
            ],
            [
                "London Bridge",
                1
            ],
            [
                "London Euston",
                1
            ],
            [
                "London King's Cross",
                1
            ],
            [
                "Glasgow Central",
                2
            ],
            [
                "East Croydon",
                2
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (T2:`train_station.station`)-[T1:`train_station.train_station`]-(T3:`train_station.train`)\nRETURN T2.Name,T3.Name",
        "question": "show the train name and station name for each train.",
        "answers": [
            [
                "London Waterloo",
                "Ananthapuri Express"
            ],
            [
                "London Waterloo",
                "Guruvayur Express"
            ],
            [
                "London Waterloo",
                "Guruvayur Express"
            ],
            [
                "London Victoria",
                "Ananthapuri Express"
            ],
            [
                "London Bridge",
                "Jayanthi Janatha Express"
            ],
            [
                "London Euston",
                "Island Express"
            ],
            [
                "London King's Cross",
                "Madurai Fast Passenger"
            ],
            [
                "Glasgow Central",
                "Quilon Fast Passenger"
            ],
            [
                "Glasgow Central",
                "Island Express"
            ],
            [
                "East Croydon",
                "Jayanthi Janatha Express"
            ],
            [
                "East Croydon",
                "Parasuram Express"
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (T2:`train_station.station`)-[T1:`train_station.train_station`]-(T3:`train_station.train`)\nWHERE T2.Location = 'London'\nRETURN T3.Name,T3.Time\nORDER BY T3.Time DESC",
        "question": "Show all train names and times in stations in London in descending order by train time.",
        "answers": [
            [
                "Guruvayur Express",
                "4:49"
            ],
            [
                "Guruvayur Express",
                "22:10"
            ],
            [
                "Madurai Fast Passenger",
                "21:49"
            ],
            [
                "Ananthapuri Express",
                "17:15"
            ],
            [
                "Ananthapuri Express",
                "11:35"
            ],
            [
                "Island Express",
                "11:15"
            ],
            [
                "Jayanthi Janatha Express",
                "10:38"
            ],
            [
                "Jayanthi Janatha Express",
                "06:30"
            ],
            [
                "Parasuram Express",
                "04:20"
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (T2:`train_station.station`)-[T1:`train_station.train_station`]-()\nWITH count(T1.Station_ID) AS cnt, T2\nRETURN T2.Name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Show the station name with greatest number of trains.",
        "answers": [
            [
                "London Waterloo"
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (T2:`train_station.station`)-[T1:`train_station.train_station`]-()\nWITH T2.Name AS Name, count(*) AS count\nWHERE count  >= 2\nRETURN Name",
        "question": "Show the station name with at least two trains.",
        "answers": [
            [
                "London Waterloo"
            ],
            [
                "Glasgow Central"
            ],
            [
                "East Croydon"
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (station:`train_station.station`)\nWITH count(*) AS count, station.Location AS Location\nWHERE count  = 1\nRETURN Location",
        "question": "Show all locations with only 1 station.",
        "answers": [
            [
                "Birmingham"
            ],
            [
                "Glasgow"
            ]
        ]
    },
    {
        "db_id": "train_station",
        "query": "MATCH (station:`train_station.station`)\nRETURN station.Name,station.Location\nORDER BY station.Annual_entry_exit,station.Annual_interchanges",
        "question": "List the names and locations of all stations ordered by their yearly entry exit and interchange amounts.",
        "answers": [
            [
                "East Croydon",
                "London"
            ],
            [
                "Stratford",
                "London"
            ],
            [
                "London St Pancras",
                "London"
            ],
            [
                "Glasgow Central",
                "Glasgow"
            ],
            [
                "London King's Cross",
                "London"
            ],
            [
                "Birmingham New Street",
                "Birmingham"
            ],
            [
                "London Euston",
                "London"
            ],
            [
                "London Charing Cross",
                "London"
            ],
            [
                "London Bridge",
                "London"
            ],
            [
                "London Liverpool Street",
                "London"
            ],
            [
                "London Victoria",
                "London"
            ],
            [
                "London Waterloo",
                "London"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (vehicles:`driving_school.Vehicles`)\nRETURN vehicles.vehicle_id",
        "question": "List all vehicle id",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (vehicles:`driving_school.Vehicles`)\nRETURN vehicles.vehicle_id",
        "question": "What are the ids of all vehicles?",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ]
        ]
    }
]