[
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN apartments.apt_type_code,max(apartments.room_count),min(apartments.room_count)",
        "question": "Show each apartment type code, and the maximum and minimum number of rooms for each type.",
        "answers": [
            [
                "Flat",
                "9",
                "3"
            ],
            [
                "Studio",
                "9",
                "6"
            ],
            [
                "Duplex",
                "9",
                "3"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN apartments.apt_type_code,max(apartments.room_count),min(apartments.room_count)",
        "question": "Return each apartment type code along with the maximum and minimum number of rooms among each type.",
        "answers": [
            [
                "Flat",
                "9",
                "3"
            ],
            [
                "Studio",
                "9",
                "6"
            ],
            [
                "Duplex",
                "9",
                "3"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (guests:`apartment_rentals.Guests`)\nRETURN guests.gender_code,count(*)\nORDER BY guests.gender_code DESC",
        "question": "Show each gender code and the corresponding count of guests sorted by the count in descending order.",
        "answers": [
            [
                "Unknown",
                3
            ],
            [
                "Male",
                3
            ],
            [
                "Female",
                9
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (guests:`apartment_rentals.Guests`)\nRETURN guests.gender_code,count(*)\nORDER BY guests.gender_code DESC",
        "question": "Sort the gender codes in descending order of their corresponding number of guests. Return both the gender codes and counts.",
        "answers": [
            [
                "Unknown",
                3
            ],
            [
                "Male",
                3
            ],
            [
                "Female",
                9
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (game:`game_injury.game`)\nWHERE game.Season > 2007\nRETURN count(*)",
        "question": "How many games are held after season 2007?",
        "answers": [
            [
                17
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (game:`game_injury.game`)\nRETURN game.Date\nORDER BY game.Home_team DESC",
        "question": "List the dates of games by the home team name in descending order.",
        "answers": [
            [
                "18 May 2007"
            ],
            [
                "22 September 2007"
            ],
            [
                "9 December 2007"
            ],
            [
                "10 July 2008"
            ],
            [
                "14 October 2009"
            ],
            [
                "8 August 2009"
            ],
            [
                "31 October 2010"
            ],
            [
                "7 July 2011"
            ],
            [
                "9 August 2012"
            ],
            [
                "25 November 2012"
            ],
            [
                "30 June 2013"
            ],
            [
                "16 August 2008"
            ],
            [
                "31 October 2008"
            ],
            [
                "12 July 2009"
            ],
            [
                "14 March 2010"
            ],
            [
                "21 August 2011"
            ],
            [
                "11 March 2012"
            ],
            [
                "26 June 2012"
            ],
            [
                "22 August 2012"
            ],
            [
                "8 August 2013"
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (game:`game_injury.game`)\nRETURN game.Season,game.Home_team,game.Away_team",
        "question": "List the season, home team, away team of all the games.",
        "answers": [
            [
                2007,
                "Quruvchi",
                "Pakhtakor"
            ],
            [
                2007,
                "Pakhtakor",
                "Quruvchi"
            ],
            [
                2007,
                "Pakhtakor",
                "Quruvchi"
            ],
            [
                2008,
                "Pakhtakor",
                "Quruvchi"
            ],
            [
                2008,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2008,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2009,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2009,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2009,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2010,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2010,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2011,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2011,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2012,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2012,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2012,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2012,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2012,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2013,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2013,
                "Bunyodkor",
                "Pakhtakor"
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (stadium:`game_injury.stadium`)\nRETURN max(stadium.Home_Games),min(stadium.Home_Games),avg(stadium.Home_Games)",
        "question": "What are the maximum, minimum and average home games each stadium held?",
        "answers": [
            [
                8,
                8,
                8.0
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (stadium:`game_injury.stadium`)\nWHERE stadium.Capacity_Percentage > 100\nRETURN stadium.Average_Attendance",
        "question": "What is the average attendance of stadiums with capacity percentage higher than 100%?",
        "answers": [
            [
                87047.0
            ],
            [
                71227.0
            ],
            [
                69144.0
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (injury_accident:`game_injury.injury_accident`)\nWHERE injury_accident.Injury <> 'Knee problem'\nRETURN injury_accident.Player,injury_accident.Number_of_matches,injury_accident.Source",
        "question": "What are the player name, number of matches, and information source for players who do not suffer from injury of 'Knee problem'?",
        "answers": [
            [
                "Davide Santon",
                "12",
                "inter.it"
            ],
            [
                "Dejan Stankovi\u0107",
                "2",
                "inter.it"
            ],
            [
                "Wesley Sneijder",
                "1",
                "inter.it"
            ],
            [
                "Diego Milito",
                "1",
                "inter.it"
            ],
            [
                "Javier Zanetti",
                "4",
                "inter.it"
            ],
            [
                "Walter Samuel",
                "3",
                "inter.it"
            ],
            [
                "Thiago Motta",
                "10",
                "inter.it"
            ],
            [
                "Goran Pandev",
                "3",
                "inter.it"
            ],
            [
                "Iv\u00e1n C\u00f3rdoba",
                "1",
                "inter.it"
            ],
            [
                "Esteban Cambiasso",
                "2",
                "inter.it"
            ],
            [
                "Dejan Stankovi\u0107 (2)",
                "4 (6)",
                "inter.it"
            ],
            [
                "Wesley Sneijder (2)",
                "1 (2)",
                "inter.it"
            ],
            [
                "Esteban Cambiasso (2)",
                "4 (6)",
                "inter.it"
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (T1:`game_injury.game`)-[]-(T2:`game_injury.injury_accident`)\nWHERE T2.Player = 'Walter Samuel'\nRETURN T1.Season",
        "question": "What is the season of the game which causes the player 'Walter Samuel' to get injured?",
        "answers": [
            [
                2008
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (T1:`game_injury.game`)-[]-(T2:`game_injury.injury_accident`)\nWITH count(*) AS count, T1.Score AS Score, T1.Date AS Date, T1.id AS id\nWHERE count  >= 2\nRETURN id,Score,Date",
        "question": "What are the ids, scores, and dates of the games which caused at least two injury accidents?",
        "answers": [
            [
                5,
                "1\u20131",
                "16 August 2008"
            ],
            [
                6,
                "3\u20131",
                "31 October 2008"
            ],
            [
                10,
                "2\u20131",
                "14 March 2010"
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (T1:`game_injury.stadium`)-[]-(T2:`game_injury.game`)-[]-(T3:`game_injury.injury_accident`)\nWITH T1, count(T1.id) AS cnt\nRETURN T1.id,T1.name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What are the id and name of the stadium where the most injury accidents happened?",
        "answers": [
            [
                10,
                "Louisiana Superdome"
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (T1:`game_injury.stadium`)-[]-(T2:`game_injury.game`)-[]-(T3:`game_injury.injury_accident`)\nWITH T1, count(T1.id) AS cnt\nRETURN T1.id,T1.name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Find the id and name of the stadium where the largest number of injury accidents occurred.",
        "answers": [
            [
                10,
                "Louisiana Superdome"
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (injury_accident:`game_injury.injury_accident`)\nRETURN count(DISTINCT injury_accident.Source)",
        "question": "How many different kinds of information sources are there for injury accidents?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (game:`game_injury.game`)\nWHERE NOT (game)-[]-(:`game_injury.injury_accident`)    \nRETURN count(*)",
        "question": "How many games are free of injury accidents?",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (T1:`game_injury.injury_accident`)-[]-(T2:`game_injury.game`)\nWHERE T2.Season > 2010\nRETURN count(DISTINCT T1.Injury)",
        "question": "How many distinct kinds of injuries happened after season 2010?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (T1:`game_injury.stadium`)-[]-(T2:`game_injury.game`)\nRETURN T1.id,count(*)",
        "question": "How many games has each stadium held?",
        "answers": [
            [
                1,
                2
            ],
            [
                2,
                2
            ],
            [
                3,
                2
            ],
            [
                4,
                2
            ],
            [
                5,
                2
            ],
            [
                6,
                1
            ],
            [
                7,
                2
            ],
            [
                8,
                1
            ],
            [
                9,
                1
            ],
            [
                10,
                3
            ],
            [
                11,
                1
            ],
            [
                12,
                1
            ]
        ]
    },
    {
        "db_id": "game_injury",
        "query": "MATCH (T1:`game_injury.game`)-[]-(T2:`game_injury.injury_accident`)\nRETURN T1.Date,T2.Player\nORDER BY T1.Season DESC",
        "question": "For each injury accident, find the date of the game and the name of the injured player in the game, and sort the results in descending order of game season.",
        "answers": [
            [
                "7 July 2011",
                "Thiago Motta (2)"
            ],
            [
                "14 March 2010",
                "Dejan Stankovi\u0107 (2)"
            ],
            [
                "14 March 2010",
                "Wesley Sneijder (2)"
            ],
            [
                "31 October 2010",
                "Esteban Cambiasso (2)"
            ],
            [
                "14 October 2009",
                "Iv\u00e1n C\u00f3rdoba"
            ],
            [
                "8 August 2009",
                "Esteban Cambiasso"
            ],
            [
                "10 July 2008",
                "Wesley Sneijder"
            ],
            [
                "16 August 2008",
                "Diego Milito"
            ],
            [
                "16 August 2008",
                "Javier Zanetti"
            ],
            [
                "31 October 2008",
                "Walter Samuel"
            ],
            [
                "31 October 2008",
                "Thiago Motta"
            ],
            [
                "31 October 2008",
                "Goran Pandev"
            ],
            [
                "18 May 2007",
                "Davide Santon"
            ],
            [
                "22 September 2007",
                "Maicon"
            ],
            [
                "9 December 2007",
                "Dejan Stankovi\u0107"
            ]
        ]
    },
    {
        "db_id": "performance_attendance",
        "query": "MATCH (performance:`performance_attendance.performance`)\nRETURN count(*)",
        "question": "How many performances are there?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "performance_attendance",
        "query": "MATCH (performance:`performance_attendance.performance`)\nRETURN performance.Host\nORDER BY performance.Attendance ASC",
        "question": "List the hosts of performances in ascending order of attendance.",
        "answers": [
            [
                "Boston Bruins"
            ],
            [
                "New York Rangers"
            ],
            [
                "Pittsburgh Penguins"
            ],
            [
                "Atlanta Thrashers"
            ],
            [
                "Ottawa Senators"
            ],
            [
                "Montreal Canadiens"
            ]
        ]
    },
    {
        "db_id": "performance_attendance",
        "query": "MATCH (performance:`performance_attendance.performance`)\nRETURN performance.Date,performance.Location",
        "question": "What are the dates and locations of performances?",
        "answers": [
            [
                "February 2",
                "TD Garden"
            ],
            [
                "February 4",
                "Madison Square Garden"
            ],
            [
                "February 5",
                "Verizon Center"
            ],
            [
                "February 7",
                "Verizon Center"
            ],
            [
                "February 10",
                "Bell Centre"
            ],
            [
                "February 11",
                "Scotiabank Place"
            ]
        ]
    },
    {
        "db_id": "performance_attendance",
        "query": "MATCH (performance:`performance_attendance.performance`)\nWHERE performance.Location = 'TD Garden' OR performance.Location = 'Bell Centre'\nRETURN performance.Attendance",
        "question": "Show the attendances of the performances at location \"TD Garden\" or \"Bell Centre\"",
        "answers": [
            [
                165
            ],
            [
                2173
            ]
        ]
    },
    {
        "db_id": "performance_attendance",
        "query": "MATCH (performance:`performance_attendance.performance`)\nRETURN performance.Date\nORDER BY performance.Attendance DESC\nLIMIT 1",
        "question": "What is the date of the performance with the highest number of attendees?",
        "answers": [
            [
                "February 10"
            ]
        ]
    },
    {
        "db_id": "performance_attendance",
        "query": "MATCH (performance:`performance_attendance.performance`)\nRETURN performance.Location,count(*)",
        "question": "Show different locations and the number of performances at each location.",
        "answers": [
            [
                "TD Garden",
                1
            ],
            [
                "Madison Square Garden",
                1
            ],
            [
                "Verizon Center",
                2
            ],
            [
                "Bell Centre",
                1
            ],
            [
                "Scotiabank Place",
                1
            ]
        ]
    },
    {
        "db_id": "performance_attendance",
        "query": "MATCH (performance:`performance_attendance.performance`)\nRETURN performance.Location\nORDER BY performance.Location DESC\nLIMIT 1",
        "question": "Show the most common location of performances.",
        "answers": [
            [
                "Verizon Center"
            ]
        ]
    },
    {
        "db_id": "performance_attendance",
        "query": "MATCH (performance:`performance_attendance.performance`)\nWITH count(*) AS count, performance.Location AS Location\nWHERE count  >= 2\nRETURN Location",
        "question": "Show the locations that have at least two performances.",
        "answers": [
            [
                "Verizon Center"
            ]
        ]
    },
    {
        "db_id": "debate",
        "query": "MATCH (debate:`debate.debate`)\nRETURN count(*)",
        "question": "How many debates are there?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "debate",
        "query": "MATCH (debate:`debate.debate`)\nRETURN debate.Venue\nORDER BY debate.Num_of_Audience ASC",
        "question": "List the venues of debates in ascending order of the number of audience.",
        "answers": [
            [
                "Manama , Bahrain"
            ],
            [
                "Doha , Qatar"
            ],
            [
                "Abu Dhabi , UAE"
            ],
            [
                "Manama , Bahrain"
            ],
            [
                "Dubai , UAE"
            ],
            [
                "Manama , Bahrain"
            ]
        ]
    },
    {
        "db_id": "debate",
        "query": "MATCH (debate:`debate.debate`)\nRETURN debate.Date,debate.Venue",
        "question": "What are the date and venue of each debate?",
        "answers": [
            [
                "October 21, 2011",
                "Manama , Bahrain"
            ],
            [
                "December 17, 2014",
                "Doha , Qatar"
            ],
            [
                "August 3, 2015",
                "Manama , Bahrain"
            ],
            [
                "October 27, 2015",
                "Manama , Bahrain"
            ],
            [
                "January 12, 2017",
                "Dubai , UAE"
            ],
            [
                "January 21, 2017",
                "Abu Dhabi , UAE"
            ]
        ]
    },
    {
        "db_id": "debate",
        "query": "MATCH (debate:`debate.debate`)\nWHERE debate.Num_of_Audience > 150\nRETURN debate.Date",
        "question": "List the dates of debates with number of audience bigger than 150",
        "answers": [
            [
                "October 21, 2011"
            ],
            [
                "October 27, 2015"
            ],
            [
                "January 12, 2017"
            ],
            [
                "January 21, 2017"
            ]
        ]
    },
    {
        "db_id": "debate",
        "query": "MATCH (people:`debate.people`)\nWHERE people.Age = 35 OR people.Age = 36\nRETURN people.Name",
        "question": "Show the names of people aged either 35 or 36.",
        "answers": [
            [
                "Luther C. Carter"
            ],
            [
                "William B. Maclay"
            ],
            [
                "Charles Van Wyck"
            ]
        ]
    },
    {
        "db_id": "debate",
        "query": "MATCH (people:`debate.people`)\nRETURN people.Party\nORDER BY people.Age ASC\nLIMIT 1",
        "question": "What is the party of the youngest people?",
        "answers": [
            [
                "Republican"
            ]
        ]
    },
    {
        "db_id": "debate",
        "query": "MATCH (people:`debate.people`)\nRETURN people.Party,count(*)",
        "question": "Show different parties of people along with the number of people in each party.",
        "answers": [
            [
                "Republican",
                4
            ],
            [
                "Democratic",
                3
            ],
            [
                "Independent Democrat",
                1
            ],
            [
                "Anti-Lecompton Democrat",
                2
            ]
        ]
    },
    {
        "db_id": "debate",
        "query": "MATCH (people:`debate.people`)\nRETURN people.Party\nORDER BY people.Party DESC\nLIMIT 1",
        "question": "Show the party that has the most people.",
        "answers": [
            [
                "Republican"
            ]
        ]
    },
    {
        "db_id": "debate",
        "query": "MATCH (debate:`debate.debate`)\nRETURN DISTINCT debate.Venue",
        "question": "Show the distinct venues of debates",
        "answers": [
            [
                "Manama , Bahrain"
            ],
            [
                "Doha , Qatar"
            ],
            [
                "Dubai , UAE"
            ],
            [
                "Abu Dhabi , UAE"
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (customers:`insurance_and_eClaims.Customers`)\nRETURN customers.Customer_Details\nORDER BY customers.Customer_Details",
        "question": "List the names of all the customers in alphabetical order.",
        "answers": [
            [
                "America Jaskolski"
            ],
            [
                "Augustine Kerluke"
            ],
            [
                "Buddy Marquardt"
            ],
            [
                "Dayana Robel"
            ],
            [
                "Dr. Diana Rath"
            ],
            [
                "Ellsworth Paucek"
            ],
            [
                "Lauriane Ferry PhD"
            ],
            [
                "Miss Felicita Reichel"
            ],
            [
                "Mr. Edwardo Blanda I"
            ],
            [
                "Mr. Randal Lynch III"
            ],
            [
                "Mrs. Hanna Willms"
            ],
            [
                "Mrs. Lilly Graham III"
            ],
            [
                "Mrs. Liza Heller V"
            ],
            [
                "Selena Gerhold"
            ],
            [
                "Sydnie Friesen"
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (customers:`insurance_and_eClaims.Customers`)\nRETURN customers.Customer_Details\nORDER BY customers.Customer_Details",
        "question": "Sort the customer names in alphabetical order.",
        "answers": [
            [
                "America Jaskolski"
            ],
            [
                "Augustine Kerluke"
            ],
            [
                "Buddy Marquardt"
            ],
            [
                "Dayana Robel"
            ],
            [
                "Dr. Diana Rath"
            ],
            [
                "Ellsworth Paucek"
            ],
            [
                "Lauriane Ferry PhD"
            ],
            [
                "Miss Felicita Reichel"
            ],
            [
                "Mr. Edwardo Blanda I"
            ],
            [
                "Mr. Randal Lynch III"
            ],
            [
                "Mrs. Hanna Willms"
            ],
            [
                "Mrs. Lilly Graham III"
            ],
            [
                "Mrs. Liza Heller V"
            ],
            [
                "Selena Gerhold"
            ],
            [
                "Sydnie Friesen"
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (policies:`insurance_and_eClaims.Policies`)\nRETURN policies.Policy_Type_Code\nORDER BY policies.Policy_Type_Code DESC\nLIMIT 1",
        "question": "Which type of policy is most frequently used? Give me the policy type code.",
        "answers": [
            [
                "Uniformed"
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (policies:`insurance_and_eClaims.Policies`)\nRETURN policies.Policy_Type_Code\nORDER BY policies.Policy_Type_Code DESC\nLIMIT 1",
        "question": "Find the type code of the most frequently used policy.",
        "answers": [
            [
                "Uniformed"
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (policies:`insurance_and_eClaims.Policies`)\nWITH count(*) AS count, policies.Policy_Type_Code AS Policy_Type_Code\nWHERE count  > 2\nRETURN Policy_Type_Code",
        "question": "Find all the policy types that are used by more than 2 customers.",
        "answers": [
            [
                "Deputy"
            ],
            [
                "Jurisdiction"
            ],
            [
                "Uniformed"
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (policies:`insurance_and_eClaims.Policies`)\nWITH count(*) AS count, policies.Policy_Type_Code AS Policy_Type_Code\nWHERE count  > 2\nRETURN Policy_Type_Code",
        "question": "Which types of policy are chosen by more than 2 customers? Give me the policy type codes.",
        "answers": [
            [
                "Deputy"
            ],
            [
                "Jurisdiction"
            ],
            [
                "Uniformed"
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (claims_processing_stages:`insurance_and_eClaims.Claims_Processing_Stages`)\nRETURN count(*)",
        "question": "How many claim processing stages are there in total?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (claims_processing_stages:`insurance_and_eClaims.Claims_Processing_Stages`)\nRETURN count(*)",
        "question": "Find the number of distinct stages in claim processing.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (policies:`insurance_and_eClaims.Policies`)\nRETURN policies.Policy_Type_Code,count(*)",
        "question": "Find the number of records of each policy type and its type code.",
        "answers": [
            [
                "Deputy",
                3
            ],
            [
                "Jurisdiction",
                3
            ],
            [
                "Uniformed",
                8
            ],
            [
                "Normal",
                1
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (policies:`insurance_and_eClaims.Policies`)\nRETURN policies.Policy_Type_Code,count(*)",
        "question": "For each policy type, return its type code and its count in the record.",
        "answers": [
            [
                "Deputy",
                3
            ],
            [
                "Jurisdiction",
                3
            ],
            [
                "Uniformed",
                8
            ],
            [
                "Normal",
                1
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (t1:`insurance_and_eClaims.Policies`)-[]-(t2:`insurance_and_eClaims.Customers`)\nWITH count(t2.Customer_Details) AS cnt, t2\nRETURN t2.Customer_Details\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Find the name of the customer that has been involved in the most policies.",
        "answers": [
            [
                "Dr. Diana Rath"
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (t1:`insurance_and_eClaims.Policies`)-[]-(t2:`insurance_and_eClaims.Customers`)\nWITH count(t2.Customer_Details) AS cnt, t2\nRETURN t2.Customer_Details\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Which customer have the most policies? Give me the customer details.",
        "answers": [
            [
                "Dr. Diana Rath"
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (claims_processing:`insurance_and_eClaims.Claims_Processing`)\nRETURN count(DISTINCT claims_processing.Claim_Outcome_Code)",
        "question": "How many distinct claim outcome codes are there?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "insurance_and_eClaims",
        "query": "MATCH (claims_processing:`insurance_and_eClaims.Claims_Processing`)\nRETURN count(DISTINCT claims_processing.Claim_Outcome_Code)",
        "question": "Count the number of distinct claim outcome codes.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "customers_and_invoices",
        "query": "MATCH (accounts:`customers_and_invoices.Accounts`)\nRETURN count(*)",
        "question": "Show the number of accounts.",
        "answers": [
            [
                15
            ]
        ]
    }
]