[
    {
        "db_id": "county_public_safety",
        "query": "MATCH (city:`county_public_safety.city`)\nRETURN city.Name\nORDER BY city.White DESC\nLIMIT 5",
        "question": "List the names of the city with the top 5 white percentages.",
        "answers": [
            [
                "Adjuntas"
            ],
            [
                "Camuy"
            ],
            [
                "Aguada"
            ],
            [
                "Barranquitas"
            ],
            [
                "Arecibo"
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (city:`county_public_safety.city`)\nRETURN city.Name\nORDER BY city.White DESC\nLIMIT 5",
        "question": "What are the names of the five cities with the greatest proportion of white people?",
        "answers": [
            [
                "Adjuntas"
            ],
            [
                "Camuy"
            ],
            [
                "Aguada"
            ],
            [
                "Barranquitas"
            ],
            [
                "Arecibo"
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (T1:`county_public_safety.city`)-[]-(T2:`county_public_safety.county_public_safety`)\nRETURN T1.Name,T2.Name",
        "question": "Show names of cities and names of counties they are in.",
        "answers": [
            [
                "Adjuntas",
                "Abbotsford"
            ],
            [
                "Aguadilla",
                "Abbotsford"
            ],
            [
                "Aguada",
                "Abbotsford"
            ],
            [
                "Aibonito",
                "Burnaby"
            ],
            [
                "Aguas Buenas",
                "Burnaby"
            ],
            [
                "Bayam\u00f3n",
                "Campbell River"
            ],
            [
                "A\u00f1asco",
                "Campbell River"
            ],
            [
                "Arecibo",
                "Campbell River"
            ],
            [
                "Barranquitas",
                "Campbell River"
            ],
            [
                "Barceloneta",
                "Campbell River"
            ],
            [
                "Arroyo",
                "Campbell River"
            ],
            [
                "Cabo Rojo",
                "Castlegar"
            ],
            [
                "Caguas",
                "Castlegar"
            ],
            [
                "Camuy",
                "Central Saanich"
            ],
            [
                "Can\u00f3vanas",
                "Central Saanich"
            ],
            [
                "Cata\u00f1o",
                "Chilliwack"
            ],
            [
                "Carolina",
                "Chilliwack"
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (T1:`county_public_safety.city`)-[]-(T2:`county_public_safety.county_public_safety`)\nRETURN T1.Name,T2.Name",
        "question": "What are the names of cities, as well as the names of the counties they correspond to?",
        "answers": [
            [
                "Adjuntas",
                "Abbotsford"
            ],
            [
                "Aguadilla",
                "Abbotsford"
            ],
            [
                "Aguada",
                "Abbotsford"
            ],
            [
                "Aibonito",
                "Burnaby"
            ],
            [
                "Aguas Buenas",
                "Burnaby"
            ],
            [
                "Bayam\u00f3n",
                "Campbell River"
            ],
            [
                "A\u00f1asco",
                "Campbell River"
            ],
            [
                "Arecibo",
                "Campbell River"
            ],
            [
                "Barranquitas",
                "Campbell River"
            ],
            [
                "Barceloneta",
                "Campbell River"
            ],
            [
                "Arroyo",
                "Campbell River"
            ],
            [
                "Cabo Rojo",
                "Castlegar"
            ],
            [
                "Caguas",
                "Castlegar"
            ],
            [
                "Camuy",
                "Central Saanich"
            ],
            [
                "Can\u00f3vanas",
                "Central Saanich"
            ],
            [
                "Cata\u00f1o",
                "Chilliwack"
            ],
            [
                "Carolina",
                "Chilliwack"
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (T1:`county_public_safety.city`)-[]-(T2:`county_public_safety.county_public_safety`)\nRETURN T1.White,T2.Crime_rate",
        "question": "Show white percentages of cities and the crime rates of counties they are in.",
        "answers": [
            [
                93.1,
                118.0
            ],
            [
                83.0,
                118.0
            ],
            [
                86.6,
                118.0
            ],
            [
                83.5,
                123.0
            ],
            [
                72.5,
                123.0
            ],
            [
                78.3,
                178.0
            ],
            [
                82.0,
                178.0
            ],
            [
                84.5,
                178.0
            ],
            [
                86.0,
                178.0
            ],
            [
                80.7,
                178.0
            ],
            [
                53.5,
                178.0
            ],
            [
                84.1,
                150.0
            ],
            [
                76.1,
                150.0
            ],
            [
                87.9,
                49.0
            ],
            [
                61.2,
                49.0
            ],
            [
                70.7,
                174.0
            ],
            [
                64.3,
                174.0
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (T1:`county_public_safety.city`)-[]-(T2:`county_public_safety.county_public_safety`)\nRETURN T1.White,T2.Crime_rate",
        "question": "What are the white percentages of cities, and the corresponding crime rates of the counties they correspond to?",
        "answers": [
            [
                93.1,
                118.0
            ],
            [
                83.0,
                118.0
            ],
            [
                86.6,
                118.0
            ],
            [
                83.5,
                123.0
            ],
            [
                72.5,
                123.0
            ],
            [
                78.3,
                178.0
            ],
            [
                82.0,
                178.0
            ],
            [
                84.5,
                178.0
            ],
            [
                86.0,
                178.0
            ],
            [
                80.7,
                178.0
            ],
            [
                53.5,
                178.0
            ],
            [
                84.1,
                150.0
            ],
            [
                76.1,
                150.0
            ],
            [
                87.9,
                49.0
            ],
            [
                61.2,
                49.0
            ],
            [
                70.7,
                174.0
            ],
            [
                64.3,
                174.0
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (T1:`county_public_safety.city`)-[]-(T2:`county_public_safety.county_public_safety`)\nWHERE T1.White > 90\nRETURN T2.Crime_rate",
        "question": "Show the crime rate of counties with a city having white percentage more than 90.",
        "answers": [
            [
                118.0
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (T1:`county_public_safety.city`)-[]-(T2:`county_public_safety.county_public_safety`)\nWHERE T1.White > 90\nRETURN T2.Crime_rate",
        "question": "What are the crime rates of counties that contain cities that have white percentages of over 90?",
        "answers": [
            [
                118.0
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Police_force,count(*)",
        "question": "Please show the police forces and the number of counties with each police force.",
        "answers": [
            [
                "Abbotsford Police Department",
                1
            ],
            [
                "RCMP",
                4
            ],
            [
                "Central Saanich Police",
                1
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Police_force,count(*)",
        "question": "How many counties correspond to each police force?",
        "answers": [
            [
                "Abbotsford Police Department",
                1
            ],
            [
                "RCMP",
                4
            ],
            [
                "Central Saanich Police",
                1
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nWHERE NOT (county_public_safety)-[]-(:`county_public_safety.city`)    \nRETURN county_public_safety.Name",
        "question": "List the names of counties that do not have any cities.",
        "answers": []
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nWHERE NOT (county_public_safety)-[]-(:`county_public_safety.city`)    \nRETURN county_public_safety.Name",
        "question": "What are the names of counties that do not contain any cities?",
        "answers": []
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Case_burden\nORDER BY county_public_safety.Population DESC",
        "question": "Show the case burden of counties in descending order of population.",
        "answers": [
            [
                100
            ],
            [
                81
            ],
            [
                140
            ],
            [
                137
            ],
            [
                39
            ],
            [
                107
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Case_burden\nORDER BY county_public_safety.Population DESC",
        "question": "What are the case burdens of counties, ordered descending by population?",
        "answers": [
            [
                100
            ],
            [
                81
            ],
            [
                140
            ],
            [
                137
            ],
            [
                39
            ],
            [
                107
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.basePrice < 160 AND rooms.beds = 2 AND rooms.decor = 'modern'\nRETURN rooms.roomName",
        "question": "Find the names of all modern rooms with a base price below $160 and two beds.",
        "answers": [
            [
                "Mendicant with cryptic"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.basePrice < 160 AND rooms.beds = 2 AND rooms.decor = 'modern'\nRETURN rooms.roomName",
        "question": "What are the names of modern rooms that have a base price lower than $160 and two beds.",
        "answers": [
            [
                "Mendicant with cryptic"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.basePrice > 160 AND rooms.maxOccupancy > 2\nRETURN rooms.roomName,rooms.RoomId",
        "question": "Find all the rooms that have a price higher than 160 and can accommodate more than 2 people. Report room names and ids.",
        "answers": [
            [
                "Abscond or bolster",
                "AOB"
            ],
            [
                "Convoke and sanguine",
                "CAS"
            ],
            [
                "Riddle to exculpate",
                "RTE"
            ],
            [
                "Frugal not apropos",
                "FNA"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.basePrice > 160 AND rooms.maxOccupancy > 2\nRETURN rooms.roomName,rooms.RoomId",
        "question": "What are the room names and ids of all the rooms that cost more than 160 and can accommodate more than two people.",
        "answers": [
            [
                "Abscond or bolster",
                "AOB"
            ],
            [
                "Convoke and sanguine",
                "CAS"
            ],
            [
                "Riddle to exculpate",
                "RTE"
            ],
            [
                "Frugal not apropos",
                "FNA"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (reservations:`inn_1.Reservations`)\nWHERE reservations.FirstName = 'ROY' AND reservations.LastName = 'SWEAZY'\nRETURN reservations.Kids",
        "question": "How many kids stay in the rooms reserved by ROY SWEAZY?",
        "answers": [
            [
                1
            ],
            [
                1
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (reservations:`inn_1.Reservations`)\nWHERE reservations.FirstName = 'ROY' AND reservations.LastName = 'SWEAZY'\nRETURN reservations.Kids",
        "question": "Find the number of kids staying in the rooms reserved by a person called ROY SWEAZ.",
        "answers": [
            [
                1
            ],
            [
                1
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (reservations:`inn_1.Reservations`)\nWHERE reservations.FirstName = 'ROY' AND reservations.LastName = 'SWEAZY'\nRETURN count(*)",
        "question": "How many times does ROY SWEAZY has reserved a room.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (reservations:`inn_1.Reservations`)\nWHERE reservations.FirstName = 'ROY' AND reservations.LastName = 'SWEAZY'\nRETURN count(*)",
        "question": "Find the number of times ROY SWEAZY has reserved a room.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (reservations:`inn_1.Reservations`)\nWHERE reservations.CheckIn = \"2010-10-23\" AND reservations.FirstName = 'CONRAD' AND reservations.LastName = 'SELBIG'\nRETURN reservations.Adults",
        "question": "How many adults stay in the room CONRAD SELBIG checked in on Oct 23, 2010?",
        "answers": []
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (reservations:`inn_1.Reservations`)\nWHERE reservations.CheckIn = \"2010-10-23\" AND reservations.FirstName = 'CONRAD' AND reservations.LastName = 'SELBIG'\nRETURN reservations.Adults",
        "question": "Find the number of adults for the room reserved and checked in by CONRAD SELBIG on Oct 23, 2010.",
        "answers": []
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (reservations:`inn_1.Reservations`)\nWHERE reservations.CheckIn = \"2010-09-21\" AND reservations.FirstName = 'DAMIEN' AND reservations.LastName = 'TRACHSEL'\nRETURN reservations.Kids",
        "question": "How many kids stay in the room DAMIEN TRACHSEL checked in on Sep 21, 2010?",
        "answers": []
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (reservations:`inn_1.Reservations`)\nWHERE reservations.CheckIn = \"2010-09-21\" AND reservations.FirstName = 'DAMIEN' AND reservations.LastName = 'TRACHSEL'\nRETURN reservations.Kids",
        "question": "Return the number of kids for the room reserved and checked in by DAMIEN TRACHSEL on  Sep 21, 2010.",
        "answers": []
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.bedType = 'King'\nRETURN rooms.roomName,rooms.decor\nORDER BY rooms.basePrice",
        "question": "List the names and decor of rooms that have a king bed. Sort the list by their price.",
        "answers": [
            [
                "Recluse and defiance",
                "modern"
            ],
            [
                "Interim but salutary",
                "traditional"
            ],
            [
                "Convoke and sanguine",
                "traditional"
            ],
            [
                "Frugal not apropos",
                "traditional"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.bedType = 'King'\nRETURN rooms.roomName,rooms.decor\nORDER BY rooms.basePrice",
        "question": "What are the names and decor of rooms with a king bed? Sort them by their price",
        "answers": [
            [
                "Recluse and defiance",
                "modern"
            ],
            [
                "Interim but salutary",
                "traditional"
            ],
            [
                "Convoke and sanguine",
                "traditional"
            ],
            [
                "Frugal not apropos",
                "traditional"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.roomName,rooms.basePrice\nORDER BY rooms.basePrice ASC\nLIMIT 1",
        "question": "Which room has cheapest base price? List the room's name and the base price.",
        "answers": [
            [
                "Thrift and accolade",
                75
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.roomName,rooms.basePrice\nORDER BY rooms.basePrice ASC\nLIMIT 1",
        "question": "What are the room name and base price of the room with the lowest base price?",
        "answers": [
            [
                "Thrift and accolade",
                75
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.roomName = 'Recluse and defiance'\nRETURN rooms.decor",
        "question": "What is the decor of room Recluse and defiance?",
        "answers": [
            [
                "modern"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.roomName = 'Recluse and defiance'\nRETURN rooms.decor",
        "question": "Return the decor of the room named \"Recluse and defiance\".",
        "answers": [
            [
                "modern"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.bedType,avg(rooms.basePrice)",
        "question": "What is the average base price of different bed type? List bed type and average base price.",
        "answers": [
            [
                "King",
                181.25
            ],
            [
                "Queen",
                150.0
            ],
            [
                "Double",
                100.0
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.bedType,avg(rooms.basePrice)",
        "question": "For each bed type, find the average base price of different bed type.",
        "answers": [
            [
                "King",
                181.25
            ],
            [
                "Queen",
                150.0
            ],
            [
                "Double",
                100.0
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nWHERE T2.maxOccupancy = T1.Adults + T1.Kids\nRETURN count(*)",
        "question": "List how many times the number of people in the room reached the maximum occupancy of the room. The number of people include adults and kids.",
        "answers": [
            [
                204
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nWHERE T2.maxOccupancy = T1.Adults + T1.Kids\nRETURN count(*)",
        "question": "How many times the number of adults and kids staying in a room reached the maximum capacity of the room?",
        "answers": [
            [
                204
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN count(*)",
        "question": "How many rooms are there?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN count(*)",
        "question": "What is the total number of rooms available in this inn?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.bedType = 'King'\nRETURN count(*)",
        "question": "Find the number of rooms with a king bed.",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.bedType = 'King'\nRETURN count(*)",
        "question": "How many rooms have a king bed?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.bedType,count(*)",
        "question": "Find the number of rooms for each bed type.",
        "answers": [
            [
                "King",
                4
            ],
            [
                "Queen",
                4
            ],
            [
                "Double",
                2
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.bedType,count(*)",
        "question": "What are the number of rooms for each bed type?",
        "answers": [
            [
                "King",
                4
            ],
            [
                "Queen",
                4
            ],
            [
                "Double",
                2
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.roomName\nORDER BY rooms.maxOccupancy DESC\nLIMIT 1",
        "question": "Find the name of the room with the maximum occupancy.",
        "answers": [
            [
                "Abscond or bolster"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.roomName\nORDER BY rooms.maxOccupancy DESC\nLIMIT 1",
        "question": "What is the name of the room that can accommodate the most people?",
        "answers": [
            [
                "Abscond or bolster"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.RoomId,rooms.roomName\nORDER BY rooms.basePrice DESC\nLIMIT 1",
        "question": "Find the id and name of the most expensive base price room.",
        "answers": [
            [
                "FNA",
                "Frugal not apropos"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.RoomId,rooms.roomName\nORDER BY rooms.basePrice DESC\nLIMIT 1",
        "question": "Which room has the highest base price?",
        "answers": [
            [
                "FNA",
                "Frugal not apropos"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.decor = 'traditional'\nRETURN rooms.roomName,rooms.bedType",
        "question": "List the type of bed and name of all traditional rooms.",
        "answers": [
            [
                "Interim but salutary",
                "King"
            ],
            [
                "Abscond or bolster",
                "Queen"
            ],
            [
                "Convoke and sanguine",
                "King"
            ],
            [
                "Frugal not apropos",
                "King"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.decor = 'traditional'\nRETURN rooms.roomName,rooms.bedType",
        "question": "What are the bed type and name of all the rooms with traditional decor?",
        "answers": [
            [
                "Interim but salutary",
                "King"
            ],
            [
                "Abscond or bolster",
                "Queen"
            ],
            [
                "Convoke and sanguine",
                "King"
            ],
            [
                "Frugal not apropos",
                "King"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.bedType = 'King'\nRETURN rooms.decor,count(*)",
        "question": "Find the number of rooms with king bed for each decor type.",
        "answers": [
            [
                "modern",
                1
            ],
            [
                "traditional",
                3
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.bedType = 'King'\nRETURN rooms.decor,count(*)",
        "question": "How many rooms have king beds? Report the number for each decor type.",
        "answers": [
            [
                "modern",
                1
            ],
            [
                "traditional",
                3
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.decor,avg(rooms.basePrice),min(rooms.basePrice)",
        "question": "Find the average and minimum price of the rooms in different decor.",
        "answers": [
            [
                "modern",
                112.5,
                75
            ],
            [
                "traditional",
                187.5,
                150
            ],
            [
                "rustic",
                162.5,
                150
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.decor,avg(rooms.basePrice),min(rooms.basePrice)",
        "question": "What is the average minimum and price of the rooms for each different decor.",
        "answers": [
            [
                "modern",
                112.5,
                75
            ],
            [
                "traditional",
                187.5,
                150
            ],
            [
                "rustic",
                162.5,
                150
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.roomName\nORDER BY rooms.basePrice",
        "question": "List the name of all rooms sorted by their prices.",
        "answers": [
            [
                "Thrift and accolade"
            ],
            [
                "Harbinger but bequest"
            ],
            [
                "Mendicant with cryptic"
            ],
            [
                "Recluse and defiance"
            ],
            [
                "Interim but salutary"
            ],
            [
                "Immutable before decorum"
            ],
            [
                "Abscond or bolster"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Riddle to exculpate"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.roomName\nORDER BY rooms.basePrice",
        "question": "Sort all the rooms according to the price. Just report the room names.",
        "answers": [
            [
                "Thrift and accolade"
            ],
            [
                "Harbinger but bequest"
            ],
            [
                "Mendicant with cryptic"
            ],
            [
                "Recluse and defiance"
            ],
            [
                "Interim but salutary"
            ],
            [
                "Immutable before decorum"
            ],
            [
                "Abscond or bolster"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Riddle to exculpate"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.basePrice > 120\nRETURN rooms.decor,count(*)",
        "question": "Find the number of rooms with price higher than 120 for different decor.",
        "answers": [
            [
                "modern",
                2
            ],
            [
                "traditional",
                4
            ],
            [
                "rustic",
                2
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.basePrice > 120\nRETURN rooms.decor,count(*)",
        "question": "How many rooms cost more than 120, for each different decor?",
        "answers": [
            [
                "modern",
                2
            ],
            [
                "traditional",
                4
            ],
            [
                "rustic",
                2
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.bedType,avg(rooms.basePrice)",
        "question": "For each bed type, find the average room price.",
        "answers": [
            [
                "King",
                181.25
            ],
            [
                "Queen",
                150.0
            ],
            [
                "Double",
                100.0
            ]
        ]
    }
]