[
    {
        "question": "Show the name of storms which don't have affected region in record.",
        "query": "MATCH (storm:`storm_record.storm`)\nWHERE NOT (storm:`storm_record.storm`)-[:`storm_record.affected_region`]-()\nRETURN storm.Name",
        "db_id": "storm_record",
        "answers": [
            [
                "Two"
            ],
            [
                "Six"
            ],
            [
                "Seven"
            ],
            [
                "Eight"
            ],
            [
                "Nine"
            ],
            [
                "9 cyclones"
            ]
        ]
    },
    {
        "question": "Show the region name with at least two storms.",
        "query": "MATCH (T1:`storm_record.region`)-[T2:`storm_record.affected_region`]-()\nWITH count(*) AS count, T1.Region_name AS Region_name\nWHERE count  >= 2\nRETURN Region_name",
        "db_id": "storm_record",
        "answers": [
            [
                "Afghanistan"
            ],
            [
                "Albania"
            ]
        ]
    },
    {
        "question": "Count the total number of counties.",
        "query": "MATCH (county:`election.county`)\nRETURN count(*)",
        "db_id": "election",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "Show the county name and population of all counties.",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name,county.Population",
        "db_id": "election",
        "answers": [
            [
                "Howard",
                21000.0
            ],
            [
                "Baltimore County",
                90000.0
            ],
            [
                "Colony",
                79000.0
            ],
            [
                "Mansfield",
                87200.0
            ],
            [
                "Manning",
                13300.0
            ]
        ]
    },
    {
        "question": "Show the average population of all counties.",
        "query": "MATCH (county:`election.county`)\nRETURN avg(county.Population)",
        "db_id": "election",
        "answers": [
            [
                58100.0
            ]
        ]
    },
    {
        "question": "Return the maximum and minimum population among all counties.",
        "query": "MATCH (county:`election.county`)\nRETURN max(county.Population),min(county.Population)",
        "db_id": "election",
        "answers": [
            [
                90000.0,
                13300.0
            ]
        ]
    },
    {
        "question": "Show all the distinct districts for elections.",
        "query": "MATCH (election:`election.election`)\nRETURN DISTINCT election.District",
        "db_id": "election",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ],
            [
                4
            ]
        ]
    },
    {
        "question": "Show the zip code of the county with name \"Howard\".",
        "query": "MATCH (county:`election.county`)\nWHERE county.County_name = 'Howard'\nRETURN county.Zip_code",
        "db_id": "election",
        "answers": [
            [
                "D21"
            ]
        ]
    },
    {
        "question": "Show the delegate from district 1 in election.",
        "query": "MATCH (election:`election.election`)\nWHERE election.District = 1\nRETURN election.Delegate",
        "db_id": "election",
        "answers": [
            [
                "Bates, Gail H. Gail H. Bates"
            ],
            [
                "Miller, Warren E. Warren E. Miller"
            ],
            [
                "Pendergrass, Shane E. Shane Pendergrass"
            ]
        ]
    },
    {
        "question": "Show the delegate and committee information of elections.",
        "query": "MATCH (election:`election.election`)\nRETURN election.Delegate,election.Committee",
        "db_id": "election",
        "answers": [
            [
                "Bates, Gail H. Gail H. Bates",
                "Appropriations"
            ],
            [
                "Miller, Warren E. Warren E. Miller",
                "Economic Matters"
            ],
            [
                "DeBoy, Steven J. Sr. Steven J. DeBoy, Sr.",
                "Appropriations"
            ],
            [
                "Malone, James E. Jr. James E. Malone, Jr.",
                "Environmental Matters (Vice-Chair)"
            ],
            [
                "Bobo, Elizabeth Elizabeth Bobo",
                "Environmental Matters"
            ],
            [
                "Pendergrass, Shane E. Shane Pendergrass",
                "Health and Government Operations"
            ],
            [
                "Guzzone, Guy Guy Guzzone",
                "Appropriations"
            ],
            [
                "Turner, Frank S. Frank S. Turner",
                "Ways and Means"
            ]
        ]
    },
    {
        "question": "Count the number of distinct governors.",
        "query": "MATCH (party:`election.party`)\nRETURN count(DISTINCT party.Governor)",
        "db_id": "election",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "Show the lieutenant governor and comptroller from the democratic party.",
        "query": "MATCH (party:`election.party`)\nWHERE party.Party = 'Democratic'\nRETURN party.Lieutenant_Governor,party.Comptroller",
        "db_id": "election",
        "answers": [
            [
                "Sandra Frankel",
                "Carl McCall"
            ],
            [
                "Dennis Mehiel",
                "Alan Hevesi"
            ],
            [
                "David Paterson",
                "Alan Hevesi"
            ]
        ]
    },
    {
        "question": "In which distinct years was the governor \"Eliot Spitzer\"?",
        "query": "MATCH (party:`election.party`)\nWHERE party.Governor = 'Eliot Spitzer'\nRETURN DISTINCT party.Year",
        "db_id": "election",
        "answers": [
            [
                2006.0
            ]
        ]
    },
    {
        "question": "Return the names of all counties sorted by population in ascending order.",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name\nORDER BY county.Population ASC",
        "db_id": "election",
        "answers": [
            [
                "Manning"
            ],
            [
                "Howard"
            ],
            [
                "Colony"
            ],
            [
                "Mansfield"
            ],
            [
                "Baltimore County"
            ]
        ]
    },
    {
        "question": "Return the names of all counties sorted by county name in descending alphabetical order.",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name\nORDER BY county.County_name DESC",
        "db_id": "election",
        "answers": [
            [
                "Mansfield"
            ],
            [
                "Manning"
            ],
            [
                "Howard"
            ],
            [
                "Colony"
            ],
            [
                "Baltimore County"
            ]
        ]
    },
    {
        "question": "Show the name of the county with the biggest population.",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name\nORDER BY county.Population DESC\nLIMIT 1",
        "db_id": "election",
        "answers": [
            [
                "Baltimore County"
            ]
        ]
    },
    {
        "question": "Show the 3 counties with the smallest population.",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name\nORDER BY county.Population ASC\nLIMIT 3",
        "db_id": "election",
        "answers": [
            [
                "Manning"
            ],
            [
                "Howard"
            ],
            [
                "Colony"
            ]
        ]
    },
    {
        "question": "Show the name of the party that has at least two records.",
        "query": "MATCH (party:`election.party`)\nWITH count(*) AS count, party.Party AS Party\nWHERE count  >= 2\nRETURN Party",
        "db_id": "election",
        "answers": [
            [
                "Democratic"
            ],
            [
                "Independence"
            ]
        ]
    },
    {
        "question": "Show the people that have been governor the most times.",
        "query": "MATCH (party:`election.party`)\nWITH party.Governor AS Governor, count(party.Governor) AS count\nRETURN Governor\nORDER BY count DESC\nLIMIT 1",
        "db_id": "election",
        "answers": [
            [
                "Eliot Spitzer"
            ]
        ]
    },
    {
        "question": "Which people severed as governor most frequently?",
        "query": "MATCH (party:`election.party`)\nWITH party.Governor AS Governor, count(party.Governor) AS count\nRETURN Governor\nORDER BY count DESC\nLIMIT 1",
        "db_id": "election",
        "answers": [
            [
                "Eliot Spitzer"
            ]
        ]
    },
    {
        "question": "Show the people that have been comptroller the most times and the corresponding number of times.",
        "query": "MATCH (party:`election.party`)\nWITH party.Comptroller AS Comptroller, count(party.Comptroller) AS count\nRETURN Comptroller,count\nORDER BY count DESC\nLIMIT 1",
        "db_id": "election",
        "answers": [
            [
                "Alan Hevesi",
                4
            ]
        ]
    },
    {
        "question": "List the names of journalists in ascending order of years working.",
        "query": "MATCH (journalist:`news_report.journalist`)\nRETURN journalist.Name\nORDER BY journalist.Years_working ASC",
        "db_id": "news_report",
        "answers": [
            [
                "Tom Briggs"
            ],
            [
                "Ray Ferris"
            ],
            [
                "Fred Keenor"
            ],
            [
                "George Gilchrist"
            ],
            [
                "Fred Chandler"
            ],
            [
                "John Meaney"
            ],
            [
                "Jack Meaney"
            ],
            [
                "Frank Mitcheson"
            ],
            [
                "Herbert Swindells"
            ],
            [
                "Tony Waddington"
            ],
            [
                "Jackie Waring"
            ]
        ]
    },
    {
        "question": "Show the names of journalists from \"England\" or \"Wales\".",
        "query": "MATCH (journalist:`news_report.journalist`)\nWHERE journalist.Nationality = 'England' OR journalist.Nationality = 'Wales'\nRETURN journalist.Name",
        "db_id": "news_report",
        "answers": [
            [
                "Herbert Swindells"
            ],
            [
                "Fred Keenor"
            ],
            [
                "George Gilchrist"
            ],
            [
                "Jackie Waring"
            ],
            [
                "Fred Chandler"
            ],
            [
                "John Meaney"
            ],
            [
                "Tony Waddington"
            ],
            [
                "Jack Meaney"
            ],
            [
                "Frank Mitcheson"
            ],
            [
                "Tom Briggs"
            ]
        ]
    },
    {
        "question": "Show the different nationalities and the number of journalists of each nationality.",
        "query": "MATCH (journalist:`news_report.journalist`)\nWITH count(journalist.Nationality) AS count, journalist.Nationality AS Nationality\nRETURN Nationality,count",
        "db_id": "news_report",
        "answers": [
            [
                "England",
                9
            ],
            [
                "Wales",
                1
            ],
            [
                "Northern Ireland",
                1
            ]
        ]
    },
    {
        "question": "Show the most common nationality for journalists.",
        "query": "MATCH (journalist:`news_report.journalist`)\nWITH count(journalist.Nationality) AS count, journalist.Nationality AS Nationality\nRETURN Nationality\nORDER BY count DESC\nLIMIT 1",
        "db_id": "news_report",
        "answers": [
            [
                "England"
            ]
        ]
    },
    {
        "question": "List the names of journalists who have not reported any event.",
        "query": "MATCH (journalist:`news_report.journalist`)\nWHERE NOT (journalist:`news_report.journalist`)-[:`news_report.news_report`]-()\nRETURN journalist.Name",
        "db_id": "news_report",
        "answers": [
            [
                "Fred Keenor"
            ],
            [
                "George Gilchrist"
            ],
            [
                "Fred Chandler"
            ],
            [
                "Jack Meaney"
            ],
            [
                "Frank Mitcheson"
            ]
        ]
    },
    {
        "question": "List the event venues and names that have the top 2 most number of people attended.",
        "query": "MATCH (event:`news_report.event`)\nRETURN event.Venue,event.Name\nORDER BY event.Event_Attendance DESC\nLIMIT 2",
        "db_id": "news_report",
        "answers": [
            [
                "Marathon",
                "Olympia Games Openning"
            ],
            [
                "Platense",
                "Global Awarding"
            ]
        ]
    },
    {
        "question": "Show me all the restaurants.",
        "query": "MATCH (restaurant:`restaurant_1.Restaurant`)\nRETURN restaurant.ResName",
        "db_id": "restaurant_1",
        "answers": [
            [
                "Subway"
            ],
            [
                "Honeygrow"
            ]
        ]
    },
    {
        "question": "List all restaurant types.",
        "query": "MATCH (restaurant_type:`restaurant_1.Restaurant_Type`)\nRETURN restaurant_type.ResTypeName",
        "db_id": "restaurant_1",
        "answers": [
            [
                "Sandwich"
            ],
            [
                "Stir-fry"
            ]
        ]
    },
    {
        "question": "Which restaurants have highest rating? List the restaurant name and its rating.",
        "query": "MATCH (restaurant:`restaurant_1.Restaurant`)\nRETURN restaurant.ResName,restaurant.Rating\nORDER BY restaurant.Rating DESC\nLIMIT 1",
        "db_id": "restaurant_1",
        "answers": [
            [
                "Honeygrow",
                4
            ]
        ]
    },
    {
        "question": "What is the age of student Linda Smith?",
        "query": "MATCH (student:`restaurant_1.Student`)\nWHERE student.Fname = 'Linda' AND student.LName = 'Smith'\nRETURN student.Age",
        "db_id": "restaurant_1",
        "answers": [
            [
                18
            ]
        ]
    },
    {
        "question": "What is the gender of the student Linda Smith?",
        "query": "MATCH (student:`restaurant_1.Student`)\nWHERE student.Fname = 'Linda' AND student.LName = 'Smith'\nRETURN student.Sex",
        "db_id": "restaurant_1",
        "answers": [
            [
                "F"
            ]
        ]
    },
    {
        "question": "List all students' first names and last names who majored in 600.",
        "query": "MATCH (student:`restaurant_1.Student`)\nWHERE student.Major = 600\nRETURN student.Fname,student.LName",
        "db_id": "restaurant_1",
        "answers": [
            [
                "Linda",
                "Smith"
            ],
            [
                "Tracy",
                "Kim"
            ],
            [
                "Shiela",
                "Jones"
            ],
            [
                "Dinesh",
                "Kumar"
            ],
            [
                "Paul",
                "Gompers"
            ],
            [
                "Andy",
                "Schultz"
            ],
            [
                "Lisa",
                "Apap"
            ],
            [
                "Jandy",
                "Nelson"
            ],
            [
                "Eric",
                "Tai"
            ],
            [
                "Derek",
                "Lee"
            ],
            [
                "David",
                "Adams"
            ],
            [
                "Steven",
                "Davis"
            ],
            [
                "Charles",
                "Norris"
            ],
            [
                "Susan",
                "Lee"
            ],
            [
                "Mark",
                "Schwartz"
            ],
            [
                "Bruce",
                "Wilson"
            ],
            [
                "Michael",
                "Leighton"
            ],
            [
                "Arthur",
                "Pang"
            ]
        ]
    },
    {
        "question": "Which city does student Linda Smith live in?",
        "query": "MATCH (student:`restaurant_1.Student`)\nWHERE student.Fname = 'Linda' AND student.LName = 'Smith'\nRETURN student.city_code",
        "db_id": "restaurant_1",
        "answers": [
            [
                "BAL"
            ]
        ]
    },
    {
        "question": "Which student's age is older than 18 and is majoring in 600? List each student's first and last name.",
        "query": "MATCH (student:`restaurant_1.Student`)\nWHERE student.Age > 18 AND student.Major = 600\nRETURN student.Fname,student.LName",
        "db_id": "restaurant_1",
        "answers": [
            [
                "Tracy",
                "Kim"
            ],
            [
                "Shiela",
                "Jones"
            ],
            [
                "Dinesh",
                "Kumar"
            ],
            [
                "Paul",
                "Gompers"
            ],
            [
                "Jandy",
                "Nelson"
            ],
            [
                "Eric",
                "Tai"
            ],
            [
                "David",
                "Adams"
            ],
            [
                "Steven",
                "Davis"
            ],
            [
                "Bruce",
                "Wilson"
            ],
            [
                "Michael",
                "Leighton"
            ]
        ]
    },
    {
        "question": "List all female students age is older than 18 who is not majoring in 600. List students' first name and last name.",
        "query": "MATCH (student:`restaurant_1.Student`)\nWHERE student.Age > 18 AND student.Major <> 600 AND student.Sex = 'F'\nRETURN student.Fname,student.LName",
        "db_id": "restaurant_1",
        "answers": [
            [
                "Lisa",
                "Cheng"
            ],
            [
                "Sarah",
                "Smith"
            ],
            [
                "Sarah",
                "Schmidt"
            ]
        ]
    },
    {
        "question": "Find the ids of orders whose status is 'Success'.",
        "query": "MATCH (actual_orders:`customer_deliveries.Actual_Orders`)\nWHERE actual_orders.order_status_code = 'Success'\nRETURN actual_orders.actual_order_id",
        "db_id": "customer_deliveries",
        "answers": [
            [
                1
            ],
            [
                6
            ],
            [
                7
            ],
            [
                9
            ],
            [
                10
            ]
        ]
    },
    {
        "question": "Find the number of customers in total.",
        "query": "MATCH (customers:`customer_deliveries.Customers`)\nRETURN count(*)",
        "db_id": "customer_deliveries",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Show the details of all trucks in the order of their license number.",
        "query": "MATCH (trucks:`customer_deliveries.Trucks`)\nRETURN trucks.truck_details\nORDER BY trucks.truck_licence_number",
        "db_id": "customer_deliveries",
        "answers": [
            [
                "Laverna"
            ],
            [
                "Kaya"
            ],
            [
                "Deon"
            ],
            [
                "Ricky"
            ],
            [
                "Randy"
            ],
            [
                "Holly"
            ],
            [
                "Rosamond"
            ],
            [
                "Frida"
            ],
            [
                "Queen"
            ],
            [
                "Rebeka"
            ],
            [
                "Luisa"
            ],
            [
                "Bud"
            ],
            [
                "Joanny"
            ],
            [
                "Efren"
            ],
            [
                "Stacy"
            ]
        ]
    },
    {
        "question": "Find the name of the most expensive product.",
        "query": "MATCH (products:`customer_deliveries.Products`)\nRETURN products.product_name\nORDER BY products.product_price DESC\nLIMIT 1",
        "db_id": "customer_deliveries",
        "answers": [
            [
                "books"
            ]
        ]
    },
    {
        "question": "List the names and emails of customers who payed by Visa card.",
        "query": "MATCH (customers:`customer_deliveries.Customers`)\nWHERE customers.payment_method = 'Visa'\nRETURN customers.customer_email,customers.customer_name",
        "db_id": "customer_deliveries",
        "answers": [
            [
                "shaniya45@example.net",
                "Ron Emard"
            ],
            [
                "dedric17@example.org",
                "Jaden Lang"
            ],
            [
                "elmira.langworth@example.org",
                "Geovanni Grady"
            ],
            [
                "reichel.winnifred@example.org",
                "Dr. Karine Farrell"
            ],
            [
                "leann.hamill@example.org",
                "Lila Howe"
            ],
            [
                "danika49@example.com",
                "Amalia Hudson DDS"
            ],
            [
                "adriana83@example.org",
                "Annabell Walsh"
            ],
            [
                "rollin95@example.net",
                "Aracely Borer V"
            ]
        ]
    },
    {
        "question": "Find the states which do not have any employee in their record.",
        "query": "MATCH (addresses:`customer_deliveries.Addresses`)\nWHERE NOT (addresses:`customer_deliveries.Addresses`)-[]-(:`customer_deliveries.Employees`)\nRETURN addresses.state_province_county",
        "db_id": "customer_deliveries",
        "answers": [
            [
                "Colorado"
            ],
            [
                "Idaho"
            ],
            [
                "Maine"
            ],
            [
                "Washington"
            ]
        ]
    },
    {
        "question": "List the names, phone numbers, and emails of all customers sorted by their dates of becoming customers.",
        "query": "MATCH (customers:`customer_deliveries.Customers`)\nRETURN customers.customer_name,customers.customer_phone,customers.customer_email\nORDER BY customers.date_became_customer",
        "db_id": "customer_deliveries",
        "answers": [
            [
                "Verda Streich",
                "06730471330",
                "xgraham@example.org"
            ],
            [
                "Jaden Lang",
                "361.151.3489x7272",
                "dedric17@example.org"
            ],
            [
                "Dr. Karine Farrell",
                "+49(2)0677806107",
                "reichel.winnifred@example.org"
            ],
            [
                "Ron Emard",
                "1-382-503-5179x53639",
                "shaniya45@example.net"
            ],
            [
                "Gabe Schroeder",
                "1-728-537-4293x0885",
                "alexandra91@example.net"
            ],
            [
                "Candace Schneider",
                "940.575.3682x7959",
                "tkassulke@example.com"
            ],
            [
                "Keenan Kuhic",
                "686-517-9923x348",
                "dallin76@example.org"
            ],
            [
                "Emmanuel Reilly",
                "129.959.6420",
                "gleichner.ethelyn@example.net"
            ],
            [
                "Lila Howe",
                "1-492-284-1097",
                "leann.hamill@example.org"
            ],
            [
                "Amalia Hudson DDS",
                "003-991-1506x483",
                "danika49@example.com"
            ],
            [
                "Rusty Morar",
                "1-123-197-9677x7194",
                "njenkins@example.org"
            ],
            [
                "Aracely Borer V",
                "531-617-3230",
                "rollin95@example.net"
            ],
            [
                "Patience Yundt",
                "969-208-8932x715",
                "kira82@example.com"
            ],
            [
                "Geovanni Grady",
                "1-005-644-2495",
                "elmira.langworth@example.org"
            ],
            [
                "Annabell Walsh",
                "(881)096-1281x6448",
                "adriana83@example.org"
            ]
        ]
    },
    {
        "question": "Find the name of the first 5 customers.",
        "query": "MATCH (customers:`customer_deliveries.Customers`)\nRETURN customers.customer_name\nORDER BY customers.date_became_customer\nLIMIT 5",
        "db_id": "customer_deliveries",
        "answers": [
            [
                "Verda Streich"
            ],
            [
                "Jaden Lang"
            ],
            [
                "Dr. Karine Farrell"
            ],
            [
                "Ron Emard"
            ],
            [
                "Gabe Schroeder"
            ]
        ]
    },
    {
        "question": "Find the payment method that is used most frequently.",
        "query": "MATCH (customers:`customer_deliveries.Customers`)\nWITH count(customers.payment_method) AS count, customers.payment_method AS payment_method\nRETURN payment_method\nORDER BY count DESC\nLIMIT 1",
        "db_id": "customer_deliveries",
        "answers": [
            [
                "Visa"
            ]
        ]
    },
    {
        "question": "List the names of all routes in alphabetic order.",
        "query": "MATCH (delivery_routes:`customer_deliveries.Delivery_Routes`)\nRETURN delivery_routes.route_name\nORDER BY delivery_routes.route_name",
        "db_id": "customer_deliveries",
        "answers": [
            [
                "Abshire Ltd"
            ],
            [
                "Adams, Macejkovic and Carroll"
            ],
            [
                "Brekke, Powlowski and Fritsch"
            ],
            [
                "Gerhold Inc"
            ],
            [
                "Gorczany Group"
            ],
            [
                "Grady, King and Price"
            ],
            [
                "Hegmann-Waters"
            ],
            [
                "Heidenreich Group"
            ],
            [
                "Hermiston, Feeney and Daugherty"
            ],
            [
                "Huel, Armstrong and Senger"
            ],
            [
                "Nader, Leuschke and Huels"
            ],
            [
                "Renner-Kovacek"
            ],
            [
                "Schowalter Group"
            ],
            [
                "Streich, Spencer and Brakus"
            ],
            [
                "Torphy Ltd"
            ]
        ]
    },
    {
        "question": "Count the number of authors.",
        "query": "MATCH (authors:`icfp_1.Authors`)\nRETURN count(*)",
        "db_id": "icfp_1",
        "answers": [
            [
                13
            ]
        ]
    },
    {
        "question": "Count the number of institutions.",
        "query": "MATCH (inst:`icfp_1.Inst`)\nRETURN count(*)",
        "db_id": "icfp_1",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "question": "Count the number of total papers.",
        "query": "MATCH (papers:`icfp_1.Papers`)\nRETURN count(*)",
        "db_id": "icfp_1",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "What is the first name of the author with last name \"Ueno\"?",
        "query": "MATCH (authors:`icfp_1.Authors`)\nWHERE authors.lname = 'Ueno'\nRETURN authors.fname",
        "db_id": "icfp_1",
        "answers": [
            [
                "Katsuhiro"
            ]
        ]
    },
    {
        "question": "Find the last name of the author with first name \"Amal\".",
        "query": "MATCH (authors:`icfp_1.Authors`)\nWHERE authors.fname = 'Amal'\nRETURN authors.lname",
        "db_id": "icfp_1",
        "answers": [
            [
                "Ahmed"
            ]
        ]
    },
    {
        "question": "Find the first names of all the authors ordered in alphabetical order.",
        "query": "MATCH (authors:`icfp_1.Authors`)\nRETURN authors.fname\nORDER BY authors.fname",
        "db_id": "icfp_1",
        "answers": [
            [
                "Aaron"
            ],
            [
                "Amal"
            ],
            [
                "Atsushi"
            ],
            [
                "Brent"
            ],
            [
                "Daniel W. H."
            ],
            [
                "Jeremy"
            ],
            [
                "Katsuhiro"
            ],
            [
                "Matthias"
            ],
            [
                "Nicolas"
            ],
            [
                "Olin"
            ],
            [
                "Ralf"
            ],
            [
                "Stephanie"
            ],
            [
                "Tim"
            ]
        ]
    },
    {
        "question": "Retrieve all the last names of authors in alphabetical order.",
        "query": "MATCH (authors:`icfp_1.Authors`)\nRETURN authors.lname\nORDER BY authors.lname",
        "db_id": "icfp_1",
        "answers": [
            [
                "Ahmed"
            ],
            [
                "Blume"
            ],
            [
                "Gibbons"
            ],
            [
                "Hinze"
            ],
            [
                "James"
            ],
            [
                "Ohori"
            ],
            [
                "Pouillard"
            ],
            [
                "Sheard"
            ],
            [
                "Shivers"
            ],
            [
                "Turon"
            ],
            [
                "Ueno"
            ],
            [
                "Weirich"
            ],
            [
                "Yorgey"
            ]
        ]
    }
]