[
    {
        "db_id": "pilot_record",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nRETURN pilot.Position,pilot.Team",
        "question": "What are the positions and teams of pilots?",
        "answers": [
            [
                "Center Team",
                "Bradley"
            ],
            [
                "Forward-Center Team",
                "Eau Claire High School"
            ],
            [
                "Center Team",
                "Fordham"
            ],
            [
                "Forward Team",
                "Virginia Union"
            ],
            [
                "Center Team",
                "Houston"
            ]
        ]
    },
    {
        "db_id": "pilot_record",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nWHERE pilot.Age > 30\nRETURN DISTINCT pilot.Position",
        "question": "List the distinct positions of pilots older than 30.",
        "answers": [
            [
                "Center Team"
            ],
            [
                "Forward-Center Team"
            ]
        ]
    },
    {
        "db_id": "pilot_record",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nWHERE pilot.Team = 'Bradley' OR pilot.Team = 'Fordham'\nRETURN pilot.Pilot_name",
        "question": "Show the names of pilots from team \"Bradley\" or \"Fordham\".",
        "answers": [
            [
                "Patrick O'Bryant"
            ],
            [
                "Dan O'Sullivan"
            ]
        ]
    },
    {
        "db_id": "pilot_record",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nRETURN pilot.Join_Year\nORDER BY pilot.Rank ASC\nLIMIT 1",
        "question": "What is the joined year of the pilot of the highest rank?",
        "answers": [
            [
                2008
            ]
        ]
    },
    {
        "db_id": "pilot_record",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nRETURN pilot.Nationality,count(*)",
        "question": "What are the different nationalities of pilots? Show each nationality and the number of pilots of each nationality.",
        "answers": [
            [
                "United States",
                3
            ],
            [
                "United Kindom",
                1
            ],
            [
                "Nigeria",
                1
            ]
        ]
    },
    {
        "db_id": "pilot_record",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nRETURN pilot.Nationality\nORDER BY pilot.Nationality DESC\nLIMIT 1",
        "question": "Show the most common nationality of pilots.",
        "answers": [
            [
                "United States"
            ]
        ]
    },
    {
        "db_id": "pilot_record",
        "query": "MATCH (T2:`pilot_record.aircraft`)-[T1:`pilot_record.pilot_record`]-(T3:`pilot_record.pilot`)\nRETURN T3.Pilot_name,T2.Model",
        "question": "Show the names of pilots and models of aircrafts they have flied with.",
        "answers": [
            [
                "Patrick O'Bryant",
                "Advantage (Low Floor)"
            ],
            [
                "Patrick O'Bryant",
                "Advantage (Low Floor)"
            ],
            [
                "Patrick O'Bryant",
                "Phantom (High Floor)"
            ],
            [
                "Jermaine O'Neal",
                "Phantom (High Floor)"
            ],
            [
                "Dan O'Sullivan",
                "GE40LFR"
            ],
            [
                "Charles Oakley",
                "Phantom (High Floor)"
            ]
        ]
    },
    {
        "db_id": "pilot_record",
        "query": "MATCH (T2:`pilot_record.aircraft`)-[T1:`pilot_record.pilot_record`]-(T3:`pilot_record.pilot`)\nRETURN T3.Pilot_name,T2.Fleet_Series\nORDER BY T3.Rank",
        "question": "Show the names of pilots and fleet series of the aircrafts they have flied with in ascending order of the rank of the pilot.",
        "answers": [
            [
                "Jermaine O'Neal",
                "444-464 (21)"
            ],
            [
                "Patrick O'Bryant",
                "482-492 (11)"
            ],
            [
                "Patrick O'Bryant",
                "474-481 (8)"
            ],
            [
                "Patrick O'Bryant",
                "444-464 (21)"
            ],
            [
                "Charles Oakley",
                "465-467 (3)"
            ],
            [
                "Dan O'Sullivan",
                "300-309 (10)"
            ]
        ]
    },
    {
        "db_id": "pilot_record",
        "query": "MATCH (T2:`pilot_record.aircraft`)-[T1:`pilot_record.pilot_record`]-(T3:`pilot_record.pilot`)\nWHERE T3.Age < 34\nRETURN T2.Fleet_Series",
        "question": "Show the fleet series of the aircrafts flied by pilots younger than 34",
        "answers": [
            [
                "482-492 (11)"
            ],
            [
                "474-481 (8)"
            ],
            [
                "444-464 (21)"
            ],
            [
                "465-467 (3)"
            ]
        ]
    },
    {
        "db_id": "pilot_record",
        "query": "MATCH (T2:`pilot_record.pilot`)-[T1:`pilot_record.pilot_record`]-()\nRETURN T2.Pilot_name,count(*)",
        "question": "Show the names of pilots and the number of records they have.",
        "answers": [
            [
                "Patrick O'Bryant",
                3
            ],
            [
                "Jermaine O'Neal",
                1
            ],
            [
                "Dan O'Sullivan",
                1
            ],
            [
                "Charles Oakley",
                1
            ]
        ]
    },
    {
        "db_id": "pilot_record",
        "query": "MATCH (T2:`pilot_record.pilot`)-[T1:`pilot_record.pilot_record`]-()\nWITH T2.Pilot_name AS Pilot_name, count(*) AS count\nWHERE count  > 1\nRETURN Pilot_name,count",
        "question": "Show names of pilots that have more than one record.",
        "answers": [
            [
                "Patrick O'Bryant",
                3
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Control_Systems",
        "query": "MATCH (documents:`cre_Doc_Control_Systems.Documents`)\nRETURN documents.document_id,documents.receipt_date",
        "question": "List all document ids and receipt dates of documents.",
        "answers": [
            [
                1,
                "2008-04-21 20:42:25"
            ],
            [
                2,
                "1974-05-08 00:00:46"
            ],
            [
                3,
                "2014-12-25 17:22:44"
            ],
            [
                4,
                "1973-11-05 21:48:53"
            ],
            [
                7,
                "1982-09-27 14:52:15"
            ],
            [
                10,
                "1976-09-15 19:24:17"
            ],
            [
                12,
                "1996-05-31 06:51:58"
            ],
            [
                13,
                "2015-04-03 09:36:19"
            ],
            [
                14,
                "2017-07-02 17:39:09"
            ],
            [
                15,
                "1986-12-14 14:18:59"
            ],
            [
                17,
                "1983-09-26 09:32:56"
            ],
            [
                20,
                "1996-07-27 03:30:40"
            ],
            [
                23,
                "1999-04-17 14:19:32"
            ],
            [
                24,
                "2005-09-30 00:10:02"
            ],
            [
                25,
                "1985-11-05 17:59:34"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Control_Systems",
        "query": "MATCH (T1:`cre_Doc_Control_Systems.Roles`)-[]-(T2:`cre_Doc_Control_Systems.Employees`)\nRETURN T1.role_description,T2.role_code,count(*)",
        "question": "How many employees does each role have? List role description, id and number of employees.",
        "answers": [
            [
                "Editor",
                "ED",
                2
            ],
            [
                "Photo",
                "PT",
                2
            ],
            [
                "Manager",
                "MG",
                1
            ],
            [
                "Proof Manager",
                "PR",
                1
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Control_Systems",
        "query": "MATCH (documents:`cre_Doc_Control_Systems.Documents`)\nWHERE documents.document_id = 2\nRETURN documents.document_type_code",
        "question": "List the document type code for the document with the id 2.",
        "answers": [
            [
                "Paper"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Control_Systems",
        "query": "MATCH ()-[documents_mailed:`cre_Doc_Control_Systems.Documents_Mailed`]-()\nWHERE documents_mailed.document_id = 7\nRETURN documents_mailed.mailing_date",
        "question": "What is the mail date of the document with id 7?",
        "answers": [
            [
                "1979-09-21 10:30:52"
            ],
            [
                "1979-09-21 10:30:52"
            ]
        ]
    },
    {
        "db_id": "cre_Doc_Control_Systems",
        "query": "MATCH (draft_copies:`cre_Doc_Control_Systems.Draft_Copies`)\nWITH count(*) AS count, draft_copies.document_id AS document_id\nWHERE count  > 1\nRETURN document_id,count",
        "question": "Which documents have more than 1 draft copies? List document id and number of draft copies.",
        "answers": [
            [
                2,
                2
            ]
        ]
    },
    {
        "db_id": "company_1",
        "query": "MATCH (department:`company_1.department`)\nRETURN department.Dname\nORDER BY department.Mgr_start_date",
        "question": "List all department names ordered by their starting date.",
        "answers": [
            [
                "Headquarters"
            ],
            [
                "Research"
            ],
            [
                "Administration"
            ]
        ]
    },
    {
        "db_id": "company_1",
        "query": "MATCH (dependent:`company_1.dependent`)\nWHERE dependent.Relationship = 'Spouse'\nRETURN dependent.Dependent_name",
        "question": "find all dependent names who have a spouse relation with some employee.",
        "answers": [
            [
                "Joy"
            ],
            [
                "Abner"
            ],
            [
                "Elizabeth"
            ]
        ]
    },
    {
        "db_id": "company_1",
        "query": "MATCH (dependent:`company_1.dependent`)\nWHERE dependent.Sex = 'F'\nRETURN count(*)",
        "question": "how many female dependents are there?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "company_1",
        "query": "MATCH (employee:`company_1.employee`)\nWHERE employee.Salary > 30000\nRETURN employee.Fname,employee.Lname",
        "question": "Return the first names and last names of employees who earn more than 30000 in salary.",
        "answers": [
            [
                "Franklin",
                "Wong"
            ],
            [
                "Ramesh",
                "Narayan"
            ],
            [
                "James",
                "Borg"
            ],
            [
                "Jennifier",
                "Wallace"
            ]
        ]
    },
    {
        "db_id": "company_1",
        "query": "MATCH (employee:`company_1.employee`)\nWHERE employee.Salary < 50000\nRETURN count(*),employee.Sex",
        "question": "Find the number of employees of each gender whose salary is lower than 50000.",
        "answers": [
            [
                4,
                "M"
            ],
            [
                3,
                "F"
            ]
        ]
    },
    {
        "db_id": "company_1",
        "query": "MATCH (employee:`company_1.employee`)\nRETURN employee.Fname,employee.Lname,employee.Address\nORDER BY employee.Bdate",
        "question": "list the first and last names, and the addresses of all employees in the ascending order of their birth date.",
        "answers": [
            [
                "James",
                "Borg",
                "450 Stone, Houston, TX"
            ],
            [
                "Jennifier",
                "Wallace",
                "291 Berry, Bellaire, TX"
            ],
            [
                "Franklin",
                "Wong",
                "638 Voss, Houston, TX"
            ],
            [
                "Ramesh",
                "Narayan",
                "975 Fire Oak, Humble, TX"
            ],
            [
                "Jonh",
                "Smith",
                "731 Fondren, Houston, TX"
            ],
            [
                "Alicia",
                "Zelaya",
                "3321 Castle, Spring, TX"
            ],
            [
                "Ahmad",
                "Jabbar",
                "980 Dallas, Houston, TX"
            ],
            [
                "Joyce",
                "English",
                "5631 Rice, Houston, TX"
            ]
        ]
    },
    {
        "db_id": "local_govt_in_alabama",
        "query": "MATCH (T1:`local_govt_in_alabama.Events`)-[]-(T2:`local_govt_in_alabama.Services`)\nWHERE T2.Service_Type_Code = 'Marriage'\nRETURN T1.Event_Details",
        "question": "what are the event details of the services that have the type code 'Marriage'?",
        "answers": [
            [
                "Success"
            ],
            [
                "Fail"
            ],
            [
                "Fail"
            ],
            [
                "Fail"
            ],
            [
                "Success"
            ]
        ]
    },
    {
        "db_id": "local_govt_in_alabama",
        "query": "MATCH (T1:`local_govt_in_alabama.Events`)-[T2:`local_govt_in_alabama.Participants_in_Events`]-()\nWITH T1.Event_Details AS Event_Details, T1.Event_ID AS Event_ID, count(*) AS count\nWHERE count  > 1\nRETURN Event_ID,Event_Details",
        "question": "What are the ids and details of events that have more than one participants?",
        "answers": [
            [
                3,
                "Success"
            ],
            [
                13,
                "Fail"
            ],
            [
                17,
                "Fail"
            ],
            [
                40,
                "Fail"
            ],
            [
                80,
                "Success"
            ]
        ]
    },
    {
        "db_id": "local_govt_in_alabama",
        "query": "MATCH (T1:`local_govt_in_alabama.Participants`)-[T2:`local_govt_in_alabama.Participants_in_Events`]-()\nRETURN T1.Participant_ID,T1.Participant_Type_Code,count(*)",
        "question": "How many events have each participants attended? List the participant id, type and the number.",
        "answers": [
            [
                26,
                "Organizer",
                2
            ],
            [
                36,
                "Organizer",
                1
            ],
            [
                37,
                "Participant",
                2
            ],
            [
                60,
                "Participant",
                1
            ],
            [
                63,
                "Participant",
                1
            ],
            [
                64,
                "Participant",
                1
            ],
            [
                66,
                "Participant",
                4
            ],
            [
                86,
                "Organizer",
                2
            ],
            [
                90,
                "Participant",
                3
            ],
            [
                96,
                "Organizer",
                1
            ]
        ]
    },
    {
        "db_id": "local_govt_in_alabama",
        "query": "MATCH (participants:`local_govt_in_alabama.Participants`)\nRETURN participants.Participant_ID,participants.Participant_Type_Code,participants.Participant_Details",
        "question": "What are all the the participant ids, type code and details?",
        "answers": [
            [
                9,
                "Organizer",
                "Karlee Batz"
            ],
            [
                26,
                "Organizer",
                "Vilma Schinner"
            ],
            [
                28,
                "Organizer",
                "Lupe Deckow"
            ],
            [
                36,
                "Organizer",
                "Kenyatta Kuhn"
            ],
            [
                37,
                "Participant",
                "Miss Kaci Lebsack"
            ],
            [
                38,
                "Organizer",
                "Macy Mayer DDS"
            ],
            [
                60,
                "Participant",
                "Dewitt Walter"
            ],
            [
                63,
                "Participant",
                "Prof. Michelle Maggio Jr."
            ],
            [
                64,
                "Participant",
                "Dr. Jaydon Renner"
            ],
            [
                66,
                "Participant",
                "Justyn Lebsack"
            ],
            [
                75,
                "Participant",
                "Berniece Weimann"
            ],
            [
                86,
                "Organizer",
                "Neil Blick"
            ],
            [
                90,
                "Participant",
                "Dedrick Ebert"
            ],
            [
                96,
                "Organizer",
                "Miss Joyce Cremin"
            ],
            [
                98,
                "Participant",
                "Dr. Kris Deckow"
            ]
        ]
    },
    {
        "db_id": "local_govt_in_alabama",
        "query": "MATCH (participants:`local_govt_in_alabama.Participants`)\nWHERE participants.Participant_Type_Code = 'Organizer'\nRETURN count(*)",
        "question": "How many participants belong to the type 'Organizer'?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "local_govt_in_alabama",
        "query": "MATCH (services:`local_govt_in_alabama.Services`)\nRETURN services.Service_Type_Code\nORDER BY services.Service_Type_Code",
        "question": "List the type of the services in alphabetical order.",
        "answers": [
            [
                "Birth Proof"
            ],
            [
                "Death Proof"
            ],
            [
                "Marriage"
            ],
            [
                "Property Change"
            ]
        ]
    },
    {
        "db_id": "local_govt_in_alabama",
        "query": "MATCH (events:`local_govt_in_alabama.Events`)\nRETURN events.Service_ID,events.Event_Details",
        "question": "List the service id and details for the events.",
        "answers": [
            [
                5,
                "Success"
            ],
            [
                8,
                "Success"
            ],
            [
                8,
                "Fail"
            ],
            [
                2,
                "Fail"
            ],
            [
                5,
                "Fail"
            ],
            [
                6,
                "Fail"
            ],
            [
                6,
                "Fail"
            ],
            [
                8,
                "Fail"
            ],
            [
                8,
                "Fail"
            ],
            [
                5,
                "Success"
            ],
            [
                2,
                "Fail"
            ],
            [
                2,
                "Success"
            ],
            [
                5,
                "Success"
            ],
            [
                2,
                "Fail"
            ],
            [
                2,
                "Success"
            ]
        ]
    },
    {
        "db_id": "local_govt_in_alabama",
        "query": "MATCH (participants:`local_govt_in_alabama.Participants`)\nRETURN participants.Participant_Type_Code\nORDER BY participants.Participant_Type_Code DESC\nLIMIT 1",
        "question": "What is the most common participant type?",
        "answers": [
            [
                "Participant"
            ]
        ]
    },
    {
        "db_id": "local_govt_in_alabama",
        "query": "MATCH ()-[participants_in_events:`local_govt_in_alabama.Participants_in_Events`]-()\nRETURN count(DISTINCT participants_in_events.Participant_ID)",
        "question": "What are all the distinct participant ids who attended any events?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "machine_repair",
        "query": "MATCH (technician:`machine_repair.technician`)\nRETURN technician.Name\nORDER BY technician.Age ASC",
        "question": "List the names of technicians in ascending order of age.",
        "answers": [
            [
                "Mark Sewell"
            ],
            [
                "Lou Boudreau"
            ],
            [
                "Charlie Hollocher"
            ],
            [
                "John Brown"
            ],
            [
                "Joe Sewell"
            ],
            [
                "Mickey Cochrane"
            ],
            [
                "Tony Sewell"
            ],
            [
                "Eddie Collins"
            ],
            [
                "Joe Cochrane"
            ],
            [
                "Eddie Collins"
            ]
        ]
    },
    {
        "db_id": "machine_repair",
        "query": "MATCH (technician:`machine_repair.technician`)\nWHERE technician.Team <> 'NYY'\nRETURN technician.Name",
        "question": "List the name of technicians whose team is not \"NYY\".",
        "answers": [
            [
                "Tony Sewell"
            ],
            [
                "Mark Sewell"
            ],
            [
                "Charlie Hollocher"
            ],
            [
                "Lou Boudreau"
            ],
            [
                "Eddie Collins"
            ],
            [
                "Joe Cochrane"
            ],
            [
                "Eddie Collins"
            ],
            [
                "Mickey Cochrane"
            ]
        ]
    },
    {
        "db_id": "machine_repair",
        "query": "MATCH (technician:`machine_repair.technician`)\nWHERE technician.Age = 36 OR technician.Age = 37\nRETURN technician.Name",
        "question": "Show the name of technicians aged either 36 or 37",
        "answers": [
            [
                "Joe Sewell"
            ],
            [
                "John Brown"
            ]
        ]
    },
    {
        "db_id": "machine_repair",
        "query": "MATCH (technician:`machine_repair.technician`)\nRETURN technician.Team,count(*)",
        "question": "Show different teams of technicians and the number of technicians in each team.",
        "answers": [
            [
                "NYY",
                2
            ],
            [
                "CLE",
                4
            ],
            [
                "CHC",
                1
            ],
            [
                "CWS",
                2
            ],
            [
                "PHA",
                1
            ]
        ]
    },
    {
        "db_id": "machine_repair",
        "query": "MATCH (technician:`machine_repair.technician`)\nRETURN technician.Team,count(*)",
        "question": "For each team, how many technicians are there?",
        "answers": [
            [
                "NYY",
                2
            ],
            [
                "CLE",
                4
            ],
            [
                "CHC",
                1
            ],
            [
                "CWS",
                2
            ],
            [
                "PHA",
                1
            ]
        ]
    },
    {
        "db_id": "machine_repair",
        "query": "MATCH (technician:`machine_repair.technician`)\nWITH count(*) AS count, technician.Team AS Team\nWHERE count  >= 2\nRETURN Team",
        "question": "Show the team that have at least two technicians.",
        "answers": [
            [
                "NYY"
            ],
            [
                "CLE"
            ],
            [
                "CWS"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN count(*)",
        "question": "How many entrepreneurs are there?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN count(*)",
        "question": "Count the number of entrepreneurs.",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN entrepreneur.Company\nORDER BY entrepreneur.Money_Requested DESC",
        "question": "List the companies of entrepreneurs in descending order of money requested.",
        "answers": [
            [
                "Umbrolly"
            ],
            [
                "Grails Ltd"
            ],
            [
                "Elizabeth Galton Ltd"
            ],
            [
                "Mycorrhizal Systems"
            ],
            [
                "Le Beanock"
            ],
            [
                "IV Cam"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN entrepreneur.Company\nORDER BY entrepreneur.Money_Requested DESC",
        "question": "What are the companies of entrepreneurs, ordered descending by amount of money requested?",
        "answers": [
            [
                "Umbrolly"
            ],
            [
                "Grails Ltd"
            ],
            [
                "Elizabeth Galton Ltd"
            ],
            [
                "Mycorrhizal Systems"
            ],
            [
                "Le Beanock"
            ],
            [
                "IV Cam"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN entrepreneur.Company,entrepreneur.Investor",
        "question": "List the companies and the investors of entrepreneurs.",
        "answers": [
            [
                "Umbrolly",
                "Duncan Bannatyne"
            ],
            [
                "Grails Ltd",
                "Doug Richard"
            ],
            [
                "Le Beanock",
                "Rachel Elnaugh"
            ],
            [
                "IV Cam",
                "Peter Jones"
            ],
            [
                "Mycorrhizal Systems",
                "Simon Woodroffe"
            ],
            [
                "Elizabeth Galton Ltd",
                "Duncan Bannatyne"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN entrepreneur.Company,entrepreneur.Investor",
        "question": "What are the companies and investors that correspond to each entrepreneur?",
        "answers": [
            [
                "Umbrolly",
                "Duncan Bannatyne"
            ],
            [
                "Grails Ltd",
                "Doug Richard"
            ],
            [
                "Le Beanock",
                "Rachel Elnaugh"
            ],
            [
                "IV Cam",
                "Peter Jones"
            ],
            [
                "Mycorrhizal Systems",
                "Simon Woodroffe"
            ],
            [
                "Elizabeth Galton Ltd",
                "Duncan Bannatyne"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN avg(entrepreneur.Money_Requested)",
        "question": "What is the average money requested by all entrepreneurs?",
        "answers": [
            [
                93166.66666666667
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN avg(entrepreneur.Money_Requested)",
        "question": "Return the average money requested across all entrepreneurs.",
        "answers": [
            [
                93166.66666666667
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (people:`entrepreneur.people`)\nRETURN people.Name\nORDER BY people.Weight ASC",
        "question": "What are the names of people in ascending order of weight?",
        "answers": [
            [
                "Fabrizio Buonocore"
            ],
            [
                "Leonardo Binchi"
            ],
            [
                "Alberto Angelini"
            ],
            [
                "Roberto Calcaterra"
            ],
            [
                "Marco Gerini"
            ],
            [
                "Maurizio Felugo"
            ],
            [
                "Francesco Postiglione"
            ],
            [
                "Goran Fiorentini"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (people:`entrepreneur.people`)\nRETURN people.Name\nORDER BY people.Weight ASC",
        "question": "Return the names of people, ordered by weight ascending.",
        "answers": [
            [
                "Fabrizio Buonocore"
            ],
            [
                "Leonardo Binchi"
            ],
            [
                "Alberto Angelini"
            ],
            [
                "Roberto Calcaterra"
            ],
            [
                "Marco Gerini"
            ],
            [
                "Maurizio Felugo"
            ],
            [
                "Francesco Postiglione"
            ],
            [
                "Goran Fiorentini"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T2.Name",
        "question": "What are the names of entrepreneurs?",
        "answers": [
            [
                "Francesco Postiglione"
            ],
            [
                "Leonardo Binchi"
            ],
            [
                "Fabrizio Buonocore"
            ],
            [
                "Roberto Calcaterra"
            ],
            [
                "Goran Fiorentini"
            ],
            [
                "Maurizio Felugo"
            ]
        ]
    }
]