[
    {
        "question": "For each classroom report the grade that is taught in it. Report just the classroom number and the grade number.",
        "query": "MATCH (list:`student_1.list`)\nRETURN DISTINCT list.Classroom,list.Grade",
        "db_id": "student_1",
        "answers": [
            [
                101,
                2
            ],
            [
                112,
                6
            ],
            [
                107,
                3
            ],
            [
                105,
                0
            ],
            [
                111,
                4
            ],
            [
                102,
                1
            ],
            [
                104,
                0
            ],
            [
                109,
                5
            ],
            [
                110,
                4
            ],
            [
                103,
                1
            ],
            [
                106,
                0
            ],
            [
                108,
                4
            ]
        ]
    },
    {
        "question": "Find the grade taught in classroom 103.",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Classroom = 103\nRETURN DISTINCT list.Grade",
        "db_id": "student_1",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "question": "Find the grade studying in room 105.",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Classroom = 105\nRETURN DISTINCT list.Grade",
        "db_id": "student_1",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Find the classrooms in which grade 4 is studying.",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Grade = 4\nRETURN DISTINCT list.Classroom",
        "db_id": "student_1",
        "answers": [
            [
                111
            ],
            [
                110
            ],
            [
                108
            ]
        ]
    },
    {
        "question": "Show me the classrooms grade 5 is using.",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Grade = 5\nRETURN DISTINCT list.Classroom",
        "db_id": "student_1",
        "answers": [
            [
                109
            ]
        ]
    },
    {
        "question": "Find the first names of all the teachers that teach in classroom 110.",
        "query": "MATCH (teachers:`student_1.teachers`)\nWHERE teachers.Classroom = 110\nRETURN teachers.FirstName",
        "db_id": "student_1",
        "answers": [
            [
                " GEORGETTA"
            ]
        ]
    },
    {
        "question": "Find the last names of teachers teaching in classroom 109.",
        "query": "MATCH (teachers:`student_1.teachers`)\nWHERE teachers.Classroom = 109\nRETURN teachers.LastName",
        "db_id": "student_1",
        "answers": [
            [
                "KAWA"
            ]
        ]
    },
    {
        "question": "Report the first name and last name of all the teachers.",
        "query": "MATCH (teachers:`student_1.teachers`)\nRETURN DISTINCT teachers.FirstName,teachers.LastName",
        "db_id": "student_1",
        "answers": [
            [
                " MIN",
                "MACROSTIE"
            ],
            [
                " JEROME",
                "COVIN"
            ],
            [
                " OTHA",
                "MOYER"
            ],
            [
                " JERLENE",
                "NIBLER"
            ],
            [
                " KIRK",
                "MARROTTE"
            ],
            [
                " LEIA",
                "TARRING"
            ],
            [
                " CHARMAINE",
                "URSERY"
            ],
            [
                " LORIA",
                "ONDERSMA"
            ],
            [
                " GORDON",
                "KAWA"
            ],
            [
                " GEORGETTA",
                "SUMPTION"
            ],
            [
                " BILLIE",
                "KRIENER"
            ],
            [
                " ALFREDA",
                "SUGAI"
            ]
        ]
    },
    {
        "question": "Count the number of students the teacher LORIA ONDERSMA teaches.",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T2.FirstName = 'LORIA' AND T2.LastName = 'ONDERSMA'\nRETURN count(*)",
        "db_id": "student_1",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Find the number of students taught by the teacher KAWA GORDON.",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T2.FirstName = 'KAWA' AND T2.LastName = 'GORDON'\nRETURN count(*)",
        "db_id": "student_1",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Find the number of students taught by TARRING LEIA.",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T2.FirstName = 'TARRING' AND T2.LastName = 'LEIA'\nRETURN count(*)",
        "db_id": "student_1",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Find the number of teachers who teach the student called CHRISSY NABOZNY.",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T1.FirstName = 'CHRISSY' AND T1.LastName = 'NABOZNY'\nRETURN count(*)",
        "db_id": "student_1",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Find the number of teachers who teach the student called MADLOCK RAY.",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T1.FirstName = 'MADLOCK' AND T1.LastName = 'RAY'\nRETURN count(*)",
        "db_id": "student_1",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Find the classroom that the most students use.",
        "query": "MATCH (list:`student_1.list`)\nWITH count(list.Classroom) AS count, list.Classroom AS Classroom\nRETURN Classroom\nORDER BY count DESC\nLIMIT 1",
        "db_id": "student_1",
        "answers": [
            [
                109
            ]
        ]
    },
    {
        "question": "Report the number of students in each classroom.",
        "query": "MATCH (list:`student_1.list`)\nWITH count(list.Classroom) AS count, list.Classroom AS Classroom\nRETURN Classroom,count",
        "db_id": "student_1",
        "answers": [
            [
                101,
                3
            ],
            [
                112,
                3
            ],
            [
                107,
                6
            ],
            [
                105,
                5
            ],
            [
                111,
                4
            ],
            [
                102,
                7
            ],
            [
                104,
                4
            ],
            [
                109,
                8
            ],
            [
                110,
                6
            ],
            [
                103,
                5
            ],
            [
                106,
                7
            ],
            [
                108,
                2
            ]
        ]
    },
    {
        "question": "Find the number of students in one classroom.",
        "query": "MATCH (list:`student_1.list`)\nWITH count(list.Classroom) AS count, list.Classroom AS Classroom\nRETURN count,Classroom",
        "db_id": "student_1",
        "answers": [
            [
                3,
                101
            ],
            [
                3,
                112
            ],
            [
                6,
                107
            ],
            [
                5,
                105
            ],
            [
                4,
                111
            ],
            [
                7,
                102
            ],
            [
                4,
                104
            ],
            [
                8,
                109
            ],
            [
                6,
                110
            ],
            [
                5,
                103
            ],
            [
                7,
                106
            ],
            [
                2,
                108
            ]
        ]
    },
    {
        "question": "List the names of companies by ascending number of sales.",
        "query": "MATCH (company:`company_employee.company`)\nRETURN company.Name\nORDER BY company.Sales_in_Billion ASC",
        "db_id": "company_employee",
        "answers": [
            [
                "Agricultural Bank of China"
            ],
            [
                "China Construction Bank"
            ],
            [
                "Industrial and Commercial Bank of China"
            ],
            [
                "Wells Fargo"
            ],
            [
                "HSBC"
            ],
            [
                "Citigroup"
            ],
            [
                "JPMorgan Chase"
            ],
            [
                "Gazprom"
            ],
            [
                "Berkshire Hathaway"
            ],
            [
                "Petrobras"
            ],
            [
                "General Electric"
            ],
            [
                "Total"
            ],
            [
                "Volkswagen Group"
            ],
            [
                "Chevron"
            ],
            [
                "PetroChina"
            ],
            [
                "BP"
            ],
            [
                "ExxonMobil"
            ],
            [
                "Walmart"
            ],
            [
                "Royal Dutch Shell"
            ]
        ]
    },
    {
        "question": "Show the different headquarters and number of companies at each headquarter.",
        "query": "MATCH (company:`company_employee.company`)\nWITH company.Headquarters AS Headquarters, count(company.Headquarters) AS count\nRETURN Headquarters,count",
        "db_id": "company_employee",
        "answers": [
            [
                "USA",
                8
            ],
            [
                "Netherlands",
                1
            ],
            [
                "China",
                4
            ],
            [
                "UK",
                2
            ],
            [
                "Brazil",
                1
            ],
            [
                "Russia",
                1
            ],
            [
                "Germany",
                1
            ],
            [
                "France",
                1
            ]
        ]
    },
    {
        "question": "Show the most common headquarter for companies.",
        "query": "MATCH (company:`company_employee.company`)\nWITH company.Headquarters AS Headquarters, count(company.Headquarters) AS count\nRETURN Headquarters\nORDER BY count DESC\nLIMIT 1",
        "db_id": "company_employee",
        "answers": [
            [
                "USA"
            ]
        ]
    },
    {
        "question": "Show the headquarters that have at least two companies.",
        "query": "MATCH (company:`company_employee.company`)\nWITH count(*) AS count, company.Headquarters AS Headquarters\nWHERE count  >= 2\nRETURN Headquarters",
        "db_id": "company_employee",
        "answers": [
            [
                "USA"
            ],
            [
                "China"
            ],
            [
                "UK"
            ]
        ]
    },
    {
        "question": "List the names of people that are not employed by any company",
        "query": "MATCH (people:`company_employee.people`)\nWHERE NOT (people:`company_employee.people`)-[:`company_employee.employment`]-()\nRETURN people.Name",
        "db_id": "company_employee",
        "answers": [
            [
                "David Butler"
            ],
            [
                "Tim Naegeli"
            ]
        ]
    },
    {
        "question": "list the names of the companies with more than 200 sales in the descending order of sales and profits.",
        "query": "MATCH (company:`company_employee.company`)\nWHERE company.Sales_in_Billion > 200\nRETURN company.Name\nORDER BY company.Sales_in_Billion,company.Profits_in_Billion DESC",
        "db_id": "company_employee",
        "answers": [
            [
                "Total"
            ],
            [
                "Volkswagen Group"
            ],
            [
                "Chevron"
            ],
            [
                "PetroChina"
            ],
            [
                "BP"
            ],
            [
                "ExxonMobil"
            ],
            [
                "Walmart"
            ],
            [
                "Royal Dutch Shell"
            ]
        ]
    },
    {
        "question": "Count the number of films.",
        "query": "MATCH (film:`film_rank.film`)\nRETURN count(*)",
        "db_id": "film_rank",
        "answers": [
            [
                13
            ]
        ]
    },
    {
        "question": "List the distinct director of all films.",
        "query": "MATCH (film:`film_rank.film`)\nRETURN DISTINCT film.Director",
        "db_id": "film_rank",
        "answers": [
            [
                "Steven Spielberg"
            ],
            [
                "Sydney Pollack"
            ],
            [
                "Taylor Hackford"
            ],
            [
                "Sylvester Stallone"
            ],
            [
                "Bob Clark"
            ],
            [
                "Nicholas Meyer"
            ],
            [
                "Walter Hill"
            ],
            [
                "Tobe Hooper"
            ],
            [
                "Colin Higgins"
            ],
            [
                "John Huston"
            ],
            [
                "Sidney Lumet"
            ],
            [
                "Richard Attenborough"
            ],
            [
                "Ted Kotcheff"
            ]
        ]
    },
    {
        "question": "Return the average gross sales in dollars across all films.",
        "query": "MATCH (film:`film_rank.film`)\nRETURN avg(film.Gross_in_dollar)",
        "db_id": "film_rank",
        "answers": [
            [
                114827242.38461539
            ]
        ]
    },
    {
        "question": "Return the low and high estimates for all film markets.",
        "query": "MATCH (film_market_estimation:`film_rank.film_market_estimation`)\nRETURN film_market_estimation.Low_Estimate,film_market_estimation.High_Estimate",
        "db_id": "film_rank",
        "answers": [
            [
                80000.0,
                80400.0
            ],
            [
                8000.0,
                8000.0
            ],
            [
                3000.0,
                80400.0
            ],
            [
                960.0,
                960.0
            ],
            [
                913.0,
                913.0
            ],
            [
                300.0,
                1000.0
            ],
            [
                53.0,
                53.0
            ],
            [
                39.0,
                39.0
            ],
            [
                16.0,
                16.0
            ]
        ]
    },
    {
        "question": "Return the types of film market estimations in 1995.",
        "query": "MATCH (film_market_estimation:`film_rank.film_market_estimation`)\nWHERE film_market_estimation.Year = 1995\nRETURN film_market_estimation.Type",
        "db_id": "film_rank",
        "answers": [
            [
                "Mass suicide"
            ]
        ]
    },
    {
        "question": "What are the maximum and minimum number of cities in all markets.",
        "query": "MATCH (market:`film_rank.market`)\nRETURN max(market.Number_cities),min(market.Number_cities)",
        "db_id": "film_rank",
        "answers": [
            [
                700,
                209
            ]
        ]
    },
    {
        "question": "Count the number of markets that have a number of cities lower than 300.",
        "query": "MATCH (market:`film_rank.market`)\nWHERE market.Number_cities < 300\nRETURN count(*)",
        "db_id": "film_rank",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "List all countries of markets in ascending alphabetical order.",
        "query": "MATCH (market:`film_rank.market`)\nRETURN market.Country\nORDER BY market.Country ASC",
        "db_id": "film_rank",
        "answers": [
            [
                "China"
            ],
            [
                "France"
            ],
            [
                "Japan"
            ],
            [
                "Poland"
            ],
            [
                "Russia"
            ],
            [
                "USA"
            ]
        ]
    },
    {
        "question": "List all countries of markets in descending order of number of cities.",
        "query": "MATCH (market:`film_rank.market`)\nRETURN market.Country\nORDER BY market.Number_cities DESC",
        "db_id": "film_rank",
        "answers": [
            [
                "USA"
            ],
            [
                "China"
            ],
            [
                "Poland"
            ],
            [
                "Russia"
            ],
            [
                "France"
            ],
            [
                "Japan"
            ]
        ]
    },
    {
        "question": "List the studios of each film and the number of films produced by that studio.",
        "query": "MATCH (film:`film_rank.film`)\nWITH count(film.Studio) AS count, film.Studio AS Studio\nRETURN Studio,count",
        "db_id": "film_rank",
        "answers": [
            [
                "Universal",
                1
            ],
            [
                "Columbia",
                2
            ],
            [
                "Paramount / Lorimar",
                1
            ],
            [
                "United Artists",
                1
            ],
            [
                "20th Century Fox",
                2
            ],
            [
                "Paramount",
                2
            ],
            [
                "MGM",
                1
            ],
            [
                "Universal / RKO",
                1
            ],
            [
                "Columbia / Rastar",
                1
            ],
            [
                "Orion / Carolco",
                1
            ]
        ]
    },
    {
        "question": "List the names of studios that have at least two films.",
        "query": "MATCH (film:`film_rank.film`)\nWITH count(*) AS count, film.Studio AS Studio\nWHERE count  >= 2\nRETURN Studio",
        "db_id": "film_rank",
        "answers": [
            [
                "Columbia"
            ],
            [
                "20th Century Fox"
            ],
            [
                "Paramount"
            ]
        ]
    },
    {
        "question": "Count the number of all the calendar items.",
        "query": "MATCH (ref_calendar:`cre_Doc_Tracking_DB.Ref_Calendar`)\nRETURN count(*)",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Show all calendar dates and day Numbers.",
        "query": "MATCH (ref_calendar:`cre_Doc_Tracking_DB.Ref_Calendar`)\nRETURN ref_calendar.Calendar_Date,ref_calendar.Day_Number",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "1972-03-31 09:47:22",
                5
            ],
            [
                "1976-06-15 03:40:06",
                7
            ],
            [
                "1985-05-13 12:19:43",
                7
            ],
            [
                "1986-10-14 17:53:39",
                1
            ],
            [
                "1987-11-05 06:11:22",
                3
            ],
            [
                "1988-02-01 14:41:52",
                8
            ],
            [
                "1994-11-15 03:49:54",
                9
            ],
            [
                "1995-01-01 03:52:11",
                1
            ],
            [
                "1997-03-10 15:24:00",
                7
            ],
            [
                "2007-05-28 16:28:48",
                2
            ],
            [
                "2008-06-08 12:45:38",
                3
            ],
            [
                "2009-08-18 03:29:08",
                8
            ],
            [
                "2010-11-26 19:22:50",
                7
            ],
            [
                "2012-07-03 09:48:46",
                7
            ],
            [
                "2017-01-06 23:17:22",
                8
            ]
        ]
    },
    {
        "question": "Show the number of document types.",
        "query": "MATCH (ref_document_types:`cre_Doc_Tracking_DB.Ref_Document_Types`)\nRETURN count(*)",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "question": "List all document type codes and document type names.",
        "query": "MATCH (ref_document_types:`cre_Doc_Tracking_DB.Ref_Document_Types`)\nRETURN ref_document_types.Document_Type_Code,ref_document_types.Document_Type_Name",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "CV",
                "CV"
            ],
            [
                "BK",
                "Book"
            ],
            [
                "PR",
                "Paper"
            ],
            [
                "RV",
                "Review"
            ]
        ]
    },
    {
        "question": "What is the name and description for document type code RV?",
        "query": "MATCH (ref_document_types:`cre_Doc_Tracking_DB.Ref_Document_Types`)\nWHERE ref_document_types.Document_Type_Code = 'RV'\nRETURN ref_document_types.Document_Type_Name,ref_document_types.Document_Type_Description",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "Review",
                ""
            ]
        ]
    },
    {
        "question": "What is the document type code for document type \"Paper\"?",
        "query": "MATCH (ref_document_types:`cre_Doc_Tracking_DB.Ref_Document_Types`)\nWHERE ref_document_types.Document_Type_Name = 'Paper'\nRETURN ref_document_types.Document_Type_Code",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "PR"
            ]
        ]
    },
    {
        "question": "Show the number of documents with document type code CV or BK.",
        "query": "MATCH (all_documents:`cre_Doc_Tracking_DB.All_Documents`)\nWHERE all_documents.Document_Type_Code = 'CV' OR all_documents.Document_Type_Code = 'BK'\nRETURN count(*)",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "question": "How many documents have document type code CV or BK?",
        "query": "MATCH (all_documents:`cre_Doc_Tracking_DB.All_Documents`)\nWHERE all_documents.Document_Type_Code = 'CV' OR all_documents.Document_Type_Code = 'BK'\nRETURN count(*)",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "question": "What is the date when the document \"Marry CV\" was stored?",
        "query": "MATCH (all_documents:`cre_Doc_Tracking_DB.All_Documents`)\nWHERE all_documents.Document_Name = 'Marry CV'\nRETURN all_documents.Date_Stored",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "1986-10-14 17:53:39"
            ]
        ]
    },
    {
        "question": "Show the number of locations.",
        "query": "MATCH (ref_locations:`cre_Doc_Tracking_DB.Ref_Locations`)\nRETURN count(*)",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "List all location codes and location names.",
        "query": "MATCH (ref_locations:`cre_Doc_Tracking_DB.Ref_Locations`)\nRETURN ref_locations.Location_Code,ref_locations.Location_Name",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "b",
                "Brazil"
            ],
            [
                "c",
                "Canada"
            ],
            [
                "e",
                "Edinburgh"
            ],
            [
                "n",
                "Nanjing"
            ],
            [
                "x",
                "Xiamen"
            ]
        ]
    },
    {
        "question": "Give me the name and description of the location with code x.",
        "query": "MATCH (ref_locations:`cre_Doc_Tracking_DB.Ref_Locations`)\nWHERE ref_locations.Location_Code = 'x'\nRETURN ref_locations.Location_Name,ref_locations.Location_Description",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "Xiamen",
                ""
            ]
        ]
    },
    {
        "question": "What is the location code for the country \"Canada\"?",
        "query": "MATCH (ref_locations:`cre_Doc_Tracking_DB.Ref_Locations`)\nWHERE ref_locations.Location_Name = 'Canada'\nRETURN ref_locations.Location_Code",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "c"
            ]
        ]
    },
    {
        "question": "Count the total number of roles listed.",
        "query": "MATCH (roles:`cre_Doc_Tracking_DB.Roles`)\nRETURN count(*)",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "List all role codes, role names, and role descriptions.",
        "query": "MATCH (roles:`cre_Doc_Tracking_DB.Roles`)\nRETURN roles.Role_Code,roles.Role_Name,roles.Role_Description",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "MG",
                "Manager",
                "Vero harum corrupti odit ipsa vero et odio. Iste et recusandae temporibus maxime. Magni aspernatur fugit quis explicabo totam esse corrupti."
            ],
            [
                "ED",
                "Editor",
                "Itaque dolor ut nemo rerum vitae provident. Vel laborum ipsum velit sint. Et est omnis dignissimos."
            ],
            [
                "PT",
                "Photo",
                "Aut modi nihil molestias temporibus sit rerum. Sit neque eaque odio omnis incidunt."
            ],
            [
                "PR",
                "Proof Reader",
                "Ut sed quae eaque mollitia qui hic. Natus ea expedita et odio illum fugiat qui natus. Consequatur velit ut dolorem cum ullam esse deserunt dignissimos. Enim non non rem officiis quis."
            ],
            [
                "HR",
                "Human Resource",
                "Et totam est quibusdam aspernatur ut. Vitae perferendis eligendi voluptatem molestiae rem ut enim. Ipsum expedita quae earum unde est. Repellendus ut ipsam nihil accusantium sit. Magni accusantium numquam quod et."
            ]
        ]
    },
    {
        "question": "What are the name and description for role code \"MG\"?",
        "query": "MATCH (roles:`cre_Doc_Tracking_DB.Roles`)\nWHERE roles.Role_Code = 'MG'\nRETURN roles.Role_Name,roles.Role_Description",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "Manager",
                "Vero harum corrupti odit ipsa vero et odio. Iste et recusandae temporibus maxime. Magni aspernatur fugit quis explicabo totam esse corrupti."
            ]
        ]
    },
    {
        "question": "Show the description for role name \"Proof Reader\".",
        "query": "MATCH (roles:`cre_Doc_Tracking_DB.Roles`)\nWHERE roles.Role_Name = 'Proof Reader'\nRETURN roles.Role_Description",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "Ut sed quae eaque mollitia qui hic. Natus ea expedita et odio illum fugiat qui natus. Consequatur velit ut dolorem cum ullam esse deserunt dignissimos. Enim non non rem officiis quis."
            ]
        ]
    },
    {
        "question": "Find the number of employees we have.",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nRETURN count(*)",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Show the name, role code, and date of birth for the employee with name 'Armani'.",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nWHERE employees.Employee_Name = 'Armani'\nRETURN employees.Employee_Name,employees.Role_Code,employees.Date_of_Birth",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "Armani",
                "ED",
                "1988-12-08 06:13:33"
            ]
        ]
    },
    {
        "question": "Show the id of the employee named Ebba.",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nWHERE employees.Employee_Name = 'Ebba'\nRETURN employees.Employee_ID",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                30
            ]
        ]
    },
    {
        "question": "Show the names of all the employees with role \"HR\".",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nWHERE employees.Role_Code = 'HR'\nRETURN employees.Employee_Name",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "Leo"
            ]
        ]
    },
    {
        "question": "Show all role codes and the number of employees in each role.",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nWITH employees.Role_Code AS Role_Code, count(employees.Role_Code) AS count\nRETURN Role_Code,count",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "HR",
                1
            ],
            [
                "MG",
                1
            ],
            [
                "ED",
                7
            ],
            [
                "PT",
                1
            ],
            [
                "PR",
                5
            ]
        ]
    },
    {
        "question": "What is the role code with the largest number of employees?",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nWITH employees.Role_Code AS Role_Code, count(employees.Role_Code) AS count\nRETURN Role_Code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "ED"
            ]
        ]
    },
    {
        "question": "Show all role codes with at least 3 employees.",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nWITH count(*) AS count, employees.Role_Code AS Role_Code\nWHERE count  >= 3\nRETURN Role_Code",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "ED"
            ],
            [
                "PR"
            ]
        ]
    }
]