[
    {
        "question": "Show ids, customer ids, card type codes, card numbers for all cards.",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN customers_cards.card_id,customers_cards.customer_id,customers_cards.card_type_code,customers_cards.card_number",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                1,
                14,
                "Credit",
                "4560596484842"
            ],
            [
                2,
                9,
                "Credit",
                "4859448397570735"
            ],
            [
                3,
                6,
                "Debit",
                "348237249146948"
            ],
            [
                4,
                15,
                "Credit",
                "4485460762694"
            ],
            [
                5,
                13,
                "Credit",
                "5122249720639438"
            ],
            [
                6,
                10,
                "Debit",
                "5102229294602335"
            ],
            [
                7,
                9,
                "Credit",
                "4716674779726"
            ],
            [
                8,
                12,
                "Credit",
                "6011225247353230"
            ],
            [
                9,
                3,
                "Debit",
                "4929590358481"
            ],
            [
                10,
                10,
                "Debit",
                "4532488235104"
            ],
            [
                11,
                8,
                "Debit",
                "4707949584519"
            ],
            [
                12,
                3,
                "Debit",
                "4929896676202959"
            ],
            [
                13,
                2,
                "Credit",
                "5484846021884483"
            ],
            [
                14,
                5,
                "Debit",
                "4929384762825"
            ],
            [
                15,
                2,
                "Debit",
                "345475370003028"
            ]
        ]
    },
    {
        "question": "Count the number of cards the customer with the first name Art and last name Turcotte has.",
        "query": "MATCH (T1:`customers_card_transactions.Customers_Cards`)-[]-(T2:`customers_card_transactions.Customers`)\nWHERE T2.customer_first_name = 'Art' AND T2.customer_last_name = 'Turcotte'\nRETURN count(*)",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "How many debit cards do we have?",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nWHERE customers_cards.card_type_code = 'Debit'\nRETURN count(*)",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "question": "Show all customer ids and the number of cards owned by each customer.",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nWITH count(customers_cards.customer_id) AS count, customers_cards.customer_id AS customer_id\nRETURN customer_id,count",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                14,
                1
            ],
            [
                9,
                2
            ],
            [
                6,
                1
            ],
            [
                15,
                1
            ],
            [
                13,
                1
            ],
            [
                10,
                2
            ],
            [
                12,
                1
            ],
            [
                3,
                2
            ],
            [
                8,
                1
            ],
            [
                2,
                2
            ],
            [
                5,
                1
            ]
        ]
    },
    {
        "question": "Show all card type codes and the number of cards in each type.",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nWITH customers_cards.card_type_code AS card_type_code, count(customers_cards.card_type_code) AS count\nRETURN card_type_code,count",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                "Credit",
                7
            ],
            [
                "Debit",
                8
            ]
        ]
    },
    {
        "question": "Return the code of the card type that is most common.",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nWITH customers_cards.card_type_code AS card_type_code, count(customers_cards.card_type_code) AS count\nRETURN card_type_code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                "Debit"
            ]
        ]
    },
    {
        "question": "Show card type codes with at least 5 cards.",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nWITH count(*) AS count, customers_cards.card_type_code AS card_type_code\nWHERE count  >= 5\nRETURN card_type_code",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                "Credit"
            ],
            [
                "Debit"
            ]
        ]
    },
    {
        "question": "Show all card type codes.",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN DISTINCT customers_cards.card_type_code",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                "Credit"
            ],
            [
                "Debit"
            ]
        ]
    },
    {
        "question": "Show the number of card types.",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN count(DISTINCT customers_cards.card_type_code)",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "Count the number of tracks.",
        "query": "MATCH (track:`race_track.track`)\nRETURN count(*)",
        "db_id": "race_track",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "question": "Show the name and location for all tracks.",
        "query": "MATCH (track:`race_track.track`)\nRETURN track.Name,track.Location",
        "db_id": "race_track",
        "answers": [
            [
                "Auto Club Speedway",
                "Fontana, CA"
            ],
            [
                "Chicagoland Speedway",
                "Joliet, IL"
            ],
            [
                "Darlington Raceway",
                "Darlington, SC"
            ],
            [
                "Daytona International Speedway",
                "Daytona Beach, FL"
            ],
            [
                "Homestead-Miami Speedway",
                "Homestead, FL"
            ],
            [
                "Kansas Speedway",
                "Kansas City, KS"
            ],
            [
                "Martinsville Speedway",
                "Ridgeway, VA"
            ],
            [
                "Michigan International Speedway",
                "Brooklyn, MI"
            ],
            [
                "Phoenix International Raceway",
                "Avondale, AZ"
            ]
        ]
    },
    {
        "question": "Show names and seatings, ordered by seating for all tracks opened after 2000.",
        "query": "MATCH (track:`race_track.track`)\nWHERE track.Year_Opened > 2000\nRETURN track.Name,track.Seating\nORDER BY track.Seating",
        "db_id": "race_track",
        "answers": [
            [
                "Chicagoland Speedway",
                75000.0
            ],
            [
                "Kansas Speedway",
                81687.0
            ]
        ]
    },
    {
        "question": "Return the name, location, and seating of the track that was opened in the most recent year.",
        "query": "MATCH (track:`race_track.track`)\nRETURN track.Name,track.Location,track.Seating\nORDER BY track.Year_Opened DESC\nLIMIT 1",
        "db_id": "race_track",
        "answers": [
            [
                "Chicagoland Speedway",
                "Joliet, IL",
                75000.0
            ]
        ]
    },
    {
        "question": "What is the minimum, maximum, and average seating for all tracks.",
        "query": "MATCH (track:`race_track.track`)\nRETURN min(track.Seating),max(track.Seating),avg(track.Seating)",
        "db_id": "race_track",
        "answers": [
            [
                63000.0,
                168000.0,
                91526.88888888889
            ]
        ]
    },
    {
        "question": "Give the different locations of tracks.",
        "query": "MATCH (track:`race_track.track`)\nRETURN DISTINCT track.Location",
        "db_id": "race_track",
        "answers": [
            [
                "Fontana, CA"
            ],
            [
                "Joliet, IL"
            ],
            [
                "Darlington, SC"
            ],
            [
                "Daytona Beach, FL"
            ],
            [
                "Homestead, FL"
            ],
            [
                "Kansas City, KS"
            ],
            [
                "Ridgeway, VA"
            ],
            [
                "Brooklyn, MI"
            ],
            [
                "Avondale, AZ"
            ]
        ]
    },
    {
        "question": "Count the number of races.",
        "query": "MATCH (race:`race_track.race`)\nRETURN count(*)",
        "db_id": "race_track",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "Return the different classes of races.",
        "query": "MATCH (race:`race_track.race`)\nRETURN DISTINCT race.Class",
        "db_id": "race_track",
        "answers": [
            [
                "DP/GT"
            ],
            [
                "GT"
            ]
        ]
    },
    {
        "question": "Show the race class and number of races in each class.",
        "query": "MATCH (race:`race_track.race`)\nWITH count(race.Class) AS count, race.Class AS Class\nRETURN Class,count",
        "db_id": "race_track",
        "answers": [
            [
                "DP/GT",
                5
            ],
            [
                "GT",
                2
            ]
        ]
    },
    {
        "question": "What is the race class with most number of races.",
        "query": "MATCH (race:`race_track.race`)\nWITH count(race.Class) AS count, race.Class AS Class\nRETURN Class\nORDER BY count DESC\nLIMIT 1",
        "db_id": "race_track",
        "answers": [
            [
                "DP/GT"
            ]
        ]
    },
    {
        "question": "List the race class with at least two races.",
        "query": "MATCH (race:`race_track.race`)\nWITH count(*) AS count, race.Class AS Class\nWHERE count  >= 2\nRETURN Class",
        "db_id": "race_track",
        "answers": [
            [
                "DP/GT"
            ],
            [
                "GT"
            ]
        ]
    },
    {
        "question": "Find the number of members living in each address.",
        "query": "MATCH (member:`coffee_shop.member`)\nWITH member.Address AS Address, count(member.Address) AS count\nRETURN count,Address",
        "db_id": "coffee_shop",
        "answers": [
            [
                3,
                "Hartford"
            ],
            [
                4,
                "Waterbury"
            ],
            [
                2,
                "Cheshire"
            ],
            [
                1,
                "Bridgeport"
            ]
        ]
    },
    {
        "question": "Give me the names of members whose address is in Harford or Waterbury.",
        "query": "MATCH (member:`coffee_shop.member`)\nWHERE member.Address = 'Harford' OR member.Address = 'Waterbury'\nRETURN member.Name",
        "db_id": "coffee_shop",
        "answers": [
            [
                "Breton, Robert"
            ],
            [
                "Cobb, Sedrick"
            ],
            [
                "Reynolds, Richard"
            ],
            [
                "Rizzo, Todd"
            ]
        ]
    },
    {
        "question": "Find the ids and names of members who are under age 30 or with black membership card.",
        "query": "MATCH (member:`coffee_shop.member`)\nWHERE member.Membership_card = 'Black' OR member.Age < 30\nRETURN member.Name,member.Member_ID",
        "db_id": "coffee_shop",
        "answers": [
            [
                "Ashby, Lazale",
                1
            ],
            [
                "Campbell, Jessie",
                3
            ],
            [
                "Cobb, Sedrick",
                4
            ],
            [
                "Peeler, Russell",
                7
            ],
            [
                "Reynolds, Richard",
                8
            ],
            [
                "Webb, Daniel",
                10
            ]
        ]
    },
    {
        "question": "Find the purchase time, age and address of each member, and show the results in the order of purchase time.",
        "query": "MATCH (member:`coffee_shop.member`)\nRETURN member.Time_of_purchase,member.Age,member.Address\nORDER BY member.Time_of_purchase",
        "db_id": "coffee_shop",
        "answers": [
            [
                18,
                29,
                "Hartford"
            ],
            [
                18,
                35,
                "Waterbury"
            ],
            [
                20,
                34,
                "Hartford"
            ],
            [
                24,
                45,
                "Waterbury"
            ],
            [
                26,
                33,
                "Cheshire"
            ],
            [
                26,
                42,
                "Bridgeport"
            ],
            [
                27,
                51,
                "Waterbury"
            ],
            [
                27,
                51,
                "Hartford"
            ],
            [
                41,
                67,
                "Waterbury"
            ],
            [
                44,
                50,
                "Cheshire"
            ]
        ]
    },
    {
        "question": "Show the shop addresses ordered by their opening year.",
        "query": "MATCH (shop:`coffee_shop.shop`)\nRETURN shop.Address\nORDER BY shop.Open_Year",
        "db_id": "coffee_shop",
        "answers": [
            [
                "1100 Main Street"
            ],
            [
                "1111 Main Street"
            ],
            [
                "2345 McGee Street"
            ],
            [
                "324 E. 11th Street"
            ],
            [
                "1200 Main Street"
            ],
            [
                "1330 Baltimore Street"
            ],
            [
                "909 Walnut Street"
            ],
            [
                "1201 Walnut Street"
            ],
            [
                "414 E. 12th Street"
            ],
            [
                "909 Main Street"
            ]
        ]
    },
    {
        "question": "Find the address and staff number of the shops that do not have any happy hour.",
        "query": "MATCH (shop:`coffee_shop.shop`)\nWHERE NOT (shop:`coffee_shop.shop`)-[]-(:`coffee_shop.happy_hour`)\nRETURN shop.Address,shop.Num_of_staff",
        "db_id": "coffee_shop",
        "answers": [
            [
                "909 Walnut Street",
                "27"
            ],
            [
                "1201 Walnut Street",
                "34"
            ],
            [
                "2345 McGee Street",
                "425"
            ],
            [
                "909 Main Street",
                "28"
            ],
            [
                "1100 Main Street",
                "23"
            ]
        ]
    },
    {
        "question": "which shop has happy hour most frequently? List its id and number of happy hours.",
        "query": "MATCH (happy_hour:`coffee_shop.happy_hour`)\nWITH count(happy_hour.Shop_ID) AS count, happy_hour.Shop_ID AS Shop_ID\nRETURN Shop_ID,count\nORDER BY count DESC\nLIMIT 1",
        "db_id": "coffee_shop",
        "answers": [
            [
                1,
                4
            ]
        ]
    },
    {
        "question": "Find all the phone numbers.",
        "query": "MATCH (available_policies:`insurance_fnol.Available_Policies`)\nRETURN available_policies.Customer_Phone",
        "db_id": "insurance_fnol",
        "answers": [
            [
                "+16(2)5838999222"
            ],
            [
                "242.763.9214"
            ],
            [
                "1-416-503-7735x94204"
            ],
            [
                "(777)537-7792"
            ],
            [
                "1-446-940-9907x257"
            ],
            [
                "(379)862-8274x12620"
            ],
            [
                "+85(6)1302858396"
            ],
            [
                "1-797-927-3585x9321"
            ],
            [
                "991.642.6485x822"
            ],
            [
                "813.178.8211x557"
            ],
            [
                "889-572-0609x552"
            ],
            [
                "1-138-841-3073"
            ],
            [
                "1-381-132-0127x3801"
            ],
            [
                "00481937923"
            ],
            [
                "405.090.8654x021"
            ]
        ]
    },
    {
        "question": "What are the customer phone numbers under the policy \"Life Insurance\"?",
        "query": "MATCH (available_policies:`insurance_fnol.Available_Policies`)\nWHERE available_policies.policy_type_code = 'Life Insurance'\nRETURN available_policies.Customer_Phone",
        "db_id": "insurance_fnol",
        "answers": [
            [
                "+16(2)5838999222"
            ],
            [
                "991.642.6485x822"
            ],
            [
                "889-572-0609x552"
            ],
            [
                "1-138-841-3073"
            ]
        ]
    },
    {
        "question": "Which policy type has the most records in the database?",
        "query": "MATCH (available_policies:`insurance_fnol.Available_Policies`)\nWITH count(available_policies.policy_type_code) AS count, available_policies.policy_type_code AS policy_type_code\nRETURN policy_type_code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "insurance_fnol",
        "answers": [
            [
                "Property Insurance"
            ]
        ]
    },
    {
        "question": "Which policy type appears most frequently in the available policies?",
        "query": "MATCH (available_policies:`insurance_fnol.Available_Policies`)\nWITH count(available_policies.policy_type_code) AS count, available_policies.policy_type_code AS policy_type_code\nRETURN policy_type_code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "insurance_fnol",
        "answers": [
            [
                "Property Insurance"
            ]
        ]
    },
    {
        "question": "Find the policy type used by more than 4 customers.",
        "query": "MATCH (available_policies:`insurance_fnol.Available_Policies`)\nWITH count(*) AS count, available_policies.policy_type_code AS policy_type_code\nWHERE count  > 4\nRETURN policy_type_code",
        "db_id": "insurance_fnol",
        "answers": [
            [
                "Property Insurance"
            ],
            [
                "Mortgage Insurance"
            ]
        ]
    },
    {
        "question": "List all the services in the alphabetical order.",
        "query": "MATCH (services:`insurance_fnol.Services`)\nRETURN services.Service_name\nORDER BY services.Service_name",
        "db_id": "insurance_fnol",
        "answers": [
            [
                "Change a policy"
            ],
            [
                "Close a policy"
            ],
            [
                "New policy application"
            ],
            [
                "Upgrade a policy"
            ]
        ]
    },
    {
        "question": "Count the total number of available services.",
        "query": "MATCH (services:`insurance_fnol.Services`)\nRETURN count(*)",
        "db_id": "insurance_fnol",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "question": "Find the maximum and minimum settlement amount.",
        "query": "MATCH (settlements:`insurance_fnol.Settlements`)\nRETURN max(settlements.Settlement_Amount),min(settlements.Settlement_Amount)",
        "db_id": "insurance_fnol",
        "answers": [
            [
                9814.39,
                1588.45
            ]
        ]
    },
    {
        "question": "List all the customers in increasing order of IDs.",
        "query": "MATCH (customers:`insurance_fnol.Customers`)\nRETURN customers.Customer_ID,customers.Customer_name\nORDER BY customers.Customer_ID ASC",
        "db_id": "insurance_fnol",
        "answers": [
            [
                194,
                "America Jaskolski"
            ],
            [
                214,
                "Ellsworth Paucek"
            ],
            [
                256,
                "Mrs. Hanna Willms"
            ],
            [
                562,
                "Dr. Diana Rath"
            ],
            [
                582,
                "Selena Gerhold"
            ],
            [
                641,
                "Dayana Robel"
            ],
            [
                682,
                "Mr. Edwardo Blanda I"
            ],
            [
                756,
                "Mr. Randal Lynch III"
            ],
            [
                805,
                "Mrs. Liza Heller V"
            ],
            [
                826,
                "Mrs. Lilly Graham III"
            ],
            [
                882,
                "Miss Felicita Reichel"
            ],
            [
                892,
                "Sydnie Friesen"
            ],
            [
                923,
                "David Ross"
            ],
            [
                956,
                "Cai Zhang"
            ],
            [
                996,
                "Jay Chou"
            ]
        ]
    },
    {
        "question": "List the name of enzymes in descending lexicographical order.",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nRETURN enzyme.name\nORDER BY enzyme.name DESC",
        "db_id": "medicine_enzyme_interaction",
        "answers": [
            [
                "Uroporphyrinogen III synthase"
            ],
            [
                "Uroporphyrinogen III decarboxylase"
            ],
            [
                "Protoporphyrinogen oxidase"
            ],
            [
                "PBG deaminase"
            ],
            [
                "Ferrochelatase"
            ],
            [
                "Coproporphyrinogen III oxidase"
            ],
            [
                "ALA synthase"
            ],
            [
                "ALA dehydratase"
            ]
        ]
    },
    {
        "question": "List the names and the locations that the enzymes can make an effect.",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nRETURN enzyme.name,enzyme.Location",
        "db_id": "medicine_enzyme_interaction",
        "answers": [
            [
                "ALA synthase",
                "Mitochondrion"
            ],
            [
                "ALA dehydratase",
                "Cytosol"
            ],
            [
                "PBG deaminase",
                "Cytosol"
            ],
            [
                "Uroporphyrinogen III synthase",
                "Cytosol"
            ],
            [
                "Uroporphyrinogen III decarboxylase",
                "Cytosol"
            ],
            [
                "Coproporphyrinogen III oxidase",
                "Mitochondrion"
            ],
            [
                "Protoporphyrinogen oxidase",
                "Mitochondrion"
            ],
            [
                "Ferrochelatase",
                "Mitochondrion"
            ]
        ]
    },
    {
        "question": "What are the ids, names and FDA approval status of medicines in descending order of the number of enzymes that it can interact with.",
        "query": "MATCH (T1:`medicine_enzyme_interaction.medicine`)-[T2:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-()\nWITH T1.name AS name, T1.FDA_approved AS FDA_approved, T1.id AS id, count(T1.id) AS count\nRETURN id,name,FDA_approved\nORDER BY count DESC",
        "db_id": "medicine_enzyme_interaction",
        "answers": [
            [
                2,
                "Aripiprazole",
                "Yes"
            ],
            [
                3,
                "Asenapine",
                "Yes"
            ],
            [
                8,
                "Iloperidone",
                "Yes"
            ],
            [
                20,
                "Ziprasidone",
                "Yes"
            ],
            [
                1,
                "Amisulpride",
                "No"
            ],
            [
                4,
                "Blonanserin",
                "No"
            ],
            [
                5,
                "Carpipramine",
                "No"
            ],
            [
                6,
                "Clocapramine",
                "No"
            ],
            [
                7,
                "Clozapine",
                "Yes"
            ],
            [
                9,
                "Lurasidone",
                "Yes"
            ],
            [
                10,
                "Melperone",
                "No"
            ],
            [
                13,
                "Paliperidone",
                "Yes"
            ],
            [
                19,
                "Sulpiride",
                "No"
            ]
        ]
    },
    {
        "question": "How many enzymes do not have any interactions?",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nWHERE NOT (enzyme:`medicine_enzyme_interaction.enzyme`)-[:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-()\nRETURN count(*)",
        "db_id": "medicine_enzyme_interaction",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "What is the count of enzymes without any interactions?",
        "query": "MATCH (enzyme:`medicine_enzyme_interaction.enzyme`)\nWHERE NOT (enzyme:`medicine_enzyme_interaction.enzyme`)-[:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-()\nRETURN count(*)",
        "db_id": "medicine_enzyme_interaction",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "find the number of medicines offered by each trade.",
        "query": "MATCH (medicine:`medicine_enzyme_interaction.medicine`)\nWITH count(medicine.Trade_Name) AS count, medicine.Trade_Name AS Trade_Name\nRETURN Trade_Name,count",
        "db_id": "medicine_enzyme_interaction",
        "answers": [
            [
                "Solian",
                1
            ],
            [
                "Abilify",
                1
            ],
            [
                "Saphris",
                1
            ],
            [
                "Lonasen",
                1
            ],
            [
                "Prazinil",
                1
            ],
            [
                "Clofekton",
                1
            ],
            [
                "Clozaril",
                1
            ],
            [
                "Fanapt",
                1
            ],
            [
                "Latuda",
                1
            ],
            [
                "Buronil",
                1
            ],
            [
                "Cremin",
                1
            ],
            [
                "Zyprexa",
                1
            ],
            [
                "Invega",
                1
            ],
            [
                "Lullan",
                1
            ],
            [
                "Seroquel",
                1
            ],
            [
                "Roxiam",
                1
            ],
            [
                "Risperdal",
                1
            ],
            [
                "Serdolect",
                1
            ],
            [
                "Sulpirid",
                1
            ],
            [
                "Geodon",
                1
            ],
            [
                "Nipolept",
                1
            ]
        ]
    },
    {
        "question": "List all schools and their nicknames in the order of founded year.",
        "query": "MATCH (university:`university_basketball.university`)\nRETURN university.School,university.Nickname\nORDER BY university.Founded",
        "db_id": "university_basketball",
        "answers": [
            [
                "University of Delaware",
                "Fightin' Blue Hens"
            ],
            [
                "Rutgers University",
                "Scarlet Knights"
            ],
            [
                "Lebanon Valley College",
                "Flying Dutchmen"
            ],
            [
                "University of Rhode Island",
                "Rams"
            ],
            [
                "Stony Brook University",
                "Seawolves"
            ]
        ]
    },
    {
        "question": "List all public schools and their locations.",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Affiliation = 'Public'\nRETURN university.School,university.Location",
        "db_id": "university_basketball",
        "answers": [
            [
                "University of Delaware",
                "Newark, DE"
            ],
            [
                "University of Rhode Island",
                "Kingston, RI"
            ],
            [
                "Rutgers University",
                "New Brunswick, NJ"
            ],
            [
                "Stony Brook University",
                "Stony Brook, NY"
            ]
        ]
    },
    {
        "question": "Return the founded year for the school with the largest enrollment.",
        "query": "MATCH (university:`university_basketball.university`)\nRETURN university.Founded\nORDER BY university.Enrollment DESC\nLIMIT 1",
        "db_id": "university_basketball",
        "answers": [
            [
                1766.0
            ]
        ]
    },
    {
        "question": "Find the founded year of the newest non public school.",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Affiliation <> 'Public'\nRETURN university.Founded\nORDER BY university.Founded DESC\nLIMIT 1",
        "db_id": "university_basketball",
        "answers": [
            [
                1866.0
            ]
        ]
    }
]