[
    {
        "question": "List the description of all the colors.",
        "query": "MATCH (ref_colors:`products_gen_characteristics.Ref_Colors`)\nRETURN ref_colors.color_description",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                "red"
            ],
            [
                "green"
            ],
            [
                "yellow"
            ],
            [
                "blue"
            ],
            [
                "black"
            ],
            [
                "white"
            ],
            [
                "purple"
            ],
            [
                "gray"
            ]
        ]
    },
    {
        "question": "Find the names of all the product characteristics.",
        "query": "MATCH (characteristics:`products_gen_characteristics.Characteristics`)\nRETURN DISTINCT characteristics.characteristic_name",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                "slow"
            ],
            [
                "fast"
            ],
            [
                "warm"
            ],
            [
                "hot"
            ],
            [
                "cool"
            ],
            [
                "error"
            ]
        ]
    },
    {
        "question": "What are the names of products with category \"Spices\"?",
        "query": "MATCH (products:`products_gen_characteristics.Products`)\nWHERE products.product_category_code = 'Spices'\nRETURN products.product_name",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                "cumin"
            ],
            [
                "peper"
            ],
            [
                "chili"
            ],
            [
                "cinnam"
            ]
        ]
    },
    {
        "question": "How many products are there under the category \"Seeds\"?",
        "query": "MATCH (products:`products_gen_characteristics.Products`)\nWHERE products.product_category_code = 'Seeds'\nRETURN count(*)",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "What is the category and typical buying price  of the product with name \"cumin\"?",
        "query": "MATCH (products:`products_gen_characteristics.Products`)\nWHERE products.product_name = 'cumin'\nRETURN products.product_category_code,products.typical_buying_price",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                "Spices",
                ""
            ]
        ]
    },
    {
        "question": "Which category does the product named \"flax\" belong to?",
        "query": "MATCH (products:`products_gen_characteristics.Products`)\nWHERE products.product_name = 'flax'\nRETURN products.product_category_code",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                "Seeds"
            ]
        ]
    },
    {
        "question": "What is the code of the category that the product with the name 'flax' belongs to?",
        "query": "MATCH (products:`products_gen_characteristics.Products`)\nWHERE products.product_name = 'flax'\nRETURN products.product_category_code",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                "Seeds"
            ]
        ]
    },
    {
        "question": "What is the unit of measuerment of the product category code \"Herbs\"?",
        "query": "MATCH (ref_product_categories:`products_gen_characteristics.Ref_Product_Categories`)\nWHERE ref_product_categories.product_category_code = 'Herbs'\nRETURN ref_product_categories.unit_of_measure",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                "Handful             "
            ]
        ]
    },
    {
        "question": "Find the product category description of the product category with code \"Spices\".",
        "query": "MATCH (ref_product_categories:`products_gen_characteristics.Ref_Product_Categories`)\nWHERE ref_product_categories.product_category_code = 'Spices'\nRETURN ref_product_categories.product_category_description",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                "Spices"
            ]
        ]
    },
    {
        "question": "What is the description of the product category with the code 'Spices'?",
        "query": "MATCH (ref_product_categories:`products_gen_characteristics.Ref_Product_Categories`)\nWHERE ref_product_categories.product_category_code = 'Spices'\nRETURN ref_product_categories.product_category_description",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                "Spices"
            ]
        ]
    },
    {
        "question": "What is the product category description and unit of measurement of category \"Herbs\"?",
        "query": "MATCH (ref_product_categories:`products_gen_characteristics.Ref_Product_Categories`)\nWHERE ref_product_categories.product_category_code = 'Herbs'\nRETURN ref_product_categories.product_category_description,ref_product_categories.unit_of_measure",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                "Herbs",
                "Handful             "
            ]
        ]
    },
    {
        "question": "List all the event names by year from the most recent to the oldest.",
        "query": "MATCH (event:`swimming.event`)\nRETURN event.Name\nORDER BY event.Year DESC",
        "db_id": "swimming",
        "answers": [
            [
                "European FINA"
            ],
            [
                "FINA"
            ],
            [
                "IPC"
            ],
            [
                "World Junior"
            ],
            [
                "World Master"
            ],
            [
                "Pacific"
            ]
        ]
    },
    {
        "question": "Find the name of the stadium that has the maximum capacity.",
        "query": "MATCH (stadium:`swimming.stadium`)\nRETURN stadium.name\nORDER BY stadium.Capacity DESC\nLIMIT 1",
        "db_id": "swimming",
        "answers": [
            [
                "Nou Mestalla"
            ]
        ]
    },
    {
        "question": "Find the country that has the most stadiums.",
        "query": "MATCH (stadium:`swimming.stadium`)\nWITH stadium.Country AS Country, count(stadium.Country) AS count\nRETURN Country\nORDER BY count DESC\nLIMIT 1",
        "db_id": "swimming",
        "answers": [
            [
                "Russia"
            ]
        ]
    },
    {
        "question": "How many stadiums are not in country \"Russia\"?",
        "query": "MATCH (stadium:`swimming.stadium`)\nWHERE stadium.Country <> 'Russia'\nRETURN count(*)",
        "db_id": "swimming",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "question": "Find the names of all swimmers, sorted by their 100 meter scores in ascending order.",
        "query": "MATCH (swimmer:`swimming.swimmer`)\nRETURN swimmer.name\nORDER BY swimmer.meter_100",
        "db_id": "swimming",
        "answers": [
            [
                "S\u00e9bastien Rouault"
            ],
            [
                "Przemys\u0142aw Sta\u0144czyk"
            ],
            [
                "Oussama Mellouli"
            ],
            [
                "Sergiy Fesenko"
            ],
            [
                "Grant Hackett"
            ],
            [
                "Craig Stevens"
            ],
            [
                "Federico Colbertaldo"
            ],
            [
                "Ryan Cochrane"
            ]
        ]
    },
    {
        "question": "List countries that have more than one swimmer.",
        "query": "MATCH (swimmer:`swimming.swimmer`)\nWITH count(*) AS count, swimmer.Nationality AS Nationality\nWHERE count  > 1\nRETURN Nationality,count",
        "db_id": "swimming",
        "answers": [
            [
                "Australia",
                2
            ]
        ]
    },
    {
        "question": "Find all 200 meter and 300 meter results of swimmers with nationality \"Australia\".",
        "query": "MATCH (swimmer:`swimming.swimmer`)\nWHERE swimmer.Nationality = 'Australia'\nRETURN swimmer.meter_200,swimmer.meter_300",
        "db_id": "swimming",
        "answers": [
            [
                "1:56.34",
                "2:55.90"
            ],
            [
                "1:57.21",
                "2:56.95"
            ]
        ]
    },
    {
        "question": "Find the names of stadiums which have never had any event.",
        "query": "MATCH (stadium:`swimming.stadium`)\nWHERE NOT (stadium:`swimming.stadium`)-[]-(:`swimming.event`)\nRETURN stadium.name",
        "db_id": "swimming",
        "answers": [
            [
                "Ferenc Pusk\u00e1s Stadion"
            ],
            [
                "Stade des Lumi\u00e8res"
            ],
            [
                "Northumberland Development Project"
            ],
            [
                "Arena Baltika"
            ]
        ]
    },
    {
        "question": "Find the names of the swimmers who have no record.",
        "query": "MATCH (swimmer:`swimming.swimmer`)\nWHERE NOT (swimmer:`swimming.swimmer`)-[:`swimming.record`]-()\nRETURN swimmer.name",
        "db_id": "swimming",
        "answers": [
            [
                "Przemys\u0142aw Sta\u0144czyk"
            ],
            [
                "S\u00e9bastien Rouault"
            ]
        ]
    },
    {
        "question": "List the builders of railways in ascending alphabetical order.",
        "query": "MATCH (railway:`railway.railway`)\nRETURN railway.Builder\nORDER BY railway.Builder ASC",
        "db_id": "railway",
        "answers": [
            [
                "Avonside"
            ],
            [
                "GER Hartford"
            ],
            [
                "GER Stratford"
            ],
            [
                "GNR Doncaster"
            ],
            [
                "GWR Swindon"
            ],
            [
                "GWR Swindon"
            ],
            [
                "MR Derby"
            ],
            [
                "SECR Ashford"
            ],
            [
                "Stephenson"
            ],
            [
                "Swindon Works"
            ]
        ]
    },
    {
        "question": "List the wheels and locations of the railways.",
        "query": "MATCH (railway:`railway.railway`)\nRETURN railway.Wheels,railway.Location",
        "db_id": "railway",
        "answers": [
            [
                "4-4-0",
                "York"
            ],
            [
                "4-4-0",
                "Bo'ness"
            ],
            [
                "4-4-2",
                "Barrow Hill"
            ],
            [
                "4-4-0",
                "Toddington"
            ],
            [
                "0-6-0T",
                "Bressingham"
            ],
            [
                "0-6-0",
                "Barrow Hill"
            ],
            [
                "2-8-0",
                "Shildon"
            ],
            [
                "4-6-0",
                "Swindon"
            ],
            [
                "4-4-2T",
                "Bressingham"
            ],
            [
                "0-6-0ST",
                "Basingstoke"
            ]
        ]
    },
    {
        "question": "What is the maximum level of managers in countries that are not \"Australia\"?",
        "query": "MATCH (manager:`railway.manager`)\nWHERE manager.Country <> 'Australia\t'\nRETURN max(manager.Level)",
        "db_id": "railway",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "question": "Show the names of trains and locations of railways they are in.",
        "query": "MATCH (T1:`railway.railway`)-[]-(T2:`railway.train`)\nRETURN T2.Name,T1.Location",
        "db_id": "railway",
        "answers": [
            [
                "Wardha-Ballarshah Pass",
                "York"
            ],
            [
                "Sewagram Exp",
                "York"
            ],
            [
                "Ballarshah-Mumbai Pass",
                "Bo'ness"
            ],
            [
                "Nagpur-Kazipet Pass",
                "Barrow Hill"
            ],
            [
                "Kazipet-Nagpur Pass",
                "Bressingham"
            ],
            [
                "Lucknow-Chennai Exp",
                "Bressingham"
            ],
            [
                "Andaman Exp",
                "Shildon"
            ],
            [
                "Andaman Exp",
                "Bressingham"
            ],
            [
                "Nandigram Exp",
                "Basingstoke"
            ]
        ]
    },
    {
        "question": "Show the builder of railways associated with the trains named \"Andaman Exp\".",
        "query": "MATCH (T1:`railway.railway`)-[]-(T2:`railway.train`)\nWHERE T2.Name = 'Andaman Exp'\nRETURN T1.Builder",
        "db_id": "railway",
        "answers": [
            [
                "GWR Swindon"
            ],
            [
                "Stephenson"
            ]
        ]
    },
    {
        "question": "Show id and location of railways that are associated with more than one train.",
        "query": "MATCH (T1:`railway.railway`)-[]-(T2:`railway.train`)\nWITH count(*) AS count, T2.Railway_ID AS Railway_ID, T1.Location AS Location\nWHERE count  > 1\nRETURN Railway_ID,Location",
        "db_id": "railway",
        "answers": [
            [
                1,
                "York"
            ],
            [
                5,
                "Bressingham"
            ]
        ]
    },
    {
        "question": "Show different builders of railways, along with the corresponding number of railways using each builder.",
        "query": "MATCH (railway:`railway.railway`)\nWITH count(railway.Builder) AS count, railway.Builder AS Builder\nRETURN Builder,count",
        "db_id": "railway",
        "answers": [
            [
                "SECR Ashford",
                1
            ],
            [
                "MR Derby",
                1
            ],
            [
                "GNR Doncaster",
                1
            ],
            [
                "GWR Swindon",
                2
            ],
            [
                "GER Stratford",
                1
            ],
            [
                "GER Hartford",
                1
            ],
            [
                "Swindon Works",
                1
            ],
            [
                "Stephenson",
                1
            ],
            [
                "Avonside",
                1
            ]
        ]
    },
    {
        "question": "Show the most common builder of railways.",
        "query": "MATCH (railway:`railway.railway`)\nWITH count(railway.Builder) AS count, railway.Builder AS Builder\nRETURN Builder\nORDER BY count DESC\nLIMIT 1",
        "db_id": "railway",
        "answers": [
            [
                "GWR Swindon"
            ]
        ]
    },
    {
        "question": "Show different locations of railways along with the corresponding number of railways at each location.",
        "query": "MATCH (railway:`railway.railway`)\nWITH railway.Location AS Location, count(railway.Location) AS count\nRETURN Location,count",
        "db_id": "railway",
        "answers": [
            [
                "York",
                1
            ],
            [
                "Bo'ness",
                1
            ],
            [
                "Barrow Hill",
                2
            ],
            [
                "Toddington",
                1
            ],
            [
                "Bressingham",
                2
            ],
            [
                "Shildon",
                1
            ],
            [
                "Swindon",
                1
            ],
            [
                "Basingstoke",
                1
            ]
        ]
    },
    {
        "question": "Show the locations that have more than one railways.",
        "query": "MATCH (railway:`railway.railway`)\nWITH count(*) AS count, railway.Location AS Location\nWHERE count  > 1\nRETURN Location",
        "db_id": "railway",
        "answers": [
            [
                "Barrow Hill"
            ],
            [
                "Bressingham"
            ]
        ]
    },
    {
        "question": "List the object number of railways that do not have any trains.",
        "query": "MATCH (railway:`railway.railway`)\nWHERE NOT (railway:`railway.railway`)-[]-(:`railway.train`)\nRETURN railway.ObjectNumber",
        "db_id": "railway",
        "answers": [
            [
                "1978-7025"
            ],
            [
                "1978-7026"
            ],
            [
                "1978-7027"
            ]
        ]
    },
    {
        "question": "Show the distinct countries of managers.",
        "query": "MATCH (manager:`railway.manager`)\nRETURN DISTINCT manager.Country",
        "db_id": "railway",
        "answers": [
            [
                "United States"
            ],
            [
                "Scotland"
            ],
            [
                "England"
            ],
            [
                "Australia"
            ]
        ]
    },
    {
        "question": "Show the working years of managers in descending order of their level.",
        "query": "MATCH (manager:`railway.manager`)\nRETURN manager.Working_year_starts\nORDER BY manager.Level DESC",
        "db_id": "railway",
        "answers": [
            [
                "1993"
            ],
            [
                "1999"
            ],
            [
                "1985"
            ],
            [
                "2001"
            ],
            [
                "2003"
            ],
            [
                "2004"
            ],
            [
                "2006"
            ]
        ]
    },
    {
        "question": "Show the countries that have managers of age above 50 or below 46.",
        "query": "MATCH (manager:`railway.manager`)\nWHERE manager.Age > 50 OR manager.Age < 46\nRETURN manager.Country",
        "db_id": "railway",
        "answers": [
            [
                "United States"
            ],
            [
                "United States"
            ],
            [
                "England"
            ],
            [
                "Australia"
            ]
        ]
    },
    {
        "question": "Show all distinct cities in the address record.",
        "query": "MATCH (addresses:`customers_and_products_contacts.Addresses`)\nRETURN DISTINCT addresses.city",
        "db_id": "customers_and_products_contacts",
        "answers": [
            [
                "Hertafurt"
            ],
            [
                "Edgardoberg"
            ],
            [
                "Gilbertmouth"
            ],
            [
                "Lake Floyd"
            ],
            [
                "Gibsonfurt"
            ],
            [
                "North Jairo"
            ],
            [
                "East Rickey"
            ],
            [
                "West Kaiatown"
            ],
            [
                "Agustinstad"
            ],
            [
                "Gleasonland"
            ],
            [
                "Lake Katheryn"
            ],
            [
                "North Lisandroport"
            ],
            [
                "Estaland"
            ],
            [
                "West Muriel"
            ],
            [
                "Port Montytown"
            ]
        ]
    },
    {
        "question": "Show each state and the number of addresses in each state.",
        "query": "MATCH (addresses:`customers_and_products_contacts.Addresses`)\nWITH addresses.state_province_county AS state_province_county, count(addresses.state_province_county) AS count\nRETURN state_province_county,count",
        "db_id": "customers_and_products_contacts",
        "answers": [
            [
                "Nevada",
                1
            ],
            [
                "Colorado",
                1
            ],
            [
                "Virginia",
                1
            ],
            [
                "Oklahoma",
                1
            ],
            [
                "District of Columbia",
                1
            ],
            [
                "Maryland",
                1
            ],
            [
                "Louisiana",
                1
            ],
            [
                "Oregon",
                1
            ],
            [
                "Illinois",
                1
            ],
            [
                "Kentucky",
                2
            ],
            [
                "Maine",
                1
            ],
            [
                "Idaho",
                1
            ],
            [
                "Vermont",
                1
            ],
            [
                "SouthDakota",
                1
            ]
        ]
    },
    {
        "question": "Show the product type codes which have at least two products.",
        "query": "MATCH (products:`customers_and_products_contacts.Products`)\nWITH count(*) AS count, products.product_type_code AS product_type_code\nWHERE count  >= 2\nRETURN product_type_code",
        "db_id": "customers_and_products_contacts",
        "answers": [
            [
                "Hardware"
            ],
            [
                "Clothes"
            ]
        ]
    },
    {
        "question": "Show the product type and name for the products with price higher than 1000 or lower than 500.",
        "query": "MATCH (products:`customers_and_products_contacts.Products`)\nWHERE products.product_price > 1000 OR products.product_price < 500\nRETURN products.product_type_code,products.product_name",
        "db_id": "customers_and_products_contacts",
        "answers": [
            [
                "Hardware",
                "Apple"
            ],
            [
                "Clothes",
                "jcrew"
            ],
            [
                "Hardware",
                "Apple"
            ],
            [
                "Hardware",
                "Apple"
            ],
            [
                "Clothes",
                "jcrew"
            ],
            [
                "Hardware",
                "Apple"
            ],
            [
                "Hardware",
                "Apple"
            ],
            [
                "Hardware",
                "Sony"
            ],
            [
                "Hardware",
                "Sony"
            ],
            [
                "Clothes",
                "jcrew"
            ],
            [
                "Clothes",
                "gucci"
            ],
            [
                "Hardware",
                "Sony"
            ],
            [
                "Clothes",
                "gucci"
            ]
        ]
    },
    {
        "question": "Find the name of dorms only for female (F gender).",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nWHERE dorm.gender = 'F'\nRETURN dorm.dorm_name",
        "db_id": "dorm_1",
        "answers": [
            [
                "Anonymous Donor Hall"
            ]
        ]
    },
    {
        "question": "Find the name of dorms that can accommodate more than 300 students.",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nWHERE dorm.student_capacity > 300\nRETURN dorm.dorm_name",
        "db_id": "dorm_1",
        "answers": [
            [
                "Fawlty Towers"
            ],
            [
                "Dorm-plex 2000"
            ]
        ]
    },
    {
        "question": "Find the first name of students who is older than 20.",
        "query": "MATCH (student:`dorm_1.Student`)\nWHERE student.Age > 20\nRETURN student.Fname",
        "db_id": "dorm_1",
        "answers": [
            [
                "Shiela"
            ],
            [
                "Paul"
            ],
            [
                "David"
            ],
            [
                "Bruce"
            ],
            [
                "Ian"
            ],
            [
                "Lisa"
            ],
            [
                "Sarah"
            ]
        ]
    },
    {
        "question": "Find the number of distinct amenities.",
        "query": "MATCH (dorm_amenity:`dorm_1.Dorm_amenity`)\nRETURN count(*)",
        "db_id": "dorm_1",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "question": "Find the number of distinct gender for dorms.",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nRETURN count(DISTINCT dorm.gender)",
        "db_id": "dorm_1",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "Find the capacity and gender type of the dorm whose name has substring \u2018Donor\u2019.",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nWHERE dorm.dorm_name =~'.*[D|d]onor.*'\nRETURN dorm.student_capacity,dorm.gender",
        "db_id": "dorm_1",
        "answers": [
            [
                128,
                "F"
            ]
        ]
    },
    {
        "question": "Find the name and gender type of the dorms whose capacity is greater than 300 or less than 100.",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nWHERE dorm.student_capacity > 300 OR dorm.student_capacity < 100\nRETURN dorm.dorm_name,dorm.gender",
        "db_id": "dorm_1",
        "answers": [
            [
                "Smith Hall",
                "X"
            ],
            [
                "Fawlty Towers",
                "X"
            ],
            [
                "Dorm-plex 2000",
                "X"
            ],
            [
                "University Hovels",
                "X"
            ]
        ]
    },
    {
        "question": "Find the numbers of different majors and cities.",
        "query": "MATCH (student:`dorm_1.Student`)\nRETURN count(DISTINCT student.Major),count(DISTINCT student.city_code)",
        "db_id": "dorm_1",
        "answers": [
            [
                6,
                19
            ]
        ]
    },
    {
        "question": "Find the last name of students who is either female (sex is F) and living in the city of code BAL or male (sex is M) and in age of below 20.",
        "query": "MATCH (student:`dorm_1.Student`)\nWHERE student.Sex = 'F' AND student.city_code = 'BAL'\nRETURN student.LName  AS lname \nUNION\nMATCH (student:`dorm_1.Student`)\nWHERE student.Sex = 'M' AND student.Age < 20\nRETURN student.LName  AS lname",
        "db_id": "dorm_1",
        "answers": [
            [
                "Smith"
            ],
            [
                "Nelson"
            ],
            [
                "Prater"
            ],
            [
                "Schultz"
            ],
            [
                "Tai"
            ],
            [
                "Lee"
            ],
            [
                "Norris"
            ],
            [
                "Schwartz"
            ],
            [
                "Pang"
            ],
            [
                "Andreou"
            ],
            [
                "Woods"
            ],
            [
                "Goldman"
            ],
            [
                "Brody"
            ],
            [
                "Han"
            ],
            [
                "Simms"
            ],
            [
                "Epp"
            ]
        ]
    },
    {
        "question": "Find the name of the dorm with the largest capacity.",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nRETURN dorm.dorm_name\nORDER BY dorm.student_capacity DESC\nLIMIT 1",
        "db_id": "dorm_1",
        "answers": [
            [
                "Dorm-plex 2000"
            ]
        ]
    },
    {
        "question": "List in alphabetic order all different amenities.",
        "query": "MATCH (dorm_amenity:`dorm_1.Dorm_amenity`)\nRETURN dorm_amenity.amenity_name\nORDER BY dorm_amenity.amenity_name",
        "db_id": "dorm_1",
        "answers": [
            [
                "4 Walls"
            ],
            [
                "Air Conditioning"
            ],
            [
                "Allows Pets"
            ],
            [
                "Carpeted Rooms"
            ],
            [
                "Ethernet Ports"
            ],
            [
                "Heat"
            ],
            [
                "Kitchen in Every Room"
            ],
            [
                "Pub in Basement"
            ],
            [
                "Roof"
            ],
            [
                "Study Room"
            ],
            [
                "TV Lounge"
            ],
            [
                "Working Fireplaces"
            ]
        ]
    }
]