[
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN max(volume.Weeks_on_Top),min(volume.Weeks_on_Top)",
        "question": "Give the maximum and minimum weeks on top across all volumes.",
        "answers": [
            [
                3.0,
                1.0
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nWHERE volume.Weeks_on_Top > 1\nRETURN volume.Song",
        "question": "What are the songs in volumes with more than 1 week on top?",
        "answers": [
            [
                " The Way"
            ],
            [
                " Touch Me (I Want Your Body) "
            ],
            [
                " (I Just) Died in Your Arms "
            ],
            [
                " Always "
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nWHERE volume.Weeks_on_Top > 1\nRETURN volume.Song",
        "question": "Give the songs included in volumes that have more than 1 week on top.",
        "answers": [
            [
                " The Way"
            ],
            [
                " Touch Me (I Want Your Body) "
            ],
            [
                " (I Just) Died in Your Arms "
            ],
            [
                " Always "
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN volume.Song\nORDER BY volume.Song",
        "question": "Please list all songs in volumes in ascending alphabetical order.",
        "answers": [
            [
                " (I Just) Died in Your Arms "
            ],
            [
                " Always "
            ],
            [
                " Everybody Have Fun Tonight "
            ],
            [
                " La Isla Bonita "
            ],
            [
                " The Way"
            ],
            [
                " Touch Me (I Want Your Body) "
            ],
            [
                " Walk Like an Egyptian "
            ],
            [
                " With or Without You "
            ],
            [
                "Head to Toe "
            ],
            [
                "Looking for a New Love"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN volume.Song\nORDER BY volume.Song",
        "question": "What are the the songs in volumes, listed in ascending order?",
        "answers": [
            [
                " (I Just) Died in Your Arms "
            ],
            [
                " Always "
            ],
            [
                " Everybody Have Fun Tonight "
            ],
            [
                " La Isla Bonita "
            ],
            [
                " The Way"
            ],
            [
                " Touch Me (I Want Your Body) "
            ],
            [
                " Walk Like an Egyptian "
            ],
            [
                " With or Without You "
            ],
            [
                "Head to Toe "
            ],
            [
                "Looking for a New Love"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN count(DISTINCT volume.Artist_ID)",
        "question": "How many distinct artists do the volumes associate to?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN count(DISTINCT volume.Artist_ID)",
        "question": "Count the number of distinct artists who have volumes.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (T1:`music_4.music_festival`)-[]-(T2:`music_4.volume`)\nWHERE T2.Weeks_on_Top > 2\nRETURN T1.Date_of_ceremony",
        "question": "Please show the date of ceremony of the volumes that last more than 2 weeks on top.",
        "answers": [
            [
                "18 February 2011"
            ],
            [
                "18 February 2011"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (T1:`music_4.music_festival`)-[]-(T2:`music_4.volume`)\nWHERE T2.Weeks_on_Top > 2\nRETURN T1.Date_of_ceremony",
        "question": "What are the dates of ceremony at music festivals corresponding to volumes that lasted more than 2 weeks on top?",
        "answers": [
            [
                "18 February 2011"
            ],
            [
                "18 February 2011"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (T1:`music_4.music_festival`)-[]-(T2:`music_4.volume`)\nWHERE T1.Result = 'Nominated'\nRETURN T2.Song",
        "question": "Please show the songs that have result \"nominated\" at music festivals.",
        "answers": [
            [
                " The Way"
            ],
            [
                " Everybody Have Fun Tonight "
            ],
            [
                " With or Without You "
            ],
            [
                " (I Just) Died in Your Arms "
            ],
            [
                " La Isla Bonita "
            ],
            [
                "Looking for a New Love"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (T1:`music_4.music_festival`)-[]-(T2:`music_4.volume`)\nWHERE T1.Result = 'Nominated'\nRETURN T2.Song",
        "question": "What are the songs in volumes that have resulted in a nomination at music festivals?",
        "answers": [
            [
                " The Way"
            ],
            [
                " Everybody Have Fun Tonight "
            ],
            [
                " With or Without You "
            ],
            [
                " (I Just) Died in Your Arms "
            ],
            [
                " La Isla Bonita "
            ],
            [
                "Looking for a New Love"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (T1:`music_4.artist`)-[]-(T2:`music_4.volume`)\nWHERE T1.Artist = 'Gorgoroth'\nRETURN T2.Issue_Date",
        "question": "What are the issue dates of volumes associated with the artist \"Gorgoroth\"?",
        "answers": [
            [
                "24 January"
            ],
            [
                "9 May"
            ],
            [
                "16 May - 30 May"
            ],
            [
                "27 December 1986 - 10 January"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (T1:`music_4.artist`)-[]-(T2:`music_4.volume`)\nWHERE T1.Artist = 'Gorgoroth'\nRETURN T2.Issue_Date",
        "question": "Return the issue dates of volumes that are by the artist named Gorgoroth.",
        "answers": [
            [
                "24 January"
            ],
            [
                "9 May"
            ],
            [
                "16 May - 30 May"
            ],
            [
                "27 December 1986 - 10 January"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (T1:`music_4.artist`)-[]-(T2:`music_4.volume`)\nWHERE T1.Age >= 32\nRETURN T2.Song",
        "question": "What are the songs in volumes associated with the artist aged 32 or older?",
        "answers": [
            [
                " Walk Like an Egyptian "
            ],
            [
                " With or Without You "
            ],
            [
                " (I Just) Died in Your Arms "
            ],
            [
                " The Way"
            ],
            [
                " Everybody Have Fun Tonight "
            ],
            [
                " Touch Me (I Want Your Body) "
            ],
            [
                "Head to Toe "
            ],
            [
                "Looking for a New Love"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (T1:`music_4.artist`)-[]-(T2:`music_4.volume`)\nWHERE T1.Age >= 32\nRETURN T2.Song",
        "question": "Return names of songs in volumes that are by artists that are at least 32 years old.",
        "answers": [
            [
                " Walk Like an Egyptian "
            ],
            [
                " With or Without You "
            ],
            [
                " (I Just) Died in Your Arms "
            ],
            [
                " The Way"
            ],
            [
                " Everybody Have Fun Tonight "
            ],
            [
                " Touch Me (I Want Your Body) "
            ],
            [
                "Head to Toe "
            ],
            [
                "Looking for a New Love"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (T1:`music_4.artist`)-[]-(T2:`music_4.volume`)\nWHERE T2.Weeks_on_Top > 2\nRETURN T1.Famous_Title",
        "question": "What are the famous title of the artists associated with volumes with more than 2 weeks on top?",
        "answers": [
            [
                "Bergen 1996"
            ],
            [
                "Bergen 1996"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (T1:`music_4.artist`)-[]-(T2:`music_4.volume`)\nWHERE T2.Weeks_on_Top > 2\nRETURN T1.Famous_Title",
        "question": "Return the famous titles for artists that have volumes that lasted more than 2 weeks on top.",
        "answers": [
            [
                "Bergen 1996"
            ],
            [
                "Bergen 1996"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN artist.Famous_Title,artist.Age\nORDER BY artist.Age DESC",
        "question": "Please list the age and famous title of artists in descending order of age.",
        "answers": [
            [
                "Antithesis of All Flesh",
                49
            ],
            [
                "Transmutation",
                35
            ],
            [
                "Unholy Metal Way (re-release)",
                35
            ],
            [
                "Bergen 1996",
                34
            ],
            [
                "Those Who Unleashed (re-release)",
                27
            ],
            [
                "Antievangelistical Process (re-release)",
                22
            ],
            [
                "Imperivm",
                18
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN artist.Famous_Title,artist.Age\nORDER BY artist.Age DESC",
        "question": "What are the famous titles and ages of each artist, listed in descending order by age?",
        "answers": [
            [
                "Antithesis of All Flesh",
                49
            ],
            [
                "Transmutation",
                35
            ],
            [
                "Unholy Metal Way (re-release)",
                35
            ],
            [
                "Bergen 1996",
                34
            ],
            [
                "Those Who Unleashed (re-release)",
                27
            ],
            [
                "Antievangelistical Process (re-release)",
                22
            ],
            [
                "Imperivm",
                18
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN artist.Famous_Release_date\nORDER BY artist.Age DESC\nLIMIT 1",
        "question": "What is the famous release date of the artist with the oldest age?",
        "answers": [
            [
                "June 15, 2009"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN artist.Famous_Release_date\nORDER BY artist.Age DESC\nLIMIT 1",
        "question": "Return the famous release date for the oldest artist.",
        "answers": [
            [
                "June 15, 2009"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nRETURN music_festival.Category,count(*)",
        "question": "Please show the categories of the music festivals and the count.",
        "answers": [
            [
                "Best Song",
                5
            ],
            [
                "Best Lyrics",
                3
            ],
            [
                "Best Sound Song",
                1
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nRETURN music_festival.Category,count(*)",
        "question": "Return the number of music festivals of each category.",
        "answers": [
            [
                "Best Song",
                5
            ],
            [
                "Best Lyrics",
                3
            ],
            [
                "Best Sound Song",
                1
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nRETURN music_festival.Result\nORDER BY music_festival.Result DESC\nLIMIT 1",
        "question": "What is the most common result of the music festival?",
        "answers": [
            [
                "Nominated"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nRETURN music_festival.Result\nORDER BY music_festival.Result DESC\nLIMIT 1",
        "question": "Return the result that is most frequent at music festivals.",
        "answers": [
            [
                "Nominated"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nWITH count(*) AS count, music_festival.Category AS Category\nWHERE count  > 1\nRETURN Category",
        "question": "Please show the categories of the music festivals with count more than 1.",
        "answers": [
            [
                "Best Song"
            ],
            [
                "Best Lyrics"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nWITH count(*) AS count, music_festival.Category AS Category\nWHERE count  > 1\nRETURN Category",
        "question": "What are the categories of music festivals for which there have been more than 1 music festival?",
        "answers": [
            [
                "Best Song"
            ],
            [
                "Best Lyrics"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN volume.Song\nORDER BY volume.Weeks_on_Top DESC\nLIMIT 1",
        "question": "What is the song in the volume with the maximum weeks on top?",
        "answers": [
            [
                " The Way"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN volume.Song\nORDER BY volume.Weeks_on_Top DESC\nLIMIT 1",
        "question": "Return the song in the volume that has spent the most weeks on top?",
        "answers": [
            [
                " The Way"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nWHERE NOT (artist)-[]-(:`music_4.volume`)    \nRETURN artist.Famous_Title",
        "question": "Find the famous titles of artists that do not have any volume.",
        "answers": [
            [
                "Antievangelistical Process (re-release)"
            ],
            [
                "Antithesis of All Flesh"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nWHERE NOT (artist)-[]-(:`music_4.volume`)    \nRETURN artist.Famous_Title",
        "question": "What are the famous titles of artists who do not have any volumes?",
        "answers": [
            [
                "Antievangelistical Process (re-release)"
            ],
            [
                "Antithesis of All Flesh"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nWHERE music_festival.Category = 'Best Song' AND music_festival.Result = 'Awarded'\nRETURN music_festival.Date_of_ceremony",
        "question": "What are the date of ceremony of music festivals with category \"Best Song\" and result \"Awarded\"?",
        "answers": [
            [
                "18 February 2011"
            ],
            [
                "18 February 2011"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nWHERE music_festival.Category = 'Best Song' AND music_festival.Result = 'Awarded'\nRETURN music_festival.Date_of_ceremony",
        "question": "Return the dates of ceremony corresponding to music festivals that had the category \"Best Song\" and result \"Awarded\".",
        "answers": [
            [
                "18 February 2011"
            ],
            [
                "18 February 2011"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN volume.Issue_Date\nORDER BY volume.Weeks_on_Top ASC\nLIMIT 1",
        "question": "What is the issue date of the volume with the minimum weeks on top?",
        "answers": [
            [
                "17 January"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN volume.Issue_Date\nORDER BY volume.Weeks_on_Top ASC\nLIMIT 1",
        "question": "Return the issue date of the volume that has spent the fewest weeks on top.",
        "answers": [
            [
                "17 January"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN count(DISTINCT volume.Artist_ID)",
        "question": "How many distinct artists have volumes?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN count(DISTINCT volume.Artist_ID)",
        "question": "Count the number of artists who have had volumes.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nRETURN music_festival.Result,count(*)\nORDER BY music_festival.Result DESC",
        "question": "Please show the results of music festivals and the number of music festivals that have had each, ordered by this count.",
        "answers": [
            [
                "Nominated",
                6
            ],
            [
                "Awarded",
                3
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nRETURN music_festival.Result,count(*)\nORDER BY music_festival.Result DESC",
        "question": "How many music festivals have had each kind of result, ordered descending by count?",
        "answers": [
            [
                "Nominated",
                6
            ],
            [
                "Awarded",
                3
            ]
        ]
    },
    {
        "db_id": "roller_coaster",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nRETURN count(*)",
        "question": "How many roller coasters are there?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "roller_coaster",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nRETURN roller_coaster.Name\nORDER BY roller_coaster.Length ASC",
        "question": "List the names of roller coasters by ascending order of length.",
        "answers": [
            [
                "Twister"
            ],
            [
                "Ravine Flyer II"
            ],
            [
                "Boardwalk Bullet"
            ],
            [
                "Dauling Dragon"
            ],
            [
                "Hades 360"
            ],
            [
                "The Voyage"
            ]
        ]
    },
    {
        "db_id": "roller_coaster",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nRETURN roller_coaster.Length,roller_coaster.Height",
        "question": "What are the lengths and heights of roller coasters?",
        "answers": [
            [
                3236.0,
                96.0
            ],
            [
                3914.0,
                105.0
            ],
            [
                4726.0,
                136.0
            ],
            [
                2900.0,
                120.0
            ],
            [
                1574.0,
                50.0
            ],
            [
                6442.0,
                163.0
            ]
        ]
    },
    {
        "db_id": "roller_coaster",
        "query": "MATCH (country:`roller_coaster.country`)\nWHERE country.Languages <> 'German'\nRETURN country.Name",
        "question": "List the names of countries whose language is not \"German\".",
        "answers": [
            [
                "Finland"
            ],
            [
                "Sweden"
            ]
        ]
    },
    {
        "db_id": "roller_coaster",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nWHERE roller_coaster.Length > 3300 OR roller_coaster.Height > 100\nRETURN roller_coaster.Status",
        "question": "Show the statuses of roller coasters longer than 3300 or higher than 100.",
        "answers": [
            [
                "Operating"
            ],
            [
                "Operating"
            ],
            [
                "Operating"
            ],
            [
                "Operating"
            ]
        ]
    },
    {
        "db_id": "roller_coaster",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nRETURN roller_coaster.Speed\nORDER BY roller_coaster.Length DESC\nLIMIT 1",
        "question": "What are the speeds of the longest roller coaster?",
        "answers": [
            [
                "67"
            ]
        ]
    },
    {
        "db_id": "roller_coaster",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nRETURN roller_coaster.Status,count(*)",
        "question": "Show the different statuses and the numbers of roller coasters for each status.",
        "answers": [
            [
                "Operating",
                6
            ]
        ]
    },
    {
        "db_id": "roller_coaster",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nRETURN roller_coaster.Status\nORDER BY roller_coaster.Status DESC\nLIMIT 1",
        "question": "Please show the most common status of roller coasters.",
        "answers": [
            [
                "Operating"
            ]
        ]
    },
    {
        "db_id": "roller_coaster",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nWITH count(*) AS count, roller_coaster.Status AS Status\nWHERE count  > 2\nRETURN Status",
        "question": "List the status shared by more than two roller coaster.",
        "answers": [
            [
                "Operating"
            ]
        ]
    },
    {
        "db_id": "roller_coaster",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nRETURN roller_coaster.Park\nORDER BY roller_coaster.Speed DESC\nLIMIT 1",
        "question": "Show the park of the roller coaster with the highest speed.",
        "answers": [
            [
                "Mt. Olympus"
            ]
        ]
    },
    {
        "db_id": "roller_coaster",
        "query": "MATCH (T1:`roller_coaster.country`)-[]-(T2:`roller_coaster.roller_coaster`)\nRETURN T2.Name,T1.Name",
        "question": "Show the names of roller coasters and names of country they are in.",
        "answers": [
            [
                "Boardwalk Bullet",
                "Austria"
            ],
            [
                "Hades 360",
                "Austria"
            ],
            [
                "Dauling Dragon",
                "Austria"
            ],
            [
                "Twister",
                "Finland"
            ],
            [
                "Ravine Flyer II",
                "Finland"
            ],
            [
                "The Voyage",
                "Sweden"
            ]
        ]
    },
    {
        "db_id": "roller_coaster",
        "query": "MATCH (T1:`roller_coaster.country`)-[]-(T2:`roller_coaster.roller_coaster`)\nWITH T1.Name AS Name, count(*) AS count\nWHERE count  > 1\nRETURN Name",
        "question": "Show the names of countries that have more than one roller coaster.",
        "answers": [
            [
                "Austria"
            ],
            [
                "Finland"
            ]
        ]
    },
    {
        "db_id": "roller_coaster",
        "query": "MATCH (T1:`roller_coaster.country`)-[]-(T2:`roller_coaster.roller_coaster`)\nRETURN T1.Name,T1.Population\nORDER BY T2.Height DESC\nLIMIT 1",
        "question": "Show the name and population of the country that has the highest roller coaster.",
        "answers": [
            [
                "Sweden",
                9047752
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN count(DISTINCT captain.Rank)",
        "question": "How many different captain ranks are there?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN count(DISTINCT captain.Rank)",
        "question": "Count the number of different ranks of captain.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN count(*),captain.Rank",
        "question": "How many captains are in each rank?",
        "answers": [
            [
                4,
                "Midshipman"
            ],
            [
                2,
                "Lieutenant"
            ],
            [
                1,
                "Commander, junior captain"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN count(*),captain.Rank",
        "question": "Count the number of captains that have each rank.",
        "answers": [
            [
                4,
                "Midshipman"
            ],
            [
                2,
                "Lieutenant"
            ],
            [
                1,
                "Commander, junior captain"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nWHERE captain.age < '50'\nRETURN count(*),captain.Rank",
        "question": "How many captains with younger than 50 are in each rank?",
        "answers": [
            [
                3,
                "Midshipman"
            ],
            [
                1,
                "Lieutenant"
            ],
            [
                1,
                "Commander, junior captain"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nWHERE captain.age < '50'\nRETURN count(*),captain.Rank",
        "question": "Count the number of captains younger than 50 of each rank.",
        "answers": [
            [
                3,
                "Midshipman"
            ],
            [
                1,
                "Lieutenant"
            ],
            [
                1,
                "Commander, junior captain"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN captain.Name\nORDER BY captain.age DESC",
        "question": "Sort all captain names by their ages from old to young.",
        "answers": [
            [
                "Captain Gilbert Pears"
            ],
            [
                "Captain Beves Conway"
            ],
            [
                "Lieutenant Montagu Verling"
            ],
            [
                "Lieutenant Hugh Bolitho"
            ],
            [
                "Captain Sir Henry Langford"
            ],
            [
                "Captain Henry Dumaresq"
            ],
            [
                "Commander Richard Bolitho"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN captain.Name\nORDER BY captain.age DESC",
        "question": "What are the names of captains, sorted by age descending?",
        "answers": [
            [
                "Captain Gilbert Pears"
            ],
            [
                "Captain Beves Conway"
            ],
            [
                "Lieutenant Montagu Verling"
            ],
            [
                "Lieutenant Hugh Bolitho"
            ],
            [
                "Captain Sir Henry Langford"
            ],
            [
                "Captain Henry Dumaresq"
            ],
            [
                "Commander Richard Bolitho"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN captain.Name,captain.Class,captain.Rank",
        "question": "Find the name, class and rank of all captains.",
        "answers": [
            [
                "Captain Sir Henry Langford",
                "Third-rate ship of the line",
                "Midshipman"
            ],
            [
                "Captain Beves Conway",
                "Third-rate ship of the line",
                "Midshipman"
            ],
            [
                "Lieutenant Hugh Bolitho",
                "Cutter",
                "Midshipman"
            ],
            [
                "Lieutenant Montagu Verling",
                "Armed schooner",
                "Midshipman"
            ],
            [
                "Captain Henry Dumaresq",
                "Frigate",
                "Lieutenant"
            ],
            [
                "Captain Gilbert Pears",
                "Third-rate ship of the line",
                "Lieutenant"
            ],
            [
                "Commander Richard Bolitho",
                "Sloop-of-war",
                "Commander, junior captain"
            ]
        ]
    }
]