[
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWITH count(T2.Lastname) AS cnt, T2\nRETURN T2.Lastname\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the last name of the musician that have produced the most songs?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWITH count(T2.Lastname) AS cnt, T2\nRETURN T2.Lastname\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the last name of the artist who sang the most songs?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Songs`)-[T1:`music_2.Vocals`]-()\nWHERE T2.Title = 'Le Pop'\nRETURN count(*)",
        "question": "Find the number of vocal types used in song \"Le Pop\"",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Songs`)-[T1:`music_2.Vocals`]-()\nWHERE T2.Title = 'Le Pop'\nRETURN count(*)",
        "question": "How many vocal types are used in the song \"Le Pop\"?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "music_2",
        "query": "MATCH (t2:`music_2.Band`)-[t1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWITH count(t2.Firstname) AS cnt, t2\nRETURN t2.Firstname\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Find the first name of the band mate that has performed in most songs.",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (t2:`music_2.Band`)-[t1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWITH count(t2.Firstname) AS cnt, t2\nRETURN t2.Firstname\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the first name of the band mate who perfomed in the most songs?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T3.Title = 'Der Kapitan' AND T1.StagePosition = 'back'\nRETURN T2.Firstname,T2.Lastname",
        "question": "Who is performing in the back stage position for the song \"Der Kapitan\"? Show the first name and last name.",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T2:`music_2.Band`)-[T1:`music_2.Performance`]-(T3:`music_2.Songs`)\nWHERE T3.Title = 'Der Kapitan' AND T1.StagePosition = 'back'\nRETURN T2.Firstname,T2.Lastname",
        "question": "What is the first and last name of the artist who performed back stage for the song \"Der Kapitan\"?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T1:`music_2.Albums`)-[T2:`music_2.Tracklists`]-(T3:`music_2.Songs`)\nWHERE T1.Title = 'A Kiss Before You Go: Live in Hamburg'\nRETURN T3.Title",
        "question": "What are the songs in album \"A Kiss Before You Go: Live in Hamburg\"?",
        "answers": []
    },
    {
        "db_id": "music_2",
        "query": "MATCH (T1:`music_2.Albums`)-[T2:`music_2.Tracklists`]-(T3:`music_2.Songs`)\nWHERE T1.Title = 'A Kiss Before You Go: Live in Hamburg'\nRETURN T3.Title",
        "question": "What are the song titles on the album \"A Kiss Before You Go: Live in Hamburg\"?",
        "answers": []
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE manufacturers.Name = 'Sony'\nRETURN manufacturers.Founder",
        "question": "Who is the founder of Sony?",
        "answers": [
            [
                "Andy"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE manufacturers.Name = 'Sony'\nRETURN manufacturers.Founder",
        "question": "Return the founder of Sony.",
        "answers": [
            [
                "Andy"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE manufacturers.Founder = 'James'\nRETURN manufacturers.Headquarter",
        "question": "Where is the headquarter of the company founded by James?",
        "answers": [
            [
                "Los Angeles"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE manufacturers.Founder = 'James'\nRETURN manufacturers.Headquarter",
        "question": "What is the headquarter of the company whose founder is James?",
        "answers": [
            [
                "Los Angeles"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN manufacturers.Name,manufacturers.Headquarter\nORDER BY manufacturers.Revenue DESC",
        "question": "Find all manufacturers' names and their headquarters, sorted by the ones with highest revenue first.",
        "answers": [
            [
                "Iomega",
                "Beijing"
            ],
            [
                "Fujitsu",
                "Taiwan"
            ],
            [
                "Sony",
                "Tokyo"
            ],
            [
                "Creative Labs",
                "Austin"
            ],
            [
                "Hewlett-Packard",
                "Los Angeles"
            ],
            [
                "Winchester",
                "Paris"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN manufacturers.Name,manufacturers.Headquarter\nORDER BY manufacturers.Revenue DESC",
        "question": "What are the names and headquarters of all manufacturers, ordered by revenue descending?",
        "answers": [
            [
                "Iomega",
                "Beijing"
            ],
            [
                "Fujitsu",
                "Taiwan"
            ],
            [
                "Sony",
                "Tokyo"
            ],
            [
                "Creative Labs",
                "Austin"
            ],
            [
                "Hewlett-Packard",
                "Los Angeles"
            ],
            [
                "Winchester",
                "Paris"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE manufacturers.Founder = 'Andy'\nRETURN count(*)",
        "question": "How many companies were created by Andy?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE manufacturers.Founder = 'Andy'\nRETURN count(*)",
        "question": "Return the number of companies created by Andy.",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN DISTINCT manufacturers.Headquarter",
        "question": "What are the different cities listed?",
        "answers": [
            [
                "Tokyo"
            ],
            [
                "Austin"
            ],
            [
                "Los Angeles"
            ],
            [
                "Beijing"
            ],
            [
                "Taiwan"
            ],
            [
                "Paris"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN DISTINCT manufacturers.Headquarter",
        "question": "Give the distinct headquarters of manufacturers.",
        "answers": [
            [
                "Tokyo"
            ],
            [
                "Austin"
            ],
            [
                "Los Angeles"
            ],
            [
                "Beijing"
            ],
            [
                "Taiwan"
            ],
            [
                "Paris"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE manufacturers.Headquarter = 'Tokyo' OR manufacturers.Headquarter = 'Beijing'\nRETURN count(*)",
        "question": "Find the number of manufactures that are based in Tokyo or Beijing.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE manufacturers.Headquarter = 'Tokyo' OR manufacturers.Headquarter = 'Beijing'\nRETURN count(*)",
        "question": "How many manufacturers have headquarters in either Tokyo or Beijing?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE 100<=manufacturers.Revenue<=150\nRETURN manufacturers.Name",
        "question": "Find the name of companies whose revenue is between 100 and 150.",
        "answers": [
            [
                "Sony"
            ],
            [
                "Creative Labs"
            ],
            [
                "Fujitsu"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE 100<=manufacturers.Revenue<=150\nRETURN manufacturers.Name",
        "question": "What are the names of companies with revenue between 100 and 150?",
        "answers": [
            [
                "Sony"
            ],
            [
                "Creative Labs"
            ],
            [
                "Fujitsu"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN manufacturers.Name,manufacturers.Headquarter,manufacturers.Founder\nORDER BY manufacturers.Revenue DESC\nLIMIT 1",
        "question": "Find the name, headquarter and founder of the manufacturer that has the highest revenue.",
        "answers": [
            [
                "Iomega",
                "Beijing",
                "Mary"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN manufacturers.Name,manufacturers.Headquarter,manufacturers.Founder\nORDER BY manufacturers.Revenue DESC\nLIMIT 1",
        "question": "What are the names, headquarters and founders of the company with the highest revenue?",
        "answers": [
            [
                "Iomega",
                "Beijing",
                "Mary"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN manufacturers.Name,manufacturers.Headquarter,manufacturers.Revenue\nORDER BY manufacturers.Revenue DESC",
        "question": "Find the name, headquarter and revenue of all manufacturers sorted by their revenue in the descending order.",
        "answers": [
            [
                "Iomega",
                "Beijing",
                200.0
            ],
            [
                "Fujitsu",
                "Taiwan",
                130.0
            ],
            [
                "Sony",
                "Tokyo",
                120.0
            ],
            [
                "Creative Labs",
                "Austin",
                100.0
            ],
            [
                "Hewlett-Packard",
                "Los Angeles",
                50.0
            ],
            [
                "Winchester",
                "Paris",
                30.0
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN manufacturers.Name,manufacturers.Headquarter,manufacturers.Revenue\nORDER BY manufacturers.Revenue DESC",
        "question": "What are the names, headquarters and revenues for manufacturers, sorted by revenue descending?",
        "answers": [
            [
                "Iomega",
                "Beijing",
                200.0
            ],
            [
                "Fujitsu",
                "Taiwan",
                130.0
            ],
            [
                "Sony",
                "Tokyo",
                120.0
            ],
            [
                "Creative Labs",
                "Austin",
                100.0
            ],
            [
                "Hewlett-Packard",
                "Los Angeles",
                50.0
            ],
            [
                "Winchester",
                "Paris",
                30.0
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWITH avg(manufacturers.Revenue) AS revenue\nMATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE  manufacturers.Revenue >  revenue \nRETURN manufacturers.Name",
        "question": "Find the name of companies whose revenue is greater than the average revenue of all companies.",
        "answers": [
            [
                "Sony"
            ],
            [
                "Iomega"
            ],
            [
                "Fujitsu"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWITH avg(manufacturers.Revenue) AS revenue\nMATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE  manufacturers.Revenue >  revenue \nRETURN manufacturers.Name",
        "question": "What are the names of manufacturers with revenue greater than the average of all revenues?",
        "answers": [
            [
                "Sony"
            ],
            [
                "Iomega"
            ],
            [
                "Fujitsu"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE manufacturers.Headquarter = 'Austin'\nWITH min(manufacturers.Revenue) AS revenue\nMATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE  manufacturers.Revenue <  revenue \nRETURN manufacturers.Name",
        "question": "Find the name of companies whose revenue is smaller than the revenue of all companies based in Austin.",
        "answers": [
            [
                "Hewlett-Packard"
            ],
            [
                "Winchester"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE manufacturers.Headquarter = 'Austin'\nWITH min(manufacturers.Revenue) AS revenue\nMATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE  manufacturers.Revenue <  revenue \nRETURN manufacturers.Name",
        "question": "What are the names of companies with revenue less than the lowest revenue of any manufacturer in Austin?",
        "answers": [
            [
                "Hewlett-Packard"
            ],
            [
                "Winchester"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN manufacturers.Name,max(manufacturers.Revenue),manufacturers.Headquarter",
        "question": "Find the name and revenue of the company that earns the highest revenue in each city.",
        "answers": [
            [
                "Sony",
                120.0,
                "Tokyo"
            ],
            [
                "Creative Labs",
                100.0,
                "Austin"
            ],
            [
                "Hewlett-Packard",
                50.0,
                "Los Angeles"
            ],
            [
                "Iomega",
                200.0,
                "Beijing"
            ],
            [
                "Fujitsu",
                130.0,
                "Taiwan"
            ],
            [
                "Winchester",
                30.0,
                "Paris"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN manufacturers.Name,max(manufacturers.Revenue),manufacturers.Headquarter",
        "question": "What are the names and revenues of the companies with the highest revenues in each headquarter city?",
        "answers": [
            [
                "Sony",
                120.0,
                "Tokyo"
            ],
            [
                "Creative Labs",
                100.0,
                "Austin"
            ],
            [
                "Hewlett-Packard",
                50.0,
                "Los Angeles"
            ],
            [
                "Iomega",
                200.0,
                "Beijing"
            ],
            [
                "Fujitsu",
                130.0,
                "Taiwan"
            ],
            [
                "Winchester",
                30.0,
                "Paris"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (T1:`manufactory_1.Products`)-[]-(T2:`manufactory_1.Manufacturers`)\nRETURN count(DISTINCT T1.Name),T2.Headquarter",
        "question": "Find the number of different products that are produced by companies at different headquarter cities.",
        "answers": [
            [
                1,
                "Tokyo"
            ],
            [
                3,
                "Austin"
            ],
            [
                3,
                "Los Angeles"
            ],
            [
                1,
                "Beijing"
            ],
            [
                1,
                "Taiwan"
            ],
            [
                2,
                "Paris"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (T1:`manufactory_1.Products`)-[]-(T2:`manufactory_1.Manufacturers`)\nRETURN count(DISTINCT T1.Name),T2.Headquarter",
        "question": "How many different products are produced in each headquarter city?",
        "answers": [
            [
                1,
                "Tokyo"
            ],
            [
                3,
                "Austin"
            ],
            [
                3,
                "Los Angeles"
            ],
            [
                1,
                "Beijing"
            ],
            [
                1,
                "Taiwan"
            ],
            [
                2,
                "Paris"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (T1:`manufactory_1.Products`)-[]-(T2:`manufactory_1.Manufacturers`)\nRETURN count(*),T2.Name",
        "question": "Find the number of products for each manufacturer, showing the name of each company.",
        "answers": [
            [
                1,
                "Sony"
            ],
            [
                3,
                "Creative Labs"
            ],
            [
                3,
                "Hewlett-Packard"
            ],
            [
                1,
                "Iomega"
            ],
            [
                1,
                "Fujitsu"
            ],
            [
                2,
                "Winchester"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (T1:`manufactory_1.Products`)-[]-(T2:`manufactory_1.Manufacturers`)\nRETURN count(*),T2.Name",
        "question": "How many products are there for each manufacturer?",
        "answers": [
            [
                1,
                "Sony"
            ],
            [
                3,
                "Creative Labs"
            ],
            [
                3,
                "Hewlett-Packard"
            ],
            [
                1,
                "Iomega"
            ],
            [
                1,
                "Fujitsu"
            ],
            [
                2,
                "Winchester"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN products.Name",
        "question": "Select the names of all the products in the store.",
        "answers": [
            [
                "Hard drive"
            ],
            [
                "Memory"
            ],
            [
                "ZIP drive"
            ],
            [
                "Floppy disk"
            ],
            [
                "Monitor"
            ],
            [
                "DVD drive"
            ],
            [
                "CD drive"
            ],
            [
                "Printer"
            ],
            [
                "Toner cartridge"
            ],
            [
                "DVD burner"
            ],
            [
                "DVD drive"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN products.Name",
        "question": "What are the names of all products?",
        "answers": [
            [
                "Hard drive"
            ],
            [
                "Memory"
            ],
            [
                "ZIP drive"
            ],
            [
                "Floppy disk"
            ],
            [
                "Monitor"
            ],
            [
                "DVD drive"
            ],
            [
                "CD drive"
            ],
            [
                "Printer"
            ],
            [
                "Toner cartridge"
            ],
            [
                "DVD burner"
            ],
            [
                "DVD drive"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN products.Name,products.Price",
        "question": "Select the names and the prices of all the products in the store.",
        "answers": [
            [
                "Hard drive",
                240
            ],
            [
                "Memory",
                120
            ],
            [
                "ZIP drive",
                150
            ],
            [
                "Floppy disk",
                5
            ],
            [
                "Monitor",
                240
            ],
            [
                "DVD drive",
                180
            ],
            [
                "CD drive",
                90
            ],
            [
                "Printer",
                270
            ],
            [
                "Toner cartridge",
                66
            ],
            [
                "DVD burner",
                180
            ],
            [
                "DVD drive",
                150
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN products.Name,products.Price",
        "question": "What are the names and prices of all products in the store?",
        "answers": [
            [
                "Hard drive",
                240
            ],
            [
                "Memory",
                120
            ],
            [
                "ZIP drive",
                150
            ],
            [
                "Floppy disk",
                5
            ],
            [
                "Monitor",
                240
            ],
            [
                "DVD drive",
                180
            ],
            [
                "CD drive",
                90
            ],
            [
                "Printer",
                270
            ],
            [
                "Toner cartridge",
                66
            ],
            [
                "DVD burner",
                180
            ],
            [
                "DVD drive",
                150
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nWHERE products.Price <= 200\nRETURN products.Name",
        "question": "Select the name of the products with a price less than or equal to $200.",
        "answers": [
            [
                "Memory"
            ],
            [
                "ZIP drive"
            ],
            [
                "Floppy disk"
            ],
            [
                "DVD drive"
            ],
            [
                "CD drive"
            ],
            [
                "Toner cartridge"
            ],
            [
                "DVD burner"
            ],
            [
                "DVD drive"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nWHERE products.Price <= 200\nRETURN products.Name",
        "question": "What are the names of products with price at most 200?",
        "answers": [
            [
                "Memory"
            ],
            [
                "ZIP drive"
            ],
            [
                "Floppy disk"
            ],
            [
                "DVD drive"
            ],
            [
                "CD drive"
            ],
            [
                "Toner cartridge"
            ],
            [
                "DVD burner"
            ],
            [
                "DVD drive"
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN avg(products.Price)",
        "question": "Compute the average price of all the products.",
        "answers": [
            [
                153.72727272727272
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN avg(products.Price)",
        "question": "What is the average price across all products?",
        "answers": [
            [
                153.72727272727272
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nWHERE products.Manufacturer = 2\nRETURN avg(products.Price)",
        "question": "Compute the average price of all products with manufacturer code equal to 2.",
        "answers": [
            [
                150.0
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nWHERE products.Manufacturer = 2\nRETURN avg(products.Price)",
        "question": "What is the average price of products with manufacturer codes equal to 2?",
        "answers": [
            [
                150.0
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nWHERE products.Price >= 180\nRETURN count(*)",
        "question": "Compute the number of products with a price larger than or equal to $180.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nWHERE products.Price >= 180\nRETURN count(*)",
        "question": "How many products have prices of at least 180?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nWHERE products.Price >= 180\nRETURN products.Name,products.Price\nORDER BY products.Price DESC,products.Name ASC",
        "question": "Select the name and price of all products with a price larger than or equal to $180, and sort first by price (in descending order), and then by name  (in ascending order).",
        "answers": [
            [
                "Printer",
                270
            ],
            [
                "Hard drive",
                240
            ],
            [
                "Monitor",
                240
            ],
            [
                "DVD burner",
                180
            ],
            [
                "DVD drive",
                180
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nWHERE products.Price >= 180\nRETURN products.Name,products.Price\nORDER BY products.Price DESC,products.Name ASC",
        "question": "What are the names and prices of products that cost at least 180, sorted by price decreasing and name ascending?",
        "answers": [
            [
                "Printer",
                270
            ],
            [
                "Hard drive",
                240
            ],
            [
                "Monitor",
                240
            ],
            [
                "DVD burner",
                180
            ],
            [
                "DVD drive",
                180
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN avg(products.Price),products.Manufacturer",
        "question": "Select the average price of each manufacturer's products, showing only the manufacturer's code.",
        "answers": [
            [
                240.0,
                5
            ],
            [
                62.5,
                6
            ],
            [
                150.0,
                4
            ],
            [
                240.0,
                1
            ],
            [
                150.0,
                2
            ],
            [
                162.0,
                3
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN avg(products.Price),products.Manufacturer",
        "question": "What are the average prices of products, grouped by manufacturer code?",
        "answers": [
            [
                240.0,
                5
            ],
            [
                62.5,
                6
            ],
            [
                150.0,
                4
            ],
            [
                240.0,
                1
            ],
            [
                150.0,
                2
            ],
            [
                162.0,
                3
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN products.Name,products.Price\nORDER BY products.Price ASC\nLIMIT 1",
        "question": "Select the name and price of the cheapest product.",
        "answers": [
            [
                "Floppy disk",
                5
            ]
        ]
    },
    {
        "db_id": "manufactory_1",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN products.Name,products.Price\nORDER BY products.Price ASC\nLIMIT 1",
        "question": "What is the name and price of the cheapest product?",
        "answers": [
            [
                "Floppy disk",
                5
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (problem_log:`tracking_software_problems.Problem_Log`)\nRETURN problem_log.problem_log_id\nORDER BY problem_log.log_entry_date DESC\nLIMIT 1",
        "question": "What is the id of the problem log that is created most recently?",
        "answers": [
            [
                14
            ]
        ]
    }
]