[
    {
        "db_id": "solvency_ii",
        "query": "MATCH (T1:`solvency_ii.Products`)-[]-(T2:`solvency_ii.Products_in_Events`)\nWITH count(*) AS count, T1.Product_Name AS Product_Name\nWHERE count  >= 2\nRETURN Product_Name",
        "question": "Show the names of products that are in at least two events.",
        "answers": [
            [
                "Special Dinning"
            ],
            [
                "TV Equipments"
            ],
            [
                "Men suits"
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (artwork:`entertainment_awards.artwork`)\nRETURN count(*)",
        "question": "How many artworks are there?",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (artwork:`entertainment_awards.artwork`)\nRETURN artwork.Name\nORDER BY artwork.Name ASC",
        "question": "List the name of artworks in ascending alphabetical order.",
        "answers": [
            [
                "Back Home"
            ],
            [
                "Boys"
            ],
            [
                "Cats"
            ],
            [
                "Daniel Mananta"
            ],
            [
                "I Know"
            ],
            [
                "Indonesian Idol"
            ],
            [
                "Loving you"
            ],
            [
                "Martin"
            ],
            [
                "Why"
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (artwork:`entertainment_awards.artwork`)\nWHERE artwork.Type <> 'Program Talent Show'\nRETURN artwork.Name",
        "question": "List the name of artworks whose type is not \"Program Talent Show\".",
        "answers": [
            [
                "Indonesian Idol"
            ],
            [
                "I Know"
            ],
            [
                "Loving you"
            ],
            [
                "Why"
            ],
            [
                "Boys"
            ],
            [
                "Daniel Mananta"
            ],
            [
                "Back Home"
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (festival_detail:`entertainment_awards.festival_detail`)\nRETURN festival_detail.Festival_Name,festival_detail.Location",
        "question": "What are the names and locations of festivals?",
        "answers": [
            [
                "Panasonic Awards",
                "United States"
            ],
            [
                "Flower Awards",
                "United States"
            ],
            [
                "Cherry Awards",
                "United States"
            ],
            [
                "Gobel Awards",
                "United States"
            ],
            [
                "LA Awards",
                "United States"
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (festival_detail:`entertainment_awards.festival_detail`)\nRETURN festival_detail.Chair_Name\nORDER BY festival_detail.Year ASC",
        "question": "What are the names of the chairs of festivals, sorted in ascending order of the year held?",
        "answers": [
            [
                "Raymond Floyd"
            ],
            [
                "Charles Coody"
            ],
            [
                "Doug Ford"
            ],
            [
                "Arnold Palmer"
            ],
            [
                "Lucy Lu"
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (festival_detail:`entertainment_awards.festival_detail`)\nRETURN festival_detail.Location\nORDER BY festival_detail.Num_of_Audience DESC\nLIMIT 1",
        "question": "What is the location of the festival with the largest number of audience?",
        "answers": [
            [
                "United States"
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (festival_detail:`entertainment_awards.festival_detail`)\nWHERE festival_detail.Year = 2007\nRETURN festival_detail.Festival_Name",
        "question": "What are the names of festivals held in year 2007?",
        "answers": [
            [
                "Flower Awards"
            ],
            [
                "Cherry Awards"
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (festival_detail:`entertainment_awards.festival_detail`)\nRETURN avg(festival_detail.Num_of_Audience)",
        "question": "What is the average number of audience for festivals?",
        "answers": [
            [
                157.6
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (T2:`entertainment_awards.artwork`)-[T1:`entertainment_awards.nomination`]-(T3:`entertainment_awards.festival_detail`)\nRETURN T2.Name,T3.Festival_Name",
        "question": "For each nomination, show the name of the artwork and name of the festival where it is nominated.",
        "answers": [
            [
                "Indonesian Idol",
                "Flower Awards"
            ],
            [
                "I Know",
                "Flower Awards"
            ],
            [
                "Loving you",
                "Panasonic Awards"
            ],
            [
                "Why",
                "Panasonic Awards"
            ],
            [
                "Martin",
                "LA Awards"
            ],
            [
                "Back Home",
                "LA Awards"
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (T2:`entertainment_awards.artwork`)-[T1:`entertainment_awards.nomination`]-(T3:`entertainment_awards.festival_detail`)\nWHERE T3.Year = 2007\nRETURN DISTINCT T2.Type",
        "question": "Show distinct types of artworks that are nominated in festivals in 2007.",
        "answers": [
            [
                "Program Music/Variety Show"
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (T2:`entertainment_awards.artwork`)-[T1:`entertainment_awards.nomination`]-(T3:`entertainment_awards.festival_detail`)\nRETURN T2.Name\nORDER BY T3.Year",
        "question": "Show the names of artworks in ascending order of the year they are nominated in.",
        "answers": [
            [
                "Loving you"
            ],
            [
                "Why"
            ],
            [
                "Indonesian Idol"
            ],
            [
                "I Know"
            ],
            [
                "Martin"
            ],
            [
                "Back Home"
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (T2:`entertainment_awards.artwork`)-[T1:`entertainment_awards.nomination`]-(T3:`entertainment_awards.festival_detail`)\nWHERE T2.Type = 'Program Talent Show'\nRETURN T3.Festival_Name",
        "question": "Show the names of festivals that have nominated artworks of type \"Program Talent Show\".",
        "answers": [
            [
                "LA Awards"
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (T2:`entertainment_awards.artwork`)-[T1:`entertainment_awards.nomination`]-(T3:`entertainment_awards.festival_detail`)\nWITH count(*) AS count, T1.Festival_ID AS Festival_ID, T3.Festival_Name AS Festival_Name\nWHERE count  >= 2\nRETURN Festival_ID,Festival_Name",
        "question": "Show the ids and names of festivals that have at least two nominations for artworks.",
        "answers": [
            [
                2,
                "Flower Awards"
            ],
            [
                1,
                "Panasonic Awards"
            ],
            [
                5,
                "LA Awards"
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (T2:`entertainment_awards.artwork`)-[T1:`entertainment_awards.nomination`]-(T3:`entertainment_awards.festival_detail`)\nRETURN T1.Festival_ID,T3.Festival_Name,count(*)",
        "question": "Show the id, name of each festival and the number of artworks it has nominated.",
        "answers": [
            [
                2,
                "Flower Awards",
                2
            ],
            [
                1,
                "Panasonic Awards",
                2
            ],
            [
                5,
                "LA Awards",
                2
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (artwork:`entertainment_awards.artwork`)\nRETURN artwork.Type,count(*)",
        "question": "Please show different types of artworks with the corresponding number of artworks of each type.",
        "answers": [
            [
                "Program Music/Variety Show",
                3
            ],
            [
                "Presenter Music/Variety Show",
                2
            ],
            [
                "Program Talent Show",
                2
            ],
            [
                "Presenter Talent Show",
                2
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (festival_detail:`entertainment_awards.festival_detail`)\nWITH festival_detail.Year AS Year, count(*) AS count\nWHERE count  > 1\nRETURN Year",
        "question": "List the year in which there are more than one festivals.",
        "answers": [
            [
                2007
            ]
        ]
    },
    {
        "db_id": "entertainment_awards",
        "query": "MATCH (festival_detail:`entertainment_awards.festival_detail`)\nWHERE festival_detail.Year = 2008 OR festival_detail.Year = 2010\nRETURN festival_detail.Num_of_Audience",
        "question": "Show the number of audience in year 2008 or 2010.",
        "answers": [
            [
                160
            ],
            [
                161
            ]
        ]
    },
    {
        "db_id": "customers_campaigns_ecommerce",
        "query": "MATCH (premises:`customers_campaigns_ecommerce.Premises`)\nRETURN count(*)",
        "question": "How many premises are there?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "customers_campaigns_ecommerce",
        "query": "MATCH (premises:`customers_campaigns_ecommerce.Premises`)\nRETURN DISTINCT premises.premises_type",
        "question": "What are all the distinct premise types?",
        "answers": [
            [
                "Warehouse"
            ],
            [
                "Residence"
            ],
            [
                "Office"
            ]
        ]
    },
    {
        "db_id": "customers_campaigns_ecommerce",
        "query": "MATCH (premises:`customers_campaigns_ecommerce.Premises`)\nRETURN premises.premises_type,premises.premise_details\nORDER BY premises.premises_type",
        "question": "Find the types and details for all premises and order by the premise type.",
        "answers": [
            [
                "Office",
                "38291 Jerde Light Apt. 713"
            ],
            [
                "Office",
                "5585 Abbott Walk"
            ],
            [
                "Office",
                "07318 Annetta Motorway"
            ],
            [
                "Office",
                "00100 Green Mountains Apt. 653"
            ],
            [
                "Office",
                "33294 William Lodge Apt. 953"
            ],
            [
                "Office",
                "2760 Austin Station"
            ],
            [
                "Office",
                "867 Emard Drives Apt. 066"
            ],
            [
                "Residence",
                "27839 Carissa Tunnel Suite 048"
            ],
            [
                "Residence",
                "2219 Barrows Tunnel Apt. 893"
            ],
            [
                "Residence",
                "5510 Veum Green"
            ],
            [
                "Residence",
                "5109 Jules Squares Apt. 082"
            ],
            [
                "Warehouse",
                "036 Lueilwitz Harbor"
            ],
            [
                "Warehouse",
                "676 Kelly Spur"
            ],
            [
                "Warehouse",
                "7230 Tillman Glens Suite 202"
            ],
            [
                "Warehouse",
                "62282 Wiza Glen Apt. 430"
            ]
        ]
    },
    {
        "db_id": "customers_campaigns_ecommerce",
        "query": "MATCH (premises:`customers_campaigns_ecommerce.Premises`)\nRETURN premises.premises_type,count(*)",
        "question": "Show each premise type and the number of premises in that type.",
        "answers": [
            [
                "Warehouse",
                4
            ],
            [
                "Residence",
                4
            ],
            [
                "Office",
                7
            ]
        ]
    },
    {
        "db_id": "customers_campaigns_ecommerce",
        "query": "MATCH (mailshot_campaigns:`customers_campaigns_ecommerce.Mailshot_Campaigns`)\nRETURN mailshot_campaigns.product_category,count(*)",
        "question": "Show all distinct product categories along with the number of mailshots in each category.",
        "answers": [
            [
                "food",
                11
            ],
            [
                "clothes",
                9
            ]
        ]
    },
    {
        "db_id": "customers_campaigns_ecommerce",
        "query": "MATCH (T1:`customers_campaigns_ecommerce.Customers`)-[T2:`customers_campaigns_ecommerce.Mailshot_Customers`]-()\nWHERE T2.outcome_code = 'No Response'\nRETURN T1.customer_name,T1.customer_phone",
        "question": "Show the name and phone for customers with a mailshot with outcome code 'No Response'.",
        "answers": [
            [
                "Wendell",
                "(773)971-9411x759"
            ],
            [
                "Wendell",
                "(773)971-9411x759"
            ],
            [
                "Stella",
                "+43(3)1861877192"
            ],
            [
                "Carlotta",
                "+66(7)1491041398"
            ],
            [
                "Donnie",
                "(030)521-0681x0191"
            ]
        ]
    },
    {
        "db_id": "customers_campaigns_ecommerce",
        "query": "MATCH (T2:`customers_campaigns_ecommerce.Premises`)-[T1:`customers_campaigns_ecommerce.Customer_Addresses`]-()\nRETURN T2.premises_type,T1.address_type_code",
        "question": "Show the premise type and address type code for all customer addresses.",
        "answers": [
            [
                "Warehouse",
                "Billing"
            ],
            [
                "Warehouse",
                "Shipping"
            ],
            [
                "Warehouse",
                "Billing"
            ],
            [
                "Warehouse",
                "Shipping"
            ],
            [
                "Warehouse",
                "Billing"
            ],
            [
                "Residence",
                "Shipping"
            ],
            [
                "Residence",
                "Shipping"
            ],
            [
                "Office",
                "Shipping"
            ],
            [
                "Office",
                "Shipping"
            ],
            [
                "Office",
                "Billing"
            ],
            [
                "Office",
                "Billing"
            ],
            [
                "Warehouse",
                "Shipping"
            ],
            [
                "Office",
                "Billing"
            ],
            [
                "Office",
                "Billing"
            ],
            [
                "Residence",
                "Billing"
            ]
        ]
    },
    {
        "db_id": "customers_campaigns_ecommerce",
        "query": "MATCH ()-[customer_addresses:`customers_campaigns_ecommerce.Customer_Addresses`]-()\nRETURN DISTINCT customer_addresses.address_type_code",
        "question": "What are the distinct address type codes for all customer addresses?",
        "answers": [
            [
                "Billing"
            ],
            [
                "Shipping"
            ]
        ]
    },
    {
        "db_id": "customers_campaigns_ecommerce",
        "query": "MATCH (customer_orders:`customers_campaigns_ecommerce.Customer_Orders`)\nWHERE customer_orders.order_status_code = 'Cancelled' OR customer_orders.order_status_code = 'Paid'\nRETURN customer_orders.order_shipping_charges,customer_orders.customer_id",
        "question": "Show the shipping charge and customer id for customer orders with order status Cancelled or Paid.",
        "answers": [
            [
                "85.79",
                2
            ],
            [
                "98.4",
                8
            ],
            [
                "36.87",
                9
            ],
            [
                "35.63",
                7
            ],
            [
                "99.26",
                2
            ],
            [
                "26.56",
                15
            ],
            [
                "57.36",
                1
            ],
            [
                "33.58",
                14
            ],
            [
                "22.84",
                1
            ],
            [
                "21.24",
                12
            ],
            [
                "31.33",
                12
            ],
            [
                "46.4",
                14
            ]
        ]
    },
    {
        "db_id": "customers_campaigns_ecommerce",
        "query": "MATCH (T1:`customers_campaigns_ecommerce.Customers`)-[]-(T2:`customers_campaigns_ecommerce.Customer_Orders`)\nWHERE T2.shipping_method_code = 'FedEx' AND T2.order_status_code = 'Paid'\nRETURN T1.customer_name",
        "question": "Show the names of customers having an order with shipping method FedEx and order status Paid.",
        "answers": [
            [
                "Leanna"
            ],
            [
                "Kyle"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (course:`college_3.Course`)\nRETURN count(*)",
        "question": "Count the number of courses.",
        "answers": [
            [
                76
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (course:`college_3.Course`)\nWHERE course.Credits > 2\nRETURN count(*)",
        "question": "Count the number of courses with more than 2 credits.",
        "answers": [
            [
                71
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (gradeconversion:`college_3.Gradeconversion`)\nRETURN max(gradeconversion.gradepoint),min(gradeconversion.gradepoint)",
        "question": "Find the max and min grade point for all letter grade.",
        "answers": [
            [
                4.0,
                0.0
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (student:`college_3.Student`)\nWHERE student.Fname =~'.*[A|a].*'\nRETURN DISTINCT student.Fname",
        "question": "Find the first names of students whose first names contain letter \"a\".",
        "answers": [
            [
                "Linda"
            ],
            [
                "Tracy"
            ],
            [
                "Shiela"
            ],
            [
                "Paul"
            ],
            [
                "Andy"
            ],
            [
                "Lisa"
            ],
            [
                "Jandy"
            ],
            [
                "David"
            ],
            [
                "Charles"
            ],
            [
                "Susan"
            ],
            [
                "Mark"
            ],
            [
                "Michael"
            ],
            [
                "Arthur"
            ],
            [
                "Ian"
            ],
            [
                "Stacy"
            ],
            [
                "Sarah"
            ],
            [
                "William"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (student:`college_3.Student`)\nWHERE student.Fname =~'.*[A|a].*'\nRETURN DISTINCT student.Fname",
        "question": "What are the first names for students who have an \"a\" in their first name?",
        "answers": [
            [
                "Linda"
            ],
            [
                "Tracy"
            ],
            [
                "Shiela"
            ],
            [
                "Paul"
            ],
            [
                "Andy"
            ],
            [
                "Lisa"
            ],
            [
                "Jandy"
            ],
            [
                "David"
            ],
            [
                "Charles"
            ],
            [
                "Susan"
            ],
            [
                "Mark"
            ],
            [
                "Michael"
            ],
            [
                "Arthur"
            ],
            [
                "Ian"
            ],
            [
                "Stacy"
            ],
            [
                "Sarah"
            ],
            [
                "William"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (student:`college_3.Student`)\nRETURN student.Fname\nORDER BY student.Age DESC",
        "question": "Find the first name of students in the descending order of age.",
        "answers": [
            [
                "Bruce"
            ],
            [
                "Paul"
            ],
            [
                "Sarah"
            ],
            [
                "David"
            ],
            [
                "Ian"
            ],
            [
                "Shiela"
            ],
            [
                "Lisa"
            ],
            [
                "Dinesh"
            ],
            [
                "Jandy"
            ],
            [
                "Steven"
            ],
            [
                "Michael"
            ],
            [
                "David"
            ],
            [
                "Eric"
            ],
            [
                "Sarah"
            ],
            [
                "Eric"
            ],
            [
                "Tracy"
            ],
            [
                "Eric"
            ],
            [
                "George"
            ],
            [
                "Eric"
            ],
            [
                "Linda"
            ],
            [
                "Andy"
            ],
            [
                "Lisa"
            ],
            [
                "Charles"
            ],
            [
                "Arthur"
            ],
            [
                "Stacy"
            ],
            [
                "Mark"
            ],
            [
                "Paul"
            ],
            [
                "William"
            ],
            [
                "Eric"
            ],
            [
                "Derek"
            ],
            [
                "Mark"
            ],
            [
                "Michael"
            ],
            [
                "Jun"
            ],
            [
                "Susan"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (T1:`college_3.Department`)-[T2:`college_3.Member_of`]-()\nWITH T1, count(T1.DNO) AS cnt\nRETURN T1.DName\nORDER BY cnt ASC\nLIMIT 1",
        "question": "Find the name of the department that has the fewest members.",
        "answers": [
            [
                "Cognitive Science"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (T1:`college_3.Department`)-[T2:`college_3.Member_of`]-()\nWITH T1, count(T1.DNO) AS cnt\nRETURN T1.DName\nORDER BY cnt ASC\nLIMIT 1",
        "question": "What is the name of the department with the fewest members?",
        "answers": [
            [
                "Cognitive Science"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (faculty:`college_3.Faculty`)\nRETURN faculty.Rank\nORDER BY faculty.Rank ASC\nLIMIT 1",
        "question": "Find the rank of the faculty that the fewest faculties belong to.",
        "answers": [
            [
                "AssocProf"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (faculty:`college_3.Faculty`)\nRETURN faculty.Rank\nORDER BY faculty.Rank ASC\nLIMIT 1",
        "question": "What is the least common faculty rank?",
        "answers": [
            [
                "AssocProf"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (T1:`college_3.Course`)-[]-(T2:`college_3.Enrolled_in`)\nWITH count(*) AS count, T1.CName AS CName\nWHERE count  >= 5\nRETURN CName",
        "question": "What are the name of courses that have at least five enrollments?",
        "answers": [
            [
                "INTRO TO PROGRAMMING IN JAVA"
            ],
            [
                "EXPLORING THE INTERNET"
            ],
            [
                "DATA STRUCTURES in JAVA"
            ],
            [
                "MULTIMEDIA COMPUTING"
            ],
            [
                "SUPERCOMPUTING"
            ],
            [
                "DATABASE SYSTEMS"
            ],
            [
                "COMPUTER SYSTEM FUNDAMENTALS"
            ],
            [
                "DISTRIBUTED SYSTEMS"
            ],
            [
                "QUANTITATIVE MEDICAL COMPUTING"
            ],
            [
                "COMPUTER VISION"
            ],
            [
                "ALGORITHMS I"
            ],
            [
                "INTRO TO NATURAL LANGUAGE PROCESSING"
            ],
            [
                "APPLIED STATISTICS AND DATA ANALYSIS"
            ],
            [
                "INTRODUCTION TO PROBABILITY"
            ],
            [
                "COMBINATORIAL ANALYSIS"
            ],
            [
                "CIRCUITS"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (T1:`college_3.Course`)-[]-(T2:`college_3.Enrolled_in`)\nWITH count(*) AS count, T1.CName AS CName\nWHERE count  >= 5\nRETURN CName",
        "question": "Give the names of the courses with at least five enrollments.",
        "answers": [
            [
                "INTRO TO PROGRAMMING IN JAVA"
            ],
            [
                "EXPLORING THE INTERNET"
            ],
            [
                "DATA STRUCTURES in JAVA"
            ],
            [
                "MULTIMEDIA COMPUTING"
            ],
            [
                "SUPERCOMPUTING"
            ],
            [
                "DATABASE SYSTEMS"
            ],
            [
                "COMPUTER SYSTEM FUNDAMENTALS"
            ],
            [
                "DISTRIBUTED SYSTEMS"
            ],
            [
                "QUANTITATIVE MEDICAL COMPUTING"
            ],
            [
                "COMPUTER VISION"
            ],
            [
                "ALGORITHMS I"
            ],
            [
                "INTRO TO NATURAL LANGUAGE PROCESSING"
            ],
            [
                "APPLIED STATISTICS AND DATA ANALYSIS"
            ],
            [
                "INTRODUCTION TO PROBABILITY"
            ],
            [
                "COMBINATORIAL ANALYSIS"
            ],
            [
                "CIRCUITS"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (T1:`college_3.Course`)-[]-(T2:`college_3.Faculty`)\nWHERE T1.CName = \"COMPUTER LITERACY\"\nRETURN T2.Fname,T2.Lname",
        "question": "Find the first name and last name of the instructor of course that has course name",
        "answers": [
            [
                "Louis",
                "Beach"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (T1:`college_3.Course`)-[]-(T2:`college_3.Department`)\nWHERE T1.CName = \"INTRODUCTION TO COMPUTER SCIENCE\"\nRETURN T2.DName,T2.Room",
        "question": "Find the department name and room of the course INTRODUCTION TO COMPUTER SCIENCE.",
        "answers": [
            [
                "Computer Science",
                "224"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (T1:`college_3.Course`)-[]-(T2:`college_3.Department`)\nWHERE T1.CName = \"INTRODUCTION TO COMPUTER SCIENCE\"\nRETURN T2.DName,T2.Room",
        "question": "What are the department name and room for the course INTRODUCTION TO COMPUTER SCIENCE?",
        "answers": [
            [
                "Computer Science",
                "224"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (T1:`college_3.Faculty`)-[T2:`college_3.Member_of`]-()\nWHERE T2.DNO = 520\nRETURN T1.Fname,T1.Lname",
        "question": "Find the full names of faculties who are members of department with department number 520.",
        "answers": [
            [
                "Thordur",
                "Runolfsson"
            ],
            [
                "Frederic",
                "Davidson"
            ],
            [
                "William",
                "Brody"
            ],
            [
                "Gerard",
                "Meyer"
            ],
            [
                "Alexander",
                "Kaplan"
            ],
            [
                "William",
                "Byrne"
            ],
            [
                "Pablo",
                "Iglesias"
            ],
            [
                "John",
                "Goutsias"
            ],
            [
                "Wilson",
                "Rugh"
            ],
            [
                "Frederick",
                "Jelinek"
            ],
            [
                "Charles",
                "Westgate"
            ],
            [
                "Howard",
                "Weinert"
            ],
            [
                "Lawrence",
                "Wolff"
            ],
            [
                "Gert",
                "Cauwenberghs"
            ],
            [
                "Andreas",
                "Andreou"
            ],
            [
                "Oliver",
                "Collins"
            ],
            [
                "Brian",
                "Hughes"
            ],
            [
                "Richard",
                "Joseph"
            ],
            [
                "Jacob",
                "Khurgin"
            ],
            [
                "Jerry",
                "Prince"
            ],
            [
                "Robert",
                "Glaser"
            ]
        ]
    }
]