[
    {
        "db_id": "game_1",
        "query": "MATCH (student:`game_1.Student`)\nWITH student.Advisor AS Advisor, count(*) AS count\nWHERE count  >= 2\nRETURN Advisor",
        "question": "What are the advisors",
        "answers": [
            [
                1121
            ],
            [
                1148
            ],
            [
                2192
            ],
            [
                7271
            ],
            [
                8722
            ],
            [
                7134
            ],
            [
                2311
            ],
            [
                8772
            ],
            [
                5718
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (sportsinfo:`game_1.SportsInfo`)\nRETURN count(DISTINCT sportsinfo.SportName)",
        "question": "How many sports do we have?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (sportsinfo:`game_1.SportsInfo`)\nRETURN count(DISTINCT sportsinfo.SportName)",
        "question": "How many different types of sports do we offer?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (sportsinfo:`game_1.SportsInfo`)\nRETURN count(DISTINCT sportsinfo.StuID)",
        "question": "How many students play sports?",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (sportsinfo:`game_1.SportsInfo`)\nRETURN count(DISTINCT sportsinfo.StuID)",
        "question": "How many different students are involved in sports?",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (sportsinfo:`game_1.SportsInfo`)\nWHERE sportsinfo.OnScholarship = 'Y'\nRETURN sportsinfo.StuID",
        "question": "List ids for all student who are on scholarship.",
        "answers": [
            [
                1002
            ],
            [
                1003
            ],
            [
                1015
            ],
            [
                1019
            ],
            [
                1023
            ],
            [
                1023
            ],
            [
                1026
            ],
            [
                1033
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (sportsinfo:`game_1.SportsInfo`)\nWHERE sportsinfo.OnScholarship = 'Y'\nRETURN sportsinfo.StuID",
        "question": "What are the ids for all sporty students who are on scholarship?",
        "answers": [
            [
                1002
            ],
            [
                1003
            ],
            [
                1015
            ],
            [
                1019
            ],
            [
                1023
            ],
            [
                1023
            ],
            [
                1026
            ],
            [
                1033
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (T1:`game_1.SportsInfo`)-[]-(T2:`game_1.Student`)\nWHERE T1.OnScholarship = 'Y'\nRETURN T2.LName",
        "question": "Show last names for all student who are on scholarship.",
        "answers": [
            [
                "Kim"
            ],
            [
                "Jones"
            ],
            [
                "Lee"
            ],
            [
                "Pang"
            ],
            [
                "Shieber"
            ],
            [
                "Shieber"
            ],
            [
                "Pang"
            ],
            [
                "Simms"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (T1:`game_1.SportsInfo`)-[]-(T2:`game_1.Student`)\nWHERE T1.OnScholarship = 'Y'\nRETURN T2.LName",
        "question": "What are the last names for all scholarship students?",
        "answers": [
            [
                "Kim"
            ],
            [
                "Jones"
            ],
            [
                "Lee"
            ],
            [
                "Pang"
            ],
            [
                "Shieber"
            ],
            [
                "Shieber"
            ],
            [
                "Pang"
            ],
            [
                "Simms"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (sportsinfo:`game_1.SportsInfo`)\nRETURN sportsinfo.SportName,count(*)",
        "question": "Show all sport name and the number of students.",
        "answers": [
            [
                "Athletics",
                1
            ],
            [
                "Football",
                2
            ],
            [
                "Lacrosse",
                3
            ],
            [
                "Swimming",
                1
            ],
            [
                "Tennis",
                2
            ],
            [
                "Baseball",
                1
            ],
            [
                "Basketball",
                1
            ],
            [
                "Cricket",
                1
            ],
            [
                "Soccer",
                1
            ],
            [
                "Curling",
                1
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (sportsinfo:`game_1.SportsInfo`)\nRETURN sportsinfo.SportName,count(*)",
        "question": "How many students play each sport?",
        "answers": [
            [
                "Athletics",
                1
            ],
            [
                "Football",
                2
            ],
            [
                "Lacrosse",
                3
            ],
            [
                "Swimming",
                1
            ],
            [
                "Tennis",
                2
            ],
            [
                "Baseball",
                1
            ],
            [
                "Basketball",
                1
            ],
            [
                "Cricket",
                1
            ],
            [
                "Soccer",
                1
            ],
            [
                "Curling",
                1
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH ()-[plays_games:`game_1.Plays_Games`]-()\nRETURN count(DISTINCT plays_games.StuID)",
        "question": "How many students play video games?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH ()-[plays_games:`game_1.Plays_Games`]-()\nRETURN count(DISTINCT plays_games.StuID)",
        "question": "How many different students play games?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nRETURN customers.customer_name",
        "question": "Find the name of all customers.",
        "answers": [
            [
                "Dr. Julia Wuckert MD"
            ],
            [
                "Tillman Ernser"
            ],
            [
                "Rodrick Heaney"
            ],
            [
                "Prof. Alexzander Hamill"
            ],
            [
                "Prof. Reyes Berge II"
            ],
            [
                "Maudie Kertzmann"
            ],
            [
                "Mozell Morissette"
            ],
            [
                "Eunice Morar"
            ],
            [
                "Devin Mills"
            ],
            [
                "Kitty Padberg III"
            ],
            [
                "Salvatore Tillman"
            ],
            [
                "Clifford Pagac"
            ],
            [
                "Miss Aliyah Witting"
            ],
            [
                "Alexane Kilback"
            ],
            [
                "Prof. Ibrahim Bashirian"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nRETURN customers.customer_name",
        "question": "What are the names of all the customers?",
        "answers": [
            [
                "Dr. Julia Wuckert MD"
            ],
            [
                "Tillman Ernser"
            ],
            [
                "Rodrick Heaney"
            ],
            [
                "Prof. Alexzander Hamill"
            ],
            [
                "Prof. Reyes Berge II"
            ],
            [
                "Maudie Kertzmann"
            ],
            [
                "Mozell Morissette"
            ],
            [
                "Eunice Morar"
            ],
            [
                "Devin Mills"
            ],
            [
                "Kitty Padberg III"
            ],
            [
                "Salvatore Tillman"
            ],
            [
                "Clifford Pagac"
            ],
            [
                "Miss Aliyah Witting"
            ],
            [
                "Alexane Kilback"
            ],
            [
                "Prof. Ibrahim Bashirian"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nRETURN count(*)",
        "question": "Return the total number of distinct customers.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nWHERE 10<=customers.customer_id<=20\nRETURN customers.date_became_customer",
        "question": "Find the \"date became customers\" of the customers whose ID is between 10 and 20.",
        "answers": [
            [
                "2018-03-22 18:09:09"
            ],
            [
                "2018-03-04 00:17:48"
            ],
            [
                "2018-02-24 10:24:23"
            ],
            [
                "2018-03-05 07:19:45"
            ],
            [
                "2018-03-08 01:17:31"
            ],
            [
                "2018-03-15 02:54:27"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nWHERE 10<=customers.customer_id<=20\nRETURN customers.date_became_customer",
        "question": "What are the dates when customers with ids between 10 and 20 became customers?",
        "answers": [
            [
                "2018-03-22 18:09:09"
            ],
            [
                "2018-03-04 00:17:48"
            ],
            [
                "2018-02-24 10:24:23"
            ],
            [
                "2018-03-05 07:19:45"
            ],
            [
                "2018-03-08 01:17:31"
            ],
            [
                "2018-03-15 02:54:27"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nRETURN DISTINCT customers.payment_method",
        "question": "What are all the payment methods?",
        "answers": [
            [
                "Cash"
            ],
            [
                "Cheque"
            ],
            [
                "Credit Card"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nRETURN DISTINCT customers.payment_method",
        "question": "Return all the distinct payment methods used by customers.",
        "answers": [
            [
                "Cash"
            ],
            [
                "Cheque"
            ],
            [
                "Credit Card"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (products:`customers_and_addresses.Products`)\nRETURN DISTINCT products.product_details",
        "question": "What are the details of all products?",
        "answers": [
            [
                "Americano"
            ],
            [
                "Dove Chocolate"
            ],
            [
                "Latte"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (products:`customers_and_addresses.Products`)\nRETURN DISTINCT products.product_details",
        "question": "Return the the details of all products.",
        "answers": [
            [
                "Americano"
            ],
            [
                "Dove Chocolate"
            ],
            [
                "Latte"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (t1:`customers_and_addresses.Customers`)-[t2:`customers_and_addresses.Customer_Addresses`]-(t3:`customers_and_addresses.Addresses`)\nWHERE t1.customer_name = \"Maudie Kertzmann\"\nRETURN t3.address_content",
        "question": "What is the address content of the customer named \"Maudie Kertzmann\"?",
        "answers": [
            [
                "59540 Grover Wells Apt. 814"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (t1:`customers_and_addresses.Customers`)-[t2:`customers_and_addresses.Customer_Addresses`]-(t3:`customers_and_addresses.Addresses`)\nWHERE t3.city = \"Lake Geovannyton\"\nRETURN count(*)",
        "question": "How many customers are living in city \"Lake Geovannyton\"?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (t1:`customers_and_addresses.Customers`)-[t2:`customers_and_addresses.Customer_Addresses`]-(t3:`customers_and_addresses.Addresses`)\nWHERE t3.city = \"Lake Geovannyton\"\nRETURN count(*)",
        "question": "Find the number of customers who live in the city called Lake Geovannyton.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (t1:`customers_and_addresses.Customers`)-[t2:`customers_and_addresses.Customer_Addresses`]-(t3:`customers_and_addresses.Addresses`)\nWITH count(t3.city) AS cnt, t3\nRETURN t3.city\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Which city has the most customers living in?",
        "answers": [
            [
                "Lake Geovannyton"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (addresses:`customers_and_addresses.Addresses`)\nRETURN DISTINCT addresses.city",
        "question": "Retrieve the list of all cities.",
        "answers": [
            [
                "Lucasville"
            ],
            [
                "New Sabryna"
            ],
            [
                "Reingertown"
            ],
            [
                "Gleasonmouth"
            ],
            [
                "Stantonville"
            ],
            [
                "South Meghanview"
            ],
            [
                "Lake Walterton"
            ],
            [
                "South Bellaland"
            ],
            [
                "Felicityfort"
            ],
            [
                "East Julianaside"
            ],
            [
                "Lake Geovannyton"
            ],
            [
                "New Terrillport"
            ],
            [
                "Port Lilyan"
            ],
            [
                "Lake Ryann"
            ],
            [
                "East Pascale"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (addresses:`customers_and_addresses.Addresses`)\nRETURN DISTINCT addresses.city",
        "question": "List all the distinct cities",
        "answers": [
            [
                "Lucasville"
            ],
            [
                "New Sabryna"
            ],
            [
                "Reingertown"
            ],
            [
                "Gleasonmouth"
            ],
            [
                "Stantonville"
            ],
            [
                "South Meghanview"
            ],
            [
                "Lake Walterton"
            ],
            [
                "South Bellaland"
            ],
            [
                "Felicityfort"
            ],
            [
                "East Julianaside"
            ],
            [
                "Lake Geovannyton"
            ],
            [
                "New Terrillport"
            ],
            [
                "Port Lilyan"
            ],
            [
                "Lake Ryann"
            ],
            [
                "East Pascale"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (addresses:`customers_and_addresses.Addresses`)\nWHERE addresses.zip_postcode = '255'\nRETURN addresses.city",
        "question": "Find the city with post code 255.",
        "answers": [
            [
                "Reingertown"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (addresses:`customers_and_addresses.Addresses`)\nWHERE addresses.zip_postcode = '255'\nRETURN addresses.city",
        "question": "Which city is post code 255 located in?",
        "answers": [
            [
                "Reingertown"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (addresses:`customers_and_addresses.Addresses`)\nWITH count(addresses.address_id) AS count, addresses.country AS country\nWHERE count > 4\nRETURN country",
        "question": "List the countries having more than 4 addresses listed.",
        "answers": [
            [
                "USA"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (addresses:`customers_and_addresses.Addresses`)\nWITH count(addresses.address_id) AS count, addresses.country AS country\nWHERE count > 4\nRETURN country",
        "question": "For which countries are there more than four distinct addresses listed?",
        "answers": [
            [
                "USA"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (customer_contact_channels:`customers_and_addresses.Customer_Contact_Channels`)\nWITH count(customer_contact_channels.customer_id) AS count, customer_contact_channels.channel_code AS channel_code\nWHERE count < 5\nRETURN channel_code",
        "question": "List all the contact channel codes that were used less than 5 times.",
        "answers": [
            [
                "Email"
            ],
            [
                "Cell"
            ],
            [
                "Fax"
            ],
            [
                "Mobile"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (customer_contact_channels:`customers_and_addresses.Customer_Contact_Channels`)\nWITH count(customer_contact_channels.customer_id) AS count, customer_contact_channels.channel_code AS channel_code\nWHERE count < 5\nRETURN channel_code",
        "question": "Which contact channel codes were used less than 5 times?",
        "answers": [
            [
                "Email"
            ],
            [
                "Cell"
            ],
            [
                "Fax"
            ],
            [
                "Mobile"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (customer_orders:`customers_and_addresses.Customer_Orders`)\nWHERE customer_orders.order_details = \"Second time\"\nRETURN count(*)",
        "question": "How many orders have detail \"Second time\"?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (customer_orders:`customers_and_addresses.Customer_Orders`)\nWHERE customer_orders.order_details = \"Second time\"\nRETURN count(*)",
        "question": "Tell me the number of orders with \"Second time\" as order detail.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (t1:`customers_and_addresses.Customers`)-[]-(t2:`customers_and_addresses.Customer_Orders`)\nRETURN t1.customer_name\nORDER BY t2.order_date DESC\nLIMIT 1",
        "question": "Who made the latest order?",
        "answers": [
            [
                "Eunice Morar"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (t1:`customers_and_addresses.Customers`)-[]-(t2:`customers_and_addresses.Customer_Orders`)\nRETURN t1.customer_name\nORDER BY t2.order_date DESC\nLIMIT 1",
        "question": "Find the name of the customer who made an order most recently.",
        "answers": [
            [
                "Eunice Morar"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (t2:`customers_and_addresses.Products`)-[t1:`customers_and_addresses.Order_Items`]-()\nWITH count(t1.product_id) AS cnt, t2\nRETURN t2.product_details\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Which product has been ordered most number of times?",
        "answers": [
            [
                "Dove Chocolate"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (t2:`customers_and_addresses.Products`)-[t1:`customers_and_addresses.Order_Items`]-()\nWITH count(t1.product_id) AS cnt, t2\nRETURN t2.product_details\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the most frequently ordered product? Tell me the detail of the product",
        "answers": [
            [
                "Dove Chocolate"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nWHERE customers.payment_method <> 'Cash'\nRETURN customers.customer_name",
        "question": "Find the name of customers who did not pay with Cash.",
        "answers": [
            [
                "Tillman Ernser"
            ],
            [
                "Rodrick Heaney"
            ],
            [
                "Prof. Alexzander Hamill"
            ],
            [
                "Prof. Reyes Berge II"
            ],
            [
                "Mozell Morissette"
            ],
            [
                "Eunice Morar"
            ],
            [
                "Devin Mills"
            ],
            [
                "Salvatore Tillman"
            ],
            [
                "Clifford Pagac"
            ],
            [
                "Miss Aliyah Witting"
            ],
            [
                "Alexane Kilback"
            ]
        ]
    },
    {
        "db_id": "customers_and_addresses",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nWHERE customers.payment_method <> 'Cash'\nRETURN customers.customer_name",
        "question": "What is the name of customers who do not use Cash as payment method.",
        "answers": [
            [
                "Tillman Ernser"
            ],
            [
                "Rodrick Heaney"
            ],
            [
                "Prof. Alexzander Hamill"
            ],
            [
                "Prof. Reyes Berge II"
            ],
            [
                "Mozell Morissette"
            ],
            [
                "Eunice Morar"
            ],
            [
                "Devin Mills"
            ],
            [
                "Salvatore Tillman"
            ],
            [
                "Clifford Pagac"
            ],
            [
                "Miss Aliyah Witting"
            ],
            [
                "Alexane Kilback"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN count(*)",
        "question": "How many artists are there?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN count(*)",
        "question": "Count the number of artists.",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN artist.Age",
        "question": "List the age of all music artists.",
        "answers": [
            [
                34
            ],
            [
                35
            ],
            [
                22
            ],
            [
                18
            ],
            [
                35
            ],
            [
                27
            ],
            [
                49
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN artist.Age",
        "question": "What are the ages of all music artists?",
        "answers": [
            [
                34
            ],
            [
                35
            ],
            [
                22
            ],
            [
                18
            ],
            [
                35
            ],
            [
                27
            ],
            [
                49
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN avg(artist.Age)",
        "question": "What is the average age of all artists?",
        "answers": [
            [
                31.428571428571427
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN avg(artist.Age)",
        "question": "Return the average age across all artists.",
        "answers": [
            [
                31.428571428571427
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nWHERE artist.Artist = 'Triumfall'\nRETURN artist.Famous_Title",
        "question": "What are the famous titles of the artist \"Triumfall\"?",
        "answers": [
            [
                "Antithesis of All Flesh"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nWHERE artist.Artist = 'Triumfall'\nRETURN artist.Famous_Title",
        "question": "Return the famous titles of the artist called \"Triumfall\".",
        "answers": [
            [
                "Antithesis of All Flesh"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN DISTINCT artist.Famous_Release_date",
        "question": "What are the distinct Famous release dates?",
        "answers": [
            [
                "November 2007"
            ],
            [
                "January 21, 2008"
            ],
            [
                "2009"
            ],
            [
                "June 23, 2008"
            ],
            [
                "June 15, 2009"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN DISTINCT artist.Famous_Release_date",
        "question": "Give the distinct famous release dates for all artists.",
        "answers": [
            [
                "November 2007"
            ],
            [
                "January 21, 2008"
            ],
            [
                "2009"
            ],
            [
                "June 23, 2008"
            ],
            [
                "June 15, 2009"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nRETURN music_festival.Date_of_ceremony,music_festival.Result",
        "question": "Return the dates of ceremony and the results of all music festivals",
        "answers": [
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Awarded"
            ],
            [
                "18 February 2011",
                "Awarded"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Awarded"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nRETURN music_festival.Date_of_ceremony,music_festival.Result",
        "question": "What are the dates of ceremony and results for each music festival?",
        "answers": [
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Awarded"
            ],
            [
                "18 February 2011",
                "Awarded"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Awarded"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nWHERE music_festival.Result = 'Awarded'\nRETURN music_festival.Category",
        "question": "What are the category of music festivals with result \"Awarded\"?",
        "answers": [
            [
                "Best Song"
            ],
            [
                "Best Song"
            ],
            [
                "Best Sound Song"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nWHERE music_festival.Result = 'Awarded'\nRETURN music_festival.Category",
        "question": "Return the categories of music festivals that have the result \"Awarded\".",
        "answers": [
            [
                "Best Song"
            ],
            [
                "Best Song"
            ],
            [
                "Best Sound Song"
            ]
        ]
    },
    {
        "db_id": "music_4",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN max(volume.Weeks_on_Top),min(volume.Weeks_on_Top)",
        "question": "What are the maximum and minimum week on top of all volumes?",
        "answers": [
            [
                3.0,
                1.0
            ]
        ]
    }
]