[
    {
        "db_id": "college_1",
        "query": "MATCH (class:`college_1.CLASS`)\nRETURN count(DISTINCT class.CLASS_CODE)",
        "question": "How many unique classes are offered?",
        "answers": [
            [
                13
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (class:`college_1.CLASS`)\nRETURN count(DISTINCT class.CRS_CODE)",
        "question": "How many courses are offered?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (class:`college_1.CLASS`)\nRETURN count(DISTINCT class.CRS_CODE)",
        "question": "What are the number of different course codes?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nRETURN count(DISTINCT department.DEPT_NAME)",
        "question": "How many departments does the college has?",
        "answers": [
            [
                11
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nRETURN count(DISTINCT department.DEPT_NAME)",
        "question": "How many different departments are there?",
        "answers": [
            [
                11
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[T2:`college_1.ENROLL`]-()\nWHERE T1.CRS_CODE = 'ACCT-211'\nRETURN count(*)",
        "question": "How many students enrolled in class ACCT-211?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[T2:`college_1.ENROLL`]-()\nWHERE T1.CRS_CODE = 'ACCT-211'\nRETURN count(*)",
        "question": "What are the total number of students enrolled in ACCT-211?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[T2:`college_1.ENROLL`]-(T3:`college_1.STUDENT`)\nWHERE T1.CRS_CODE = 'ACCT-211'\nRETURN T3.STU_FNAME",
        "question": "What is the first name of each student enrolled in class ACCT-211?",
        "answers": [
            [
                "Anne"
            ],
            [
                "William"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[T2:`college_1.ENROLL`]-(T3:`college_1.STUDENT`)\nWHERE T1.CRS_CODE = 'ACCT-211'\nRETURN T3.STU_FNAME",
        "question": "What are the first names of all students in course ACCT-211?",
        "answers": [
            [
                "Anne"
            ],
            [
                "William"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[T2:`college_1.ENROLL`]-(T3:`college_1.STUDENT`)\nWHERE T1.CRS_CODE = 'ACCT-211' AND T2.ENROLL_GRADE = 'C'\nRETURN T3.STU_FNAME",
        "question": "What is the first name of students enrolled in class ACCT-211 and got grade C?",
        "answers": [
            [
                "William"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[T2:`college_1.ENROLL`]-(T3:`college_1.STUDENT`)\nWHERE T1.CRS_CODE = 'ACCT-211' AND T2.ENROLL_GRADE = 'C'\nRETURN T3.STU_FNAME",
        "question": "What are the first names of all students who took ACCT-211 and received a C?",
        "answers": [
            [
                "William"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (employee:`college_1.EMPLOYEE`)\nRETURN count(*)",
        "question": "Find the total number of employees.",
        "answers": [
            [
                37
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (employee:`college_1.EMPLOYEE`)\nRETURN count(*)",
        "question": "How many employees are there all together?",
        "answers": [
            [
                37
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nRETURN department.DEPT_NAME\nORDER BY department.DEPT_NAME",
        "question": "list names of all departments ordered by their names.",
        "answers": [
            [
                "Accounting"
            ],
            [
                "Biology"
            ],
            [
                "Computer Info. Systems"
            ],
            [
                "Economics/Finance"
            ],
            [
                "English"
            ],
            [
                "Fine Arts"
            ],
            [
                "History"
            ],
            [
                "Marketing/Management"
            ],
            [
                "Mathematics"
            ],
            [
                "Psychology"
            ],
            [
                "Sociology"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nRETURN department.DEPT_NAME\nORDER BY department.DEPT_NAME",
        "question": "What are the names of all departments in alphabetical order?",
        "answers": [
            [
                "Accounting"
            ],
            [
                "Biology"
            ],
            [
                "Computer Info. Systems"
            ],
            [
                "Economics/Finance"
            ],
            [
                "English"
            ],
            [
                "Fine Arts"
            ],
            [
                "History"
            ],
            [
                "Marketing/Management"
            ],
            [
                "Mathematics"
            ],
            [
                "Psychology"
            ],
            [
                "Sociology"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (class:`college_1.CLASS`)\nWHERE class.CLASS_ROOM = 'KLR209'\nRETURN class.CLASS_CODE",
        "question": "List the codes of all courses that take place in room KLR209.",
        "answers": [
            [
                "10017"
            ],
            [
                "10019"
            ],
            [
                "10020"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (class:`college_1.CLASS`)\nWHERE class.CLASS_ROOM = 'KLR209'\nRETURN class.CLASS_CODE",
        "question": "What are the codes of all the courses that are located in room KLR209?",
        "answers": [
            [
                "10017"
            ],
            [
                "10019"
            ],
            [
                "10020"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (employee:`college_1.EMPLOYEE`)\nWHERE employee.EMP_JOBCODE = 'PROF'\nRETURN employee.EMP_FNAME\nORDER BY employee.EMP_DOB",
        "question": "List the first name of all employees with job code PROF ordered by their date of birth.",
        "answers": [
            [
                "Robert"
            ],
            [
                "Gerald"
            ],
            [
                "Peter"
            ],
            [
                "Ross"
            ],
            [
                "Ronald"
            ],
            [
                "James"
            ],
            [
                "Melanie"
            ],
            [
                "George"
            ],
            [
                "Preston"
            ],
            [
                "Carlos"
            ],
            [
                "Arnelle"
            ],
            [
                "Hermine"
            ],
            [
                "Van"
            ],
            [
                "Ronald"
            ],
            [
                "Ismael"
            ],
            [
                "Willa"
            ],
            [
                "Herman"
            ],
            [
                "Robert"
            ],
            [
                "Annelise"
            ],
            [
                "Doreen"
            ],
            [
                "Anne"
            ],
            [
                "Ralph"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (employee:`college_1.EMPLOYEE`)\nWHERE employee.EMP_JOBCODE = 'PROF'\nRETURN employee.EMP_FNAME\nORDER BY employee.EMP_DOB",
        "question": "What are the first names of all employees that are professors ordered by date of birth?",
        "answers": [
            [
                "Robert"
            ],
            [
                "Gerald"
            ],
            [
                "Peter"
            ],
            [
                "Ross"
            ],
            [
                "Ronald"
            ],
            [
                "James"
            ],
            [
                "Melanie"
            ],
            [
                "George"
            ],
            [
                "Preston"
            ],
            [
                "Carlos"
            ],
            [
                "Arnelle"
            ],
            [
                "Hermine"
            ],
            [
                "Van"
            ],
            [
                "Ronald"
            ],
            [
                "Ismael"
            ],
            [
                "Willa"
            ],
            [
                "Herman"
            ],
            [
                "Robert"
            ],
            [
                "Annelise"
            ],
            [
                "Doreen"
            ],
            [
                "Anne"
            ],
            [
                "Ralph"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T2:`college_1.EMPLOYEE`)-[T1:`college_1.PROFESSOR`]-()\nRETURN T2.EMP_FNAME,T1.PROF_OFFICE\nORDER BY T2.EMP_FNAME",
        "question": "Find the first names and offices of all professors sorted by alphabetical order of their first name.",
        "answers": [
            [
                "Anne",
                "BBG 185"
            ],
            [
                "Annelise",
                "AAK 201"
            ],
            [
                "Arnelle",
                "KLR 229D"
            ],
            [
                "Carlos",
                "KLR 300"
            ],
            [
                "Doreen",
                "KLR 284"
            ],
            [
                "George",
                "AAK 230"
            ],
            [
                "Gerald",
                "KLR 211"
            ],
            [
                "Herman",
                "AAK 297"
            ],
            [
                "Hermine",
                "AAK 194"
            ],
            [
                "Ismael",
                "KLR 244"
            ],
            [
                "James",
                "DRE 156"
            ],
            [
                "Melanie",
                "KLR 333"
            ],
            [
                "Peter",
                "KLR 203E"
            ],
            [
                "Preston",
                "DRE 102"
            ],
            [
                "Ralph",
                "KLR 284"
            ],
            [
                "Robert",
                "DRE 102"
            ],
            [
                "Robert",
                "BBG 208"
            ],
            [
                "Ronald",
                "DRE 156"
            ],
            [
                "Ronald",
                "DRE 208"
            ],
            [
                "Ross",
                "KLR 126"
            ],
            [
                "Van",
                "AAK 160"
            ],
            [
                "Willa",
                "KLR 409B"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T2:`college_1.EMPLOYEE`)-[T1:`college_1.PROFESSOR`]-()\nRETURN T2.EMP_FNAME,T1.PROF_OFFICE\nORDER BY T2.EMP_FNAME",
        "question": "What are the first names and office locations for all professors sorted alphabetically by first name?",
        "answers": [
            [
                "Anne",
                "BBG 185"
            ],
            [
                "Annelise",
                "AAK 201"
            ],
            [
                "Arnelle",
                "KLR 229D"
            ],
            [
                "Carlos",
                "KLR 300"
            ],
            [
                "Doreen",
                "KLR 284"
            ],
            [
                "George",
                "AAK 230"
            ],
            [
                "Gerald",
                "KLR 211"
            ],
            [
                "Herman",
                "AAK 297"
            ],
            [
                "Hermine",
                "AAK 194"
            ],
            [
                "Ismael",
                "KLR 244"
            ],
            [
                "James",
                "DRE 156"
            ],
            [
                "Melanie",
                "KLR 333"
            ],
            [
                "Peter",
                "KLR 203E"
            ],
            [
                "Preston",
                "DRE 102"
            ],
            [
                "Ralph",
                "KLR 284"
            ],
            [
                "Robert",
                "DRE 102"
            ],
            [
                "Robert",
                "BBG 208"
            ],
            [
                "Ronald",
                "DRE 156"
            ],
            [
                "Ronald",
                "DRE 208"
            ],
            [
                "Ross",
                "KLR 126"
            ],
            [
                "Van",
                "AAK 160"
            ],
            [
                "Willa",
                "KLR 409B"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (employee:`college_1.EMPLOYEE`)\nRETURN employee.EMP_FNAME,employee.EMP_LNAME\nORDER BY employee.EMP_DOB\nLIMIT 1",
        "question": "What is the first and last name of the oldest employee?",
        "answers": [
            [
                "Robert",
                "Smith"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (employee:`college_1.EMPLOYEE`)\nRETURN employee.EMP_FNAME,employee.EMP_LNAME\nORDER BY employee.EMP_DOB\nLIMIT 1",
        "question": "What are the first and last names of the employee with the earliest date of birth?",
        "answers": [
            [
                "Robert",
                "Smith"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (student:`college_1.STUDENT`)\nWHERE student.STU_GPA > 3\nRETURN student.STU_FNAME,student.STU_LNAME,student.STU_GPA\nORDER BY student.STU_DOB DESC\nLIMIT 1",
        "question": "What is the first, last name, gpa of the youngest one among students whose GPA is above 3?",
        "answers": [
            [
                "Anne",
                "Smithson",
                3.27
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (student:`college_1.STUDENT`)\nWHERE student.STU_GPA > 3\nRETURN student.STU_FNAME,student.STU_LNAME,student.STU_GPA\nORDER BY student.STU_DOB DESC\nLIMIT 1",
        "question": "What is the first and last name of the youngest student with a GPA above 3, and what is their GPA?",
        "answers": [
            [
                "Anne",
                "Smithson",
                3.27
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T2:`college_1.DEPARTMENT`)-[T1:`college_1.PROFESSOR`]-()\nWITH count(T1.DEPT_CODE) AS cnt, T2\nRETURN T2.DEPT_NAME\nORDER BY cnt\nLIMIT 1",
        "question": "What is the name of department where has the smallest number of professors?",
        "answers": [
            [
                "Fine Arts"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T2:`college_1.DEPARTMENT`)-[T1:`college_1.PROFESSOR`]-()\nWITH count(T1.DEPT_CODE) AS cnt, T2\nRETURN T2.DEPT_NAME\nORDER BY cnt\nLIMIT 1",
        "question": "What is the name of the department with the fewest professors?",
        "answers": [
            [
                "Fine Arts"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.EMPLOYEE`)-[T2:`college_1.PROFESSOR`]-(T3:`college_1.DEPARTMENT`)\nWHERE T3.DEPT_NAME = 'History'\nRETURN T1.EMP_LNAME,T2.PROF_OFFICE",
        "question": "What is the last name and office of the professor from the history department?",
        "answers": [
            [
                "Blalock",
                "DRE 156"
            ],
            [
                "Donelly",
                "DRE 156"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.EMPLOYEE`)-[T2:`college_1.PROFESSOR`]-(T3:`college_1.DEPARTMENT`)\nWHERE T3.DEPT_NAME = 'History'\nRETURN T1.EMP_LNAME,T2.PROF_OFFICE",
        "question": "What are the last name and office of all history professors?",
        "answers": [
            [
                "Blalock",
                "DRE 156"
            ],
            [
                "Donelly",
                "DRE 156"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.EMPLOYEE`)-[T2:`college_1.PROFESSOR`]-(T3:`college_1.DEPARTMENT`)\nWHERE T1.EMP_LNAME = 'Heffington'\nRETURN T3.DEPT_NAME,T2.PROF_OFFICE",
        "question": "What is department name and office for the professor whose last name is Heffington?",
        "answers": [
            [
                "Accounting",
                "KLR 229D"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.EMPLOYEE`)-[T2:`college_1.PROFESSOR`]-(T3:`college_1.DEPARTMENT`)\nWHERE T1.EMP_LNAME = 'Heffington'\nRETURN T3.DEPT_NAME,T2.PROF_OFFICE",
        "question": "What is the name of the department and office location for the professor with the last name of Heffington?",
        "answers": [
            [
                "Accounting",
                "KLR 229D"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.EMPLOYEE`)-[T2:`college_1.PROFESSOR`]-()\nWHERE T2.PROF_OFFICE = 'DRE 102'\nRETURN T1.EMP_LNAME,T1.EMP_HIREDATE",
        "question": "Find the last name and hire date of the professor who is in office DRE 102.",
        "answers": [
            [
                "Yukon",
                "1992-5-1"
            ],
            [
                "Smith",
                "1992-8-1"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.EMPLOYEE`)-[T2:`college_1.PROFESSOR`]-()\nWHERE T2.PROF_OFFICE = 'DRE 102'\nRETURN T1.EMP_LNAME,T1.EMP_HIREDATE",
        "question": "What is the last name of the professor whose office is located in DRE 102, and when were they hired?",
        "answers": [
            [
                "Yukon",
                "1992-5-1"
            ],
            [
                "Smith",
                "1992-8-1"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[T2:`college_1.ENROLL`]-(T3:`college_1.STUDENT`)\nWHERE T3.STU_LNAME = 'Smithson'\nRETURN T1.CRS_CODE",
        "question": "What is the code of the course which the student whose last name is Smithson took?",
        "answers": [
            [
                "ACCT-211"
            ],
            [
                "CIS-220"
            ],
            [
                "QM-261"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[T2:`college_1.ENROLL`]-(T3:`college_1.STUDENT`)\nWHERE T3.STU_LNAME = 'Smithson'\nRETURN T1.CRS_CODE",
        "question": "What are the course codes for every class that the student with the last name Smithson took?",
        "answers": [
            [
                "ACCT-211"
            ],
            [
                "CIS-220"
            ],
            [
                "QM-261"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T2:`college_1.DEPARTMENT`)-[T1:`college_1.PROFESSOR`]-()\nWHERE T2.DEPT_NAME = 'Accounting' OR T2.DEPT_NAME = 'Biology'\nRETURN count(*)",
        "question": "How many professors who are from either Accounting or Biology department?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T2:`college_1.DEPARTMENT`)-[T1:`college_1.PROFESSOR`]-()\nWHERE T2.DEPT_NAME = 'Accounting' OR T2.DEPT_NAME = 'Biology'\nRETURN count(*)",
        "question": "What is the number of professors who are in the Accounting or Biology departments?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (student:`college_1.STUDENT`)\nRETURN student.STU_GPA,student.STU_PHONE,student.STU_FNAME\nORDER BY student.STU_GPA DESC\nLIMIT 5",
        "question": "What is the first name, gpa and phone number of the top 5 students with highest gpa?",
        "answers": [
            [
                3.87,
                "2267",
                "Gerald"
            ],
            [
                3.27,
                "2256",
                "Anne"
            ],
            [
                3.15,
                "2267",
                "Raphael"
            ],
            [
                3.09,
                "2114",
                "Walter"
            ],
            [
                2.92,
                "2315",
                "John"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (student:`college_1.STUDENT`)\nRETURN student.STU_GPA,student.STU_PHONE,student.STU_FNAME\nORDER BY student.STU_GPA DESC\nLIMIT 5",
        "question": "What is the first name, GPA, and phone number of the students with the top 5 GPAs?",
        "answers": [
            [
                3.87,
                "2267",
                "Gerald"
            ],
            [
                3.27,
                "2256",
                "Anne"
            ],
            [
                3.15,
                "2267",
                "Raphael"
            ],
            [
                3.09,
                "2114",
                "Walter"
            ],
            [
                2.92,
                "2315",
                "John"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.STUDENT`)-[]-(T2:`college_1.DEPARTMENT`)\nRETURN T2.DEPT_NAME\nORDER BY T1.STU_GPA\nLIMIT 1",
        "question": "What is the department name of the students with lowest gpa belongs to?",
        "answers": [
            [
                "Accounting"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.STUDENT`)-[]-(T2:`college_1.DEPARTMENT`)\nRETURN T2.DEPT_NAME\nORDER BY T1.STU_GPA\nLIMIT 1",
        "question": "What is the name of the department with the student that has the lowest GPA?",
        "answers": [
            [
                "Accounting"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (student:`college_1.STUDENT`)\nWITH avg(student.STU_GPA) AS stu_gpa\nMATCH (student:`college_1.STUDENT`)\nWHERE  student.STU_GPA <  stu_gpa \nRETURN student.STU_FNAME,student.STU_GPA",
        "question": "Find the first name and gpa of the students whose gpa is lower than the average gpa of all students.",
        "answers": [
            [
                "William",
                2.84
            ],
            [
                "Juliette",
                2.26
            ],
            [
                "John",
                2.11
            ],
            [
                "John",
                2.92
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (student:`college_1.STUDENT`)\nWITH avg(student.STU_GPA) AS stu_gpa\nMATCH (student:`college_1.STUDENT`)\nWHERE  student.STU_GPA <  stu_gpa \nRETURN student.STU_FNAME,student.STU_GPA",
        "question": "What is the first name and GPA of every student that has a GPA lower than average?",
        "answers": [
            [
                "William",
                2.84
            ],
            [
                "Juliette",
                2.26
            ],
            [
                "John",
                2.11
            ],
            [
                "John",
                2.92
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.STUDENT`)-[]-(T2:`college_1.DEPARTMENT`)\nWITH count(T1.DEPT_CODE) AS cnt, T2\nRETURN T2.DEPT_NAME,T2.DEPT_ADDRESS\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Find the name and address of the department that has the highest number of students.",
        "answers": [
            [
                "Accounting",
                "KLR 211, Box 52"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.STUDENT`)-[]-(T2:`college_1.DEPARTMENT`)\nWITH count(T1.DEPT_CODE) AS cnt, T2\nRETURN T2.DEPT_NAME,T2.DEPT_ADDRESS\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the name and address of the department with the most students?",
        "answers": [
            [
                "Accounting",
                "KLR 211, Box 52"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[]-(T2:`college_1.EMPLOYEE`)\nRETURN T2.EMP_FNAME,T1.CRS_CODE",
        "question": "Find the first names of all instructors who have taught some course and the course code.",
        "answers": [
            [
                "Arnelle",
                "ACCT-211"
            ],
            [
                "Arnelle",
                "ACCT-211"
            ],
            [
                "Robert",
                "ACCT-211"
            ],
            [
                "Ismael",
                "ACCT-212"
            ],
            [
                "Ismael",
                "ACCT-212"
            ],
            [
                "Carlos",
                "CIS-220"
            ],
            [
                "Gerald",
                "CIS-220"
            ],
            [
                "Carlos",
                "CIS-220"
            ],
            [
                "Peter",
                "CIS-420"
            ],
            [
                "Gerald",
                "QM-261"
            ],
            [
                "Gerald",
                "QM-261"
            ],
            [
                "Peter",
                "QM-362"
            ],
            [
                "Peter",
                "QM-362"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[]-(T2:`college_1.EMPLOYEE`)\nRETURN T2.EMP_FNAME,T1.CRS_CODE",
        "question": "What are the first names of all teachers who have taught a course and the corresponding course codes?",
        "answers": [
            [
                "Arnelle",
                "ACCT-211"
            ],
            [
                "Arnelle",
                "ACCT-211"
            ],
            [
                "Robert",
                "ACCT-211"
            ],
            [
                "Ismael",
                "ACCT-212"
            ],
            [
                "Ismael",
                "ACCT-212"
            ],
            [
                "Carlos",
                "CIS-220"
            ],
            [
                "Gerald",
                "CIS-220"
            ],
            [
                "Carlos",
                "CIS-220"
            ],
            [
                "Peter",
                "CIS-420"
            ],
            [
                "Gerald",
                "QM-261"
            ],
            [
                "Gerald",
                "QM-261"
            ],
            [
                "Peter",
                "QM-362"
            ],
            [
                "Peter",
                "QM-362"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.STUDENT`)-[T2:`college_1.ENROLL`]-()\nWHERE T2.ENROLL_GRADE = 'C' OR T2.ENROLL_GRADE = 'A'\nRETURN T1.STU_FNAME,T1.STU_LNAME",
        "question": "Find names of all students who took some course and got A or C.",
        "answers": [
            [
                "William",
                "Bowser"
            ],
            [
                "William",
                "Bowser"
            ],
            [
                "William",
                "Bowser"
            ],
            [
                "Anne",
                "Smithson"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.STUDENT`)-[T2:`college_1.ENROLL`]-()\nWHERE T2.ENROLL_GRADE = 'C' OR T2.ENROLL_GRADE = 'A'\nRETURN T1.STU_FNAME,T1.STU_LNAME",
        "question": "What are the names of all students taking a course who received an A or C?",
        "answers": [
            [
                "William",
                "Bowser"
            ],
            [
                "William",
                "Bowser"
            ],
            [
                "William",
                "Bowser"
            ],
            [
                "Anne",
                "Smithson"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[]-(T2:`college_1.EMPLOYEE`)\nWITH count(*) AS count, T2.EMP_FNAME AS EMP_FNAME\nWHERE count  > 1\nRETURN EMP_FNAME",
        "question": "Find the first names of professors who are teaching more than one class.",
        "answers": [
            [
                "Arnelle"
            ],
            [
                "Ismael"
            ],
            [
                "Carlos"
            ],
            [
                "Gerald"
            ],
            [
                "Peter"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[]-(T2:`college_1.EMPLOYEE`)\nWITH count(*) AS count, T2.EMP_FNAME AS EMP_FNAME\nWHERE count  > 1\nRETURN EMP_FNAME",
        "question": "What are the first names of all professors who teach more than one class?",
        "answers": [
            [
                "Arnelle"
            ],
            [
                "Ismael"
            ],
            [
                "Carlos"
            ],
            [
                "Gerald"
            ],
            [
                "Peter"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.STUDENT`)-[T2:`college_1.ENROLL`]-()\nWITH count(*) AS count, T1.STU_FNAME AS STU_FNAME\nWHERE count  = 1\nRETURN STU_FNAME",
        "question": "Find the first names of students who took exactly one class.",
        "answers": []
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.STUDENT`)-[T2:`college_1.ENROLL`]-()\nWITH count(*) AS count, T1.STU_FNAME AS STU_FNAME\nWHERE count  = 1\nRETURN STU_FNAME",
        "question": "What are the first names of student who only took one course?",
        "answers": []
    }
]