[
    {
        "db_id": "body_builder",
        "query": "MATCH (people:`body_builder.people`)\nRETURN people.Height,people.Weight\nORDER BY people.Height DESC",
        "question": "List the height and weight of people in descending order of height.",
        "answers": [
            [
                215.0,
                102.0
            ],
            [
                205.0,
                92.0
            ],
            [
                196.0,
                89.0
            ],
            [
                195.0,
                100.0
            ],
            [
                192.0,
                90.0
            ],
            [
                182.0,
                80.0
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (people:`body_builder.people`)\nRETURN count(DISTINCT people.Birth_Place)",
        "question": "How many distinct birth places are there?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (people:`body_builder.people`)\nWHERE NOT (people)-[]-(:`body_builder.body_builder`)    \nRETURN count(*)",
        "question": "How many persons are not body builders?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (T1:`body_builder.body_builder`)-[]-(T2:`body_builder.people`)\nWHERE T1.Snatch > 140 OR T2.Height > 200\nRETURN T2.Weight",
        "question": "List the weight of the body builders who have snatch score higher than 140 or have the height greater than 200.",
        "answers": [
            [
                80.0
            ],
            [
                92.0
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (body_builder:`body_builder.body_builder`)\nRETURN min(body_builder.Snatch)",
        "question": "What is the minimum snatch score?",
        "answers": [
            [
                130.0
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (election:`election_representative.election`)\nRETURN count(*)",
        "question": "How many elections are there?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (election:`election_representative.election`)\nRETURN election.Votes\nORDER BY election.Votes DESC",
        "question": "List the votes of elections in descending order.",
        "answers": [
            [
                14077.0
            ],
            [
                13049.0
            ],
            [
                12422.0
            ],
            [
                11059.0
            ],
            [
                9423.0
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (election:`election_representative.election`)\nRETURN election.Date,election.Vote_Percent",
        "question": "List the dates and vote percents of elections.",
        "answers": [
            [
                "July 1942",
                16.2
            ],
            [
                "October 1942",
                18.5
            ],
            [
                "1946",
                19.5
            ],
            [
                "1949",
                19.5
            ],
            [
                "1953",
                16.0
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (election:`election_representative.election`)\nRETURN min(election.Vote_Percent),max(election.Vote_Percent)",
        "question": "What are the minimum and maximum vote percents of elections?",
        "answers": [
            [
                16.0,
                19.5
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (representative:`election_representative.representative`)\nRETURN representative.Name,representative.Party",
        "question": "What are the names and parties of representatives?",
        "answers": [
            [
                "Dan Quayle",
                "Republican"
            ],
            [
                "John Quayle",
                "Democratic"
            ],
            [
                "Al Quie",
                "Republican"
            ],
            [
                "James M. Quigley",
                "Democratic"
            ],
            [
                "Jimmy Quillen",
                "Republican"
            ],
            [
                "Jack Quinn",
                "Republican"
            ],
            [
                "James L. Quinn",
                "Democratic"
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (representative:`election_representative.representative`)\nWHERE representative.Party <> 'Republican'\nRETURN representative.Name",
        "question": "What are the names of representatives whose party is not \"Republican\"?",
        "answers": [
            [
                "John Quayle"
            ],
            [
                "James M. Quigley"
            ],
            [
                "James L. Quinn"
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (representative:`election_representative.representative`)\nWHERE representative.State = 'New York' OR representative.State = 'Indiana'\nRETURN representative.Lifespan",
        "question": "What are the life spans of representatives from New York state or Indiana state?",
        "answers": [
            [
                "1947\u2013"
            ],
            [
                "1868\u20131930"
            ],
            [
                "1951\u2013"
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (T1:`election_representative.election`)-[]-(T2:`election_representative.representative`)\nRETURN T2.Name,T1.Date",
        "question": "What are the names of representatives and the dates of elections they participated in.",
        "answers": [
            [
                "Dan Quayle",
                "July 1942"
            ],
            [
                "John Quayle",
                "October 1942"
            ],
            [
                "James M. Quigley",
                "1946"
            ],
            [
                "Jimmy Quillen",
                "1949"
            ],
            [
                "James L. Quinn",
                "1953"
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (T1:`election_representative.election`)-[]-(T2:`election_representative.representative`)\nWHERE T1.Votes > 10000\nRETURN T2.Name",
        "question": "What are the names of representatives with more than 10000 votes in election?",
        "answers": [
            [
                "John Quayle"
            ],
            [
                "James M. Quigley"
            ],
            [
                "Jimmy Quillen"
            ],
            [
                "James L. Quinn"
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (T1:`election_representative.election`)-[]-(T2:`election_representative.representative`)\nRETURN T2.Name\nORDER BY T1.Votes DESC",
        "question": "What are the names of representatives in descending order of votes?",
        "answers": [
            [
                "Jimmy Quillen"
            ],
            [
                "James M. Quigley"
            ],
            [
                "James L. Quinn"
            ],
            [
                "John Quayle"
            ],
            [
                "Dan Quayle"
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (T1:`election_representative.election`)-[]-(T2:`election_representative.representative`)\nRETURN T2.Party\nORDER BY T1.Votes ASC\nLIMIT 1",
        "question": "What is the party of the representative that has the smallest number of votes.",
        "answers": [
            [
                "Republican"
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (T1:`election_representative.election`)-[]-(T2:`election_representative.representative`)\nRETURN T2.Lifespan\nORDER BY T1.Vote_Percent DESC",
        "question": "What are the lifespans of representatives in descending order of vote percent?",
        "answers": [
            [
                "1918\u2013"
            ],
            [
                "1916\u20132003"
            ],
            [
                "1868\u20131930"
            ],
            [
                "1947\u2013"
            ],
            [
                "1875\u20131960"
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (representative:`election_representative.representative`)\nRETURN representative.Party,count(*)",
        "question": "What are the different parties of representative? Show the party name and the number of representatives in each party.",
        "answers": [
            [
                "Republican",
                4
            ],
            [
                "Democratic",
                3
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (representative:`election_representative.representative`)\nRETURN representative.Party,count(*)\nORDER BY representative.Party DESC\nLIMIT 1",
        "question": "What is the party that has the largest number of representatives?",
        "answers": [
            [
                "Republican",
                4
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (representative:`election_representative.representative`)\nWITH count(*) AS count, representative.Party AS Party\nWHERE count  >= 3\nRETURN Party",
        "question": "What parties have at least three representatives?",
        "answers": [
            [
                "Republican"
            ],
            [
                "Democratic"
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (representative:`election_representative.representative`)\nWITH count(*) AS count, representative.State AS State\nWHERE count  >= 2\nRETURN State",
        "question": "What states have at least two representatives?",
        "answers": [
            [
                "New York"
            ],
            [
                "Pennsylvania"
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (representative:`election_representative.representative`)\nWHERE NOT (representative)-[]-(:`election_representative.election`)    \nRETURN representative.Name",
        "question": "List the names of representatives that have not participated in elections listed here.",
        "answers": [
            [
                "Al Quie"
            ],
            [
                "Jack Quinn"
            ]
        ]
    },
    {
        "db_id": "election_representative",
        "query": "MATCH (representative:`election_representative.representative`)\nRETURN count(DISTINCT representative.Party)",
        "question": "How many distinct parties are there for representatives?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartment_bookings:`apartment_rentals.Apartment_Bookings`)\nRETURN count(*)",
        "question": "How many apartment bookings are there in total?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartment_bookings:`apartment_rentals.Apartment_Bookings`)\nRETURN count(*)",
        "question": "Count the total number of apartment bookings.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartment_bookings:`apartment_rentals.Apartment_Bookings`)\nRETURN apartment_bookings.booking_start_date,apartment_bookings.booking_end_date",
        "question": "Show the start dates and end dates of all the apartment bookings.",
        "answers": [
            [
                "2016-09-26 17:13:49",
                "2017-10-07 11:38:48"
            ],
            [
                "2016-04-01 06:28:08",
                "2017-10-25 11:08:42"
            ],
            [
                "2017-03-13 16:20:14",
                "2018-02-19 16:59:08"
            ],
            [
                "2016-08-04 10:33:00",
                "2017-09-29 12:43:50"
            ],
            [
                "2017-02-11 14:34:14",
                "2017-10-07 20:47:19"
            ],
            [
                "2016-05-24 20:09:38",
                "2017-10-03 01:56:21"
            ],
            [
                "2016-07-25 02:57:04",
                "2017-09-28 11:08:15"
            ],
            [
                "2016-11-26 05:04:31",
                "2018-02-25 15:15:37"
            ],
            [
                "2017-05-13 18:17:20",
                "2017-10-06 11:15:58"
            ],
            [
                "2017-03-04 02:23:49",
                "2018-02-06 16:57:05"
            ],
            [
                "2016-06-07 05:05:18",
                "2017-11-13 13:59:45"
            ],
            [
                "2016-04-17 12:53:59",
                "2018-03-20 17:32:58"
            ],
            [
                "2016-09-28 05:00:50",
                "2017-09-30 18:41:04"
            ],
            [
                "2017-04-07 04:53:27",
                "2017-11-29 12:59:42"
            ],
            [
                "2017-07-03 14:15:56",
                "2017-11-12 01:05:09"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartment_bookings:`apartment_rentals.Apartment_Bookings`)\nRETURN apartment_bookings.booking_start_date,apartment_bookings.booking_end_date",
        "question": "What are the start date and end date of each apartment booking?",
        "answers": [
            [
                "2016-09-26 17:13:49",
                "2017-10-07 11:38:48"
            ],
            [
                "2016-04-01 06:28:08",
                "2017-10-25 11:08:42"
            ],
            [
                "2017-03-13 16:20:14",
                "2018-02-19 16:59:08"
            ],
            [
                "2016-08-04 10:33:00",
                "2017-09-29 12:43:50"
            ],
            [
                "2017-02-11 14:34:14",
                "2017-10-07 20:47:19"
            ],
            [
                "2016-05-24 20:09:38",
                "2017-10-03 01:56:21"
            ],
            [
                "2016-07-25 02:57:04",
                "2017-09-28 11:08:15"
            ],
            [
                "2016-11-26 05:04:31",
                "2018-02-25 15:15:37"
            ],
            [
                "2017-05-13 18:17:20",
                "2017-10-06 11:15:58"
            ],
            [
                "2017-03-04 02:23:49",
                "2018-02-06 16:57:05"
            ],
            [
                "2016-06-07 05:05:18",
                "2017-11-13 13:59:45"
            ],
            [
                "2016-04-17 12:53:59",
                "2018-03-20 17:32:58"
            ],
            [
                "2016-09-28 05:00:50",
                "2017-09-30 18:41:04"
            ],
            [
                "2017-04-07 04:53:27",
                "2017-11-29 12:59:42"
            ],
            [
                "2017-07-03 14:15:56",
                "2017-11-12 01:05:09"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartment_buildings:`apartment_rentals.Apartment_Buildings`)\nRETURN DISTINCT apartment_buildings.building_description",
        "question": "Show all distinct building descriptions.",
        "answers": [
            [
                "Studio"
            ],
            [
                "Flat"
            ],
            [
                "Duplex"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartment_buildings:`apartment_rentals.Apartment_Buildings`)\nRETURN DISTINCT apartment_buildings.building_description",
        "question": "Give me a list of all the distinct building descriptions.",
        "answers": [
            [
                "Studio"
            ],
            [
                "Flat"
            ],
            [
                "Duplex"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN min(apartments.bathroom_count),max(apartments.bathroom_count)",
        "question": "What is the minimum and maximum number of bathrooms of all the apartments?",
        "answers": [
            [
                1,
                3
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN min(apartments.bathroom_count),max(apartments.bathroom_count)",
        "question": "Give me the minimum and maximum bathroom count among all the apartments.",
        "answers": [
            [
                1,
                3
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN apartments.apt_number,apartments.room_count",
        "question": "Return the apartment number and the number of rooms for each apartment.",
        "answers": [
            [
                "Suite 645",
                "7"
            ],
            [
                "Apt. 585",
                "5"
            ],
            [
                "Apt. 908",
                "7"
            ],
            [
                "Suite 749",
                "8"
            ],
            [
                "Suite 307",
                "9"
            ],
            [
                "Apt. 187",
                "9"
            ],
            [
                "Suite 088",
                "6"
            ],
            [
                "Suite 693",
                "9"
            ],
            [
                "Apt. 940",
                "8"
            ],
            [
                "Apt. 859",
                "6"
            ],
            [
                "Apt. 794",
                "3"
            ],
            [
                "Apt. 477",
                "3"
            ],
            [
                "Apt. 411",
                "9"
            ],
            [
                "Apt. 837",
                "8"
            ],
            [
                "Suite 634",
                "8"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN apartments.apt_number,apartments.room_count",
        "question": "What are the apartment number and the room count of each apartment?",
        "answers": [
            [
                "Suite 645",
                "7"
            ],
            [
                "Apt. 585",
                "5"
            ],
            [
                "Apt. 908",
                "7"
            ],
            [
                "Suite 749",
                "8"
            ],
            [
                "Suite 307",
                "9"
            ],
            [
                "Apt. 187",
                "9"
            ],
            [
                "Suite 088",
                "6"
            ],
            [
                "Suite 693",
                "9"
            ],
            [
                "Apt. 940",
                "8"
            ],
            [
                "Apt. 859",
                "6"
            ],
            [
                "Apt. 794",
                "3"
            ],
            [
                "Apt. 477",
                "3"
            ],
            [
                "Apt. 411",
                "9"
            ],
            [
                "Apt. 837",
                "8"
            ],
            [
                "Suite 634",
                "8"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (guests:`apartment_rentals.Guests`)\nRETURN guests.guest_first_name,guests.guest_last_name",
        "question": "Return the first names and last names of all guests",
        "answers": [
            [
                "Kip",
                "DuBuque"
            ],
            [
                "Rebeca",
                "Runolfsdottir"
            ],
            [
                "Keon",
                "Treutel"
            ],
            [
                "Gabe",
                "Bode"
            ],
            [
                "Lou",
                "Grady"
            ],
            [
                "Josefina",
                "Jerde"
            ],
            [
                "Mozell",
                "Toy"
            ],
            [
                "Keith",
                "Hoeger"
            ],
            [
                "Crystal",
                "Runolfsson"
            ],
            [
                "Nikki",
                "Lehner"
            ],
            [
                "Gregoria",
                "Schowalter"
            ],
            [
                "Louvenia",
                "Crona"
            ],
            [
                "Else",
                "Roberts"
            ],
            [
                "Juvenal",
                "Kautzer"
            ],
            [
                "Tamia",
                "Mante"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (guests:`apartment_rentals.Guests`)\nRETURN guests.guest_first_name,guests.guest_last_name",
        "question": "What are the first names and last names of all the guests?",
        "answers": [
            [
                "Kip",
                "DuBuque"
            ],
            [
                "Rebeca",
                "Runolfsdottir"
            ],
            [
                "Keon",
                "Treutel"
            ],
            [
                "Gabe",
                "Bode"
            ],
            [
                "Lou",
                "Grady"
            ],
            [
                "Josefina",
                "Jerde"
            ],
            [
                "Mozell",
                "Toy"
            ],
            [
                "Keith",
                "Hoeger"
            ],
            [
                "Crystal",
                "Runolfsson"
            ],
            [
                "Nikki",
                "Lehner"
            ],
            [
                "Gregoria",
                "Schowalter"
            ],
            [
                "Louvenia",
                "Crona"
            ],
            [
                "Else",
                "Roberts"
            ],
            [
                "Juvenal",
                "Kautzer"
            ],
            [
                "Tamia",
                "Mante"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (T1:`apartment_rentals.Apartment_Bookings`)-[]-(T2:`apartment_rentals.Apartments`)\nWHERE T2.apt_number = \"Suite 634\"\nRETURN T1.booking_status_code",
        "question": "What is the booking status code of the apartment with apartment number \"Suite 634\"?",
        "answers": [
            [
                "Provisional"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (T1:`apartment_rentals.Apartment_Bookings`)-[]-(T2:`apartment_rentals.Apartments`)\nWHERE T2.apt_number = \"Suite 634\"\nRETURN T1.booking_status_code",
        "question": "Tell me the booking status code for the apartment with number \"Suite 634\".",
        "answers": [
            [
                "Provisional"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (T1:`apartment_rentals.Apartment_Facilities`)-[]-(T2:`apartment_rentals.Apartments`)\nWHERE T2.bedroom_count > 4\nRETURN T1.facility_code",
        "question": "Show the facility codes of apartments with more than 4 bedrooms.",
        "answers": [
            [
                "Gym"
            ],
            [
                "Cable TV"
            ],
            [
                "Gym"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (T1:`apartment_rentals.Apartment_Facilities`)-[]-(T2:`apartment_rentals.Apartments`)\nWHERE T2.bedroom_count > 4\nRETURN T1.facility_code",
        "question": "What are the facility codes of the apartments with more than four bedrooms?",
        "answers": [
            [
                "Gym"
            ],
            [
                "Cable TV"
            ],
            [
                "Gym"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (T1:`apartment_rentals.Apartment_Buildings`)-[]-(T2:`apartment_rentals.Apartments`)\nWHERE T2.bathroom_count > 2\nRETURN T1.building_address",
        "question": "Show the addresses of the buildings that have apartments with more than 2 bathrooms.",
        "answers": [
            [
                "71537 Gorczany Inlet\nWisozkburgh, AL 08256"
            ],
            [
                "489 Josh Orchard Apt. 998\nSipesview, DE 69053"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (T1:`apartment_rentals.Apartment_Buildings`)-[]-(T2:`apartment_rentals.Apartments`)\nWHERE T2.bathroom_count > 2\nRETURN T1.building_address",
        "question": "Which buildings have apartments that have more than two bathrooms? Give me the addresses of the buildings.",
        "answers": [
            [
                "71537 Gorczany Inlet\nWisozkburgh, AL 08256"
            ],
            [
                "489 Josh Orchard Apt. 998\nSipesview, DE 69053"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartment_bookings:`apartment_rentals.Apartment_Bookings`)\nRETURN apartment_bookings.booking_status_code,count(*)",
        "question": "Show the booking status code and the corresponding number of bookings.",
        "answers": [
            [
                "Provisional",
                8
            ],
            [
                "Confirmed",
                7
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartment_bookings:`apartment_rentals.Apartment_Bookings`)\nRETURN apartment_bookings.booking_status_code,count(*)",
        "question": "How many bookings does each booking status have? List the booking status code and the number of corresponding bookings.",
        "answers": [
            [
                "Provisional",
                8
            ],
            [
                "Confirmed",
                7
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN apartments.apt_number\nORDER BY apartments.room_count ASC",
        "question": "Return all the apartment numbers sorted by the room count in ascending order.",
        "answers": [
            [
                "Apt. 794"
            ],
            [
                "Apt. 477"
            ],
            [
                "Apt. 585"
            ],
            [
                "Suite 088"
            ],
            [
                "Apt. 859"
            ],
            [
                "Suite 645"
            ],
            [
                "Apt. 908"
            ],
            [
                "Suite 749"
            ],
            [
                "Apt. 940"
            ],
            [
                "Apt. 837"
            ],
            [
                "Suite 634"
            ],
            [
                "Suite 307"
            ],
            [
                "Apt. 187"
            ],
            [
                "Suite 693"
            ],
            [
                "Apt. 411"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN apartments.apt_number\nORDER BY apartments.room_count ASC",
        "question": "Sort the apartment numbers in ascending order of room count.",
        "answers": [
            [
                "Apt. 794"
            ],
            [
                "Apt. 477"
            ],
            [
                "Apt. 585"
            ],
            [
                "Suite 088"
            ],
            [
                "Apt. 859"
            ],
            [
                "Suite 645"
            ],
            [
                "Apt. 908"
            ],
            [
                "Suite 749"
            ],
            [
                "Apt. 940"
            ],
            [
                "Apt. 837"
            ],
            [
                "Suite 634"
            ],
            [
                "Suite 307"
            ],
            [
                "Apt. 187"
            ],
            [
                "Suite 693"
            ],
            [
                "Apt. 411"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN apartments.apt_number\nORDER BY apartments.bedroom_count DESC\nLIMIT 1",
        "question": "Return the apartment number with the largest number of bedrooms.",
        "answers": [
            [
                "Apt. 908"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN apartments.apt_number\nORDER BY apartments.bedroom_count DESC\nLIMIT 1",
        "question": "What is the apartment number of the apartment with the most beds?",
        "answers": [
            [
                "Apt. 908"
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN apartments.apt_type_code,count(*)\nORDER BY apartments.apt_type_code ASC",
        "question": "Show the apartment type codes and the corresponding number of apartments sorted by the number of apartments in ascending order.",
        "answers": [
            [
                "Duplex",
                5
            ],
            [
                "Flat",
                6
            ],
            [
                "Studio",
                4
            ]
        ]
    },
    {
        "db_id": "apartment_rentals",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN apartments.apt_type_code,count(*)\nORDER BY apartments.apt_type_code ASC",
        "question": "Return each apartment type code with the number of apartments having that apartment type, in ascending order of the number of apartments.",
        "answers": [
            [
                "Duplex",
                5
            ],
            [
                "Flat",
                6
            ],
            [
                "Studio",
                4
            ]
        ]
    }
]