[
    {
        "question": "Find the average price of all product clothes.",
        "query": "MATCH (products:`department_store.Products`)\nWHERE products.product_type_code = 'Clothes'\nRETURN avg(products.product_price)",
        "db_id": "department_store",
        "answers": [
            [
                715.5366666666666
            ]
        ]
    },
    {
        "question": "Find the name of the most expensive hardware product.",
        "query": "MATCH (products:`department_store.Products`)\nWHERE products.product_type_code = 'Hardware'\nRETURN products.product_name\nORDER BY products.product_price DESC\nLIMIT 1",
        "db_id": "department_store",
        "answers": [
            [
                "mic"
            ]
        ]
    },
    {
        "question": "List the description of all aircrafts.",
        "query": "MATCH (aircraft:`aircraft.aircraft`)\nRETURN aircraft.Description",
        "db_id": "aircraft",
        "answers": [
            [
                "Light utility helicopter"
            ],
            [
                "Turboshaft utility helicopter"
            ],
            [
                "Tandem rotor helicopter"
            ],
            [
                "Heavy-lift helicopter"
            ],
            [
                "Heavy-lift helicopter"
            ]
        ]
    },
    {
        "question": "What are the number of international and domestic passengers of the airport named London \"Heathrow\"?",
        "query": "MATCH (airport:`aircraft.airport`)\nWHERE airport.Airport_Name = 'London Heathrow'\nRETURN airport.International_Passengers,airport.Domestic_Passengers",
        "db_id": "aircraft",
        "answers": [
            [
                61344438.0,
                5562516.0
            ]
        ]
    },
    {
        "question": "What are the maximum and minimum number of transit passengers of all aiports.",
        "query": "MATCH (airport:`aircraft.airport`)\nRETURN max(airport.Transit_Passengers),min(airport.Transit_Passengers)",
        "db_id": "aircraft",
        "answers": [
            [
                156246.0,
                4395.0
            ]
        ]
    },
    {
        "question": "List all pilot names in ascending alphabetical order.",
        "query": "MATCH (pilot:`aircraft.pilot`)\nRETURN pilot.Name\nORDER BY pilot.Name ASC",
        "db_id": "aircraft",
        "answers": [
            [
                "Ayana Spencer"
            ],
            [
                "Baylee Steuber"
            ],
            [
                "Blaise Muller"
            ],
            [
                "Della Lindgren"
            ],
            [
                "Dr. Jade Bradtke V"
            ],
            [
                "Elisha Hickle V"
            ],
            [
                "Ellen Ledner III"
            ],
            [
                "Katheryn Gorczany IV"
            ],
            [
                "Maxwell Graham"
            ],
            [
                "Mr. Cristian Halvorson II"
            ],
            [
                "Prof. Zackery Collins"
            ],
            [
                "Winnifred Boyle"
            ]
        ]
    },
    {
        "question": "List names of all pilot aged 30 or younger in descending alphabetical order.",
        "query": "MATCH (pilot:`aircraft.pilot`)\nWHERE pilot.Age <= 30\nRETURN pilot.Name\nORDER BY pilot.Name DESC",
        "db_id": "aircraft",
        "answers": [
            [
                "Winnifred Boyle"
            ],
            [
                "Prof. Zackery Collins"
            ],
            [
                "Mr. Cristian Halvorson II"
            ],
            [
                "Maxwell Graham"
            ],
            [
                "Katheryn Gorczany IV"
            ],
            [
                "Dr. Jade Bradtke V"
            ],
            [
                "Della Lindgren"
            ],
            [
                "Baylee Steuber"
            ],
            [
                "Ayana Spencer"
            ]
        ]
    },
    {
        "question": "Please show the names of aircrafts associated with airport with name \"London Gatwick\".",
        "query": "MATCH (T1:`aircraft.aircraft`)-[T2:`aircraft.airport_aircraft`]-(T3:`aircraft.airport`)\nWHERE T3.Airport_Name = 'London Gatwick'\nRETURN T1.Aircraft",
        "db_id": "aircraft",
        "answers": [
            [
                "Robinson R-22"
            ]
        ]
    },
    {
        "question": "Please show the names and descriptions of aircrafts associated with airports that have a total number of passengers bigger than 10000000.",
        "query": "MATCH (T1:`aircraft.aircraft`)-[T2:`aircraft.airport_aircraft`]-(T3:`aircraft.airport`)\nWHERE T3.Total_Passengers > 10000000\nRETURN T1.Aircraft,T1.Description",
        "db_id": "aircraft",
        "answers": [
            [
                "Robinson R-22",
                "Light utility helicopter"
            ],
            [
                "Bell 206B3 JetRanger",
                "Turboshaft utility helicopter"
            ]
        ]
    },
    {
        "question": "What is the average total number of passengers of airports that are associated with aircraft \"Robinson R-22\"?",
        "query": "MATCH (T1:`aircraft.aircraft`)-[T2:`aircraft.airport_aircraft`]-(T3:`aircraft.airport`)\nWHERE T1.Aircraft = \"Robinson R-22\"\nRETURN avg(T3.Total_Passengers)",
        "db_id": "aircraft",
        "answers": [
            [
                34205887.0
            ]
        ]
    },
    {
        "question": "List names of all pilot in descending order of age.",
        "query": "MATCH (pilot:`aircraft.pilot`)\nRETURN pilot.Name\nORDER BY pilot.Age DESC",
        "db_id": "aircraft",
        "answers": [
            [
                "Elisha Hickle V"
            ],
            [
                "Blaise Muller"
            ],
            [
                "Ellen Ledner III"
            ],
            [
                "Winnifred Boyle"
            ],
            [
                "Baylee Steuber"
            ],
            [
                "Della Lindgren"
            ],
            [
                "Dr. Jade Bradtke V"
            ],
            [
                "Maxwell Graham"
            ],
            [
                "Ayana Spencer"
            ],
            [
                "Prof. Zackery Collins"
            ],
            [
                "Mr. Cristian Halvorson II"
            ],
            [
                "Katheryn Gorczany IV"
            ]
        ]
    },
    {
        "question": "How many residents does each property have? List property id and resident count.",
        "query": "MATCH (T1:`local_govt_and_lot.Properties`)-[]-(T2:`local_govt_and_lot.Residents`)\nWITH T1.property_id AS property_id, count(T1.property_id) AS count\nRETURN property_id,count",
        "db_id": "local_govt_and_lot",
        "answers": [
            [
                107,
                2
            ],
            [
                108,
                1
            ],
            [
                120,
                1
            ],
            [
                373,
                1
            ],
            [
                445,
                1
            ],
            [
                605,
                1
            ],
            [
                629,
                1
            ],
            [
                669,
                2
            ],
            [
                748,
                2
            ],
            [
                879,
                1
            ],
            [
                954,
                2
            ]
        ]
    },
    {
        "question": "List the id and type of each thing, and the details of the organization that owns it.",
        "query": "MATCH (T1:`local_govt_and_lot.Things`)-[]-(T2:`local_govt_and_lot.Organizations`)\nRETURN T1.thing_id,T1.Type_of_Thing_Code,T2.organization_details",
        "db_id": "local_govt_and_lot",
        "answers": [
            [
                92,
                "Commen",
                "Reinger, Hudson and Nolan Group"
            ],
            [
                35,
                "Electronics",
                "Reinger, Hudson and Nolan Group"
            ],
            [
                84,
                "Commen",
                "Denesik and Sons Party"
            ],
            [
                2,
                "Electronics",
                "Denesik and Sons Party"
            ],
            [
                45,
                "Commen",
                "Denesik and Sons Party"
            ],
            [
                85,
                "Commen",
                "Denesik and Sons Party"
            ],
            [
                58,
                "Electronics",
                "Denesik and Sons Party"
            ],
            [
                26,
                "Electronics",
                "Denesik and Sons Party"
            ],
            [
                80,
                "Furniture",
                "Denesik and Sons Party"
            ],
            [
                1,
                "Electronics",
                "Denesik and Sons Party"
            ],
            [
                10,
                "Commen",
                "Denesik and Sons Party"
            ],
            [
                46,
                "Commen",
                "Denesik and Sons Party"
            ],
            [
                14,
                "Furniture",
                "Robel-Schulist Group"
            ],
            [
                47,
                "Commen",
                "Robel-Schulist Group"
            ],
            [
                68,
                "Commen",
                "Robel-Schulist Group"
            ]
        ]
    },
    {
        "question": "List the customer event id and the corresponding move in date and property id.",
        "query": "MATCH (customer_events:`local_govt_and_lot.Customer_Events`)\nRETURN customer_events.Customer_Event_ID,customer_events.date_moved_in,customer_events.property_id",
        "db_id": "local_govt_and_lot",
        "answers": [
            [
                70,
                "2015-03-27 12:00:00",
                605
            ],
            [
                160,
                "2015-03-27 12:00:00",
                879
            ],
            [
                166,
                "2015-03-27 12:00:00",
                629
            ],
            [
                216,
                "2015-03-27 12:00:00",
                669
            ],
            [
                226,
                "2015-03-27 12:00:00",
                748
            ],
            [
                256,
                "2015-03-27 12:00:00",
                108
            ],
            [
                428,
                "2015-03-27 12:00:00",
                954
            ],
            [
                530,
                "2015-03-27 12:00:00",
                669
            ],
            [
                559,
                "2015-03-27 12:00:00",
                107
            ],
            [
                591,
                "2016-09-27 12:00:00",
                120
            ],
            [
                606,
                "2016-09-27 12:00:00",
                445
            ],
            [
                627,
                "2016-09-27 12:00:00",
                748
            ],
            [
                817,
                "2016-09-27 12:00:00",
                107
            ]
        ]
    },
    {
        "question": "How many customers did not have any event?",
        "query": "MATCH (customers:`local_govt_and_lot.Customers`)\nWHERE NOT (customers:`local_govt_and_lot.Customers`)-[]-(:`local_govt_and_lot.Customer_Events`)\nRETURN count(*)",
        "db_id": "local_govt_and_lot",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "Count the number of schools.",
        "query": "MATCH (school:`school_player.school`)\nRETURN count(*)",
        "db_id": "school_player",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "question": "List the locations of schools in ascending order of enrollment.",
        "query": "MATCH (school:`school_player.school`)\nRETURN school.Location\nORDER BY school.Enrollment ASC",
        "db_id": "school_player",
        "answers": [
            [
                "Bellevue Hill"
            ],
            [
                "Milsons Point"
            ],
            [
                "Waverley"
            ],
            [
                "Wahroonga"
            ],
            [
                "Summer Hill"
            ],
            [
                "Hornsby"
            ]
        ]
    },
    {
        "question": "List the locations of schools in descending order of founded year.",
        "query": "MATCH (school:`school_player.school`)\nRETURN school.Location\nORDER BY school.Founded DESC",
        "db_id": "school_player",
        "answers": [
            [
                "Wahroonga"
            ],
            [
                "Bellevue Hill"
            ],
            [
                "Summer Hill"
            ],
            [
                "Waverley"
            ],
            [
                "Hornsby"
            ],
            [
                "Milsons Point"
            ]
        ]
    },
    {
        "question": "What are the enrollments of schools whose denomination is not \"Catholic\"?",
        "query": "MATCH (school:`school_player.school`)\nWHERE school.Denomination <> 'Catholic'\nRETURN school.Enrollment",
        "db_id": "school_player",
        "answers": [
            [
                2300.0
            ],
            [
                1000.0
            ],
            [
                1850.0
            ],
            [
                2200.0
            ]
        ]
    },
    {
        "question": "Take the average of the school enrollment.",
        "query": "MATCH (school:`school_player.school`)\nRETURN avg(school.Enrollment)",
        "db_id": "school_player",
        "answers": [
            [
                1663.3333333333333
            ]
        ]
    },
    {
        "question": "Find the team of each player and sort them in ascending alphabetical order.",
        "query": "MATCH (player:`school_player.player`)\nRETURN player.Team\nORDER BY player.Team ASC",
        "db_id": "school_player",
        "answers": [
            [
                "Baltimore Orioles"
            ],
            [
                "Chicago Cubs"
            ],
            [
                "Chicago White Sox"
            ],
            [
                "Cincinnati Reds"
            ],
            [
                "Detroit Tigers"
            ],
            [
                "Florida Marlins"
            ],
            [
                "Houston Astros"
            ],
            [
                "Kansas City Royals"
            ],
            [
                "Los Angeles Dodgers"
            ],
            [
                "Milwaukee Brewers"
            ],
            [
                "Minnesota Twins"
            ],
            [
                "New York Mets"
            ],
            [
                "New York Mets"
            ],
            [
                "Oakland Athletics"
            ],
            [
                "Pittsburgh Pirates"
            ],
            [
                "San Diego Padres"
            ],
            [
                "San Francisco Giants"
            ],
            [
                "Seattle Mariners"
            ],
            [
                "St. Louis Cardinals"
            ],
            [
                "Tampa Bay Devil Rays"
            ],
            [
                "Texas Rangers"
            ],
            [
                "Toronto Blue Jays"
            ],
            [
                "Washington Nationals"
            ]
        ]
    },
    {
        "question": "Count the number of distinct player positions.",
        "query": "MATCH (player:`school_player.player`)\nRETURN count(DISTINCT player.Position)",
        "db_id": "school_player",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "question": "Find the team of the player of the highest age.",
        "query": "MATCH (player:`school_player.player`)\nRETURN player.Team\nORDER BY player.Age DESC\nLIMIT 1",
        "db_id": "school_player",
        "answers": [
            [
                "New York Mets"
            ]
        ]
    },
    {
        "question": "List the teams of the players with the top 5 largest ages.",
        "query": "MATCH (player:`school_player.player`)\nRETURN player.Team\nORDER BY player.Age DESC\nLIMIT 5",
        "db_id": "school_player",
        "answers": [
            [
                "New York Mets"
            ],
            [
                "Detroit Tigers"
            ],
            [
                "Baltimore Orioles"
            ],
            [
                "St. Louis Cardinals"
            ],
            [
                "Toronto Blue Jays"
            ]
        ]
    },
    {
        "question": "For each player, show the team and the location of school they belong to.",
        "query": "MATCH (T1:`school_player.player`)-[]-(T2:`school_player.school`)\nRETURN T1.Team,T2.Location",
        "db_id": "school_player",
        "answers": [
            [
                "Washington Nationals",
                "Milsons Point"
            ],
            [
                "Milwaukee Brewers",
                "Milsons Point"
            ],
            [
                "Baltimore Orioles",
                "Milsons Point"
            ],
            [
                "Kansas City Royals",
                "Milsons Point"
            ],
            [
                "Toronto Blue Jays",
                "Milsons Point"
            ],
            [
                "Los Angeles Dodgers",
                "Milsons Point"
            ],
            [
                "Houston Astros",
                "Milsons Point"
            ],
            [
                "Cincinnati Reds",
                "Milsons Point"
            ],
            [
                "Tampa Bay Devil Rays",
                "Milsons Point"
            ],
            [
                "Chicago White Sox",
                "Milsons Point"
            ],
            [
                "Texas Rangers",
                "Milsons Point"
            ],
            [
                "Oakland Athletics",
                "Hornsby"
            ],
            [
                "Florida Marlins",
                "Hornsby"
            ],
            [
                "Pittsburgh Pirates",
                "Hornsby"
            ],
            [
                "San Francisco Giants",
                "Hornsby"
            ],
            [
                "Detroit Tigers",
                "Bellevue Hill"
            ],
            [
                "New York Mets",
                "Wahroonga"
            ],
            [
                "Seattle Mariners",
                "Wahroonga"
            ],
            [
                "Chicago Cubs",
                "Wahroonga"
            ],
            [
                "New York Mets",
                "Summer Hill"
            ],
            [
                "San Diego Padres",
                "Summer Hill"
            ],
            [
                "St. Louis Cardinals",
                "Summer Hill"
            ],
            [
                "Minnesota Twins",
                "Waverley"
            ]
        ]
    },
    {
        "question": "Show the locations of schools that have more than 1 player.",
        "query": "MATCH (T1:`school_player.player`)-[]-(T2:`school_player.school`)\nWITH count(*) AS count, T2.Location AS Location\nWHERE count  > 1\nRETURN Location",
        "db_id": "school_player",
        "answers": [
            [
                "Milsons Point"
            ],
            [
                "Hornsby"
            ],
            [
                "Wahroonga"
            ],
            [
                "Summer Hill"
            ]
        ]
    },
    {
        "question": "Show the denomination of the school that has the most players.",
        "query": "MATCH (T1:`school_player.player`)-[]-(T2:`school_player.school`)\nWITH count(T1.School_ID) AS count, T2.Denomination AS Denomination\nRETURN Denomination\nORDER BY count DESC\nLIMIT 1",
        "db_id": "school_player",
        "answers": [
            [
                "Catholic"
            ]
        ]
    },
    {
        "question": "Show locations and nicknames of schools.",
        "query": "MATCH (T1:`school_player.school`)-[]-(T2:`school_player.school_details`)\nRETURN T1.Location,T2.Nickname",
        "db_id": "school_player",
        "answers": [
            [
                "Milsons Point",
                "Tigers"
            ],
            [
                "Hornsby",
                "Auks"
            ],
            [
                "Bellevue Hill",
                "Buccaneers"
            ],
            [
                "Wahroonga",
                "Raiders"
            ],
            [
                "Summer Hill",
                "Seahawks"
            ],
            [
                "Waverley",
                "Silver Eagles"
            ]
        ]
    },
    {
        "question": "Please show different denominations and the corresponding number of schools.",
        "query": "MATCH (school:`school_player.school`)\nWITH school.Denomination AS Denomination, count(school.Denomination) AS count\nRETURN Denomination,count",
        "db_id": "school_player",
        "answers": [
            [
                "Catholic",
                2
            ],
            [
                "Anglican",
                3
            ],
            [
                "Uniting Church",
                1
            ]
        ]
    },
    {
        "question": "Please show different denominations and the corresponding number of schools in descending order.",
        "query": "MATCH (school:`school_player.school`)\nWITH school.Denomination AS Denomination, count(school.Denomination) AS count\nRETURN Denomination,count\nORDER BY count DESC",
        "db_id": "school_player",
        "answers": [
            [
                "Anglican",
                3
            ],
            [
                "Catholic",
                2
            ],
            [
                "Uniting Church",
                1
            ]
        ]
    },
    {
        "question": "List the school color of the school that has the largest enrollment.",
        "query": "MATCH (school:`school_player.school`)\nRETURN school.School_Colors\nORDER BY school.Enrollment DESC\nLIMIT 1",
        "db_id": "school_player",
        "answers": [
            [
                "Red & Blue"
            ]
        ]
    },
    {
        "question": "Show the nicknames of schools that are not in division 1.",
        "query": "MATCH (school_details:`school_player.school_details`)\nWHERE school_details.Division <> 'Division 1'\nRETURN school_details.Nickname",
        "db_id": "school_player",
        "answers": [
            [
                "Auks"
            ],
            [
                "Raiders"
            ],
            [
                "Seahawks"
            ],
            [
                "Silver Eagles"
            ]
        ]
    },
    {
        "question": "Show the denomination shared by more than one school.",
        "query": "MATCH (school:`school_player.school`)\nWITH school.Denomination AS Denomination, count(*) AS count\nWHERE count  > 1\nRETURN Denomination",
        "db_id": "school_player",
        "answers": [
            [
                "Catholic"
            ],
            [
                "Anglican"
            ]
        ]
    },
    {
        "question": "Find the list of page size which have more than 3 product listed",
        "query": "MATCH (product:`store_product.product`)\nWITH count(*) AS count, product.max_page_size AS max_page_size\nWHERE count  > 3\nRETURN max_page_size",
        "db_id": "store_product",
        "answers": [
            [
                "A4"
            ]
        ]
    },
    {
        "question": "Find the name and population of district with population between 200000 and 2000000",
        "query": "MATCH (district:`store_product.district`)\nWHERE 200000<=district.City_Population<=2000000\nRETURN district.District_name,district.City_Population",
        "db_id": "store_product",
        "answers": [
            [
                "Bahawalpur District",
                530438.0
            ],
            [
                "Chiniot District",
                219254.0
            ],
            [
                "Dera Ghazi Khan District",
                464742.0
            ],
            [
                "Gujranwala District",
                1526168.0
            ],
            [
                "Gujrat District",
                328512.0
            ],
            [
                "Jhang District",
                365198.0
            ],
            [
                "Kasur District",
                314617.0
            ]
        ]
    },
    {
        "question": "Find the name all districts with city area greater than 10 or population larger than 100000",
        "query": "MATCH (district:`store_product.district`)\nWHERE district.City_Area > 10 OR district.City_Population > 100000\nRETURN district.District_name",
        "db_id": "store_product",
        "answers": [
            [
                "Attock District"
            ],
            [
                "Bahawalnagar District"
            ],
            [
                "Bahawalpur District"
            ],
            [
                "Bhakkar District"
            ],
            [
                "Chakwal District"
            ],
            [
                "Chiniot District"
            ],
            [
                "Dera Ghazi Khan District"
            ],
            [
                "Faisalabad District"
            ],
            [
                "Gujranwala District"
            ],
            [
                "Gujrat District"
            ],
            [
                "Hafizabad District"
            ],
            [
                "Jhang District"
            ],
            [
                "Jhelum District"
            ],
            [
                "Kasur District"
            ],
            [
                "Khanewal District"
            ]
        ]
    },
    {
        "question": "Find all types of store and number of them.",
        "query": "MATCH (store:`store_product.store`)\nWITH store.Type AS Type, count(store.Type) AS count\nRETURN Type,count",
        "db_id": "store_product",
        "answers": [
            [
                "City Mall",
                2
            ],
            [
                "Village Store",
                3
            ]
        ]
    },
    {
        "question": "Find products with max page size as \"A4\" and pages per minute color smaller than 5.",
        "query": "MATCH (product:`store_product.product`)\nWHERE product.max_page_size = 'A4' AND product.pages_per_minute_color < 5\nRETURN product.product",
        "db_id": "store_product",
        "answers": [
            [
                "Xerox Travel Scanner 100"
            ],
            [
                "ScanShell 3000DN"
            ]
        ]
    },
    {
        "question": "Find products with max page size as \"A4\" or pages per minute color smaller than 5.",
        "query": "MATCH (product:`store_product.product`)\nWHERE product.max_page_size = 'A4' OR product.pages_per_minute_color < 5\nRETURN product.product",
        "db_id": "store_product",
        "answers": [
            [
                "Fujitsu fi-6130 A4 Series Scanner"
            ],
            [
                "Plustek MobileOffice D28 Corporate"
            ],
            [
                "Xerox Travel Scanner 100"
            ],
            [
                "ScanShell 3000DN"
            ]
        ]
    },
    {
        "question": "Find the most prominent max page size among all the products.",
        "query": "MATCH (product:`store_product.product`)\nWITH count(product.max_page_size) AS count, product.max_page_size AS max_page_size\nRETURN max_page_size\nORDER BY count DESC\nLIMIT 1",
        "db_id": "store_product",
        "answers": [
            [
                "A4"
            ]
        ]
    },
    {
        "question": "Find the name and training hours of players whose hours are below 1500.",
        "query": "MATCH (player:`soccer_2.Player`)\nWHERE player.HS < 1500\nRETURN player.pName,player.HS",
        "db_id": "soccer_2",
        "answers": [
            [
                "Andrew",
                1200
            ],
            [
                "Charles",
                300
            ],
            [
                "Eddie",
                600
            ]
        ]
    },
    {
        "question": "Find the max, average and min training hours of all players.",
        "query": "MATCH (player:`soccer_2.Player`)\nRETURN avg(player.HS),max(player.HS),min(player.HS)",
        "db_id": "soccer_2",
        "answers": [
            [
                1150.0,
                1600,
                300
            ]
        ]
    },
    {
        "question": "Find the players whose names contain letter 'a'.",
        "query": "MATCH (player:`soccer_2.Player`)\nWHERE player.pName =~'.*[A|a].*'\nRETURN DISTINCT player.pName",
        "db_id": "soccer_2",
        "answers": [
            [
                "Andrew"
            ],
            [
                "Blake"
            ],
            [
                "Charles"
            ],
            [
                "David"
            ],
            [
                "Drago"
            ]
        ]
    },
    {
        "question": "Find the name, enrollment of the colleges whose size is bigger than 10000 and location is in state LA.",
        "query": "MATCH (college:`soccer_2.College`)\nWHERE college.enr > 10000 AND college.state = 'LA'\nRETURN college.cName,college.enr",
        "db_id": "soccer_2",
        "answers": [
            [
                "LSU",
                18000
            ]
        ]
    },
    {
        "question": "What are the names and enrollment numbers for colleges that have more than 10000 enrolled and are located in Louisiana?",
        "query": "MATCH (college:`soccer_2.College`)\nWHERE college.enr > 10000 AND college.state = 'LA'\nRETURN college.cName,college.enr",
        "db_id": "soccer_2",
        "answers": [
            [
                "LSU",
                18000
            ]
        ]
    },
    {
        "question": "List the name of the colleges whose enrollment is greater 18000 sorted by the college's name.",
        "query": "MATCH (college:`soccer_2.College`)\nWHERE college.enr > 18000\nRETURN college.cName\nORDER BY college.cName",
        "db_id": "soccer_2",
        "answers": [
            [
                "FSU"
            ],
            [
                "OU"
            ]
        ]
    },
    {
        "question": "Find the name of players whose card is yes in the descending order of training hours.",
        "query": "MATCH (player:`soccer_2.Player`)\nWHERE player.yCard = 'yes'\nRETURN player.pName\nORDER BY player.HS DESC",
        "db_id": "soccer_2",
        "answers": [
            [
                "David"
            ],
            [
                "Drago"
            ],
            [
                "Eddie"
            ]
        ]
    }
]