[
    {
        "db_id": "culture_company",
        "query": "MATCH (book_club:`culture_company.book_club`)\nRETURN book_club.Publisher,count(*)",
        "question": "Show all publishers and the number of books for each publisher.",
        "answers": [
            [
                "Alyson",
                3
            ],
            [
                "St. Martin's Press",
                1
            ],
            [
                "William Morrow",
                1
            ],
            [
                "Mysterious Press",
                1
            ],
            [
                "International Polygonics",
                1
            ],
            [
                "Banned Books",
                2
            ],
            [
                "Naiad Press",
                2
            ],
            [
                "Crossing Press",
                1
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (book_club:`culture_company.book_club`)\nRETURN book_club.Publisher,count(*)",
        "question": "How many books are there for each publisher?",
        "answers": [
            [
                "Alyson",
                3
            ],
            [
                "St. Martin's Press",
                1
            ],
            [
                "William Morrow",
                1
            ],
            [
                "Mysterious Press",
                1
            ],
            [
                "International Polygonics",
                1
            ],
            [
                "Banned Books",
                2
            ],
            [
                "Naiad Press",
                2
            ],
            [
                "Crossing Press",
                1
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (book_club:`culture_company.book_club`)\nRETURN book_club.Category,count(*)",
        "question": "Show all book categories and the number of books in each category.",
        "answers": [
            [
                "Gay M/SF",
                5
            ],
            [
                "Lesb. M/SF",
                5
            ],
            [
                "Gay SF/F",
                2
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (book_club:`culture_company.book_club`)\nRETURN book_club.Category,count(*)",
        "question": "How many books fall into each category?",
        "answers": [
            [
                "Gay M/SF",
                5
            ],
            [
                "Lesb. M/SF",
                5
            ],
            [
                "Gay SF/F",
                2
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (book_club:`culture_company.book_club`)\nWHERE book_club.Year > 1989\nWITH book_club.Category AS Category, count(*) AS count\nWHERE count  >= 2\nRETURN Category",
        "question": "List categories that have at least two books after year 1989.",
        "answers": [
            [
                "Gay SF/F"
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (movie:`culture_company.movie`)\nRETURN movie.Title,movie.Year,movie.Director\nORDER BY movie.Budget_million",
        "question": "Show all movie titles, years, and directors, ordered by budget.",
        "answers": [
            [
                "Jill Rips",
                2000,
                "Anthony Hickox"
            ],
            [
                "Storm Catcher",
                1999,
                "Anthony Hickox"
            ],
            [
                "The Boondock Saints",
                1999,
                "Troy Duffy"
            ],
            [
                "The Big Kahuna",
                1999,
                "John Swanbeck"
            ],
            [
                "The Whole Nine Yards",
                2000,
                "Jonathan Lynn"
            ],
            [
                "Battlefield Earth",
                2000,
                "Roger Christian"
            ],
            [
                "Agent Red",
                2000,
                "Damian Lee"
            ],
            [
                "The Art of War",
                2000,
                "Christian Duguay"
            ],
            [
                "3000 Miles to Graceland",
                2001,
                "Demian Lichtenstein"
            ],
            [
                "Get Carter",
                2000,
                "Stephen Kay"
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (movie:`culture_company.movie`)\nRETURN count(DISTINCT movie.Director)",
        "question": "How many movie directors are there?",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (movie:`culture_company.movie`)\nRETURN count(DISTINCT movie.Director)",
        "question": "Count the number of different directors.",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (movie:`culture_company.movie`)\nWHERE movie.Year <= 2000\nRETURN movie.Title,movie.Director\nORDER BY movie.Gross_worldwide DESC\nLIMIT 1",
        "question": "What is the title and director for the movie with highest worldwide gross in the year 2000 or before?",
        "answers": [
            [
                "The Whole Nine Yards",
                "Jonathan Lynn"
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (movie:`culture_company.movie`)\nWHERE movie.Year <= 2000\nRETURN movie.Title,movie.Director\nORDER BY movie.Gross_worldwide DESC\nLIMIT 1",
        "question": "Return the title and director of the movie released in the year 2000 or earlier that had the highest worldwide gross.",
        "answers": [
            [
                "The Whole Nine Yards",
                "Jonathan Lynn"
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (movie:`culture_company.movie`)\nWHERE movie.Year = 1999 OR movie.Year = 2000\nRETURN movie.Director",
        "question": "Show all director names who have a movie in the year 1999 or 2000.",
        "answers": [
            [
                "Troy Duffy"
            ],
            [
                "John Swanbeck"
            ],
            [
                "Anthony Hickox"
            ],
            [
                "Anthony Hickox"
            ],
            [
                "Jonathan Lynn"
            ],
            [
                "Roger Christian"
            ],
            [
                "Stephen Kay"
            ],
            [
                "Christian Duguay"
            ],
            [
                "Damian Lee"
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (movie:`culture_company.movie`)\nWHERE movie.Year < 2000\nRETURN avg(movie.Budget_million),max(movie.Budget_million),min(movie.Budget_million)",
        "question": "What is the average, maximum, and minimum budget for all movies before 2000.",
        "answers": [
            [
                6.0,
                7.0,
                5.0
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (movie:`culture_company.movie`)\nWHERE movie.Year < 2000\nRETURN avg(movie.Budget_million),max(movie.Budget_million),min(movie.Budget_million)",
        "question": "Return the average, maximum, and minimum budgets in millions for movies made before the year 2000.",
        "answers": [
            [
                6.0,
                7.0,
                5.0
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (T1:`culture_company.culture_company`)-[]-(T2:`culture_company.book_club`)\nWHERE T2.Publisher = 'Alyson'\nRETURN T1.Company_name",
        "question": "List all company names with a book published by Alyson.",
        "answers": [
            [
                "Culture China"
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (T1:`culture_company.culture_company`)-[]-(T2:`culture_company.book_club`)\nWHERE T2.Publisher = 'Alyson'\nRETURN T1.Company_name",
        "question": "What are all the company names that have a book published by Alyson?",
        "answers": [
            [
                "Culture China"
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (T1:`culture_company.movie`)-[]-(T2:`culture_company.culture_company`)-[]-(T3:`culture_company.book_club`)\nWHERE T2.Incorporated_in = 'China'\nRETURN T1.Title,T3.Book_Title",
        "question": "Show the movie titles and book titles for all companies in China.",
        "answers": [
            [
                "The Big Kahuna",
                "Goldenboy"
            ],
            [
                "Storm Catcher",
                "Death Takes the Stage"
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (T1:`culture_company.movie`)-[]-(T2:`culture_company.culture_company`)-[]-(T3:`culture_company.book_club`)\nWHERE T2.Incorporated_in = 'China'\nRETURN T1.Title,T3.Book_Title",
        "question": "What are the titles of movies and books corresponding to companies incorporated in China?",
        "answers": [
            [
                "The Big Kahuna",
                "Goldenboy"
            ],
            [
                "Storm Catcher",
                "Death Takes the Stage"
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (T1:`culture_company.movie`)-[]-(T2:`culture_company.culture_company`)\nWHERE T1.Year = 1999\nRETURN T2.Company_name",
        "question": "Show all company names with a movie directed in year 1999.",
        "answers": [
            [
                "Culture China"
            ],
            [
                "Culture China Cargo"
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (T1:`culture_company.movie`)-[]-(T2:`culture_company.culture_company`)\nWHERE T1.Year = 1999\nRETURN T2.Company_name",
        "question": "What are all company names that have a corresponding movie directed in the year 1999?",
        "answers": [
            [
                "Culture China"
            ],
            [
                "Culture China Cargo"
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'new mexico'\nRETURN state.area",
        "question": "how big is new mexico",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'new mexico'\nRETURN state.area",
        "question": "what is the area of new mexico",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'new mexico'\nRETURN state.area",
        "question": "how large is new mexico",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'new mexico'\nRETURN state.area",
        "question": "what is the area of the new mexico state",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'new mexico'\nRETURN state.area",
        "question": "what is the size of new mexico",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'new mexico'\nRETURN state.area",
        "question": "what is the area of new mexico in square kilometers",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'california'\nRETURN state.population",
        "question": "how many people live in california",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'california'\nRETURN state.population",
        "question": "how many people reside in california",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'california'\nRETURN state.population",
        "question": "how many residents live in california",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'california'\nRETURN state.population",
        "question": "how much population does california have",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'california'\nRETURN state.population",
        "question": "what are the population of california",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'california'\nRETURN state.population",
        "question": "what is the population of california",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'california'\nRETURN state.population",
        "question": "how many people are in the state of california",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'california'\nRETURN state.population",
        "question": "what can you tell me about the population of california",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'california'\nRETURN state.population",
        "question": "how many people are there in california",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'california'\nRETURN state.population",
        "question": "how many citizens in california",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'california'\nRETURN state.population",
        "question": "how many people stay in california",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'california'\nRETURN state.population",
        "question": "how many citizens live in california",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.state_name = 'texas'\nRETURN city.city_name",
        "question": "give me the cities in texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.state_name = 'texas'\nRETURN city.city_name",
        "question": "tell me what cities are in texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.state_name = 'texas'\nRETURN city.city_name",
        "question": "what cities are located in texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.state_name = 'texas'\nRETURN city.city_name",
        "question": "what are the cities in texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.state_name = 'texas'\nRETURN city.city_name",
        "question": "what cities in texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.state_name = 'texas'\nRETURN city.city_name",
        "question": "give me the cities which are in texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.capital = 'albany'\nRETURN state.area",
        "question": "what is the area of the state with the capital albany",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (lake:`geo.lake`)\nWHERE lake.state_name = 'california'\nRETURN lake.lake_name",
        "question": "give me the lakes in california",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (lake:`geo.lake`)\nWHERE lake.area > 750 AND lake.state_name = 'michigan'\nRETURN lake.lake_name",
        "question": "name the major lakes in michigan",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "which states do ohio river flow through",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "what states does the ohio river run through",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "what states border the ohio river",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "which states border the ohio river",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "what states does the ohio run through",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "where is the ohio river",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "which states does the ohio river run through",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "which states does the ohio run through",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "which states does the ohio river pass through",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "what are the states that the ohio run through",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "which state has the ohio river",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "what states have rivers named ohio",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "through which states does the ohio flow",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "what states are next to the ohio",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "through which states does the ohio run",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'ohio'\nRETURN river.traverse",
        "question": "what states does the ohio river go through",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'pennsylvania'\nRETURN highlow.lowest_elevation",
        "question": "what is the lowest elevation in pennsylvania",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.lowest_elevation = '0'\nRETURN highlow.highest_point,highlow.state_name",
        "question": "what is the highest point in each state whose lowest point is sea level",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'idaho'\nRETURN count(river.river_name)",
        "question": "how many rivers are in idaho",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'idaho'\nRETURN count(river.river_name)",
        "question": "give me the number of rivers in idaho",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'idaho'\nRETURN count(river.river_name)",
        "question": "how many rivers does idaho have",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'idaho'\nRETURN count(river.river_name)",
        "question": "how many rivers are there in idaho",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'idaho'\nRETURN count(river.river_name)",
        "question": "how many rivers run through idaho",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'idaho'\nRETURN count(river.river_name)",
        "question": "how many rivers are found in idaho",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'idaho'\nRETURN count(river.river_name)",
        "question": "how many rivers in idaho",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN border_info.border",
        "question": "what states neighbor kentucky",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN border_info.border",
        "question": "which states border kentucky",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN border_info.border",
        "question": "what states border kentucky",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN border_info.border",
        "question": "give me the states that border kentucky",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN border_info.border",
        "question": "what state borders kentucky",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN border_info.border",
        "question": "what states are next to kentucky",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN border_info.border",
        "question": "what states surround kentucky",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN border_info.border",
        "question": "which state borders kentucky",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN border_info.border",
        "question": "what are the neighboring states for kentucky",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN border_info.border",
        "question": "which states adjoin kentucky",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN border_info.border",
        "question": "states bordering kentucky",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN border_info.border",
        "question": "which state border kentucky",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN border_info.border",
        "question": "what is the adjacent state of kentucky",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "name all the rivers in illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "rivers in illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what are all the rivers in illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what are the rivers in illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what rivers are in illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what rivers are there in illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what rivers run through illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what rivers flow through illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what river flows through illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what are the rivers in the state of illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "name the rivers in illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what are the rivers of illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "which rivers are in illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "which rivers flow through illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what is the river that cross over illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what river runs through illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN city.state_name",
        "question": "what state is springfield in",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN city.state_name",
        "question": "where is springfield",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN city.state_name",
        "question": "springfield is in what state",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN city.state_name",
        "question": "what states have cities named springfield",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN city.state_name",
        "question": "which states have cities named springfield",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN city.state_name",
        "question": "which state is springfield in",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN city.state_name",
        "question": "what states have a city named springfield",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN city.state_name",
        "question": "what state has the city springfield",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN city.state_name",
        "question": "what states have towns named springfield",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN city.state_name",
        "question": "what state is springfield located in",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN city.state_name",
        "question": "in which state is springfield",
        "answers": []
    }
]