[
    {
        "db_id": "college_3",
        "query": "MATCH (T1:`college_3.Faculty`)-[T2:`college_3.Member_of`]-()\nWHERE T2.DNO = 520\nRETURN T1.Fname,T1.Lname",
        "question": "What are the full names of faculty members who are a part of department 520?",
        "answers": [
            [
                "Thordur",
                "Runolfsson"
            ],
            [
                "Frederic",
                "Davidson"
            ],
            [
                "William",
                "Brody"
            ],
            [
                "Gerard",
                "Meyer"
            ],
            [
                "Alexander",
                "Kaplan"
            ],
            [
                "William",
                "Byrne"
            ],
            [
                "Pablo",
                "Iglesias"
            ],
            [
                "John",
                "Goutsias"
            ],
            [
                "Wilson",
                "Rugh"
            ],
            [
                "Frederick",
                "Jelinek"
            ],
            [
                "Charles",
                "Westgate"
            ],
            [
                "Howard",
                "Weinert"
            ],
            [
                "Lawrence",
                "Wolff"
            ],
            [
                "Gert",
                "Cauwenberghs"
            ],
            [
                "Andreas",
                "Andreou"
            ],
            [
                "Oliver",
                "Collins"
            ],
            [
                "Brian",
                "Hughes"
            ],
            [
                "Richard",
                "Joseph"
            ],
            [
                "Jacob",
                "Khurgin"
            ],
            [
                "Jerry",
                "Prince"
            ],
            [
                "Robert",
                "Glaser"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (T2:`college_3.Student`)-[T1:`college_3.Minor_in`]-()\nWHERE T1.DNO = 140\nRETURN T2.Fname,T2.LName",
        "question": "What are the first names and last names of the students that minor in the department with DNO 140.",
        "answers": [
            [
                "Susan",
                "Lee"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (T2:`college_3.Student`)-[T1:`college_3.Minor_in`]-()\nWHERE T1.DNO = 140\nRETURN T2.Fname,T2.LName",
        "question": "What are the full names of students minoring in department 140?",
        "answers": [
            [
                "Susan",
                "Lee"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (T1:`college_3.Department`)-[T3:`college_3.Member_of`]-(T2:`college_3.Faculty`)\nWHERE T1.DName = \"Computer Science\"\nRETURN T2.Lname",
        "question": "Find the last names of faculties who are members of computer science department.",
        "answers": [
            [
                "Yarowsky"
            ],
            [
                "Smith"
            ],
            [
                "Kumar"
            ],
            [
                "Houlahan"
            ],
            [
                "Angelopoulou"
            ],
            [
                "Wolff"
            ],
            [
                "Salzberg"
            ],
            [
                "Jelinek"
            ],
            [
                "Jones"
            ],
            [
                "Delcher"
            ],
            [
                "Masson"
            ],
            [
                "Brill"
            ],
            [
                "Giuliano"
            ],
            [
                "Amir"
            ],
            [
                "Awerbuch"
            ],
            [
                "Beach"
            ],
            [
                "Kosaraju"
            ],
            [
                "Goodrich"
            ],
            [
                "Brent"
            ],
            [
                "Taylor"
            ]
        ]
    },
    {
        "db_id": "college_3",
        "query": "MATCH (T1:`college_3.Department`)-[T3:`college_3.Member_of`]-(T2:`college_3.Faculty`)\nWHERE T1.DName = \"Computer Science\"\nRETURN T2.Lname",
        "question": "What are the last names of faculty who are part of the computer science department?",
        "answers": [
            [
                "Yarowsky"
            ],
            [
                "Smith"
            ],
            [
                "Kumar"
            ],
            [
                "Houlahan"
            ],
            [
                "Angelopoulou"
            ],
            [
                "Wolff"
            ],
            [
                "Salzberg"
            ],
            [
                "Jelinek"
            ],
            [
                "Jones"
            ],
            [
                "Delcher"
            ],
            [
                "Masson"
            ],
            [
                "Brill"
            ],
            [
                "Giuliano"
            ],
            [
                "Amir"
            ],
            [
                "Awerbuch"
            ],
            [
                "Beach"
            ],
            [
                "Kosaraju"
            ],
            [
                "Goodrich"
            ],
            [
                "Brent"
            ],
            [
                "Taylor"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nRETURN products.product_id,products.product_type_code\nORDER BY products.product_price\nLIMIT 1",
        "question": "What are the product id and product type of the cheapest product?",
        "answers": [
            [
                6,
                "Clothes"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nRETURN products.product_id,products.product_type_code\nORDER BY products.product_price\nLIMIT 1",
        "question": "Give the id and product type of the product with the lowest price.",
        "answers": [
            [
                6,
                "Clothes"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nRETURN count(DISTINCT products.product_type_code)",
        "question": "Find the number of different product types.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nRETURN count(DISTINCT products.product_type_code)",
        "question": "Count the number of distinct product types.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T1:`department_store.Addresses`)-[T2:`department_store.Customer_Addresses`]-()\nWHERE T2.customer_id = 10\nRETURN T1.address_details",
        "question": "Return the address of customer 10.",
        "answers": [
            [
                "36594 O'Keefe Lock\nNew Cali, RI 42319"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T1:`department_store.Addresses`)-[T2:`department_store.Customer_Addresses`]-()\nWHERE T2.customer_id = 10\nRETURN T1.address_details",
        "question": "What is the address for the customer with id 10?",
        "answers": [
            [
                "36594 O'Keefe Lock\nNew Cali, RI 42319"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T1:`department_store.Staff`)-[T2:`department_store.Staff_Department_Assignments`]-()\nWHERE T2.job_title_code = \"Department Manager\"\nRETURN T1.staff_id,T1.staff_gender",
        "question": "What are the staff ids and genders of all staffs whose job title is Department Manager?",
        "answers": [
            [
                5,
                "0"
            ],
            [
                6,
                "1"
            ],
            [
                15,
                "1"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T1:`department_store.Staff`)-[T2:`department_store.Staff_Department_Assignments`]-()\nWHERE T2.job_title_code = \"Department Manager\"\nRETURN T1.staff_id,T1.staff_gender",
        "question": "Return the staff ids and genders for any staff with the title Department Manager.",
        "answers": [
            [
                5,
                "0"
            ],
            [
                6,
                "1"
            ],
            [
                15,
                "1"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (customers:`department_store.Customers`)\nRETURN customers.payment_method_code,count(*)",
        "question": "For each payment method, return how many customers use it.",
        "answers": [
            [
                "Credit Card",
                10
            ],
            [
                "Direct Debit",
                5
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T1:`department_store.Customers`)-[]-(T2:`department_store.Customer_Orders`)\nWITH T1, count(T1.customer_id) AS cnt\nRETURN T1.customer_name,T1.customer_phone,T1.customer_email\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What are the name, phone number and email address of the customer who made the largest number of orders?",
        "answers": [
            [
                "Lexus",
                "+08(3)8056580281",
                "gbrekke@example.com"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nRETURN products.product_type_code,avg(products.product_price)",
        "question": "What is the average price for each type of product?",
        "answers": [
            [
                "Clothes",
                715.5366666666666
            ],
            [
                "Hardware",
                796.0416666666666
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nRETURN products.product_type_code,avg(products.product_price)",
        "question": "Return the average price for each product type.",
        "answers": [
            [
                "Clothes",
                715.5366666666666
            ],
            [
                "Hardware",
                796.0416666666666
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T1:`department_store.Staff`)-[T2:`department_store.Staff_Department_Assignments`]-()\nRETURN T1.staff_name,T2.job_title_code\nORDER BY T2.date_assigned_to DESC\nLIMIT 1",
        "question": "What is the name and job title of the staff who was assigned the latest?",
        "answers": [
            [
                "Katelynn",
                "Clerical Staff"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T1:`department_store.Staff`)-[T2:`department_store.Staff_Department_Assignments`]-()\nRETURN T1.staff_name,T2.job_title_code\nORDER BY T2.date_assigned_to DESC\nLIMIT 1",
        "question": "Return the name and job title of the staff with the latest date assigned.",
        "answers": [
            [
                "Katelynn",
                "Clerical Staff"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T2:`department_store.Products`)-[T1:`department_store.Product_Suppliers`]-()\nWHERE T1.supplier_id = 3\nRETURN T2.product_type_code,T2.product_name,T2.product_price",
        "question": "Give me the product type, name and price for all the products supplied by supplier id 3.",
        "answers": [
            [
                "Clothes",
                "black jeans",
                695.16
            ],
            [
                "Clothes",
                "blue jeans",
                939.57
            ],
            [
                "Hardware",
                "mouse",
                803.74
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T2:`department_store.Products`)-[T1:`department_store.Product_Suppliers`]-()\nWHERE T1.supplier_id = 3\nRETURN T2.product_type_code,T2.product_name,T2.product_price",
        "question": "Return the product type, name, and price for products supplied by supplier 3.",
        "answers": [
            [
                "Clothes",
                "black jeans",
                695.16
            ],
            [
                "Clothes",
                "blue jeans",
                939.57
            ],
            [
                "Hardware",
                "mouse",
                803.74
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH ()-[staff_department_assignments:`department_store.Staff_Department_Assignments`]-()\nRETURN staff_department_assignments.department_id\nORDER BY staff_department_assignments.department_id\nLIMIT 1",
        "question": "What is the id of the department with the least number of staff?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nRETURN products.product_type_code,max(products.product_price),min(products.product_price)",
        "question": "For each product type, return the maximum and minimum price.",
        "answers": [
            [
                "Clothes",
                939.57,
                408.82
            ],
            [
                "Hardware",
                971.44,
                612.46
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nRETURN products.product_type_code,max(products.product_price),min(products.product_price)",
        "question": "What are the maximum and minimum product prices for each product type?",
        "answers": [
            [
                "Clothes",
                939.57,
                408.82
            ],
            [
                "Hardware",
                971.44,
                612.46
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nWHERE 600<=products.product_price<=700\nRETURN products.product_name,products.product_id",
        "question": "Return the names and ids of all products whose price is between 600 and 700.",
        "answers": [
            [
                "yellow jeans",
                2
            ],
            [
                "black jeans",
                3
            ],
            [
                "blue topping",
                9
            ],
            [
                "keyboard",
                13
            ],
            [
                "speaker",
                14
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nWHERE 600<=products.product_price<=700\nRETURN products.product_name,products.product_id",
        "question": "What are the names and ids of products costing between 600 and 700?",
        "answers": [
            [
                "yellow jeans",
                2
            ],
            [
                "black jeans",
                3
            ],
            [
                "blue topping",
                9
            ],
            [
                "keyboard",
                13
            ],
            [
                "speaker",
                14
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T1:`department_store.Staff`)-[T2:`department_store.Staff_Department_Assignments`]-()\nWITH count(*) AS count, T1.staff_name AS staff_name\nWHERE count  > 1\nRETURN staff_name",
        "question": "List the name of staff who has been assigned multiple jobs.",
        "answers": [
            [
                "Malika"
            ],
            [
                "Tyson"
            ],
            [
                "Vito"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T1:`department_store.Staff`)-[T2:`department_store.Staff_Department_Assignments`]-()\nWITH count(*) AS count, T1.staff_name AS staff_name\nWHERE count  > 1\nRETURN staff_name",
        "question": "What are the names of staff who have been assigned multiple jobs?",
        "answers": [
            [
                "Malika"
            ],
            [
                "Tyson"
            ],
            [
                "Vito"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T1:`department_store.Suppliers`)-[T2:`department_store.Supplier_Addresses`]-(T3:`department_store.Addresses`)\nRETURN T1.supplier_name,T1.supplier_phone\nORDER BY T3.address_details",
        "question": "List the name and phone number of all suppliers in the alphabetical order of their addresses.",
        "answers": [
            [
                "AB Store",
                "1-483-283-4742"
            ],
            [
                "Tesco",
                "287-071-1153x254"
            ],
            [
                "Audi",
                "1-432-960-2402x1734"
            ],
            [
                "Tesco",
                "287-071-1153x254"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T1:`department_store.Suppliers`)-[T2:`department_store.Supplier_Addresses`]-(T3:`department_store.Addresses`)\nRETURN T1.supplier_name,T1.supplier_phone\nORDER BY T3.address_details",
        "question": "What are the names and phone numbers for all suppliers, sorted in alphabetical order of their addressed?",
        "answers": [
            [
                "AB Store",
                "1-483-283-4742"
            ],
            [
                "Tesco",
                "287-071-1153x254"
            ],
            [
                "Audi",
                "1-432-960-2402x1734"
            ],
            [
                "Tesco",
                "287-071-1153x254"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nWHERE products.product_price < 600 OR products.product_price > 900\nRETURN products.product_id,products.product_name",
        "question": "What are id and name of the products whose price is lower than 600 or higher than 900?",
        "answers": [
            [
                4,
                "blue jeans"
            ],
            [
                5,
                "red jeans"
            ],
            [
                6,
                "red topping"
            ],
            [
                7,
                "black topping"
            ],
            [
                8,
                "yellow topping"
            ],
            [
                12,
                "drive"
            ],
            [
                15,
                "mic"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nWHERE products.product_price < 600 OR products.product_price > 900\nRETURN products.product_id,products.product_name",
        "question": "Give the ids and names of products with price lower than 600 or higher than 900.",
        "answers": [
            [
                4,
                "blue jeans"
            ],
            [
                5,
                "red jeans"
            ],
            [
                6,
                "red topping"
            ],
            [
                7,
                "black topping"
            ],
            [
                8,
                "yellow topping"
            ],
            [
                12,
                "drive"
            ],
            [
                15,
                "mic"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (customers:`department_store.Customers`)\nRETURN max(customers.customer_code),min(customers.customer_code)",
        "question": "What is the largest and smallest customer codes?",
        "answers": [
            [
                "980",
                "172"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (customers:`department_store.Customers`)\nRETURN max(customers.customer_code),min(customers.customer_code)",
        "question": "Return the maximum and minimum customer codes.",
        "answers": [
            [
                "980",
                "172"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T1:`department_store.Suppliers`)-[T2:`department_store.Product_Suppliers`]-(T3:`department_store.Products`)\nWHERE T3.product_name = \"red jeans\"\nRETURN DISTINCT T1.supplier_name,T1.supplier_phone",
        "question": "List the names and phone numbers of all the distinct suppliers who supply red jeans.",
        "answers": [
            [
                "AB Store",
                "1-483-283-4742"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (T1:`department_store.Suppliers`)-[T2:`department_store.Product_Suppliers`]-(T3:`department_store.Products`)\nWHERE T3.product_name = \"red jeans\"\nRETURN DISTINCT T1.supplier_name,T1.supplier_phone",
        "question": "What are the distinct names and phone numbers for suppliers who have red jeans?",
        "answers": [
            [
                "AB Store",
                "1-483-283-4742"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nRETURN max(products.product_price),min(products.product_price),products.product_type_code\nORDER BY products.product_type_code",
        "question": "What are the highest and lowest prices of products, grouped by and alphabetically ordered by product type?",
        "answers": [
            [
                939.57,
                408.82,
                "Clothes"
            ],
            [
                971.44,
                612.46,
                "Hardware"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nRETURN max(products.product_price),min(products.product_price),products.product_type_code\nORDER BY products.product_type_code",
        "question": "Give the maximum and minimum product prices for each product type, grouped and ordered by product type.",
        "answers": [
            [
                939.57,
                408.82,
                "Clothes"
            ],
            [
                971.44,
                612.46,
                "Hardware"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nWHERE products.product_type_code = 'Clothes'\nRETURN avg(products.product_price)",
        "question": "Find the average price of all product clothes.",
        "answers": [
            [
                715.5366666666666
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nWHERE products.product_type_code = 'Clothes'\nRETURN avg(products.product_price)",
        "question": "What is the average price of clothes?",
        "answers": [
            [
                715.5366666666666
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nWHERE products.product_type_code = 'Hardware'\nRETURN products.product_name\nORDER BY products.product_price DESC\nLIMIT 1",
        "question": "Find the name of the most expensive hardware product.",
        "answers": [
            [
                "mic"
            ]
        ]
    },
    {
        "db_id": "department_store",
        "query": "MATCH (products:`department_store.Products`)\nWHERE products.product_type_code = 'Hardware'\nRETURN products.product_name\nORDER BY products.product_price DESC\nLIMIT 1",
        "question": "What is the name of the hardware product with the greatest price?",
        "answers": [
            [
                "mic"
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (aircraft:`aircraft.aircraft`)\nRETURN count(*)",
        "question": "How many aircrafts are there?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (aircraft:`aircraft.aircraft`)\nRETURN count(*)",
        "question": "What is the number of aircraft?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (aircraft:`aircraft.aircraft`)\nRETURN aircraft.Description",
        "question": "List the description of all aircrafts.",
        "answers": [
            [
                "Light utility helicopter"
            ],
            [
                "Turboshaft utility helicopter"
            ],
            [
                "Tandem rotor helicopter"
            ],
            [
                "Heavy-lift helicopter"
            ],
            [
                "Heavy-lift helicopter"
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (aircraft:`aircraft.aircraft`)\nRETURN aircraft.Description",
        "question": "What are the descriptions for the aircrafts?",
        "answers": [
            [
                "Light utility helicopter"
            ],
            [
                "Turboshaft utility helicopter"
            ],
            [
                "Tandem rotor helicopter"
            ],
            [
                "Heavy-lift helicopter"
            ],
            [
                "Heavy-lift helicopter"
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (airport:`aircraft.airport`)\nRETURN avg(airport.International_Passengers)",
        "question": "What is the average number of international passengers of all airports?",
        "answers": [
            [
                16443156.6
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (airport:`aircraft.airport`)\nRETURN avg(airport.International_Passengers)",
        "question": "What is the average number of international passengers for an airport?",
        "answers": [
            [
                16443156.6
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (airport:`aircraft.airport`)\nWHERE airport.Airport_Name = 'London Heathrow'\nRETURN airport.International_Passengers,airport.Domestic_Passengers",
        "question": "What are the number of international and domestic passengers of the airport named London \"Heathrow\"?",
        "answers": [
            [
                61344438.0,
                5562516.0
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (airport:`aircraft.airport`)\nWHERE airport.Airport_Name = 'London Heathrow'\nRETURN airport.International_Passengers,airport.Domestic_Passengers",
        "question": "How many international and domestic passengers are there in the airport London Heathrow?",
        "answers": [
            [
                61344438.0,
                5562516.0
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (airport:`aircraft.airport`)\nRETURN max(airport.Transit_Passengers),min(airport.Transit_Passengers)",
        "question": "What are the maximum and minimum number of transit passengers of all aiports.",
        "answers": [
            [
                156246.0,
                4395.0
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (airport:`aircraft.airport`)\nRETURN max(airport.Transit_Passengers),min(airport.Transit_Passengers)",
        "question": "What is the maximum and mininum number of transit passengers for all airports?",
        "answers": [
            [
                156246.0,
                4395.0
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (pilot:`aircraft.pilot`)\nWHERE pilot.Age >= 25\nRETURN pilot.Name",
        "question": "What are the name of pilots aged 25 or older?",
        "answers": [
            [
                "Ayana Spencer"
            ],
            [
                "Ellen Ledner III"
            ],
            [
                "Elisha Hickle V"
            ],
            [
                "Dr. Jade Bradtke V"
            ],
            [
                "Winnifred Boyle"
            ],
            [
                "Della Lindgren"
            ],
            [
                "Maxwell Graham"
            ],
            [
                "Blaise Muller"
            ],
            [
                "Baylee Steuber"
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (pilot:`aircraft.pilot`)\nWHERE pilot.Age >= 25\nRETURN pilot.Name",
        "question": "what is the name of every pilot who is at least 25 years old?",
        "answers": [
            [
                "Ayana Spencer"
            ],
            [
                "Ellen Ledner III"
            ],
            [
                "Elisha Hickle V"
            ],
            [
                "Dr. Jade Bradtke V"
            ],
            [
                "Winnifred Boyle"
            ],
            [
                "Della Lindgren"
            ],
            [
                "Maxwell Graham"
            ],
            [
                "Blaise Muller"
            ],
            [
                "Baylee Steuber"
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (pilot:`aircraft.pilot`)\nRETURN pilot.Name\nORDER BY pilot.Name ASC",
        "question": "List all pilot names in ascending alphabetical order.",
        "answers": [
            [
                "Ayana Spencer"
            ],
            [
                "Baylee Steuber"
            ],
            [
                "Blaise Muller"
            ],
            [
                "Della Lindgren"
            ],
            [
                "Dr. Jade Bradtke V"
            ],
            [
                "Elisha Hickle V"
            ],
            [
                "Ellen Ledner III"
            ],
            [
                "Katheryn Gorczany IV"
            ],
            [
                "Maxwell Graham"
            ],
            [
                "Mr. Cristian Halvorson II"
            ],
            [
                "Prof. Zackery Collins"
            ],
            [
                "Winnifred Boyle"
            ]
        ]
    }
]