[
    {
        "question": "Show the names of members and the locations of colleges they go to in ascending alphabetical order of member names.",
        "query": "MATCH (T1:`decoration_competition.college`)-[]-(T2:`decoration_competition.member`)\nRETURN T2.Name,T1.College_Location\nORDER BY T2.Name ASC",
        "db_id": "decoration_competition",
        "answers": [
            [
                "Arnold Palmer",
                "McGill"
            ],
            [
                "Billy Casper",
                "Ottawa"
            ],
            [
                "Bobby Nichols",
                "Western Ontario"
            ],
            [
                "Homero Blancas",
                "Minnesota"
            ],
            [
                "J. C. Snead",
                "McGill"
            ],
            [
                "Jack Nicklaus",
                "Ottawa"
            ],
            [
                "Lee Trevino",
                "St. Francis Xavier"
            ],
            [
                "Pat Fitzsimons",
                "Western Ontario"
            ],
            [
                "Tom Watson",
                "McGill"
            ],
            [
                "Tom Weiskopf",
                "St. Francis Xavier"
            ]
        ]
    },
    {
        "question": "Show the distinct leader names of colleges associated with members from country \"Canada\".",
        "query": "MATCH (T1:`decoration_competition.college`)-[]-(T2:`decoration_competition.member`)\nWHERE T2.Country = 'Canada'\nRETURN DISTINCT T1.Leader_Name",
        "db_id": "decoration_competition",
        "answers": [
            [
                "Samir Chahine"
            ],
            [
                "Roger Dunbrack"
            ]
        ]
    },
    {
        "question": "Show the names of members and the decoration themes they have.",
        "query": "MATCH (T1:`decoration_competition.member`)-[]-(T2:`decoration_competition.round`)\nRETURN T1.Name,T2.Decoration_Theme",
        "db_id": "decoration_competition",
        "answers": [
            [
                "Jack Nicklaus",
                "Walk on the Moon"
            ],
            [
                "Billy Casper",
                "Soft Dream"
            ],
            [
                "Tom Weiskopf",
                "Dark Nights"
            ],
            [
                "Tom Watson",
                "Sweetie"
            ],
            [
                "Pat Fitzsimons",
                "Summer"
            ],
            [
                "Lee Trevino",
                "Happiness"
            ]
        ]
    },
    {
        "question": "Show the names of members that have a rank in round higher than 3.",
        "query": "MATCH (T1:`decoration_competition.member`)-[]-(T2:`decoration_competition.round`)\nWHERE T2.Rank_in_Round > 3\nRETURN T1.Name",
        "db_id": "decoration_competition",
        "answers": [
            [
                "Tom Weiskopf"
            ]
        ]
    },
    {
        "question": "Show the names of members in ascending order of their rank in rounds.",
        "query": "MATCH (T1:`decoration_competition.member`)-[]-(T2:`decoration_competition.round`)\nRETURN T1.Name\nORDER BY T2.Rank_in_Round ASC",
        "db_id": "decoration_competition",
        "answers": [
            [
                "Jack Nicklaus"
            ],
            [
                "Lee Trevino"
            ],
            [
                "Billy Casper"
            ],
            [
                "Pat Fitzsimons"
            ],
            [
                "Tom Watson"
            ],
            [
                "Tom Weiskopf"
            ]
        ]
    },
    {
        "question": "List the names of members who did not participate in any round.",
        "query": "MATCH (member:`decoration_competition.member`)\nWHERE NOT (member:`decoration_competition.member`)-[]-(:`decoration_competition.round`)\nRETURN member.Name",
        "db_id": "decoration_competition",
        "answers": [
            [
                "Arnold Palmer"
            ],
            [
                "Homero Blancas"
            ],
            [
                "Bobby Nichols"
            ],
            [
                "J. C. Snead"
            ]
        ]
    },
    {
        "question": "Find the name and access counts of all documents, in alphabetic order of the document name.",
        "query": "MATCH (documents:`document_management.Documents`)\nRETURN documents.document_name,documents.access_count\nORDER BY documents.document_name",
        "db_id": "document_management",
        "answers": [
            [
                "David CV",
                6345
            ],
            [
                "Fall Sails",
                7509
            ],
            [
                "How to cook pasta",
                2045
            ],
            [
                "Humanity: a fact",
                3479
            ],
            [
                "Joe CV",
                2294
            ],
            [
                "John CV",
                5924
            ],
            [
                "Learning Database",
                3769
            ],
            [
                "Learning English",
                1864
            ],
            [
                "Learning Japanese",
                2910
            ],
            [
                "Life about Claude Monet",
                1219
            ],
            [
                "Relationships between History and Arts",
                9948
            ],
            [
                "Research about Art history",
                8208
            ],
            [
                "Spring Sails",
                3289
            ],
            [
                "Summer Sails",
                6661
            ],
            [
                "Winter Sails",
                8623
            ]
        ]
    },
    {
        "question": "Find the types of documents with more than 4 documents.",
        "query": "MATCH (documents:`document_management.Documents`)\nWITH count(*) AS count, documents.document_type_code AS document_type_code\nWHERE count  > 4\nRETURN document_type_code",
        "db_id": "document_management",
        "answers": [
            [
                "Book"
            ]
        ]
    },
    {
        "question": "What is the type of the document named \"David CV\"?",
        "query": "MATCH (documents:`document_management.Documents`)\nWHERE documents.document_name = 'David CV'\nRETURN documents.document_type_code",
        "db_id": "document_management",
        "answers": [
            [
                "CV"
            ]
        ]
    },
    {
        "question": "Find all the name of documents without any sections.",
        "query": "MATCH (documents:`document_management.Documents`)\nWHERE NOT (documents:`document_management.Documents`)-[]-(:`document_management.Document_Sections`)\nRETURN documents.document_name",
        "db_id": "document_management",
        "answers": [
            [
                "Learning Database"
            ],
            [
                "How to cook pasta"
            ],
            [
                "Humanity: a fact"
            ],
            [
                "Life about Claude Monet"
            ]
        ]
    },
    {
        "question": "What are the names of documents that do not have any sections?",
        "query": "MATCH (documents:`document_management.Documents`)\nWHERE NOT (documents:`document_management.Documents`)-[]-(:`document_management.Document_Sections`)\nRETURN documents.document_name",
        "db_id": "document_management",
        "answers": [
            [
                "Learning Database"
            ],
            [
                "How to cook pasta"
            ],
            [
                "Humanity: a fact"
            ],
            [
                "Life about Claude Monet"
            ]
        ]
    },
    {
        "question": "List all the image name and URLs in the order of their names.",
        "query": "MATCH (images:`document_management.Images`)\nRETURN images.image_name,images.image_url\nORDER BY images.image_name",
        "db_id": "document_management",
        "answers": [
            [
                "chapter1",
                "http://gaylord.info/1.jpg"
            ],
            [
                "chapter2",
                "http://www.hellerreinger.com/1.jpg"
            ],
            [
                "chapter3",
                "http://faycummerata.net/1.jpg"
            ],
            [
                "chapter4",
                "http://haleychamplin.net/1.jpg"
            ],
            [
                "chapter5",
                "http://www.fritsch.net/1.jpg"
            ],
            [
                "data1",
                "http://sauer.com/1.jpg"
            ],
            [
                "data2",
                "http://www.heller.com/1.jpg"
            ],
            [
                "data3",
                "http://www.hermann.com/1.jpg"
            ],
            [
                "data4",
                "http://rowelakin.com/1.jpg"
            ],
            [
                "data5",
                "http://andersonluettgen.net/1.jpg"
            ],
            [
                "data6",
                "http://www.beahan.biz/1.jpg"
            ],
            [
                "top1",
                "http://www.rempelnader.com/1.jpg"
            ],
            [
                "top2",
                "http://connellykertzmann.org/1.jpg"
            ],
            [
                "top3",
                "http://www.bernierconnelly.com/1.jpg"
            ],
            [
                "top4",
                "http://abernathyboehm.com/1.jpg"
            ]
        ]
    },
    {
        "question": "Find the number of users in each role.",
        "query": "MATCH (users:`document_management.Users`)\nWITH users.role_code AS role_code, count(users.role_code) AS count\nRETURN count,role_code",
        "db_id": "document_management",
        "answers": [
            [
                7,
                "PROJ-MGR"
            ],
            [
                8,
                "DBA"
            ]
        ]
    },
    {
        "question": "Give the codes of document types that have more than 2 corresponding documents.",
        "query": "MATCH (documents:`document_management.Documents`)\nWITH count(*) AS count, documents.document_type_code AS document_type_code\nWHERE count  > 2\nRETURN document_type_code",
        "db_id": "document_management",
        "answers": [
            [
                "Book"
            ],
            [
                "Paper"
            ],
            [
                "Advertisement"
            ],
            [
                "CV"
            ]
        ]
    },
    {
        "question": "Count the number of companies.",
        "query": "MATCH (companies:`company_office.Companies`)\nRETURN count(*)",
        "db_id": "company_office",
        "answers": [
            [
                19
            ]
        ]
    },
    {
        "question": "List the names of companies in descending order of market value.",
        "query": "MATCH (companies:`company_office.Companies`)\nRETURN companies.name\nORDER BY companies.Market_Value_billion DESC",
        "db_id": "company_office",
        "answers": [
            [
                "Santander Group"
            ],
            [
                "BNP Paribas"
            ],
            [
                "ExxonMobil"
            ],
            [
                "PetroChina"
            ],
            [
                "Industrial and Commercial Bank of China"
            ],
            [
                "Petrobras"
            ],
            [
                "China Construction Bank"
            ],
            [
                "General Electric"
            ],
            [
                "Royal Dutch Shell"
            ],
            [
                "Berkshire Hathaway"
            ],
            [
                "Chevron"
            ],
            [
                "Walmart"
            ],
            [
                "HSBC"
            ],
            [
                "JPMorgan Chase"
            ],
            [
                "Gazprom"
            ],
            [
                "Wells Fargo"
            ],
            [
                "AT&T Inc."
            ],
            [
                "Total"
            ],
            [
                "Citigroup"
            ]
        ]
    },
    {
        "question": "What are the names of companies whose headquarters are not \"USA\"?",
        "query": "MATCH (companies:`company_office.Companies`)\nWHERE companies.Headquarters <> 'USA'\nRETURN companies.name",
        "db_id": "company_office",
        "answers": [
            [
                "HSBC"
            ],
            [
                "Royal Dutch Shell"
            ],
            [
                "PetroChina"
            ],
            [
                "Industrial and Commercial Bank of China"
            ],
            [
                "Petrobras"
            ],
            [
                "BNP Paribas"
            ],
            [
                "Santander Group"
            ],
            [
                "Gazprom"
            ],
            [
                "China Construction Bank"
            ],
            [
                "Total"
            ]
        ]
    },
    {
        "question": "List the name and assets of each company in ascending order of company name.",
        "query": "MATCH (companies:`company_office.Companies`)\nRETURN companies.name,companies.Assets_billion\nORDER BY companies.name ASC",
        "db_id": "company_office",
        "answers": [
            [
                "AT&T Inc.",
                268.5
            ],
            [
                "BNP Paribas",
                2680.7
            ],
            [
                "Berkshire Hathaway",
                372.2
            ],
            [
                "Chevron",
                184.8
            ],
            [
                "China Construction Bank",
                1408.0
            ],
            [
                "Citigroup",
                1913.9
            ],
            [
                "ExxonMobil",
                302.5
            ],
            [
                "Gazprom",
                275.9
            ],
            [
                "General Electric",
                751.2
            ],
            [
                "HSBC",
                2467.9
            ],
            [
                "Industrial and Commercial Bank of China",
                1723.5
            ],
            [
                "JPMorgan Chase",
                2117.6
            ],
            [
                "PetroChina",
                251.3
            ],
            [
                "Petrobras",
                313.2
            ],
            [
                "Royal Dutch Shell",
                317.2
            ],
            [
                "Santander Group",
                1570.6
            ],
            [
                "Total",
                192.8
            ],
            [
                "Walmart",
                180.7
            ],
            [
                "Wells Fargo",
                1258.1
            ]
        ]
    },
    {
        "question": "What are the maximum and minimum sales of the companies whose industries are not \"Banking\".",
        "query": "MATCH (companies:`company_office.Companies`)\nWHERE companies.Industry <> 'Banking'\nRETURN max(companies.Sales_billion),min(companies.Sales_billion)",
        "db_id": "company_office",
        "answers": [
            [
                421.8,
                98.7
            ]
        ]
    },
    {
        "question": "Count the number of distinct company industries.",
        "query": "MATCH (companies:`company_office.Companies`)\nRETURN count(DISTINCT companies.Industry)",
        "db_id": "company_office",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "List the names of buildings in descending order of building height.",
        "query": "MATCH (buildings:`company_office.buildings`)\nRETURN buildings.name\nORDER BY buildings.Height DESC",
        "db_id": "company_office",
        "answers": [
            [
                "Torre Reforma"
            ],
            [
                "Reforma 432"
            ],
            [
                "Torre KOI"
            ],
            [
                "Corporativo BBVA Bancomer"
            ],
            [
                "Torre Mitikah"
            ],
            [
                "Punto Chapultepec"
            ],
            [
                "Residencial Vidalta Torre Altaire 3"
            ],
            [
                "Reforma 90"
            ],
            [
                "Residencial Vidalta Torre Altaire 2"
            ],
            [
                "Ritz-Carlton Mexico City"
            ],
            [
                "LIU East"
            ],
            [
                "Torre New York Life"
            ]
        ]
    },
    {
        "question": "Find the stories of the building with the largest height.",
        "query": "MATCH (buildings:`company_office.buildings`)\nRETURN buildings.Stories\nORDER BY buildings.Height DESC\nLIMIT 1",
        "db_id": "company_office",
        "answers": [
            [
                57
            ]
        ]
    },
    {
        "question": "Please show the names of the buildings whose status is \"on-hold\", in ascending order of stories.",
        "query": "MATCH (buildings:`company_office.buildings`)\nWHERE buildings.Status = \"on-hold\"\nRETURN buildings.name\nORDER BY buildings.Stories ASC",
        "db_id": "company_office",
        "answers": [
            [
                "Ritz-Carlton Mexico City"
            ],
            [
                "Reforma 90"
            ],
            [
                "Residencial Vidalta Torre Altaire 2"
            ],
            [
                "Residencial Vidalta Torre Altaire 3"
            ]
        ]
    },
    {
        "question": "Please show each industry and the corresponding number of companies in that industry.",
        "query": "MATCH (companies:`company_office.Companies`)\nWITH count(companies.Industry) AS count, companies.Industry AS Industry\nRETURN Industry,count",
        "db_id": "company_office",
        "answers": [
            [
                "Banking",
                8
            ],
            [
                "Conglomerate",
                2
            ],
            [
                "Oil and gas",
                7
            ],
            [
                "Telecommunications",
                1
            ],
            [
                "Retailing",
                1
            ]
        ]
    },
    {
        "question": "Please show the industries of companies in descending order of the number of companies.",
        "query": "MATCH (companies:`company_office.Companies`)\nWITH count(companies.Industry) AS count, companies.Industry AS Industry\nRETURN Industry\nORDER BY count DESC",
        "db_id": "company_office",
        "answers": [
            [
                "Banking"
            ],
            [
                "Oil and gas"
            ],
            [
                "Conglomerate"
            ],
            [
                "Telecommunications"
            ],
            [
                "Retailing"
            ]
        ]
    },
    {
        "question": "List the industry shared by the most companies.",
        "query": "MATCH (companies:`company_office.Companies`)\nWITH count(companies.Industry) AS count, companies.Industry AS Industry\nRETURN Industry\nORDER BY count DESC\nLIMIT 1",
        "db_id": "company_office",
        "answers": [
            [
                "Banking"
            ]
        ]
    },
    {
        "question": "List the names of buildings that have no company office.",
        "query": "MATCH (buildings:`company_office.buildings`)\nWHERE NOT (buildings:`company_office.buildings`)-[:`company_office.Office_locations`]-()\nRETURN buildings.name",
        "db_id": "company_office",
        "answers": [
            [
                "Ritz-Carlton Mexico City"
            ]
        ]
    },
    {
        "question": "Find the number of companies whose industry is \"Banking\" or \"Conglomerate\",",
        "query": "MATCH (companies:`company_office.Companies`)\nWHERE companies.Industry = 'Banking' OR companies.Industry = 'Conglomerate'\nRETURN count(*)",
        "db_id": "company_office",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "question": "Show the headquarters shared by more than two companies.",
        "query": "MATCH (companies:`company_office.Companies`)\nWITH count(*) AS count, companies.Headquarters AS Headquarters\nWHERE count  > 2\nRETURN Headquarters",
        "db_id": "company_office",
        "answers": [
            [
                "USA"
            ],
            [
                "China"
            ]
        ]
    },
    {
        "question": "List the name of products in ascending order of price.",
        "query": "MATCH (products:`solvency_ii.Products`)\nRETURN products.Product_Name\nORDER BY products.Product_Price ASC",
        "db_id": "solvency_ii",
        "answers": [
            [
                "Special Dinning"
            ],
            [
                "TV Equipments"
            ],
            [
                "TV Equipments"
            ],
            [
                "Business Policy"
            ],
            [
                "Dinning"
            ],
            [
                "Special Dinning"
            ],
            [
                "Business Policy B"
            ],
            [
                "Trading Policy"
            ],
            [
                "Conference Equipments"
            ],
            [
                "Men suits"
            ],
            [
                "Men suits"
            ],
            [
                "Dinning"
            ],
            [
                "Trading Policy B"
            ],
            [
                "TV Equipments"
            ],
            [
                "Dinning"
            ]
        ]
    },
    {
        "question": "Show the prices of the products named \"Dining\" or \"Trading Policy\".",
        "query": "MATCH (products:`solvency_ii.Products`)\nWHERE products.Product_Name = 'Dining' OR products.Product_Name = 'Trading Policy'\nRETURN products.Product_Price",
        "db_id": "solvency_ii",
        "answers": [
            [
                3228.49
            ]
        ]
    },
    {
        "question": "Show different type codes of products and the number of products with each type code.",
        "query": "MATCH (products:`solvency_ii.Products`)\nWITH products.Product_Type_Code AS Product_Type_Code, count(products.Product_Type_Code) AS count\nRETURN Product_Type_Code,count",
        "db_id": "solvency_ii",
        "answers": [
            [
                "Books",
                4
            ],
            [
                "Food",
                5
            ],
            [
                "Clothes",
                2
            ],
            [
                "Electronics",
                4
            ]
        ]
    },
    {
        "question": "Show the most common type code across products.",
        "query": "MATCH (products:`solvency_ii.Products`)\nWITH products.Product_Type_Code AS Product_Type_Code, count(products.Product_Type_Code) AS count\nRETURN Product_Type_Code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "solvency_ii",
        "answers": [
            [
                "Food"
            ]
        ]
    },
    {
        "question": "Show the product type codes that have at least two products.",
        "query": "MATCH (products:`solvency_ii.Products`)\nWITH count(*) AS count, products.Product_Type_Code AS Product_Type_Code\nWHERE count  >= 2\nRETURN Product_Type_Code",
        "db_id": "solvency_ii",
        "answers": [
            [
                "Books"
            ],
            [
                "Food"
            ],
            [
                "Clothes"
            ],
            [
                "Electronics"
            ]
        ]
    },
    {
        "question": "List the name of artworks in ascending alphabetical order.",
        "query": "MATCH (artwork:`entertainment_awards.artwork`)\nRETURN artwork.Name\nORDER BY artwork.Name ASC",
        "db_id": "entertainment_awards",
        "answers": [
            [
                "Back Home"
            ],
            [
                "Boys"
            ],
            [
                "Cats"
            ],
            [
                "Daniel Mananta"
            ],
            [
                "I Know"
            ],
            [
                "Indonesian Idol"
            ],
            [
                "Loving you"
            ],
            [
                "Martin"
            ],
            [
                "Why"
            ]
        ]
    },
    {
        "question": "List the name of artworks whose type is not \"Program Talent Show\".",
        "query": "MATCH (artwork:`entertainment_awards.artwork`)\nWHERE artwork.Type <> 'Program Talent Show'\nRETURN artwork.Name",
        "db_id": "entertainment_awards",
        "answers": [
            [
                "Indonesian Idol"
            ],
            [
                "I Know"
            ],
            [
                "Loving you"
            ],
            [
                "Why"
            ],
            [
                "Boys"
            ],
            [
                "Daniel Mananta"
            ],
            [
                "Back Home"
            ]
        ]
    },
    {
        "question": "Please show different types of artworks with the corresponding number of artworks of each type.",
        "query": "MATCH (artwork:`entertainment_awards.artwork`)\nWITH count(artwork.Type) AS count, artwork.Type AS Type\nRETURN Type,count",
        "db_id": "entertainment_awards",
        "answers": [
            [
                "Program Music/Variety Show",
                3
            ],
            [
                "Presenter Music/Variety Show",
                2
            ],
            [
                "Program Talent Show",
                2
            ],
            [
                "Presenter Talent Show",
                2
            ]
        ]
    },
    {
        "question": "List the most common type of artworks.",
        "query": "MATCH (artwork:`entertainment_awards.artwork`)\nWITH count(artwork.Type) AS count, artwork.Type AS Type\nRETURN Type\nORDER BY count DESC\nLIMIT 1",
        "db_id": "entertainment_awards",
        "answers": [
            [
                "Program Music/Variety Show"
            ]
        ]
    },
    {
        "question": "List the year in which there are more than one festivals.",
        "query": "MATCH (festival_detail:`entertainment_awards.festival_detail`)\nWITH count(*) AS count, festival_detail.Year AS Year\nWHERE count  > 1\nRETURN Year",
        "db_id": "entertainment_awards",
        "answers": [
            [
                2007
            ]
        ]
    },
    {
        "question": "List the name of artworks that are not nominated.",
        "query": "MATCH (artwork:`entertainment_awards.artwork`)\nWHERE NOT (artwork:`entertainment_awards.artwork`)-[:`entertainment_awards.nomination`]-()\nRETURN artwork.Name",
        "db_id": "entertainment_awards",
        "answers": [
            [
                "Boys"
            ],
            [
                "Cats"
            ],
            [
                "Daniel Mananta"
            ]
        ]
    },
    {
        "question": "Show the number of audience in year 2008 or 2010.",
        "query": "MATCH (festival_detail:`entertainment_awards.festival_detail`)\nWHERE festival_detail.Year = 2008 OR festival_detail.Year = 2010\nRETURN festival_detail.Num_of_Audience",
        "db_id": "entertainment_awards",
        "answers": [
            [
                160
            ],
            [
                161
            ]
        ]
    },
    {
        "question": "Find the types and details for all premises and order by the premise type.",
        "query": "MATCH (premises:`customers_campaigns_ecommerce.Premises`)\nRETURN premises.premises_type,premises.premise_details\nORDER BY premises.premises_type",
        "db_id": "customers_campaigns_ecommerce",
        "answers": [
            [
                "Office",
                "38291 Jerde Light Apt. 713"
            ],
            [
                "Office",
                "5585 Abbott Walk"
            ],
            [
                "Office",
                "07318 Annetta Motorway"
            ],
            [
                "Office",
                "00100 Green Mountains Apt. 653"
            ],
            [
                "Office",
                "33294 William Lodge Apt. 953"
            ],
            [
                "Office",
                "2760 Austin Station"
            ],
            [
                "Office",
                "867 Emard Drives Apt. 066"
            ],
            [
                "Residence",
                "27839 Carissa Tunnel Suite 048"
            ],
            [
                "Residence",
                "2219 Barrows Tunnel Apt. 893"
            ],
            [
                "Residence",
                "5510 Veum Green"
            ],
            [
                "Residence",
                "5109 Jules Squares Apt. 082"
            ],
            [
                "Warehouse",
                "036 Lueilwitz Harbor"
            ],
            [
                "Warehouse",
                "676 Kelly Spur"
            ],
            [
                "Warehouse",
                "7230 Tillman Glens Suite 202"
            ],
            [
                "Warehouse",
                "62282 Wiza Glen Apt. 430"
            ]
        ]
    },
    {
        "question": "Show each premise type and the number of premises in that type.",
        "query": "MATCH (premises:`customers_campaigns_ecommerce.Premises`)\nWITH count(premises.premises_type) AS count, premises.premises_type AS premises_type\nRETURN premises_type,count",
        "db_id": "customers_campaigns_ecommerce",
        "answers": [
            [
                "Warehouse",
                4
            ],
            [
                "Residence",
                4
            ],
            [
                "Office",
                7
            ]
        ]
    },
    {
        "question": "Show all distinct product categories along with the number of mailshots in each category.",
        "query": "MATCH (mailshot_campaigns:`customers_campaigns_ecommerce.Mailshot_Campaigns`)\nWITH count(mailshot_campaigns.product_category) AS count, mailshot_campaigns.product_category AS product_category\nRETURN product_category,count",
        "db_id": "customers_campaigns_ecommerce",
        "answers": [
            [
                "food",
                11
            ],
            [
                "clothes",
                9
            ]
        ]
    },
    {
        "question": "Count the number of courses.",
        "query": "MATCH (course:`college_3.Course`)\nRETURN count(*)",
        "db_id": "college_3",
        "answers": [
            [
                76
            ]
        ]
    },
    {
        "question": "Count the number of courses with more than 2 credits.",
        "query": "MATCH (course:`college_3.Course`)\nWHERE course.Credits > 2\nRETURN count(*)",
        "db_id": "college_3",
        "answers": [
            [
                71
            ]
        ]
    }
]