[
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "what are some good places for arabic on buchanan in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a good arabic on buchanan in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some restaurants good for arabic food on buchanan in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a good place on buchanan in san francisco for arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is a good place on buchanan in san francisco for arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where can i eat arabic food on buchanan in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some good places on buchanan in san francisco for arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is a arabic restaurant on buchanan in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a restaurant on buchanan in san francisco that serves good arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a good restaurant on buchanan in san francisco for arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is a restaurant on buchanan in san francisco that serves good arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some good restaurants on buchanan in san francisco for arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some good places for arabic on buchanan in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where can i eat some good arabic food on buchanan in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is a good arabic on buchanan in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where are some restaurants good for arabic food on buchanan in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where are some good places for arabic on buchanan in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a good arabic restaurant on buchanan in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t2.STREET_NAME = 'buchanan' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some good arabics on buchanan in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)-[]-(t3:`restaurants.LOCATION`)\nWHERE t2.REGION = 'bay area' AND t1.FOOD_TYPE = 'french'\nRETURN t3.HOUSE_NUMBER,t1.NAME",
        "question": "where can i eat french food in the bay area ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'bethel island' AND t2.STREET_NAME = 'bethel island rd'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some restaurants on bethel island rd in bethel island ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'bethel island' AND t2.STREET_NAME = 'bethel island rd'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a restaurant on bethel island rd in bethel island ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'bethel island' AND t2.STREET_NAME = 'bethel island rd'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where can we find a restaurant on bethel island rd in bethel island ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'bethel island' AND t2.STREET_NAME = 'bethel island rd'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where can we find some restaurants on bethel island rd in bethel island ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)-[]-(t3:`restaurants.LOCATION`)\nWHERE t2.REGION = 'yosemite and mono lake area' AND t1.FOOD_TYPE = 'french' AND t1.RATING > 2.5\nRETURN t3.HOUSE_NUMBER,t1.NAME",
        "question": "give me some restaurants good for french food in the yosemite and mono lake area ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)-[]-(t3:`restaurants.LOCATION`)\nWHERE t2.REGION = 'yosemite and mono lake area' AND t1.FOOD_TYPE = 'french' AND t1.RATING > 2.5\nRETURN t3.HOUSE_NUMBER,t1.NAME",
        "question": "what are some good places in the yosemite and mono lake area for french food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)-[]-(t3:`restaurants.LOCATION`)\nWHERE t2.REGION = 'yosemite and mono lake area' AND t1.FOOD_TYPE = 'french' AND t1.RATING > 2.5\nRETURN t3.HOUSE_NUMBER,t1.NAME",
        "question": "give me a good restaurant in the yosemite and mono lake area for french food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)-[]-(t3:`restaurants.LOCATION`)\nWHERE t2.REGION = 'yosemite and mono lake area' AND t1.FOOD_TYPE = 'french' AND t1.RATING > 2.5\nRETURN t3.HOUSE_NUMBER,t1.NAME",
        "question": "give me a good french restaurant in the yosemite and mono lake area ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)-[]-(t3:`restaurants.LOCATION`)\nWHERE t2.REGION = 'yosemite and mono lake area' AND t1.FOOD_TYPE = 'french' AND t1.RATING > 2.5\nRETURN t3.HOUSE_NUMBER,t1.NAME",
        "question": "where is a good place in the yosemite and mono lake area for french food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)-[]-(t3:`restaurants.LOCATION`)\nWHERE t2.REGION = 'yosemite and mono lake area' AND t1.FOOD_TYPE = 'french' AND t1.RATING > 2.5\nRETURN t3.HOUSE_NUMBER,t1.NAME",
        "question": "give me a good place in the yosemite and mono lake area for french food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)-[]-(t3:`restaurants.LOCATION`)\nWHERE t2.REGION = 'yosemite and mono lake area' AND t1.FOOD_TYPE = 'french' AND t1.RATING > 2.5\nRETURN t3.HOUSE_NUMBER,t1.NAME",
        "question": "where is a good restaurant in the yosemite and mono lake area for french food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)-[]-(t3:`restaurants.LOCATION`)\nWHERE t2.REGION = 'yosemite and mono lake area' AND t1.FOOD_TYPE = 'french' AND t1.RATING > 2.5\nRETURN t3.HOUSE_NUMBER,t1.NAME",
        "question": "what are some good restaurants in the yosemite and mono lake area for french food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)-[]-(t3:`restaurants.LOCATION`)\nWHERE t2.REGION = 'yosemite and mono lake area' AND t1.FOOD_TYPE = 'french' AND t1.RATING > 2.5\nRETURN t3.HOUSE_NUMBER,t1.NAME",
        "question": "where is a good french restaurant in the yosemite and mono lake area ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.GEOGRAPHIC`)-[]-(t3:`restaurants.LOCATION`)\nWHERE t2.REGION = 'yosemite and mono lake area' AND t1.FOOD_TYPE = 'french' AND t1.RATING > 2.5\nRETURN t3.HOUSE_NUMBER,t1.NAME",
        "question": "where can i eat some good french food in the yosemite and mono lake area ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where are some restaurants good for arabic food in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "what are some good places in mountain view for arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where are some good arabic restaurants in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "show me a good arabic restaurant in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a good arabic in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a good arabic restaurant in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a good place in mountain view for arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where are some good arabics in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is a restaurant in mountain view that serves good arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "what are some good restaurants in mountain view for arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some restaurants good for arabic food in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where can i eat some good arabic food in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some good places for arabic in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is a good arabic in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a restaurant in mountain view that serves good arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some good arabic restaurants in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where are some good places for arabic in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me some good arabics in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "give me a good restaurant in mountain view for arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is a good arabic restaurant in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "what are some good places for arabic in mountain view ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is a good restaurant in mountain view for arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'mountain view' AND t1.FOOD_TYPE = 'arabic' AND t1.RATING > 2.5\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is a good place in mountain view for arabic food ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t1.NAME = 'jamerican cuisine'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where can i find a jamerican cuisine in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t1.NAME = 'jamerican cuisine'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is jamerican cuisine in san francisco ?",
        "answers": []
    },
    {
        "db_id": "restaurants",
        "query": "MATCH (t1:`restaurants.RESTAURANT`)-[]-(t2:`restaurants.LOCATION`)\nWHERE t2.CITY_NAME = 'san francisco' AND t1.NAME = 'jamerican cuisine'\nRETURN t2.HOUSE_NUMBER,t1.NAME",
        "question": "where is a jamerican cuisine in san francisco ?",
        "answers": []
    }
]