[
    {
        "question": "List the name and number of followers for each user, and sort the results by the number of followers in descending order.",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nRETURN user_profiles.name,user_profiles.followers\nORDER BY user_profiles.followers DESC",
        "db_id": "twitter_1",
        "answers": [
            [
                "Tyler Swift",
                99999998
            ],
            [
                "Natalie Portman",
                94375428
            ],
            [
                "Black Widow\n",
                35425845
            ],
            [
                "Celine Dion",
                23927492
            ],
            [
                "Iron Man",
                6662425
            ],
            [
                "Mary",
                890
            ],
            [
                "Susan",
                100
            ]
        ]
    },
    {
        "question": "List the names of 5 users followed by the largest number of other users.",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nRETURN user_profiles.name\nORDER BY user_profiles.followers DESC\nLIMIT 5",
        "db_id": "twitter_1",
        "answers": [
            [
                "Tyler Swift"
            ],
            [
                "Natalie Portman"
            ],
            [
                "Black Widow\n"
            ],
            [
                "Celine Dion"
            ],
            [
                "Iron Man"
            ]
        ]
    },
    {
        "question": "Find the name of each user and number of tweets tweeted by each of them.",
        "query": "MATCH (T1:`twitter_1.user_profiles`)-[]-(T2:`twitter_1.tweets`)\nWITH T1.name AS name, count(T2.uid) AS count\nRETURN name,count",
        "db_id": "twitter_1",
        "answers": [
            [
                "Iron Man",
                2
            ],
            [
                "Black Widow\n",
                1
            ],
            [
                "Susan",
                2
            ],
            [
                "Tyler Swift",
                1
            ],
            [
                "Celine Dion",
                2
            ]
        ]
    },
    {
        "question": "Find the name and partition id for users who tweeted less than twice.",
        "query": "MATCH (T1:`twitter_1.user_profiles`)-[]-(T2:`twitter_1.tweets`)\nWITH T1.name AS name, T1.partitionid AS partitionid, count(*) AS count\nWHERE count  < 2\nRETURN name,partitionid",
        "db_id": "twitter_1",
        "answers": [
            [
                "Black Widow\n",
                23
            ],
            [
                "Tyler Swift",
                10
            ]
        ]
    },
    {
        "question": "Find the name of the user who tweeted more than once, and number of tweets tweeted by them.",
        "query": "MATCH (T1:`twitter_1.user_profiles`)-[]-(T2:`twitter_1.tweets`)\nWITH T1.name AS name, count(*) AS count\nWHERE count  > 1\nRETURN name,count",
        "db_id": "twitter_1",
        "answers": [
            [
                "Iron Man",
                2
            ],
            [
                "Susan",
                2
            ],
            [
                "Celine Dion",
                2
            ]
        ]
    },
    {
        "question": "Find the average number of followers for the users who do not have any tweet.",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nWHERE NOT (user_profiles:`twitter_1.user_profiles`)-[]-(:`twitter_1.tweets`)\nRETURN avg(user_profiles.followers)",
        "db_id": "twitter_1",
        "answers": [
            [
                47188159.0
            ]
        ]
    },
    {
        "question": "Find the names of all the catalog entries.",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nRETURN DISTINCT catalog_contents.catalog_entry_name",
        "db_id": "product_catalog",
        "answers": [
            [
                "Cola"
            ],
            [
                "Root beer"
            ],
            [
                "Cream Soda"
            ],
            [
                "Carbonated Water"
            ],
            [
                "Ginger Beer"
            ],
            [
                "Tizer"
            ],
            [
                "Vimto"
            ],
            [
                "Ramune"
            ],
            [
                "Sprite Lemo"
            ],
            [
                "Dr Pepper"
            ],
            [
                "Diet Pepsi"
            ],
            [
                "Diet Mountain Dew"
            ],
            [
                "Mountain Dew"
            ],
            [
                "Fenta Orange"
            ],
            [
                "Wanglaoji"
            ]
        ]
    },
    {
        "question": "What is the attribute data type of the attribute with name \"Green\"?",
        "query": "MATCH (attribute_definitions:`product_catalog.Attribute_Definitions`)\nWHERE attribute_definitions.attribute_name = 'Green'\nRETURN attribute_definitions.attribute_data_type",
        "db_id": "product_catalog",
        "answers": [
            [
                "Bool"
            ]
        ]
    },
    {
        "question": "Find the entry name of the catalog with the highest price (in USD).",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nRETURN catalog_contents.catalog_entry_name\nORDER BY catalog_contents.price_in_dollars DESC\nLIMIT 1",
        "db_id": "product_catalog",
        "answers": [
            [
                "Sprite Lemo"
            ]
        ]
    },
    {
        "question": "What is the product with the highest height? Give me the catalog entry name.",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nRETURN catalog_contents.catalog_entry_name\nORDER BY catalog_contents.height DESC\nLIMIT 1",
        "db_id": "product_catalog",
        "answers": [
            [
                "Cola"
            ]
        ]
    },
    {
        "question": "Find the name of the product that has the smallest capacity.",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nRETURN catalog_contents.catalog_entry_name\nORDER BY catalog_contents.capacity ASC\nLIMIT 1",
        "db_id": "product_catalog",
        "answers": [
            [
                "Cola"
            ]
        ]
    },
    {
        "question": "Find the name and capacity of products with price greater than 700 (in USD).",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nWHERE catalog_contents.price_in_dollars > 700\nRETURN catalog_contents.catalog_entry_name,catalog_contents.capacity",
        "db_id": "product_catalog",
        "answers": [
            [
                "Vimto",
                "6"
            ],
            [
                "Sprite Lemo",
                "8"
            ],
            [
                "Dr Pepper",
                "1"
            ],
            [
                "Diet Pepsi",
                "9"
            ],
            [
                "Diet Mountain Dew",
                "8"
            ]
        ]
    },
    {
        "question": "Find the dates on which more than one revisions were made.",
        "query": "MATCH (catalogs:`product_catalog.Catalogs`)\nWITH count(*) AS count, catalogs.date_of_latest_revision AS date_of_latest_revision\nWHERE count  > 1\nRETURN date_of_latest_revision",
        "db_id": "product_catalog",
        "answers": [
            [
                "2017-09-26 12:10:36"
            ],
            [
                "2017-10-26 01:16:51"
            ],
            [
                "2017-12-04 06:48:13"
            ],
            [
                "2017-03-30 09:15:37"
            ]
        ]
    },
    {
        "question": "Find the total number of catalog contents.",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nRETURN count(*)",
        "db_id": "product_catalog",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Name all the products with next entry ID greater than 8.",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nWHERE catalog_contents.next_entry_id > 8\nRETURN catalog_contents.catalog_entry_name",
        "db_id": "product_catalog",
        "answers": [
            [
                "Sprite Lemo"
            ],
            [
                "Diet Pepsi"
            ],
            [
                "Wanglaoji"
            ]
        ]
    },
    {
        "question": "Show name and distance for all aircrafts.",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN aircraft.name,aircraft.distance",
        "db_id": "flight_1",
        "answers": [
            [
                "Boeing 747-400",
                8430
            ],
            [
                "Boeing 737-800",
                3383
            ],
            [
                "Airbus A340-300",
                7120
            ],
            [
                "British Aerospace Jetstream 41",
                1502
            ],
            [
                "Embraer ERJ-145",
                1530
            ],
            [
                "SAAB 340",
                2128
            ],
            [
                "Piper Archer III",
                520
            ],
            [
                "Tupolev 154",
                4103
            ],
            [
                "Schwitzer 2-33",
                30
            ],
            [
                "Lockheed L1011",
                6900
            ],
            [
                "Boeing 757-300",
                4010
            ],
            [
                "Boeing 777-300",
                6441
            ],
            [
                "Boeing 767-400ER",
                6475
            ],
            [
                "Airbus A320",
                2605
            ],
            [
                "Airbus A319",
                1805
            ],
            [
                "Boeing 727",
                1504
            ]
        ]
    },
    {
        "question": "Show ids for all aircrafts with more than 1000 distance.",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nWHERE aircraft.distance > 1000\nRETURN aircraft.aid",
        "db_id": "flight_1",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ],
            [
                4
            ],
            [
                5
            ],
            [
                6
            ],
            [
                8
            ],
            [
                9
            ],
            [
                10
            ],
            [
                11
            ],
            [
                12
            ],
            [
                13
            ],
            [
                14
            ],
            [
                15
            ]
        ]
    },
    {
        "question": "What is the minimum, average, and maximum distance of all aircrafts.",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN min(aircraft.distance),avg(aircraft.distance),max(aircraft.distance)",
        "db_id": "flight_1",
        "answers": [
            [
                30,
                3655.375,
                8430
            ]
        ]
    },
    {
        "question": "Show the id and name of the aircraft with the maximum distance.",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN aircraft.aid,aircraft.name\nORDER BY aircraft.distance DESC\nLIMIT 1",
        "db_id": "flight_1",
        "answers": [
            [
                1,
                "Boeing 747-400"
            ]
        ]
    },
    {
        "question": "Show the name of aircrafts with top three lowest distances.",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN aircraft.name\nORDER BY aircraft.distance\nLIMIT 3",
        "db_id": "flight_1",
        "answers": [
            [
                "Schwitzer 2-33"
            ],
            [
                "Piper Archer III"
            ],
            [
                "British Aerospace Jetstream 41"
            ]
        ]
    },
    {
        "question": "Show name and salary for all employees sorted by salary.",
        "query": "MATCH (employee:`flight_1.employee`)\nRETURN employee.name,employee.salary\nORDER BY employee.salary",
        "db_id": "flight_1",
        "answers": [
            [
                "Milo Brooks",
                20
            ],
            [
                "Donald King",
                18050
            ],
            [
                "Richard Jackson",
                23980
            ],
            [
                "Patricia Jones",
                24450
            ],
            [
                "Linda Davis",
                27984
            ],
            [
                "Elizabeth Taylor",
                32021
            ],
            [
                "Haywood Kelly",
                32899
            ],
            [
                "Chad Stewart",
                33546
            ],
            [
                "David Anderson",
                43001
            ],
            [
                "Barbara Wilson",
                43723
            ],
            [
                "Robert Brown",
                44740
            ],
            [
                "Michael Miller",
                48090
            ],
            [
                "William Moore",
                48250
            ],
            [
                "Jennifer Thomas",
                54921
            ],
            [
                "William Ward",
                84476
            ],
            [
                "Michael Miller",
                99890
            ],
            [
                "Larry West",
                101745
            ],
            [
                "William Jones",
                105743
            ],
            [
                "Eric Cooper",
                114323
            ],
            [
                "James Smith",
                120433
            ],
            [
                "Dorthy Lewis",
                152013
            ],
            [
                "John Williams",
                153972
            ],
            [
                "Mary Johnson",
                178345
            ],
            [
                "Karen Scott",
                205187
            ],
            [
                "Mark Young",
                205187
            ],
            [
                "Lawrence Sperry",
                212156
            ],
            [
                "Angela Martinez",
                212156
            ],
            [
                "Joseph Thompson",
                212156
            ],
            [
                "Betty Adams",
                227489
            ],
            [
                "Lisa Walker",
                256481
            ],
            [
                "George Wright",
                289950
            ]
        ]
    },
    {
        "question": "Show ids for all employees with at least 100000 salary.",
        "query": "MATCH (employee:`flight_1.employee`)\nWHERE employee.salary > 100000\nRETURN employee.eid",
        "db_id": "flight_1",
        "answers": [
            [
                242518965
            ],
            [
                141582651
            ],
            [
                11564812
            ],
            [
                567354612
            ],
            [
                552455318
            ],
            [
                550156548
            ],
            [
                390487451
            ],
            [
                355548984
            ],
            [
                310454876
            ],
            [
                142519864
            ],
            [
                269734834
            ],
            [
                552455348
            ],
            [
                556784565
            ],
            [
                573284895
            ],
            [
                574489456
            ]
        ]
    },
    {
        "question": "Show the id and name of the employee with maximum salary.",
        "query": "MATCH (employee:`flight_1.employee`)\nRETURN employee.eid,employee.name\nORDER BY employee.salary DESC\nLIMIT 1",
        "db_id": "flight_1",
        "answers": [
            [
                269734834,
                "George Wright"
            ]
        ]
    },
    {
        "question": "Show the name of employees with three lowest salaries.",
        "query": "MATCH (employee:`flight_1.employee`)\nRETURN employee.name\nORDER BY employee.salary ASC\nLIMIT 3",
        "db_id": "flight_1",
        "answers": [
            [
                "Milo Brooks"
            ],
            [
                "Donald King"
            ],
            [
                "Richard Jackson"
            ]
        ]
    },
    {
        "question": "Show the id and salary of Mark Young.",
        "query": "MATCH (employee:`flight_1.employee`)\nWHERE employee.name = 'Mark Young'\nRETURN employee.eid,employee.salary",
        "db_id": "flight_1",
        "answers": [
            [
                556784565,
                205187
            ]
        ]
    },
    {
        "question": "Show flight number, origin, destination of all flights in the alphabetical order of the departure cities.",
        "query": "MATCH (flight:`flight_1.flight`)\nRETURN flight.flno,flight.origin,flight.destination\nORDER BY flight.origin",
        "db_id": "flight_1",
        "answers": [
            [
                76,
                "Chicago",
                "Los Angeles"
            ],
            [
                68,
                "Chicago",
                "New York"
            ],
            [
                99,
                "Los Angeles",
                "Washington D.C."
            ],
            [
                13,
                "Los Angeles",
                "Chicago"
            ],
            [
                346,
                "Los Angeles",
                "Dallas"
            ],
            [
                387,
                "Los Angeles",
                "Boston"
            ],
            [
                7,
                "Los Angeles",
                "Sydney"
            ],
            [
                2,
                "Los Angeles",
                "Tokyo"
            ],
            [
                33,
                "Los Angeles",
                "Honolulu"
            ],
            [
                34,
                "Los Angeles",
                "Honolulu"
            ]
        ]
    },
    {
        "question": "Show all flight number from Los Angeles.",
        "query": "MATCH (flight:`flight_1.flight`)\nWHERE flight.origin = 'Los Angeles'\nRETURN flight.flno",
        "db_id": "flight_1",
        "answers": [
            [
                99
            ],
            [
                13
            ],
            [
                346
            ],
            [
                387
            ],
            [
                7
            ],
            [
                2
            ],
            [
                33
            ],
            [
                34
            ]
        ]
    },
    {
        "question": "Show origins of all flights with destination Honolulu.",
        "query": "MATCH (flight:`flight_1.flight`)\nWHERE flight.destination = 'Honolulu'\nRETURN flight.origin",
        "db_id": "flight_1",
        "answers": [
            [
                "Los Angeles"
            ],
            [
                "Los Angeles"
            ]
        ]
    },
    {
        "question": "What are the origins of all flights that are headed to Honolulu?",
        "query": "MATCH (flight:`flight_1.flight`)\nWHERE flight.destination = 'Honolulu'\nRETURN flight.origin",
        "db_id": "flight_1",
        "answers": [
            [
                "Los Angeles"
            ],
            [
                "Los Angeles"
            ]
        ]
    },
    {
        "question": "Show me the departure date and arrival date for all flights from Los Angeles to Honolulu.",
        "query": "MATCH (flight:`flight_1.flight`)\nWHERE flight.origin = 'Los Angeles' AND flight.destination = 'Honolulu'\nRETURN flight.departure_date,flight.arrival_date",
        "db_id": "flight_1",
        "answers": [
            [
                "04/12/2005 09:15",
                "04/12/2005 11:15"
            ],
            [
                "04/12/2005 12:45",
                "04/12/2005 03:18"
            ]
        ]
    },
    {
        "question": "What are the departure and arrival dates of all flights from LA to Honolulu?",
        "query": "MATCH (flight:`flight_1.flight`)\nWHERE flight.origin = 'Los Angeles' AND flight.destination = 'Honolulu'\nRETURN flight.departure_date,flight.arrival_date",
        "db_id": "flight_1",
        "answers": [
            [
                "04/12/2005 09:15",
                "04/12/2005 11:15"
            ],
            [
                "04/12/2005 12:45",
                "04/12/2005 03:18"
            ]
        ]
    },
    {
        "question": "Show flight number for all flights with more than 2000 distance.",
        "query": "MATCH (flight:`flight_1.flight`)\nWHERE flight.distance > 2000\nRETURN flight.flno",
        "db_id": "flight_1",
        "answers": [
            [
                99
            ],
            [
                387
            ],
            [
                7
            ],
            [
                2
            ],
            [
                33
            ],
            [
                34
            ]
        ]
    },
    {
        "question": "What is the average price for flights from Los Angeles to Honolulu.",
        "query": "MATCH (flight:`flight_1.flight`)\nWHERE flight.origin = 'Los Angeles' AND flight.destination = 'Honolulu'\nRETURN avg(flight.price)",
        "db_id": "flight_1",
        "answers": [
            [
                400.605
            ]
        ]
    },
    {
        "question": "What is the average price for flights from LA to Honolulu?",
        "query": "MATCH (flight:`flight_1.flight`)\nWHERE flight.origin = 'Los Angeles' AND flight.destination = 'Honolulu'\nRETURN avg(flight.price)",
        "db_id": "flight_1",
        "answers": [
            [
                400.605
            ]
        ]
    },
    {
        "question": "Show origin and destination for flights with price higher than 300.",
        "query": "MATCH (flight:`flight_1.flight`)\nWHERE flight.price > 300\nRETURN flight.origin,flight.destination",
        "db_id": "flight_1",
        "answers": [
            [
                "Los Angeles",
                "Tokyo"
            ],
            [
                "Los Angeles",
                "Honolulu"
            ],
            [
                "Los Angeles",
                "Honolulu"
            ]
        ]
    },
    {
        "question": "Show the flight number and distance of the flight with maximum price.",
        "query": "MATCH (flight:`flight_1.flight`)\nRETURN flight.flno,flight.distance\nORDER BY flight.price DESC\nLIMIT 1",
        "db_id": "flight_1",
        "answers": [
            [
                2,
                5478
            ]
        ]
    },
    {
        "question": "Show the flight number of flights with three lowest distances.",
        "query": "MATCH (flight:`flight_1.flight`)\nRETURN flight.flno\nORDER BY flight.distance ASC\nLIMIT 3",
        "db_id": "flight_1",
        "answers": [
            [
                68
            ],
            [
                346
            ],
            [
                13
            ]
        ]
    },
    {
        "question": "Show all origins and the number of flights from each origin.",
        "query": "MATCH (flight:`flight_1.flight`)\nWITH flight.origin AS origin, count(flight.origin) AS count\nRETURN origin,count",
        "db_id": "flight_1",
        "answers": [
            [
                "Los Angeles",
                8
            ],
            [
                "Chicago",
                2
            ]
        ]
    },
    {
        "question": "Show all destinations and the number of flights to each destination.",
        "query": "MATCH (flight:`flight_1.flight`)\nWITH count(flight.destination) AS count, flight.destination AS destination\nRETURN destination,count",
        "db_id": "flight_1",
        "answers": [
            [
                "Washington D.C.",
                1
            ],
            [
                "Chicago",
                1
            ],
            [
                "Dallas",
                1
            ],
            [
                "Boston",
                1
            ],
            [
                "Sydney",
                1
            ],
            [
                "Tokyo",
                1
            ],
            [
                "Honolulu",
                2
            ],
            [
                "Los Angeles",
                1
            ],
            [
                "New York",
                1
            ]
        ]
    },
    {
        "question": "What is the aircraft name for the flight with number 99",
        "query": "MATCH (T1:`flight_1.flight`)-[]-(T2:`flight_1.aircraft`)\nWHERE T1.flno = 99\nRETURN T2.name",
        "db_id": "flight_1",
        "answers": [
            [
                "Boeing 747-400"
            ]
        ]
    },
    {
        "question": "Show all flight numbers with aircraft Airbus A340-300.",
        "query": "MATCH (T1:`flight_1.flight`)-[]-(T2:`flight_1.aircraft`)\nWHERE T2.name = \"Airbus A340-300\"\nRETURN T1.flno",
        "db_id": "flight_1",
        "answers": [
            [
                7
            ],
            [
                13
            ]
        ]
    },
    {
        "question": "Show aircraft names and number of flights for each aircraft.",
        "query": "MATCH (T1:`flight_1.flight`)-[]-(T2:`flight_1.aircraft`)\nWITH T2.name AS name, count(T1.aid) AS count\nRETURN name,count",
        "db_id": "flight_1",
        "answers": [
            [
                "Boeing 747-400",
                1
            ],
            [
                "Airbus A340-300",
                2
            ],
            [
                "Boeing 737-800",
                1
            ],
            [
                "SAAB 340",
                1
            ],
            [
                "Lockheed L1011",
                2
            ],
            [
                "Piper Archer III",
                1
            ],
            [
                "Embraer ERJ-145",
                1
            ],
            [
                "Boeing 757-300",
                1
            ]
        ]
    },
    {
        "question": "Show names for all aircraft with at least two flights.",
        "query": "MATCH (T1:`flight_1.flight`)-[]-(T2:`flight_1.aircraft`)\nWITH count(*) AS count, T2.name AS name\nWHERE count  >= 2\nRETURN name",
        "db_id": "flight_1",
        "answers": [
            [
                "Airbus A340-300"
            ],
            [
                "Lockheed L1011"
            ]
        ]
    },
    {
        "question": "Show names for all aircrafts of which John Williams has certificates.",
        "query": "MATCH (T1:`flight_1.employee`)-[T2:`flight_1.certificate`]-(T3:`flight_1.aircraft`)\nWHERE T1.name = 'John Williams'\nRETURN T3.name",
        "db_id": "flight_1",
        "answers": [
            [
                "Boeing 757-300"
            ],
            [
                "Boeing 737-800"
            ]
        ]
    },
    {
        "question": "Show names for all employees who have certificate of Boeing 737-800.",
        "query": "MATCH (T1:`flight_1.employee`)-[T2:`flight_1.certificate`]-(T3:`flight_1.aircraft`)\nWHERE T3.name = \"Boeing 737-800\"\nRETURN T1.name",
        "db_id": "flight_1",
        "answers": [
            [
                "Mark Young"
            ],
            [
                "Lisa Walker"
            ],
            [
                "George Wright"
            ],
            [
                "Mary Johnson"
            ],
            [
                "Larry West"
            ],
            [
                "John Williams"
            ],
            [
                "James Smith"
            ],
            [
                "Betty Adams"
            ]
        ]
    },
    {
        "question": "What is the name and distance of every aircraft that can cover a distance of more than 5000 and which at least 5 people can fly?",
        "query": "MATCH ()-[T1:`flight_1.certificate`]-(T2:`flight_1.aircraft`)\nWHERE T2.distance > 5000\nWITH T2.name AS name, count(T1.aid) AS count\nRETURN name\nORDER BY count",
        "db_id": "flight_1",
        "answers": [
            [
                "Boeing 747-400"
            ],
            [
                "Airbus A340-300"
            ],
            [
                "Lockheed L1011"
            ],
            [
                "Boeing 777-300"
            ],
            [
                "Boeing 767-400ER"
            ]
        ]
    },
    {
        "question": "What is the salary and name of the employee who has the most number of certificates on aircrafts with distance more than 5000?",
        "query": "MATCH (T1:`flight_1.employee`)-[T2:`flight_1.certificate`]-(T3:`flight_1.aircraft`)\nWHERE T3.distance > 5000\nWITH T1.name AS name, count(T1.eid) AS count\nRETURN name\nORDER BY count DESC\nLIMIT 1",
        "db_id": "flight_1",
        "answers": [
            [
                "Lisa Walker"
            ]
        ]
    },
    {
        "question": "What is the salaray and name of the employee with the most certificates to fly planes more than 5000?",
        "query": "MATCH (T1:`flight_1.employee`)-[T2:`flight_1.certificate`]-(T3:`flight_1.aircraft`)\nWHERE T3.distance > 5000\nWITH T1.name AS name, count(T1.eid) AS count\nRETURN name\nORDER BY count DESC\nLIMIT 1",
        "db_id": "flight_1",
        "answers": [
            [
                "Lisa Walker"
            ]
        ]
    },
    {
        "question": "Show all allergy types.",
        "query": "MATCH (allergy_type:`allergy_1.Allergy_Type`)\nRETURN DISTINCT allergy_type.AllergyType",
        "db_id": "allergy_1",
        "answers": [
            [
                "food"
            ],
            [
                "environmental"
            ],
            [
                "animal"
            ]
        ]
    }
]