[
    {
        "question": "Find the number of projects which each scientist is working on and scientist's name.",
        "query": "MATCH (T1:`scientist_1.Scientists`)-[T2:`scientist_1.AssignedTo`]-()\nWITH T1.Name AS Name, count(T1.Name) AS count\nRETURN count,Name",
        "db_id": "scientist_1",
        "answers": [
            [
                1,
                "Michael Rogers"
            ],
            [
                1,
                "Anand Manikutty"
            ],
            [
                1,
                "Carol Smith"
            ],
            [
                1,
                "Joe Stevens"
            ],
            [
                1,
                "Mary-Anne Foster"
            ],
            [
                1,
                "George ODonnell"
            ],
            [
                1,
                "John Doe"
            ],
            [
                1,
                "David Smith"
            ],
            [
                1,
                "Zacary Efron"
            ],
            [
                1,
                "Eric Goldsmith"
            ],
            [
                1,
                "Elizabeth Doe"
            ],
            [
                1,
                "Kumar Swamy"
            ]
        ]
    },
    {
        "question": "Select the project names which are not assigned yet.",
        "query": "MATCH (projects:`scientist_1.Projects`)\nWHERE NOT (projects:`scientist_1.Projects`)-[:`scientist_1.AssignedTo`]-()\nRETURN projects.Name",
        "db_id": "scientist_1",
        "answers": [
            [
                "Aerodynamics and Bridge Design"
            ],
            [
                "Aerodynamics of a Football"
            ],
            [
                "Aerodynamics of Air Hockey"
            ],
            [
                "A Magnetic Primer Designer"
            ],
            [
                "Bacterial Transformation Efficiency"
            ],
            [
                "A Soluble Separation Solution"
            ]
        ]
    },
    {
        "question": "What are the names of projects that have not been assigned?",
        "query": "MATCH (projects:`scientist_1.Projects`)\nWHERE NOT (projects:`scientist_1.Projects`)-[:`scientist_1.AssignedTo`]-()\nRETURN projects.Name",
        "db_id": "scientist_1",
        "answers": [
            [
                "Aerodynamics and Bridge Design"
            ],
            [
                "Aerodynamics of a Football"
            ],
            [
                "Aerodynamics of Air Hockey"
            ],
            [
                "A Magnetic Primer Designer"
            ],
            [
                "Bacterial Transformation Efficiency"
            ],
            [
                "A Soluble Separation Solution"
            ]
        ]
    },
    {
        "question": "Find the number of scientists who are not assigned to any project.",
        "query": "MATCH (scientists:`scientist_1.Scientists`)\nWHERE NOT (scientists:`scientist_1.Scientists`)-[:`scientist_1.AssignedTo`]-()\nRETURN count(*)",
        "db_id": "scientist_1",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "How many scientists do not have any projects assigned to them?",
        "query": "MATCH (scientists:`scientist_1.Scientists`)\nWHERE NOT (scientists:`scientist_1.Scientists`)-[:`scientist_1.AssignedTo`]-()\nRETURN count(*)",
        "db_id": "scientist_1",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "List all the scientists' names, their projects' names, and the hours worked by that scientist on each project, in alphabetical order of project name, and then scientist name.",
        "query": "MATCH (T1:`scientist_1.Scientists`)-[T2:`scientist_1.AssignedTo`]-(T3:`scientist_1.Projects`)\nRETURN T1.Name,T3.Name,T3.Hours\nORDER BY T3.Name,T1.Name",
        "db_id": "scientist_1",
        "answers": [
            [
                "Elizabeth Doe",
                "A Matter of Time",
                112
            ],
            [
                "Kumar Swamy",
                "A Puzzling Parallax",
                299
            ],
            [
                "John Doe",
                "A Silver-Cleaning Battery",
                545
            ],
            [
                "Zacary Efron",
                "A Silver-Cleaning Battery",
                545
            ],
            [
                "Anand Manikutty",
                "Aerodynamics and Gas Mileage",
                256
            ],
            [
                "Eric Goldsmith",
                "Aerodynamics and Gas Mileage",
                256
            ],
            [
                "George ODonnell",
                "Aerodynamics and Ice Hockey",
                789
            ],
            [
                "Carol Smith",
                "Build Your Own Telescope",
                6546
            ],
            [
                "David Smith",
                "Build Your Own Telescope",
                6546
            ],
            [
                "Joe Stevens",
                "Build Your Own Telescope",
                6546
            ],
            [
                "Mary-Anne Foster",
                "Juicy: Extracting Apple Juice with Pectinase",
                321
            ],
            [
                "Michael Rogers",
                "Winds: Studying Bernoullis Principle",
                156
            ]
        ]
    },
    {
        "question": "Count the number of appelations in Napa County.",
        "query": "MATCH (appellations:`wine_1.appellations`)\nWHERE appellations.County = 'Napa'\nRETURN count(*)",
        "db_id": "wine_1",
        "answers": [
            [
                11
            ]
        ]
    },
    {
        "question": "Show the name, location, and number of platforms for all stations.",
        "query": "MATCH (station:`train_station.station`)\nRETURN station.Name,station.Location,station.Number_of_Platforms",
        "db_id": "train_station",
        "answers": [
            [
                "London Waterloo",
                "London",
                19
            ],
            [
                "London Victoria",
                "London",
                19
            ],
            [
                "London Bridge",
                "London",
                12
            ],
            [
                "London Liverpool Street",
                "London",
                18
            ],
            [
                "London Euston",
                "London",
                18
            ],
            [
                "London Charing Cross",
                "London",
                6
            ],
            [
                "Birmingham New Street",
                "Birmingham",
                13
            ],
            [
                "London King's Cross",
                "London",
                12
            ],
            [
                "Glasgow Central",
                "Glasgow",
                17
            ],
            [
                "East Croydon",
                "London",
                6
            ],
            [
                "London St Pancras",
                "London",
                15
            ],
            [
                "Stratford",
                "London",
                15
            ]
        ]
    },
    {
        "question": "Show the names and total passengers for all train stations not in London.",
        "query": "MATCH (station:`train_station.station`)\nWHERE station.Location <> 'London'\nRETURN station.Name,station.Total_Passengers",
        "db_id": "train_station",
        "answers": [
            [
                "Birmingham New Street",
                36.331
            ],
            [
                "Glasgow Central",
                29.658
            ]
        ]
    },
    {
        "question": "Show the names and main services for train stations that have the top three total number of passengers.",
        "query": "MATCH (station:`train_station.station`)\nRETURN station.Name,station.Main_Services\nORDER BY station.Total_Passengers DESC\nLIMIT 3",
        "db_id": "train_station",
        "answers": [
            [
                "London Waterloo",
                "South Western Main Line West of England Main Line"
            ],
            [
                "London Victoria",
                "Brighton Main Line Chatham Main Line"
            ],
            [
                "London Bridge",
                "South Eastern Main Line Thameslink"
            ]
        ]
    },
    {
        "question": "Show all locations that have train stations with at least 15 platforms and train stations with more than 25 total passengers.",
        "query": "MATCH (station:`train_station.station`)\nWHERE station.Number_of_Platforms >= 15 AND station.Total_Passengers > 25\nRETURN DISTINCT station.Location",
        "db_id": "train_station",
        "answers": [
            [
                "London"
            ],
            [
                "Glasgow"
            ]
        ]
    },
    {
        "question": "Show the location with most number of train stations.",
        "query": "MATCH (station:`train_station.station`)\nWITH count(station.Location) AS count, station.Location AS Location\nRETURN Location\nORDER BY count DESC\nLIMIT 1",
        "db_id": "train_station",
        "answers": [
            [
                "London"
            ]
        ]
    },
    {
        "question": "Show the number of trains",
        "query": "MATCH (train:`train_station.train`)\nRETURN count(*)",
        "db_id": "train_station",
        "answers": [
            [
                11
            ]
        ]
    },
    {
        "question": "Show all locations with only 1 station.",
        "query": "MATCH (station:`train_station.station`)\nWITH count(*) AS count, station.Location AS Location\nWHERE count  = 1\nRETURN Location",
        "db_id": "train_station",
        "answers": [
            [
                "Birmingham"
            ],
            [
                "Glasgow"
            ]
        ]
    },
    {
        "question": "Show station names without any trains.",
        "query": "MATCH (station:`train_station.station`)\nWHERE NOT (station:`train_station.station`)-[:`train_station.train_station`]-()\nRETURN station.Name",
        "db_id": "train_station",
        "answers": [
            [
                "London Liverpool Street"
            ],
            [
                "London Charing Cross"
            ],
            [
                "Birmingham New Street"
            ],
            [
                "London St Pancras"
            ],
            [
                "Stratford"
            ]
        ]
    },
    {
        "question": "List the names and locations of all stations ordered by their yearly entry exit and interchange amounts.",
        "query": "MATCH (station:`train_station.station`)\nRETURN station.Name,station.Location\nORDER BY station.Annual_entry_exit,station.Annual_interchanges",
        "db_id": "train_station",
        "answers": [
            [
                "East Croydon",
                "London"
            ],
            [
                "Stratford",
                "London"
            ],
            [
                "London St Pancras",
                "London"
            ],
            [
                "Glasgow Central",
                "Glasgow"
            ],
            [
                "London King's Cross",
                "London"
            ],
            [
                "Birmingham New Street",
                "Birmingham"
            ],
            [
                "London Euston",
                "London"
            ],
            [
                "London Charing Cross",
                "London"
            ],
            [
                "London Bridge",
                "London"
            ],
            [
                "London Liverpool Street",
                "London"
            ],
            [
                "London Victoria",
                "London"
            ],
            [
                "London Waterloo",
                "London"
            ]
        ]
    },
    {
        "question": "List all vehicle id",
        "query": "MATCH (vehicles:`driving_school.Vehicles`)\nRETURN vehicles.vehicle_id",
        "db_id": "driving_school",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ]
        ]
    },
    {
        "question": "Show the detail of vehicle with id 1.",
        "query": "MATCH (vehicles:`driving_school.Vehicles`)\nWHERE vehicles.vehicle_id = 1\nRETURN vehicles.vehicle_details",
        "db_id": "driving_school",
        "answers": [
            [
                "Van"
            ]
        ]
    },
    {
        "question": "List the first name middle name and last name of all staff.",
        "query": "MATCH (staff:`driving_school.Staff`)\nRETURN staff.first_name,staff.middle_name,staff.last_name",
        "db_id": "driving_school",
        "answers": [
            [
                "Janessa",
                "Amara",
                "Sawayn"
            ],
            [
                "Camylle",
                "Icie",
                "Weissnat"
            ],
            [
                "Kaitlin",
                "Stephania",
                "Mertz"
            ],
            [
                "Rebekah",
                "Sherwood",
                "Hermann"
            ],
            [
                "Jedidiah",
                "Dejon",
                "Herzog"
            ],
            [
                "Eulalia",
                "Tre",
                "Maggio"
            ],
            [
                "Queenie",
                "Madelyn",
                "Macejkovic"
            ],
            [
                "Titus",
                "Duane",
                "Durgan"
            ],
            [
                "Margie",
                "Caesar",
                "Doyle"
            ],
            [
                "Jaleel",
                "Maiya",
                "Rogahn"
            ],
            [
                "Winnifred",
                "Liam",
                "Jast"
            ],
            [
                "Lincoln",
                "Benny",
                "Carroll"
            ],
            [
                "Ernestina",
                "Clarabelle",
                "Mraz"
            ],
            [
                "Ludie",
                "Ulices",
                "Kuphal"
            ],
            [
                "Simeon",
                "Mayra",
                "Turner"
            ]
        ]
    },
    {
        "question": "What is the birthday of the staff member with first name as Janessa and last name as Sawayn?",
        "query": "MATCH (staff:`driving_school.Staff`)\nWHERE staff.first_name = 'Janessa' AND staff.last_name = 'Sawayn'\nRETURN staff.date_of_birth",
        "db_id": "driving_school",
        "answers": [
            [
                "2010-12-08 16:55:14"
            ]
        ]
    },
    {
        "question": "What is the date of birth for the staff member named Janessa Sawayn?",
        "query": "MATCH (staff:`driving_school.Staff`)\nWHERE staff.first_name = 'Janessa' AND staff.last_name = 'Sawayn'\nRETURN staff.date_of_birth",
        "db_id": "driving_school",
        "answers": [
            [
                "2010-12-08 16:55:14"
            ]
        ]
    },
    {
        "question": "When did the staff member with first name as Janessa and last name as Sawayn join the company?",
        "query": "MATCH (staff:`driving_school.Staff`)\nWHERE staff.first_name = 'Janessa' AND staff.last_name = 'Sawayn'\nRETURN staff.date_joined_staff",
        "db_id": "driving_school",
        "answers": [
            [
                "2017-04-27 03:21:26"
            ]
        ]
    },
    {
        "question": "When did the staff member named Janessa Sawayn join the company?",
        "query": "MATCH (staff:`driving_school.Staff`)\nWHERE staff.first_name = 'Janessa' AND staff.last_name = 'Sawayn'\nRETURN staff.date_joined_staff",
        "db_id": "driving_school",
        "answers": [
            [
                "2017-04-27 03:21:26"
            ]
        ]
    },
    {
        "question": "When did the staff member with first name as Janessa and last name as Sawayn leave the company?",
        "query": "MATCH (staff:`driving_school.Staff`)\nWHERE staff.first_name = 'Janessa' AND staff.last_name = 'Sawayn'\nRETURN staff.date_left_staff",
        "db_id": "driving_school",
        "answers": [
            [
                "2018-03-23 22:53:12"
            ]
        ]
    },
    {
        "question": "When did the staff member Janessa Sawayn leave the company?",
        "query": "MATCH (staff:`driving_school.Staff`)\nWHERE staff.first_name = 'Janessa' AND staff.last_name = 'Sawayn'\nRETURN staff.date_left_staff",
        "db_id": "driving_school",
        "answers": [
            [
                "2018-03-23 22:53:12"
            ]
        ]
    },
    {
        "question": "How many staff have the first name Ludie?",
        "query": "MATCH (staff:`driving_school.Staff`)\nWHERE staff.first_name = 'Ludie'\nRETURN count(*)",
        "db_id": "driving_school",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "question": "How many employees have a first name of Ludie?",
        "query": "MATCH (staff:`driving_school.Staff`)\nWHERE staff.first_name = 'Ludie'\nRETURN count(*)",
        "db_id": "driving_school",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "question": "What is the nickname of staff with first name as Janessa and last name as Sawayn?",
        "query": "MATCH (staff:`driving_school.Staff`)\nWHERE staff.first_name = 'Janessa' AND staff.last_name = 'Sawayn'\nRETURN staff.nickname",
        "db_id": "driving_school",
        "answers": [
            [
                "thompson.constantin"
            ]
        ]
    },
    {
        "question": "What is the nickname of the employee named Janessa Sawayn?",
        "query": "MATCH (staff:`driving_school.Staff`)\nWHERE staff.first_name = 'Janessa' AND staff.last_name = 'Sawayn'\nRETURN staff.nickname",
        "db_id": "driving_school",
        "answers": [
            [
                "thompson.constantin"
            ]
        ]
    },
    {
        "question": "Which city does staff with first name as Janessa and last name as Sawayn live?",
        "query": "MATCH (T1:`driving_school.Addresses`)-[]-(T2:`driving_school.Staff`)\nWHERE T2.first_name = 'Janessa' AND T2.last_name = 'Sawayn'\nRETURN T1.city",
        "db_id": "driving_school",
        "answers": [
            [
                "Damianfort"
            ]
        ]
    },
    {
        "question": "In what city does Janessa Sawayn live?",
        "query": "MATCH (T1:`driving_school.Addresses`)-[]-(T2:`driving_school.Staff`)\nWHERE T2.first_name = 'Janessa' AND T2.last_name = 'Sawayn'\nRETURN T1.city",
        "db_id": "driving_school",
        "answers": [
            [
                "Damianfort"
            ]
        ]
    },
    {
        "question": "Which country and state does staff with first name as Janessa and last name as Sawayn lived?",
        "query": "MATCH (T1:`driving_school.Addresses`)-[]-(T2:`driving_school.Staff`)\nWHERE T2.first_name = 'Janessa' AND T2.last_name = 'Sawayn'\nRETURN T1.country,T1.state_province_county",
        "db_id": "driving_school",
        "answers": [
            [
                "USA",
                "Connecticut"
            ]
        ]
    },
    {
        "question": "In which country and state does Janessa Sawayn live?",
        "query": "MATCH (T1:`driving_school.Addresses`)-[]-(T2:`driving_school.Staff`)\nWHERE T2.first_name = 'Janessa' AND T2.last_name = 'Sawayn'\nRETURN T1.country,T1.state_province_county",
        "db_id": "driving_school",
        "answers": [
            [
                "USA",
                "Connecticut"
            ]
        ]
    },
    {
        "question": "What is the zip code of staff with first name as Janessa and last name as Sawayn lived?",
        "query": "MATCH (T1:`driving_school.Addresses`)-[]-(T2:`driving_school.Staff`)\nWHERE T2.first_name = 'Janessa' AND T2.last_name = 'Sawayn'\nRETURN T1.zip_postcode",
        "db_id": "driving_school",
        "answers": [
            [
                "61121"
            ]
        ]
    },
    {
        "question": "What is the zip code of the hosue of the employee named Janessa Sawayn?",
        "query": "MATCH (T1:`driving_school.Addresses`)-[]-(T2:`driving_school.Staff`)\nWHERE T2.first_name = 'Janessa' AND T2.last_name = 'Sawayn'\nRETURN T1.zip_postcode",
        "db_id": "driving_school",
        "answers": [
            [
                "61121"
            ]
        ]
    },
    {
        "question": "How many staff live in state Georgia?",
        "query": "MATCH (addresses:`driving_school.Addresses`)\nWHERE addresses.state_province_county = 'Georgia'\nRETURN count(*)",
        "db_id": "driving_school",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "How many employees live in Georgia?",
        "query": "MATCH (addresses:`driving_school.Addresses`)\nWHERE addresses.state_province_county = 'Georgia'\nRETURN count(*)",
        "db_id": "driving_school",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "Find out the first name and last name of staff lived in city Damianfort.",
        "query": "MATCH (T1:`driving_school.Addresses`)-[]-(T2:`driving_school.Staff`)\nWHERE T1.city = 'Damianfort'\nRETURN T2.first_name,T2.last_name",
        "db_id": "driving_school",
        "answers": [
            [
                "Janessa",
                "Sawayn"
            ],
            [
                "Jedidiah",
                "Herzog"
            ]
        ]
    },
    {
        "question": "What is the first and last name of all employees who live in the city Damianfort?",
        "query": "MATCH (T1:`driving_school.Addresses`)-[]-(T2:`driving_school.Staff`)\nWHERE T1.city = 'Damianfort'\nRETURN T2.first_name,T2.last_name",
        "db_id": "driving_school",
        "answers": [
            [
                "Janessa",
                "Sawayn"
            ],
            [
                "Jedidiah",
                "Herzog"
            ]
        ]
    },
    {
        "question": "Which city lives most of staffs? List the city name and number of staffs.",
        "query": "MATCH (T1:`driving_school.Addresses`)-[]-(T2:`driving_school.Staff`)\nWITH T1.city AS city, count(T1.city) AS count\nRETURN city,count\nORDER BY count DESC\nLIMIT 1",
        "db_id": "driving_school",
        "answers": [
            [
                "Port Melyssa",
                4
            ]
        ]
    },
    {
        "question": "In which city do the most employees live and how many of them live there?",
        "query": "MATCH (T1:`driving_school.Addresses`)-[]-(T2:`driving_school.Staff`)\nWITH T1.city AS city, count(T1.city) AS count\nRETURN city,count\nORDER BY count DESC\nLIMIT 1",
        "db_id": "driving_school",
        "answers": [
            [
                "Port Melyssa",
                4
            ]
        ]
    },
    {
        "question": "List the first name and last name of all customers.",
        "query": "MATCH (customers:`driving_school.Customers`)\nRETURN customers.first_name,customers.last_name",
        "db_id": "driving_school",
        "answers": [
            [
                "Carole",
                "Bernhard"
            ],
            [
                "Genevieve",
                "Terry"
            ],
            [
                "Clara",
                "Ortiz"
            ],
            [
                "Jordy",
                "Tromp"
            ],
            [
                "Millie",
                "Bruen"
            ],
            [
                "Amya",
                "Spinka"
            ],
            [
                "Marina",
                "Koelpin"
            ],
            [
                "Dianna",
                "Trantow"
            ],
            [
                "Leif",
                "Mertz"
            ],
            [
                "Rylan",
                "Goodwin"
            ],
            [
                "Ray",
                "Kohler"
            ],
            [
                "Omer",
                "Leuschke"
            ],
            [
                "Sigrid",
                "Schmeler"
            ],
            [
                "Estelle",
                "Grant"
            ],
            [
                "Dameon",
                "Sanford"
            ]
        ]
    },
    {
        "question": "List email address and birthday of customer whose first name as Carole.",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE customers.first_name = 'Carole'\nRETURN customers.email_address,customers.date_of_birth",
        "db_id": "driving_school",
        "answers": [
            [
                "everette.goyette@example.org",
                "1998-12-15 13:24:40"
            ]
        ]
    },
    {
        "question": "What are the email addresses and date of births for all customers who have a first name of Carole?",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE customers.first_name = 'Carole'\nRETURN customers.email_address,customers.date_of_birth",
        "db_id": "driving_school",
        "answers": [
            [
                "everette.goyette@example.org",
                "1998-12-15 13:24:40"
            ]
        ]
    },
    {
        "question": "List phone number and email address of customer with more than 2000 outstanding balance.",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE customers.amount_outstanding > 2000\nRETURN customers.phone_number,customers.email_address",
        "db_id": "driving_school",
        "answers": [
            [
                "+14(5)2351480248",
                "huel.jana@example.org"
            ],
            [
                "374-483-2758x85087",
                "hilario.sporer@example.org"
            ],
            [
                "218.550.1362",
                "afranecki@example.com"
            ],
            [
                "1-618-535-9750",
                "asha.kilback@example.org"
            ],
            [
                "1-673-962-8158x7646",
                "kozey.citlalli@example.org"
            ],
            [
                "(662)490-3108",
                "mayert.judy@example.com"
            ],
            [
                "206-054-0689x05861",
                "kroberts@example.org"
            ],
            [
                "753.921.0871",
                "mariela28@example.org"
            ],
            [
                "(297)122-0086",
                "karina.carroll@example.net"
            ],
            [
                "417.136.2900x672",
                "myrl.lind@example.net"
            ],
            [
                "192-395-2411",
                "wehner.harold@example.com"
            ],
            [
                "1-875-045-0806",
                "ehowell@example.com"
            ],
            [
                "(729)396-4354x3576",
                "kitty.hand@example.net"
            ]
        ]
    },
    {
        "question": "What is the status code, mobile phone number and email address of customer with last name as Kohler or first name as Marina?",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE customers.first_name = 'Marina' OR customers.last_name = 'Kohler'\nRETURN customers.customer_status_code,customers.cell_mobile_phone_number,customers.email_address",
        "db_id": "driving_school",
        "answers": [
            [
                "Bad Customer",
                "848-099-2095x785",
                "mayert.judy@example.com"
            ],
            [
                "Good Customer",
                "577-584-4864",
                "karina.carroll@example.net"
            ]
        ]
    },
    {
        "question": "What is the status code, phone number, and email address of the customer whose last name is Kohler or whose first name is Marina?",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE customers.first_name = 'Marina' OR customers.last_name = 'Kohler'\nRETURN customers.customer_status_code,customers.cell_mobile_phone_number,customers.email_address",
        "db_id": "driving_school",
        "answers": [
            [
                "Bad Customer",
                "848-099-2095x785",
                "mayert.judy@example.com"
            ],
            [
                "Good Customer",
                "577-584-4864",
                "karina.carroll@example.net"
            ]
        ]
    },
    {
        "question": "When did customer with first name as Carole and last name as Bernhard became a customer?",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE customers.first_name = 'Carole' AND customers.last_name = 'Bernhard'\nRETURN customers.date_became_customer",
        "db_id": "driving_school",
        "answers": [
            [
                "2016-05-11 17:03:48"
            ]
        ]
    },
    {
        "question": "When did Carole Bernhard first become a customer?",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE customers.first_name = 'Carole' AND customers.last_name = 'Bernhard'\nRETURN customers.date_became_customer",
        "db_id": "driving_school",
        "answers": [
            [
                "2016-05-11 17:03:48"
            ]
        ]
    },
    {
        "question": "List all customer status codes and the number of customers having each status code.",
        "query": "MATCH (customers:`driving_school.Customers`)\nWITH customers.customer_status_code AS customer_status_code, count(customers.customer_status_code) AS count\nRETURN customer_status_code,count",
        "db_id": "driving_school",
        "answers": [
            [
                "Bad Customer",
                9
            ],
            [
                "Good Customer",
                6
            ]
        ]
    },
    {
        "question": "Which customer status code has least number of customers?",
        "query": "MATCH (customers:`driving_school.Customers`)\nWITH customers.customer_status_code AS customer_status_code, count(customers.customer_status_code) AS count\nRETURN customer_status_code\nORDER BY count ASC\nLIMIT 1",
        "db_id": "driving_school",
        "answers": [
            [
                "Good Customer"
            ]
        ]
    },
    {
        "question": "What is the status code with the least number of customers?",
        "query": "MATCH (customers:`driving_school.Customers`)\nWITH customers.customer_status_code AS customer_status_code, count(customers.customer_status_code) AS count\nRETURN customer_status_code\nORDER BY count ASC\nLIMIT 1",
        "db_id": "driving_school",
        "answers": [
            [
                "Good Customer"
            ]
        ]
    },
    {
        "question": "How many lessons taken by customer with first name as Rylan and last name as Goodwin were completed?",
        "query": "MATCH (T1:`driving_school.Lessons`)-[]-(T2:`driving_school.Customers`)\nWHERE T2.first_name = 'Rylan' AND T2.last_name = 'Goodwin' AND T1.lesson_status_code = 'Completed'\nRETURN count(*)",
        "db_id": "driving_school",
        "answers": [
            [
                1
            ]
        ]
    }
]