[
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nRETURN match_season.Player\nORDER BY match_season.College ASC",
        "question": "What are all the players who played in match season, sorted by college in ascending alphabetical order?",
        "answers": [
            [
                "Sean Franklin Category:Articles with hCards"
            ],
            [
                "Rodrigo Faria Category:Articles with hCards"
            ],
            [
                "Damani Ralph Category:Articles with hCards"
            ],
            [
                "Jay Heaps Category:Articles with hCards"
            ],
            [
                "Steve Ralston Category:Articles with hCards"
            ],
            [
                "Clint Dempsey Category:Articles with hCards"
            ],
            [
                "C. J. Sapong Category:Articles with hCards"
            ],
            [
                "Maurice Edu Category:Articles with hCards"
            ],
            [
                "Omar Gonzalez Category:Articles with hCards"
            ],
            [
                "Carlos Bocanegra Category:Articles with hCards"
            ],
            [
                "Jonathan Bornstein Category:Articles with hCards"
            ],
            [
                "Mike Duhaney Category:Articles with hCards"
            ],
            [
                "Ben Olsen Category:Articles with hCards"
            ],
            [
                "Kyle Martino Category:Articles with hCards"
            ],
            [
                "Michael Parkhurst Category:Articles with hCards"
            ],
            [
                "Andy Najar Category:Articles with hCards"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nWITH count(*) AS count, match_season.College AS College\nWHERE count  >= 2\nRETURN College",
        "question": "Show the name of colleges that have at least two players.",
        "answers": [
            [
                "Virginia"
            ],
            [
                "UCLA"
            ],
            [
                "Maryland"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nWITH count(*) AS count, match_season.College AS College\nWHERE count  >= 2\nRETURN College",
        "question": "What are the names of all colleges that have two or more players?",
        "answers": [
            [
                "Virginia"
            ],
            [
                "UCLA"
            ],
            [
                "Maryland"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (team:`match_season.team`)\nWHERE NOT (team)-[]-(:`match_season.match_season`)    \nRETURN team.Name",
        "question": "What are the names of teams that do no have match season record?",
        "answers": [
            [
                "Brown Erdman"
            ],
            [
                "Los Angeles Galaxy"
            ],
            [
                "Berneice Hand"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (team:`match_season.team`)\nWHERE NOT (team)-[]-(:`match_season.match_season`)    \nRETURN team.Name",
        "question": "Return the names of teams that have no match season record.",
        "answers": [
            [
                "Brown Erdman"
            ],
            [
                "Los Angeles Galaxy"
            ],
            [
                "Berneice Hand"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (climber:`climbing.climber`)\nRETURN count(*)",
        "question": "How many climbers are there?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (climber:`climbing.climber`)\nRETURN count(*)",
        "question": "Count the number of climbers.",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (climber:`climbing.climber`)\nRETURN climber.Name\nORDER BY climber.Points DESC",
        "question": "List the names of climbers in descending order of points.",
        "answers": [
            [
                "Klaus Enders"
            ],
            [
                "Siegfried Schauzu"
            ],
            [
                "Hans Luthringhauser"
            ],
            [
                "Jean Claude Castella"
            ],
            [
                "Horst Owesle"
            ],
            [
                "Georg Auerbacher"
            ],
            [
                "Arseneus Butscher"
            ],
            [
                "Charlie Freedman"
            ],
            [
                "L Currie"
            ],
            [
                "Mick Horsepole"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (climber:`climbing.climber`)\nRETURN climber.Name\nORDER BY climber.Points DESC",
        "question": "What are the names of the climbers, ordered by points descending?",
        "answers": [
            [
                "Klaus Enders"
            ],
            [
                "Siegfried Schauzu"
            ],
            [
                "Hans Luthringhauser"
            ],
            [
                "Jean Claude Castella"
            ],
            [
                "Horst Owesle"
            ],
            [
                "Georg Auerbacher"
            ],
            [
                "Arseneus Butscher"
            ],
            [
                "Charlie Freedman"
            ],
            [
                "L Currie"
            ],
            [
                "Mick Horsepole"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (climber:`climbing.climber`)\nWHERE climber.Country <> 'Switzerland'\nRETURN climber.Name",
        "question": "List the names of climbers whose country is not Switzerland.",
        "answers": [
            [
                "Klaus Enders"
            ],
            [
                "Siegfried Schauzu"
            ],
            [
                "Hans Luthringhauser"
            ],
            [
                "Horst Owesle"
            ],
            [
                "Georg Auerbacher"
            ],
            [
                "Arseneus Butscher"
            ],
            [
                "Charlie Freedman"
            ],
            [
                "L Currie"
            ],
            [
                "Mick Horsepole"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (climber:`climbing.climber`)\nWHERE climber.Country <> 'Switzerland'\nRETURN climber.Name",
        "question": "What are the names of climbers who are not from the country of Switzerland?",
        "answers": [
            [
                "Klaus Enders"
            ],
            [
                "Siegfried Schauzu"
            ],
            [
                "Hans Luthringhauser"
            ],
            [
                "Horst Owesle"
            ],
            [
                "Georg Auerbacher"
            ],
            [
                "Arseneus Butscher"
            ],
            [
                "Charlie Freedman"
            ],
            [
                "L Currie"
            ],
            [
                "Mick Horsepole"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (climber:`climbing.climber`)\nWHERE climber.Country = 'United Kingdom'\nRETURN max(climber.Points)",
        "question": "What is the maximum point for climbers whose country is United Kingdom?",
        "answers": [
            [
                3.0
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (climber:`climbing.climber`)\nWHERE climber.Country = 'United Kingdom'\nRETURN max(climber.Points)",
        "question": "Return the maximum number of points for climbers from the United Kingdom.",
        "answers": [
            [
                3.0
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (climber:`climbing.climber`)\nRETURN count(DISTINCT climber.Country)",
        "question": "How many distinct countries are the climbers from?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (climber:`climbing.climber`)\nRETURN count(DISTINCT climber.Country)",
        "question": "Count the number of different countries that climbers are from.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nRETURN mountain.Name\nORDER BY mountain.Name ASC",
        "question": "What are the names of mountains in ascending alphabetical order?",
        "answers": [
            [
                "Duwoni / Mt Speke (Vittorio Emanuele Pk)"
            ],
            [
                "Kibo (Uhuru Pk)"
            ],
            [
                "Mawenzi (Hans Meyer Pk)"
            ],
            [
                "Mount Kenya (Batian)"
            ],
            [
                "Mount Kenya (Lenana)"
            ],
            [
                "Ngaliema / Mt Stanley (Margherita Pk)"
            ],
            [
                "Ngaliema / Mt Stanley (Savoia Pk)"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nRETURN mountain.Name\nORDER BY mountain.Name ASC",
        "question": "Give the names of mountains in alphabetical order.",
        "answers": [
            [
                "Duwoni / Mt Speke (Vittorio Emanuele Pk)"
            ],
            [
                "Kibo (Uhuru Pk)"
            ],
            [
                "Mawenzi (Hans Meyer Pk)"
            ],
            [
                "Mount Kenya (Batian)"
            ],
            [
                "Mount Kenya (Lenana)"
            ],
            [
                "Ngaliema / Mt Stanley (Margherita Pk)"
            ],
            [
                "Ngaliema / Mt Stanley (Savoia Pk)"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nWHERE mountain.Height > 5000\nRETURN mountain.Country",
        "question": "What are the countries of mountains with height bigger than 5000?",
        "answers": [
            [
                "Tanzania"
            ],
            [
                "Kenya"
            ],
            [
                "Tanzania"
            ],
            [
                "DR Congo Uganda"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nWHERE mountain.Height > 5000\nRETURN mountain.Country",
        "question": "Return the countries of the mountains that have a height larger than 5000.",
        "answers": [
            [
                "Tanzania"
            ],
            [
                "Kenya"
            ],
            [
                "Tanzania"
            ],
            [
                "DR Congo Uganda"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nRETURN mountain.Name\nORDER BY mountain.Height DESC\nLIMIT 1",
        "question": "What is the name of the highest mountain?",
        "answers": [
            [
                "Kibo (Uhuru Pk)"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nRETURN mountain.Name\nORDER BY mountain.Height DESC\nLIMIT 1",
        "question": "Return the name of the mountain with the greatest height.",
        "answers": [
            [
                "Kibo (Uhuru Pk)"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nRETURN T1.Name,T2.Name",
        "question": "Show names of climbers and the names of mountains they climb.",
        "answers": [
            [
                "Klaus Enders",
                "Kibo (Uhuru Pk)"
            ],
            [
                "Siegfried Schauzu",
                "Kibo (Uhuru Pk)"
            ],
            [
                "Hans Luthringhauser",
                "Mount Kenya (Batian)"
            ],
            [
                "Jean Claude Castella",
                "Mount Kenya (Batian)"
            ],
            [
                "Horst Owesle",
                "Mount Kenya (Batian)"
            ],
            [
                "Georg Auerbacher",
                "Mawenzi (Hans Meyer Pk)"
            ],
            [
                "Arseneus Butscher",
                "Mount Kenya (Lenana)"
            ],
            [
                "Charlie Freedman",
                "Mount Kenya (Lenana)"
            ],
            [
                "L Currie",
                "Duwoni / Mt Speke (Vittorio Emanuele Pk)"
            ],
            [
                "Mick Horsepole",
                "Duwoni / Mt Speke (Vittorio Emanuele Pk)"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nRETURN T1.Name,T2.Name",
        "question": "What are the names of climbers and the corresponding names of mountains that they climb?",
        "answers": [
            [
                "Klaus Enders",
                "Kibo (Uhuru Pk)"
            ],
            [
                "Siegfried Schauzu",
                "Kibo (Uhuru Pk)"
            ],
            [
                "Hans Luthringhauser",
                "Mount Kenya (Batian)"
            ],
            [
                "Jean Claude Castella",
                "Mount Kenya (Batian)"
            ],
            [
                "Horst Owesle",
                "Mount Kenya (Batian)"
            ],
            [
                "Georg Auerbacher",
                "Mawenzi (Hans Meyer Pk)"
            ],
            [
                "Arseneus Butscher",
                "Mount Kenya (Lenana)"
            ],
            [
                "Charlie Freedman",
                "Mount Kenya (Lenana)"
            ],
            [
                "L Currie",
                "Duwoni / Mt Speke (Vittorio Emanuele Pk)"
            ],
            [
                "Mick Horsepole",
                "Duwoni / Mt Speke (Vittorio Emanuele Pk)"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nRETURN T1.Name,T2.Height",
        "question": "Show the names of climbers and the heights of mountains they climb.",
        "answers": [
            [
                "Klaus Enders",
                5895.0
            ],
            [
                "Siegfried Schauzu",
                5895.0
            ],
            [
                "Hans Luthringhauser",
                5199.0
            ],
            [
                "Jean Claude Castella",
                5199.0
            ],
            [
                "Horst Owesle",
                5199.0
            ],
            [
                "Georg Auerbacher",
                5148.0
            ],
            [
                "Arseneus Butscher",
                4985.0
            ],
            [
                "Charlie Freedman",
                4985.0
            ],
            [
                "L Currie",
                4890.0
            ],
            [
                "Mick Horsepole",
                4890.0
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nRETURN T1.Name,T2.Height",
        "question": "What are the names of climbers and the corresponding heights of the mountains that they climb?",
        "answers": [
            [
                "Klaus Enders",
                5895.0
            ],
            [
                "Siegfried Schauzu",
                5895.0
            ],
            [
                "Hans Luthringhauser",
                5199.0
            ],
            [
                "Jean Claude Castella",
                5199.0
            ],
            [
                "Horst Owesle",
                5199.0
            ],
            [
                "Georg Auerbacher",
                5148.0
            ],
            [
                "Arseneus Butscher",
                4985.0
            ],
            [
                "Charlie Freedman",
                4985.0
            ],
            [
                "L Currie",
                4890.0
            ],
            [
                "Mick Horsepole",
                4890.0
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nRETURN T2.Height\nORDER BY T1.Points DESC\nLIMIT 1",
        "question": "Show the height of the mountain climbed by the climber with the maximum points.",
        "answers": [
            [
                5895.0
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nRETURN T2.Height\nORDER BY T1.Points DESC\nLIMIT 1",
        "question": "What is the height of the mountain climbined by the climbing who had the most points?",
        "answers": [
            [
                5895.0
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nWHERE T1.Country = 'West Germany'\nRETURN DISTINCT T2.Name",
        "question": "Show the distinct names of mountains climbed by climbers from country \"West Germany\".",
        "answers": [
            [
                "Kibo (Uhuru Pk)"
            ],
            [
                "Mount Kenya (Batian)"
            ],
            [
                "Mawenzi (Hans Meyer Pk)"
            ],
            [
                "Mount Kenya (Lenana)"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nWHERE T1.Country = 'West Germany'\nRETURN DISTINCT T2.Name",
        "question": "What are the different names of mountains ascended by climbers from the country of West Germany?",
        "answers": [
            [
                "Kibo (Uhuru Pk)"
            ],
            [
                "Mount Kenya (Batian)"
            ],
            [
                "Mawenzi (Hans Meyer Pk)"
            ],
            [
                "Mount Kenya (Lenana)"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nWHERE T2.Country = 'Uganda'\nRETURN T1.Time",
        "question": "Show the times used by climbers to climb mountains in Country Uganda.",
        "answers": [
            [
                "1:27.28.8"
            ],
            [
                "1:25.40.6"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nWHERE T2.Country = 'Uganda'\nRETURN T1.Time",
        "question": "What are the times used by climbers who climbed mountains in the country of Uganda?",
        "answers": [
            [
                "1:27.28.8"
            ],
            [
                "1:25.40.6"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (climber:`climbing.climber`)\nRETURN climber.Country,count(*)",
        "question": "Please show the countries and the number of climbers from each country.",
        "answers": [
            [
                "West Germany",
                6
            ],
            [
                "Switzerland",
                1
            ],
            [
                "United Kingdom",
                3
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (climber:`climbing.climber`)\nRETURN climber.Country,count(*)",
        "question": "How many climbers are from each country?",
        "answers": [
            [
                "West Germany",
                6
            ],
            [
                "Switzerland",
                1
            ],
            [
                "United Kingdom",
                3
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nWITH count(*) AS count, mountain.Country AS Country\nWHERE count  > 1\nRETURN Country",
        "question": "List the countries that have more than one mountain.",
        "answers": [
            [
                "Tanzania"
            ],
            [
                "Kenya"
            ],
            [
                "Uganda"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nWITH count(*) AS count, mountain.Country AS Country\nWHERE count  > 1\nRETURN Country",
        "question": "Which countries have more than one mountain?",
        "answers": [
            [
                "Tanzania"
            ],
            [
                "Kenya"
            ],
            [
                "Uganda"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nWHERE NOT (mountain)-[]-(:`climbing.climber`)    \nRETURN mountain.Name",
        "question": "List the names of mountains that do not have any climber.",
        "answers": [
            [
                "Ngaliema / Mt Stanley (Margherita Pk)"
            ],
            [
                "Ngaliema / Mt Stanley (Savoia Pk)"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nWHERE NOT (mountain)-[]-(:`climbing.climber`)    \nRETURN mountain.Name",
        "question": "What are the names of countains that no climber has climbed?",
        "answers": [
            [
                "Ngaliema / Mt Stanley (Margherita Pk)"
            ],
            [
                "Ngaliema / Mt Stanley (Savoia Pk)"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nRETURN mountain.Range\nORDER BY mountain.Range DESC\nLIMIT 1",
        "question": "Show the range that has the most number of mountains.",
        "answers": [
            [
                "Rwenzori"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nRETURN mountain.Range\nORDER BY mountain.Range DESC\nLIMIT 1",
        "question": "Which range contains the most mountains?",
        "answers": [
            [
                "Rwenzori"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nWHERE mountain.Height > 5000 OR mountain.Prominence > 1000\nRETURN mountain.Name",
        "question": "Show the names of mountains with height more than 5000 or prominence more than 1000.",
        "answers": [
            [
                "Kibo (Uhuru Pk)"
            ],
            [
                "Mount Kenya (Batian)"
            ],
            [
                "Mawenzi (Hans Meyer Pk)"
            ],
            [
                "Ngaliema / Mt Stanley (Margherita Pk)"
            ]
        ]
    },
    {
        "db_id": "climbing",
        "query": "MATCH (mountain:`climbing.mountain`)\nWHERE mountain.Height > 5000 OR mountain.Prominence > 1000\nRETURN mountain.Name",
        "question": "What are the names of mountains that have a height of over 5000 or a prominence of over 1000?",
        "answers": [
            [
                "Kibo (Uhuru Pk)"
            ],
            [
                "Mount Kenya (Batian)"
            ],
            [
                "Mawenzi (Hans Meyer Pk)"
            ],
            [
                "Ngaliema / Mt Stanley (Margherita Pk)"
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (body_builder:`body_builder.body_builder`)\nRETURN count(*)",
        "question": "How many body builders are there?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (body_builder:`body_builder.body_builder`)\nRETURN body_builder.Total\nORDER BY body_builder.Total ASC",
        "question": "List the total scores of body builders in ascending order.",
        "answers": [
            [
                292.5
            ],
            [
                312.5
            ],
            [
                315.0
            ],
            [
                315.0
            ],
            [
                317.5
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (body_builder:`body_builder.body_builder`)\nRETURN body_builder.Snatch,body_builder.Clean_Jerk\nORDER BY body_builder.Snatch ASC",
        "question": "List the snatch score and clean jerk score of body builders in ascending order of snatch score.",
        "answers": [
            [
                130.0,
                162.5
            ],
            [
                137.5,
                177.5
            ],
            [
                137.5,
                175.0
            ],
            [
                140.0,
                175.0
            ],
            [
                142.5,
                175.0
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (body_builder:`body_builder.body_builder`)\nRETURN avg(body_builder.Snatch)",
        "question": "What is the average snatch score of body builders?",
        "answers": [
            [
                137.5
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (body_builder:`body_builder.body_builder`)\nRETURN body_builder.Clean_Jerk\nORDER BY body_builder.Total DESC\nLIMIT 1",
        "question": "What are the clean and jerk score of the body builder with the highest total score?",
        "answers": [
            [
                175.0
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (people:`body_builder.people`)\nRETURN people.Birth_Date\nORDER BY people.Height ASC",
        "question": "What are the birthdays of people in ascending order of height?",
        "answers": [
            [
                "January 1, 1992"
            ],
            [
                "March 30, 1976"
            ],
            [
                "February 13, 1985"
            ],
            [
                "December 5, 1991"
            ],
            [
                "July 4, 1990"
            ],
            [
                "May 5, 1987"
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (T1:`body_builder.body_builder`)-[]-(T2:`body_builder.people`)\nRETURN T2.Name",
        "question": "What are the names of body builders?",
        "answers": [
            [
                "Jack Campbell"
            ],
            [
                "Ty Conklin"
            ],
            [
                "Al Montoya"
            ],
            [
                "Cam Fowler"
            ],
            [
                "Jake Gardiner"
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (T1:`body_builder.body_builder`)-[]-(T2:`body_builder.people`)\nWHERE T1.Total > 300\nRETURN T2.Name",
        "question": "What are the names of body builders whose total score is higher than 300?",
        "answers": [
            [
                "Jack Campbell"
            ],
            [
                "Ty Conklin"
            ],
            [
                "Al Montoya"
            ],
            [
                "Cam Fowler"
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (T1:`body_builder.body_builder`)-[]-(T2:`body_builder.people`)\nRETURN T2.Name\nORDER BY T2.Weight DESC\nLIMIT 1",
        "question": "What is the name of the body builder with the greatest body weight?",
        "answers": [
            [
                "Al Montoya"
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (T1:`body_builder.body_builder`)-[]-(T2:`body_builder.people`)\nRETURN T2.Birth_Date,T2.Birth_Place\nORDER BY T1.Total DESC\nLIMIT 1",
        "question": "What are the birth date and birth place of the body builder with the highest total points?",
        "answers": [
            [
                "January 1, 1992",
                "Port Huron, Michigan"
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (T1:`body_builder.body_builder`)-[]-(T2:`body_builder.people`)\nWHERE T1.Total < 315\nRETURN T2.Height",
        "question": "What are the heights of body builders with total score smaller than 315?",
        "answers": [
            [
                196.0
            ],
            [
                205.0
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (T1:`body_builder.body_builder`)-[]-(T2:`body_builder.people`)\nRETURN T2.Name\nORDER BY T1.Total DESC",
        "question": "What are the names of body builders in descending order of total scores?",
        "answers": [
            [
                "Jack Campbell"
            ],
            [
                "Ty Conklin"
            ],
            [
                "Al Montoya"
            ],
            [
                "Cam Fowler"
            ],
            [
                "Jake Gardiner"
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (people:`body_builder.people`)\nRETURN people.Birth_Place,count(*)",
        "question": "List each birth place along with the number of people from there.",
        "answers": [
            [
                "Port Huron, Michigan",
                1
            ],
            [
                "Anchorage, Alaska",
                1
            ],
            [
                "Glenview, Illinois",
                1
            ],
            [
                "Nashua, New Hampshire",
                1
            ],
            [
                "Farmington Hills, Michigan",
                1
            ],
            [
                "Minnetonka, Minnesota",
                1
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (people:`body_builder.people`)\nRETURN people.Birth_Place\nORDER BY people.Birth_Place DESC\nLIMIT 1",
        "question": "What is the most common birth place of people?",
        "answers": [
            [
                "Port Huron, Michigan"
            ]
        ]
    },
    {
        "db_id": "body_builder",
        "query": "MATCH (people:`body_builder.people`)\nWITH count(*) AS count, people.Birth_Place AS Birth_Place\nWHERE count  >= 2\nRETURN Birth_Place",
        "question": "What are the birth places that are shared by at least two people?",
        "answers": []
    }
]