[
    {
        "db_id": "gas_company",
        "query": "MATCH (gas_station:`gas_company.gas_station`)\nRETURN gas_station.Station_ID,gas_station.Location,gas_station.Manager_Name\nORDER BY gas_station.Open_Year",
        "question": "What are the gas station ids, locations, and manager names for the gas stations ordered by opening year?",
        "answers": [
            [
                1,
                "Herne Hill",
                "BrianWingrave"
            ],
            [
                2,
                "Channel Hill",
                "SimonMarloe"
            ],
            [
                3,
                "Reading North",
                "Simon Cope Derek Marloe"
            ],
            [
                4,
                "Herne St",
                "Colin Denman"
            ],
            [
                5,
                "Reading",
                "Colin Denman"
            ],
            [
                6,
                "Herne Ave",
                "Tom Whit"
            ],
            [
                7,
                "Hennry Hill",
                "Bryan Taylor"
            ],
            [
                8,
                "Jane Ave",
                "BryanDenman"
            ],
            [
                9,
                "Maindy Hill",
                "Tony Bristow"
            ],
            [
                10,
                "Maindy Ave",
                "Luke Rowe"
            ],
            [
                11,
                "Newport Rd",
                "Jon Rowe"
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (gas_station:`gas_company.gas_station`)\nRETURN gas_station.Location,count(*)\nORDER BY gas_station.Location",
        "question": "Show all locations and the number of gas stations in each location ordered by the count.",
        "answers": [
            [
                "Channel Hill",
                1
            ],
            [
                "Hennry Hill",
                1
            ],
            [
                "Herne Ave",
                1
            ],
            [
                "Herne Hill",
                1
            ],
            [
                "Herne St",
                1
            ],
            [
                "Jane Ave",
                1
            ],
            [
                "Maindy Ave",
                1
            ],
            [
                "Maindy Hill",
                1
            ],
            [
                "Newport Rd",
                1
            ],
            [
                "Reading",
                1
            ],
            [
                "Reading North",
                1
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (gas_station:`gas_company.gas_station`)\nRETURN gas_station.Location,count(*)\nORDER BY gas_station.Location",
        "question": "For each location, how many gas stations are there in order?",
        "answers": [
            [
                "Channel Hill",
                1
            ],
            [
                "Hennry Hill",
                1
            ],
            [
                "Herne Ave",
                1
            ],
            [
                "Herne Hill",
                1
            ],
            [
                "Herne St",
                1
            ],
            [
                "Jane Ave",
                1
            ],
            [
                "Maindy Ave",
                1
            ],
            [
                "Maindy Hill",
                1
            ],
            [
                "Newport Rd",
                1
            ],
            [
                "Reading",
                1
            ],
            [
                "Reading North",
                1
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (T2:`gas_company.company`)-[T1:`gas_company.station_company`]-()\nRETURN T2.Company,count(*)",
        "question": "Show the company name with the number of gas station.",
        "answers": [
            [
                "ExxonMobil",
                2
            ],
            [
                "Royal Dutch Shell",
                1
            ],
            [
                "PetroChina",
                1
            ],
            [
                "Petrobras",
                1
            ],
            [
                "BP",
                1
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (T2:`gas_company.company`)-[T1:`gas_company.station_company`]-(T3:`gas_company.gas_station`)\nWHERE T2.Company = 'ExxonMobil'\nRETURN T3.Manager_Name",
        "question": "Show the manager name for gas stations belonging to the ExxonMobil company.",
        "answers": [
            [
                "Colin Denman"
            ],
            [
                "Jon Rowe"
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (T2:`gas_company.company`)-[T1:`gas_company.station_company`]-(T3:`gas_company.gas_station`)\nWHERE T2.Market_Value > 100\nRETURN T3.Location",
        "question": "Show all locations where a gas station for company with market value greater than 100 is located.",
        "answers": [
            [
                "Herne St"
            ],
            [
                "Newport Rd"
            ],
            [
                "Herne Hill"
            ],
            [
                "Herne Ave"
            ],
            [
                "Hennry Hill"
            ],
            [
                "Maindy Ave"
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (gas_station:`gas_company.gas_station`)\nRETURN gas_station.Location\nORDER BY gas_station.Open_Year",
        "question": "order all gas station locations by the opening year.",
        "answers": [
            [
                "Herne Hill"
            ],
            [
                "Channel Hill"
            ],
            [
                "Reading North"
            ],
            [
                "Herne St"
            ],
            [
                "Reading"
            ],
            [
                "Herne Ave"
            ],
            [
                "Hennry Hill"
            ],
            [
                "Jane Ave"
            ],
            [
                "Maindy Hill"
            ],
            [
                "Maindy Ave"
            ],
            [
                "Newport Rd"
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (gas_station:`gas_company.gas_station`)\nRETURN gas_station.Location\nORDER BY gas_station.Open_Year",
        "question": "What are the locations of all the gas stations ordered by opening year?",
        "answers": [
            [
                "Herne Hill"
            ],
            [
                "Channel Hill"
            ],
            [
                "Reading North"
            ],
            [
                "Herne St"
            ],
            [
                "Reading"
            ],
            [
                "Herne Ave"
            ],
            [
                "Hennry Hill"
            ],
            [
                "Jane Ave"
            ],
            [
                "Maindy Hill"
            ],
            [
                "Maindy Ave"
            ],
            [
                "Newport Rd"
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (company:`gas_company.company`)\nWHERE company.Main_Industry = 'Banking'\nRETURN company.Rank,company.Company,company.Market_Value\nORDER BY company.Sales_billion,company.Profits_billion",
        "question": "find the rank, company names, market values of the companies in the banking industry order by their sales and profits in billion.",
        "answers": [
            [
                5,
                "Industrial and Commercial Bank of China",
                237.4
            ],
            [
                9,
                "Wells Fargo",
                178.7
            ],
            [
                6,
                "HSBC",
                164.3
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (company:`gas_company.company`)\nWHERE company.Main_Industry = 'Banking'\nRETURN company.Rank,company.Company,company.Market_Value\nORDER BY company.Sales_billion,company.Profits_billion",
        "question": "What is the rank, company, and market value of every comapny in the banking industry ordered by sales and profits?",
        "answers": [
            [
                5,
                "Industrial and Commercial Bank of China",
                237.4
            ],
            [
                9,
                "Wells Fargo",
                178.7
            ],
            [
                6,
                "HSBC",
                164.3
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (T2:`gas_company.company`)-[T1:`gas_company.station_company`]-(T3:`gas_company.gas_station`)\nRETURN T3.Location,T3.Representative_Name\nORDER BY T2.Assets_billion DESC\nLIMIT 3",
        "question": "find the location and Representative name of the gas stations owned by the companies with top 3 Asset amounts.",
        "answers": [
            [
                "Herne Hill",
                "Clive Burr"
            ],
            [
                "Herne St",
                "Ray Hughes"
            ],
            [
                "Newport Rd",
                "Tim Read"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (region:`party_people.region`)\nRETURN count(*)",
        "question": "Count the number of regions.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nRETURN count(DISTINCT party.Party_name)",
        "question": "How many parties do we have?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nRETURN count(DISTINCT party.Party_name)",
        "question": "Count the number of different parties.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nRETURN party.Minister,party.Took_office,party.Left_office\nORDER BY party.Left_office",
        "question": "Show the ministers and the time they took and left office, listed by the time they left office.",
        "answers": [
            [
                "Dr. Kwame Nkrumah (MP)",
                "1957",
                "1958"
            ],
            [
                "Kojo Botsio (MP)",
                "1958",
                "1959"
            ],
            [
                "Ebenezer Ako-Adjei (MP)",
                "1959",
                "1960"
            ],
            [
                "Imoru Egala (MP)",
                "1960",
                "1961"
            ],
            [
                "Ebenezer Ako-Adjei (MP)",
                "1961",
                "1962"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nRETURN party.Minister,party.Took_office,party.Left_office\nORDER BY party.Left_office",
        "question": "Who are the ministers, when did they take office, and when did they leave office, ordered by when they left office?",
        "answers": [
            [
                "Dr. Kwame Nkrumah (MP)",
                "1957",
                "1958"
            ],
            [
                "Kojo Botsio (MP)",
                "1958",
                "1959"
            ],
            [
                "Ebenezer Ako-Adjei (MP)",
                "1959",
                "1960"
            ],
            [
                "Imoru Egala (MP)",
                "1960",
                "1961"
            ],
            [
                "Ebenezer Ako-Adjei (MP)",
                "1961",
                "1962"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nWHERE party.Took_office > '1961' OR party.Took_office < '1959'\nRETURN party.Minister",
        "question": "Show the minister who took office after 1961 or before 1959.",
        "answers": [
            [
                "Dr. Kwame Nkrumah (MP)"
            ],
            [
                "Kojo Botsio (MP)"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nWHERE party.Took_office > '1961' OR party.Took_office < '1959'\nRETURN party.Minister",
        "question": "Who are the ministers who took office after 1961 or before 1959?",
        "answers": [
            [
                "Dr. Kwame Nkrumah (MP)"
            ],
            [
                "Kojo Botsio (MP)"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nWHERE party.Party_name <> 'Progress Party'\nRETURN party.Minister",
        "question": "Show all ministers who do not belong to Progress Party.",
        "answers": [
            [
                "Dr. Kwame Nkrumah (MP)"
            ],
            [
                "Ebenezer Ako-Adjei (MP)"
            ],
            [
                "Imoru Egala (MP)"
            ],
            [
                "Ebenezer Ako-Adjei (MP)"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nWHERE party.Party_name <> 'Progress Party'\nRETURN party.Minister",
        "question": "Which ministers are not a part of the Progress Party?",
        "answers": [
            [
                "Dr. Kwame Nkrumah (MP)"
            ],
            [
                "Ebenezer Ako-Adjei (MP)"
            ],
            [
                "Imoru Egala (MP)"
            ],
            [
                "Ebenezer Ako-Adjei (MP)"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nRETURN party.Minister,party.Party_name\nORDER BY party.Took_office DESC",
        "question": "Show all ministers and parties they belong to in descending order of the time they took office.",
        "answers": [
            [
                "Ebenezer Ako-Adjei (MP)",
                "Sinefine Party"
            ],
            [
                "Imoru Egala (MP)",
                "Convention Union Party"
            ],
            [
                "Ebenezer Ako-Adjei (MP)",
                "3"
            ],
            [
                "Kojo Botsio (MP)",
                "Progress Party"
            ],
            [
                "Dr. Kwame Nkrumah (MP)",
                "Convention Peoples Party"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nRETURN party.Minister,party.Party_name\nORDER BY party.Took_office DESC",
        "question": "Who are the ministers and what parties do they belong to, listed descending by the times they took office?",
        "answers": [
            [
                "Ebenezer Ako-Adjei (MP)",
                "Sinefine Party"
            ],
            [
                "Imoru Egala (MP)",
                "Convention Union Party"
            ],
            [
                "Ebenezer Ako-Adjei (MP)",
                "3"
            ],
            [
                "Kojo Botsio (MP)",
                "Progress Party"
            ],
            [
                "Dr. Kwame Nkrumah (MP)",
                "Convention Peoples Party"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nRETURN party.Minister\nORDER BY party.Left_office DESC\nLIMIT 1",
        "question": "Return the minister who left office at the latest time.",
        "answers": [
            [
                "Ebenezer Ako-Adjei (MP)"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nRETURN party.Minister\nORDER BY party.Left_office DESC\nLIMIT 1",
        "question": "Which minister left office the latest?",
        "answers": [
            [
                "Ebenezer Ako-Adjei (MP)"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.member`)-[]-(T2:`party_people.party`)\nRETURN T1.Member_Name,T2.Party_name",
        "question": "List member names and their party names.",
        "answers": [
            [
                "Hon John Anderson",
                "Convention Peoples Party"
            ],
            [
                "Kerry Bartlett",
                "Convention Peoples Party"
            ],
            [
                "Hon Kim Beazley",
                "Progress Party"
            ],
            [
                "Anthony Albanese",
                "Progress Party"
            ],
            [
                "Hon Arch Bevis",
                "Progress Party"
            ],
            [
                "Hon Dick Adams",
                "Progress Party"
            ],
            [
                "Hon Bruce Baird",
                "3"
            ],
            [
                "Hon Fran Bailey",
                "3"
            ],
            [
                "Hon Kevin Andrews",
                "3"
            ],
            [
                "Mark Baker",
                "3"
            ],
            [
                "Phil Barresi",
                "3"
            ],
            [
                "Hon Bob Baldwin",
                "3"
            ],
            [
                "Hon Bruce Billson",
                "3"
            ],
            [
                "Hon Tony Abbott",
                "3"
            ],
            [
                "Peter Andren",
                "3"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.member`)-[]-(T2:`party_people.party`)\nRETURN T1.Member_Name,T2.Party_name",
        "question": "What are the names of members and their corresponding parties?",
        "answers": [
            [
                "Hon John Anderson",
                "Convention Peoples Party"
            ],
            [
                "Kerry Bartlett",
                "Convention Peoples Party"
            ],
            [
                "Hon Kim Beazley",
                "Progress Party"
            ],
            [
                "Anthony Albanese",
                "Progress Party"
            ],
            [
                "Hon Arch Bevis",
                "Progress Party"
            ],
            [
                "Hon Dick Adams",
                "Progress Party"
            ],
            [
                "Hon Bruce Baird",
                "3"
            ],
            [
                "Hon Fran Bailey",
                "3"
            ],
            [
                "Hon Kevin Andrews",
                "3"
            ],
            [
                "Mark Baker",
                "3"
            ],
            [
                "Phil Barresi",
                "3"
            ],
            [
                "Hon Bob Baldwin",
                "3"
            ],
            [
                "Hon Bruce Billson",
                "3"
            ],
            [
                "Hon Tony Abbott",
                "3"
            ],
            [
                "Peter Andren",
                "3"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.member`)-[]-(T2:`party_people.party`)\nRETURN T2.Party_name,count(*)",
        "question": "Show all party names and the number of members in each party.",
        "answers": [
            [
                "Convention Peoples Party",
                2
            ],
            [
                "Progress Party",
                4
            ],
            [
                "3",
                9
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.member`)-[]-(T2:`party_people.party`)\nRETURN T2.Party_name,count(*)",
        "question": "How many members are in each party?",
        "answers": [
            [
                "Convention Peoples Party",
                2
            ],
            [
                "Progress Party",
                4
            ],
            [
                "3",
                9
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.member`)-[]-(T2:`party_people.party`)\nWITH count(T1.Party_ID) AS cnt, T2\nRETURN T2.Party_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the name of party with most number of members?",
        "answers": [
            [
                "3"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.member`)-[]-(T2:`party_people.party`)\nWITH count(T1.Party_ID) AS cnt, T2\nRETURN T2.Party_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Return the name of the party with the most members.",
        "answers": [
            [
                "3"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.party`)-[]-(T2:`party_people.region`)\nRETURN T1.Party_name,T2.Region_name",
        "question": "Show all party names and their region names.",
        "answers": [
            [
                "Convention Peoples Party",
                "United Kingdom"
            ],
            [
                "Progress Party",
                "United Kingdom"
            ],
            [
                "3",
                "Japan"
            ],
            [
                "Convention Union Party",
                "United States"
            ],
            [
                "Sinefine Party",
                "United States"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.party`)-[]-(T2:`party_people.region`)\nRETURN T1.Party_name,T2.Region_name",
        "question": "What are the names of parties and their respective regions?",
        "answers": [
            [
                "Convention Peoples Party",
                "United Kingdom"
            ],
            [
                "Progress Party",
                "United Kingdom"
            ],
            [
                "3",
                "Japan"
            ],
            [
                "Convention Union Party",
                "United States"
            ],
            [
                "Sinefine Party",
                "United States"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nWHERE NOT (party)-[]-(:`party_people.member`)    \nRETURN party.Party_name",
        "question": "Show names of parties that does not have any members.",
        "answers": [
            [
                "Convention Union Party"
            ],
            [
                "Sinefine Party"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party:`party_people.party`)\nWHERE NOT (party)-[]-(:`party_people.member`)    \nRETURN party.Party_name",
        "question": "What are the names of parties that have no members?",
        "answers": [
            [
                "Convention Union Party"
            ],
            [
                "Sinefine Party"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.member`)-[]-(T2:`party_people.party`)\nWHERE T2.Party_name <> 'Progress Party'\nRETURN T1.Member_Name",
        "question": "Show member names that are not in the Progress Party.",
        "answers": [
            [
                "Hon John Anderson"
            ],
            [
                "Kerry Bartlett"
            ],
            [
                "Hon Bruce Baird"
            ],
            [
                "Hon Fran Bailey"
            ],
            [
                "Hon Kevin Andrews"
            ],
            [
                "Mark Baker"
            ],
            [
                "Phil Barresi"
            ],
            [
                "Hon Bob Baldwin"
            ],
            [
                "Hon Bruce Billson"
            ],
            [
                "Hon Tony Abbott"
            ],
            [
                "Peter Andren"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.member`)-[]-(T2:`party_people.party`)\nWHERE T2.Party_name <> 'Progress Party'\nRETURN T1.Member_Name",
        "question": "Which member names corresponding to members who are not in the Progress Party?",
        "answers": [
            [
                "Hon John Anderson"
            ],
            [
                "Kerry Bartlett"
            ],
            [
                "Hon Bruce Baird"
            ],
            [
                "Hon Fran Bailey"
            ],
            [
                "Hon Kevin Andrews"
            ],
            [
                "Mark Baker"
            ],
            [
                "Phil Barresi"
            ],
            [
                "Hon Bob Baldwin"
            ],
            [
                "Hon Bruce Billson"
            ],
            [
                "Hon Tony Abbott"
            ],
            [
                "Peter Andren"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party_events:`party_people.party_events`)\nRETURN count(*)",
        "question": "How many party events do we have?",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party_events:`party_people.party_events`)\nRETURN count(*)",
        "question": "Count the number of party events.",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.party_events`)-[]-(T2:`party_people.party`)\nRETURN T2.Party_name,count(*)",
        "question": "Show party names and the number of events for each party.",
        "answers": [
            [
                "Convention Peoples Party",
                3
            ],
            [
                "Progress Party",
                2
            ],
            [
                "3",
                3
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.party_events`)-[]-(T2:`party_people.party`)\nRETURN T2.Party_name,count(*)",
        "question": "How many events are there for each party?",
        "answers": [
            [
                "Convention Peoples Party",
                3
            ],
            [
                "Progress Party",
                2
            ],
            [
                "3",
                3
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.party_events`)-[]-(T2:`party_people.party`)\nWITH count(*) AS count, T2.Party_name AS Party_name\nWHERE count  >= 2\nRETURN Party_name",
        "question": "What are the names of parties with at least 2 events?",
        "answers": [
            [
                "Convention Peoples Party"
            ],
            [
                "Progress Party"
            ],
            [
                "3"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.party_events`)-[]-(T2:`party_people.party`)\nWITH count(*) AS count, T2.Party_name AS Party_name\nWHERE count  >= 2\nRETURN Party_name",
        "question": "Return the names of parties that have two or more events.",
        "answers": [
            [
                "Convention Peoples Party"
            ],
            [
                "Progress Party"
            ],
            [
                "3"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.member`)-[]-(T2:`party_people.party_events`)\nWITH count(T2.None) AS cnt, T1\nRETURN T1.Member_Name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the name of member in charge of greatest number of events?",
        "answers": [
            [
                "Hon John Anderson"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (T1:`party_people.member`)-[]-(T2:`party_people.party_events`)\nWITH count(T2.None) AS cnt, T1\nRETURN T1.Member_Name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Return the name of the member who is in charge of the most events.",
        "answers": [
            [
                "Hon John Anderson"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party_events:`party_people.party_events`)\nWITH party_events.Event_Name AS Event_Name, count(*) AS count\nWHERE count  > 2\nRETURN Event_Name",
        "question": "find the event names that have more than 2 records.",
        "answers": [
            [
                "Annaual Meeting"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (party_events:`party_people.party_events`)\nWITH party_events.Event_Name AS Event_Name, count(*) AS count\nWHERE count  > 2\nRETURN Event_Name",
        "question": "Which event names were used more than twice for party events?",
        "answers": [
            [
                "Annaual Meeting"
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (t1:`party_people.region`)-[]-(t2:`party_people.party`)-[]-(t3:`party_people.party_events`)\nWHERE t1.Region_name = 'United Kingdom' AND t3.Event_Name = 'Annaual Meeting'\nRETURN count(*)",
        "question": "How many Annual Meeting events happened in the United Kingdom region?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "party_people",
        "query": "MATCH (t1:`party_people.region`)-[]-(t2:`party_people.party`)-[]-(t3:`party_people.party_events`)\nWHERE t1.Region_name = 'United Kingdom' AND t3.Event_Name = 'Annaual Meeting'\nRETURN count(*)",
        "question": "Count the number of Annual Meeting events that took place in the region of the United Kingdom.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "pilot_record",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nRETURN count(*)",
        "question": "How many pilots are there?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "pilot_record",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nRETURN pilot.Pilot_name\nORDER BY pilot.Rank ASC",
        "question": "List the names of pilots in ascending order of rank.",
        "answers": [
            [
                "Jermaine O'Neal"
            ],
            [
                "Patrick O'Bryant"
            ],
            [
                "Charles Oakley"
            ],
            [
                "Hakeem Olajuwon"
            ],
            [
                "Dan O'Sullivan"
            ]
        ]
    }
]