[
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Noah A Smith\"\nRETURN DISTINCT t1.authorId",
        "question": "who does Noah A Smith author with ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Noah A Smith\"\nRETURN DISTINCT t1.authorId",
        "question": "who are all the co-authors of Noah A Smith ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Noah A Smith\"\nRETURN DISTINCT t1.authorId",
        "question": "who does Noah A Smith work with ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Noah A Smith\"\nRETURN DISTINCT t1.authorId",
        "question": "who does Noah A Smith collaborate with ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Noah A Smith\"\nRETURN DISTINCT t1.authorId",
        "question": "Who are Noah A Smith 's coauthors ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nRETURN DISTINCT t3.paperId,t3.year\nORDER BY t3.year DESC",
        "question": "recent deep learning papers",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nRETURN DISTINCT t3.paperId,t3.year\nORDER BY t3.year DESC",
        "question": "new deep learning papers",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nRETURN DISTINCT t3.paperId,t3.year\nORDER BY t3.year DESC",
        "question": "What are the latest publications on deep learning ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nRETURN DISTINCT t3.paperId,t3.year\nORDER BY t3.year DESC",
        "question": "Most recent deep learning conference ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nRETURN DISTINCT t3.paperId,t3.year\nORDER BY t3.year DESC",
        "question": "Show me some recent papers on deep learning ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nRETURN DISTINCT t3.paperId,t3.year\nORDER BY t3.year DESC",
        "question": "What are some recent papers written in deep learning ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nRETURN DISTINCT t3.paperId,t3.year\nORDER BY t3.year DESC",
        "question": "What is the most recent paper of deep learning ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nRETURN DISTINCT t3.paperId,t3.year\nORDER BY t3.year DESC",
        "question": "What are recent papers on deep learning ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nRETURN DISTINCT t3.paperId,t3.year\nORDER BY t3.year DESC",
        "question": "Current research on deep learning",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nRETURN DISTINCT t3.paperId,t3.year\nORDER BY t3.year DESC",
        "question": "latest deep learning papers",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nRETURN DISTINCT t3.paperId,t3.year\nORDER BY t3.year DESC",
        "question": "newest deep learning papers",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Pedro Domingos\"\nRETURN DISTINCT t3.year",
        "question": "What years did Pedro Domingos publish papers in ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Pedro Domingos\"\nRETURN DISTINCT t3.year",
        "question": "In what years did Pedro Domingos publish a paper ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"jamie callan\"\nRETURN DISTINCT t3.paperId,t3.year\nORDER BY t3.year",
        "question": "jamie callan 's publications by year",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"instance segmentation\" AND t3.journalId >= 0\nRETURN DISTINCT t3.paperId",
        "question": "journal papers for instance segmentation",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"character recognition\" AND t3.year < 2010\nRETURN DISTINCT t3.paperId",
        "question": "character recognition papers earlier than 2010",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"character recognition\" AND t3.year < 2010\nRETURN DISTINCT t3.paperId",
        "question": "papers before 2010 about character recognition",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"character recognition\" AND t3.year < 2010\nRETURN DISTINCT t3.paperId",
        "question": "papers about character recognition from before 2010",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName =~'.*[\"|\"]Michael Armstrong\".*' AND t3.year =~'.*[1|1]99.*'\nRETURN DISTINCT t3.year,t2.paperId",
        "question": "What paper did Michael Armstrong wrote in the 90s ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (paper:`scholar.paper`)\nWHERE paper.year = 2014\nRETURN DISTINCT paper.paperId",
        "question": "papers from 2014",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (paper:`scholar.paper`)\nWHERE paper.year = 2014\nRETURN DISTINCT paper.paperId",
        "question": "2014 papers",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (paper:`scholar.paper`)\nWHERE paper.year = 2013\nRETURN DISTINCT paper.venueId",
        "question": "conferences in 2013",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Mirella Lapata\"\nRETURN DISTINCT t3.paperId,t3.year\nORDER BY t3.year DESC\nLIMIT 5",
        "question": "What are the 5 most recent papers of Mirella Lapata ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (paper:`scholar.paper`)\nWHERE paper.year = 2011\nRETURN DISTINCT paper.journalId",
        "question": "List today 's journals",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (paper:`scholar.paper`)\nWHERE paper.year = 2011\nRETURN DISTINCT paper.journalId",
        "question": "List the journals published in March , 2011",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t4:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t1:`scholar.author`)\nWHERE t4.keyphraseName =~'.*[\"|\"]sensor fusion\".*'\nRETURN DISTINCT t1.authorName",
        "question": "Who wrote sensor fusion ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t4:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t1:`scholar.author`)\nWHERE t4.keyphraseName =~'.*[\"|\"]sensor fusion\".*'\nRETURN DISTINCT t1.authorName",
        "question": "Authors of papers on sensor fusion",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t4:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t1:`scholar.author`)\nWHERE t4.keyphraseName =~'.*[\"|\"]sensor fusion\".*'\nRETURN DISTINCT t1.authorName",
        "question": "people working on sensor fusion",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t4:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t1:`scholar.author`)\nWHERE t4.keyphraseName =~'.*[\"|\"]sensor fusion\".*'\nRETURN DISTINCT t1.authorName",
        "question": "Who publishes in sensor fusion ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t4:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t1:`scholar.author`)\nWHERE t4.keyphraseName =~'.*[\"|\"]sensor fusion\".*'\nRETURN DISTINCT t1.authorName",
        "question": "who publishes papers about sensor fusion",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Takashi Matsumoto\"\nRETURN DISTINCT t3.journalId",
        "question": "What journals are Takashi Matsumoto 's articles published in ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Takashi Matsumoto\"\nRETURN DISTINCT t3.journalId",
        "question": "What journals has Takashi Matsumoto published in ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Takashi Matsumoto\"\nRETURN DISTINCT t3.journalId",
        "question": "In what scholarly journals does Takashi Matsumoto publish ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Luke S Zettlemoyer\"\nRETURN DISTINCT t3.year\nORDER BY t3.year",
        "question": "When did Luke S Zettlemoyer publish ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"question answering\" AND t3.year = 2016\nRETURN DISTINCT t3.paperId",
        "question": "question answering 2016 papers",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"question answering\" AND t3.year = 2016\nRETURN DISTINCT t3.paperId",
        "question": "What papers were written on question answering in 2016 ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Temporal Data\"\nRETURN DISTINCT t3.journalId",
        "question": "Find journals about Temporal Data .",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Temporal Data\"\nRETURN DISTINCT t3.journalId",
        "question": "List the journals related to Temporal Data",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Donald E Knuth\"\nRETURN DISTINCT t3.title",
        "question": "What are all the publication titles by Donald E Knuth ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nWITH t3, count(t3.year) AS cnt\nRETURN DISTINCT t3.year\nORDER BY t3.year ASC",
        "question": "first deep learning paper",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nWITH t3, count(t3.year) AS cnt\nRETURN DISTINCT t3.year\nORDER BY t3.year ASC",
        "question": "What was the first paper on deep learning written ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nWITH t3, count(t3.year) AS cnt\nRETURN DISTINCT t3.year\nORDER BY t3.year ASC",
        "question": "When was deep learning proposed ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"deep learning\"\nWITH t3, count(t3.year) AS cnt\nRETURN DISTINCT t3.year\nORDER BY t3.year ASC",
        "question": "when was the first deep learning paper published ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.paper`)-[]-(t1:`scholar.journal`)\nWHERE t1.journalName = \"Academic radiology\" AND t2.year = 1995\nRETURN DISTINCT t2.paperId",
        "question": "what papers were published in Academic radiology in 1995 ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Trophic Cascade\"\nRETURN DISTINCT t3.venueId",
        "question": "venue for Trophic Cascade",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Trophic Cascade\"\nRETURN DISTINCT t3.venueId",
        "question": "conferences for Trophic Cascade",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Trophic Cascade\"\nRETURN DISTINCT t3.venueId",
        "question": "what conferences are related to Trophic Cascade",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Trophic Cascade\"\nRETURN DISTINCT t3.venueId",
        "question": "What was the conference name that approved Trophic Cascade ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.paper`)-[t1:`scholar.writes`]-()\nWHERE t2.year = 2015\nRETURN DISTINCT t1.authorId",
        "question": "Which authors published papers in 2015 ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.paper`)-[t1:`scholar.writes`]-()\nWHERE t2.year = 2015\nRETURN DISTINCT t1.authorId",
        "question": "who wrote papers in 2015",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Trophic Cascade\" AND t3.year = 2010\nRETURN DISTINCT t3.journalId",
        "question": "In 2010 what journal published an article about Trophic Cascade ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (paper:`scholar.paper`)\nWHERE paper.title =~'.*[\"|\"]the effects of juicing for cancer patients\".*' AND paper.year > 2006\nRETURN DISTINCT paper.paperId,paper.title",
        "question": "What articles have been published since 2006 about the effects of juicing for cancer patients ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (paper:`scholar.paper`)\nWHERE paper.title = \"Fracture of acrylic bone cement\"\nRETURN DISTINCT paper.venueId",
        "question": "What is the venue of Fracture of acrylic bone cement ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (paper:`scholar.paper`)\nWHERE paper.title = \"A Switching Architecture For ISDN\"\nRETURN DISTINCT paper.title,paper.year",
        "question": "What is the year of publication of \" A Switching Architecture For ISDN \" ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Su-In Lee\" AND t3.year < 2012\nRETURN DISTINCT t3.paperId",
        "question": "Give me the papers written by Su-In Lee before 2012 .",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.rating > 4.5\nRETURN business.name",
        "question": "List all the businesses with more than 4.5 stars",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.rating = 3.5\nRETURN business.name",
        "question": "List all businesses with rating 3.5",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (user:`yelp.user`)\nWHERE user.name = 'Michelle'\nRETURN user.user_id",
        "question": "List all user ids with name Michelle",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.name = 'Whataburger'\nRETURN business.state",
        "question": "Find all states in which there is a Whataburger",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.name = 'MGM Grand Buffet' AND t2.category_name = 'category_category_name0'\nRETURN t1.city",
        "question": "Find all cities in which there is a restaurant called \" MGM Grand Buffet \"",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.rating < 1.5\nRETURN business.city",
        "question": "Find the cities of businesses rated below 1.5",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.name = 'Taj Mahal'\nRETURN business.city",
        "question": "Find all cities which has a \" Taj Mahal \" .",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (review:`yelp.review`)\nWHERE review.rating < 1\nRETURN review.text",
        "question": "List all the reviews which rated a business less than 1",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.rating > 3.5 AND t2.category_name = 'restaurant'\nRETURN t1.name",
        "question": "List all the restaurant rated more than 3.5",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.name = 'Taj Mahal' AND t2.category_name = 'restaurant'\nRETURN t1.city",
        "question": "find all cities which has a \" Taj Mahal \" restaurant",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.user`)-[]-(t1:`yelp.review`)\nWHERE t2.name = 'Niloofar'\nRETURN t1.text",
        "question": "list all the reviews by Niloofar",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.review`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.user`)\nWHERE t3.name = 'Niloofar'\nRETURN t1.name",
        "question": "list all the businesses which have a review by Niloofar",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.review`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.user`)\nWHERE t2.rating = 5 AND t3.name = 'Niloofar'\nRETURN t1.name",
        "question": "list all the businesses which Niloofar rated 5",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.category`)-[]-(t4:`yelp.review`)-[]-(t5:`yelp.user`)\nWHERE t2.category_name = 'Italian' AND t3.category_name = 'category_category_name1' AND t5.name = 'Michelle'\nRETURN t4.text",
        "question": "List all the reviews by Michelle for Italian restaurant",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.review`)\nWHERE t1.name = 'Cafe Zinho' AND t1.state = 'Texas' AND t2.category_name = 'restaurant'\nRETURN count(DISTINCT t3.None)",
        "question": "find the number of reviews written for \" Cafe Zinho \" restaurant in Texas",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.category`)\nWHERE t1.rating = 5 AND t2.category_name = 'Italian' AND t3.category_name = 'restaurant'\nRETURN t1.name",
        "question": "List all 5 star Italian restaurant",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t3:`yelp.category`)-[]-(t2:`yelp.business`)-[]-(t4:`yelp.category`)-[]-(t1:`yelp.neighbourhood`)\nWHERE t2.city = 'Madison' AND t3.category_name = 'Italian' AND t4.category_name = 'restaurant'\nRETURN t1.neighbourhood_name",
        "question": "List all the neighbourhoods with Italian restaurant in Madison",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t3:`yelp.category`)-[]-(t2:`yelp.business`)-[]-(t4:`yelp.category`)-[]-(t1:`yelp.neighbourhood`)\nWHERE t2.city = 'Madison' AND t2.rating < 2.5 AND t3.category_name = 'Italian' AND t4.category_name = 'restaurant'\nRETURN t1.neighbourhood_name",
        "question": "List all the neighbourhoods with Italian restaurant rated less than 2.5 in Madison",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.state = 'Pennsylvania' AND t2.category_name = 'restaurant'\nRETURN t1.name",
        "question": "find all the restaurant in Pennsylvania",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.state = 'Pennsylvania' AND t2.category_name = 'restaurant'\nRETURN t1.name",
        "question": "List all businesses that are restaurant in Pennsylvania .",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.review`)\nWHERE t1.review_count > 100 AND t2.category_name = 'Pet Groomers'\nRETURN t3.text",
        "question": "Find all the reviews for all Pet Groomers with more than 100 reviews",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.city = 'Los Angeles' AND t2.category_name = 'breweries'\nRETURN t1.name",
        "question": "What are all the breweries in \" Los Angeles \" ?",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.city = 'Los Angeles' AND t2.category_name = 'breweries'\nRETURN t1.name",
        "question": "Find all breweries in Los Angeles",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.review`)-[]-(t4:`yelp.user`)\nWHERE t1.name = 'Mesa Grill' AND t2.category_name = 'restaurant'\nRETURN t4.name",
        "question": "Find all users who reviewed restaurant \" Mesa Grill \"",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.city = 'Los Angeles' AND business.name = 'Walmart'\nRETURN business.full_address",
        "question": "List the addresses of all Walmart in \" Los Angeles \"",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.review`)-[]-(t4:`yelp.user`)\nWHERE t1.city = 'Dallas' AND t2.category_name = 'restaurant' AND t4.name = 'Patrick'\nRETURN t1.name",
        "question": "Find all restaurant reviewed by Patrick in \" Dallas \"",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.review`)-[]-(t4:`yelp.user`)\nWHERE t1.city = 'Dallas' AND t2.category_name = 'restaurant' AND t4.name = 'Patrick'\nRETURN t1.name",
        "question": "Which restaurant in Dallas were reviewed by user Patrick ?",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.review`)-[]-(t4:`yelp.user`)\nWHERE t2.category_name = 'Bars' AND t4.name = 'Patrick'\nRETURN t1.name",
        "question": "Find all Bars reviewed by Patrick",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.review`)-[]-(t4:`yelp.user`)\nWHERE t1.rating >= 3 AND t2.category_name = 'Bars' AND t4.name = 'Patrick'\nRETURN t1.name",
        "question": "Find all Bars reviewed by Patrick with at least 3 stars",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.tip`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.user`)\nWHERE t1.name = 'Barrio Cafe' AND t2.year = 2015\nRETURN t3.name",
        "question": "Find all users who have written tips for \" Barrio Cafe \" in 2015",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.rating < 2 AND business.state = 'Texas'\nRETURN business.name",
        "question": "Find all businesses in Texas with a rating below 2",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.category`)\nWHERE t1.city = 'Los Angeles' AND t2.category_name = 'Seafood' AND t3.category_name = 'restaurant'\nRETURN t1.name",
        "question": "Find all restaurant Seafood in Los Angeles",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.category`)\nWHERE t1.city = 'Los Angeles' AND t2.category_name = 'Seafood' AND t3.category_name = 'restaurant'\nRETURN t1.name",
        "question": "List all the Seafood restaurant in \" Los Angeles \"",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.category`)\nWHERE t1.city = 'Los Angeles' AND t2.category_name = 'Seafood' AND t3.category_name = 'restaurant'\nRETURN t1.name",
        "question": "Find all restaurant that serve Seafood in \" Los Angeles \"",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.user`)-[]-(t1:`yelp.review`)\nWHERE t1.rating > 4 AND t2.name = 'Patrick'\nRETURN t1.text",
        "question": "Find all reviews by Patrick with a rating above 4",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.city = 'Los Angeles' AND business.name = 'Apple Store'\nRETURN business.business_id",
        "question": "Find all Apple Store in \" Los Angeles \"",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.city = 'Dallas' AND t1.rating > 4.5 AND t2.category_name = 'restaurant'\nRETURN t1.name",
        "question": "Find all Dallas restaurant with a rating above 4.5",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t3:`yelp.category`)-[]-(t2:`yelp.business`)-[]-(t1:`yelp.neighbourhood`)\nWHERE t2.name = 'Flat Top Grill' AND t3.category_name = 'category_category_name0'\nRETURN t1.neighbourhood_name",
        "question": "What neighbourhood is restaurant \" Flat Top Grill \" in ?",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.tip`)-[]-(t1:`yelp.business`)\nWHERE t1.name = 'Vintner Grill' AND t2.likes > 9\nRETURN t2.text",
        "question": "Find all tips about \" Vintner Grill \" that received more than 9 likes",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.review`)-[]-(t1:`yelp.business`)\nWHERE t1.name = 'Kabob Palace' AND t2.year = 2014\nRETURN t2.text",
        "question": "Find all reviews about \" Kabob Palace \" in year 2014",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.tip`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.user`)\nWHERE t1.city = 'Dallas'\nRETURN t3.name",
        "question": "Find all users who have written tips about businesses in Dallas",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.name = 'MGM Grand Buffet' AND t1.state = 'Texas' AND t2.category_name = 'restaurant'\nRETURN t1.city",
        "question": "Find all cities in Texas in which there is a restaurant called \" MGM Grand Buffet \"",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.tip`)-[]-(t4:`yelp.user`)\nWHERE t2.category_name = 'Pet Groomers'\nRETURN t4.name",
        "question": "Find the users who have given tips on Pet Groomers",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.tip`)-[]-(t1:`yelp.business`)\nWHERE t1.name = 'Cafe Zinho' AND t1.state = 'Texas'\nRETURN t2.text",
        "question": "Find all tips for \" Cafe Zinho \" in Texas .",
        "answers": []
    }
]