[
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Hotels`)-[]-(T2:`cre_Theme_park.Ref_Hotel_Star_Ratings`)\nWHERE T1.price_range > 10000\nRETURN T2.star_rating_description",
        "question": "What are the star rating descriptions of the hotels with price above 10000?",
        "answers": [
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Hotels`)-[]-(T2:`cre_Theme_park.Ref_Hotel_Star_Ratings`)\nWHERE T1.price_range > 10000\nRETURN T2.star_rating_description",
        "question": "Give me the star rating descriptions of the hotels that cost more than 10000.",
        "answers": [
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Museums`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nRETURN T1.Museum_Details,T2.Opening_Hours",
        "question": "What are the details and opening hours of the museums?",
        "answers": [
            [
                "Yale Center for British Art",
                null
            ],
            [
                "The Metropolitan Museum of Art",
                null
            ],
            [
                "MoMA",
                null
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Museums`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nRETURN T1.Museum_Details,T2.Opening_Hours",
        "question": "Give me the detail and opening hour for each museum.",
        "answers": [
            [
                "Yale Center for British Art",
                null
            ],
            [
                "The Metropolitan Museum of Art",
                null
            ],
            [
                "MoMA",
                null
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Photos`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nWHERE T2.Name = \"film festival\"\nRETURN T1.Name,T1.Description",
        "question": "What are the names and descriptions of the photos taken at the tourist attraction \"film festival\"?",
        "answers": [
            [
                "park1",
                null
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Photos`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nWHERE T2.Name = \"film festival\"\nRETURN T1.Name,T1.Description",
        "question": "Find the names and descriptions of the photos taken at the tourist attraction called \"film festival\".",
        "answers": [
            [
                "park1",
                null
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Royal_Family`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nRETURN T1.Royal_Family_Details,T2.How_to_Get_There",
        "question": "What are the details and ways to get to tourist attractions related to royal family?",
        "answers": [
            [
                null,
                "bus"
            ],
            [
                null,
                "shuttle"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Royal_Family`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nRETURN T1.Royal_Family_Details,T2.How_to_Get_There",
        "question": "Which tourist attractions are related to royal family? Tell me their details and how we can get there.",
        "answers": [
            [
                null,
                "bus"
            ],
            [
                null,
                "shuttle"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Staff`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nWHERE T2.Name = \"US museum\"\nRETURN T1.Name",
        "question": "What is the name of the staff that is in charge of the attraction named \"US museum\"?",
        "answers": [
            [
                "Whitney"
            ],
            [
                "Trinity"
            ],
            [
                "Kaela"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Staff`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nWHERE T2.Name = \"US museum\"\nRETURN T1.Name",
        "question": "Tell me the name of the staff in charge of the attraction called \"US museum\".",
        "answers": [
            [
                "Whitney"
            ],
            [
                "Trinity"
            ],
            [
                "Kaela"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (hotels:`cre_Theme_park.Hotels`)\nRETURN hotels.hotel_id,hotels.star_rating_code\nORDER BY hotels.price_range ASC",
        "question": "Show the id and star rating of each hotel, ordered by its price from low to high.",
        "answers": [
            [
                144,
                "4"
            ],
            [
                222,
                "5"
            ],
            [
                239,
                "3"
            ],
            [
                331,
                "1"
            ],
            [
                350,
                "1"
            ],
            [
                376,
                "2"
            ],
            [
                431,
                "2"
            ],
            [
                426,
                "5"
            ],
            [
                473,
                "1"
            ],
            [
                555,
                "5"
            ],
            [
                420,
                "5"
            ],
            [
                172,
                "5"
            ],
            [
                264,
                "1"
            ],
            [
                442,
                "2"
            ],
            [
                514,
                "5"
            ],
            [
                123,
                "5"
            ],
            [
                421,
                "3"
            ],
            [
                379,
                "4"
            ],
            [
                373,
                "5"
            ],
            [
                314,
                "5"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (hotels:`cre_Theme_park.Hotels`)\nRETURN hotels.hotel_id,hotels.star_rating_code\nORDER BY hotels.price_range ASC",
        "question": "Find the id and star rating of each hotel and sort them in increasing order of price.",
        "answers": [
            [
                144,
                "4"
            ],
            [
                222,
                "5"
            ],
            [
                239,
                "3"
            ],
            [
                331,
                "1"
            ],
            [
                350,
                "1"
            ],
            [
                376,
                "2"
            ],
            [
                431,
                "2"
            ],
            [
                426,
                "5"
            ],
            [
                473,
                "1"
            ],
            [
                555,
                "5"
            ],
            [
                420,
                "5"
            ],
            [
                172,
                "5"
            ],
            [
                264,
                "1"
            ],
            [
                442,
                "2"
            ],
            [
                514,
                "5"
            ],
            [
                123,
                "5"
            ],
            [
                421,
                "3"
            ],
            [
                379,
                "4"
            ],
            [
                373,
                "5"
            ],
            [
                314,
                "5"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (hotels:`cre_Theme_park.Hotels`)\nRETURN hotels.other_hotel_details\nORDER BY hotels.price_range DESC\nLIMIT 3",
        "question": "Show the details of the top 3 most expensive hotels.",
        "answers": [
            [
                null
            ],
            [
                null
            ],
            [
                null
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (hotels:`cre_Theme_park.Hotels`)\nRETURN hotels.other_hotel_details\nORDER BY hotels.price_range DESC\nLIMIT 3",
        "question": "What are the details of the three most expensive hotels?",
        "answers": [
            [
                null
            ],
            [
                null
            ],
            [
                null
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (tourist_attractions:`cre_Theme_park.Tourist_Attractions`)\nRETURN tourist_attractions.How_to_Get_There,count(*)",
        "question": "Show different ways to get to attractions and the number of attractions that can be accessed in the corresponding way.",
        "answers": [
            [
                "bus",
                6
            ],
            [
                "walk",
                5
            ],
            [
                "shuttle",
                4
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (tourist_attractions:`cre_Theme_park.Tourist_Attractions`)\nRETURN tourist_attractions.How_to_Get_There,count(*)",
        "question": "List all the possible ways to get to attractions, together with the number of attractions accessible by these methods.",
        "answers": [
            [
                "bus",
                6
            ],
            [
                "walk",
                5
            ],
            [
                "shuttle",
                4
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Tourist_Attractions`)-[]-(T2:`cre_Theme_park.Visits`)\nRETURN T1.Name,T2.Tourist_Attraction_ID,count(*)",
        "question": "Show different tourist attractions' names, ids, and the corresponding number of visits.",
        "answers": [
            [
                "history gallery",
                6653,
                1
            ],
            [
                "flying elephant",
                5076,
                1
            ],
            [
                "fun shops",
                9360,
                1
            ],
            [
                "US museum",
                6476,
                4
            ],
            [
                "fun games",
                6523,
                2
            ],
            [
                "exploration trial",
                6852,
                4
            ],
            [
                "parking",
                9919,
                2
            ],
            [
                "jungle cruise",
                8698,
                3
            ],
            [
                "presidents hall",
                8429,
                1
            ],
            [
                "UK gallery",
                2701,
                1
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Tourist_Attractions`)-[]-(T2:`cre_Theme_park.Visits`)\nRETURN T1.Name,T2.Tourist_Attraction_ID,count(*)",
        "question": "What are the name, id and the corresponding number of visits for each  tourist attraction?",
        "answers": [
            [
                "history gallery",
                6653,
                1
            ],
            [
                "flying elephant",
                5076,
                1
            ],
            [
                "fun shops",
                9360,
                1
            ],
            [
                "US museum",
                6476,
                4
            ],
            [
                "fun games",
                6523,
                2
            ],
            [
                "exploration trial",
                6852,
                4
            ],
            [
                "parking",
                9919,
                2
            ],
            [
                "jungle cruise",
                8698,
                3
            ],
            [
                "presidents hall",
                8429,
                1
            ],
            [
                "UK gallery",
                2701,
                1
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Tourist_Attractions`)-[]-(T2:`cre_Theme_park.Visits`)\nWITH T1.Name AS Name, count(*) AS count, T2.Tourist_Attraction_ID AS Tourist_Attraction_ID\nWHERE count  >= 2\nRETURN Name,Tourist_Attraction_ID",
        "question": "Show the names and ids of tourist attractions that are visited at least two times.",
        "answers": [
            [
                "US museum",
                6476
            ],
            [
                "fun games",
                6523
            ],
            [
                "exploration trial",
                6852
            ],
            [
                "parking",
                9919
            ],
            [
                "jungle cruise",
                8698
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Tourist_Attractions`)-[]-(T2:`cre_Theme_park.Visits`)\nWITH T1.Name AS Name, count(*) AS count, T1.Tourist_Attraction_ID AS Tourist_Attraction_ID\nWHERE count  <= 1\nRETURN Name,Tourist_Attraction_ID",
        "question": "Show the names and ids of tourist attractions that are visited at most once.",
        "answers": [
            [
                "history gallery",
                6653
            ],
            [
                "flying elephant",
                5076
            ],
            [
                "fun shops",
                9360
            ],
            [
                "presidents hall",
                8429
            ],
            [
                "UK gallery",
                2701
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Tourist_Attractions`)-[]-(T2:`cre_Theme_park.Visits`)\nWITH T1.Name AS Name, count(*) AS count, T1.Tourist_Attraction_ID AS Tourist_Attraction_ID\nWHERE count  <= 1\nRETURN Name,Tourist_Attraction_ID",
        "question": "What are the names and ids of the tourist attractions that are visited at most once?",
        "answers": [
            [
                "history gallery",
                6653
            ],
            [
                "flying elephant",
                5076
            ],
            [
                "fun shops",
                9360
            ],
            [
                "presidents hall",
                8429
            ],
            [
                "UK gallery",
                2701
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Tourist_Attractions`)-[T2:`cre_Theme_park.Tourist_Attraction_Features`]-(T3:`cre_Theme_park.Features`)\nWHERE T3.Feature_Details = 'park'\nRETURN T1.Name  AS name \nUNION\nMATCH (T1:`cre_Theme_park.Tourist_Attractions`)-[T2:`cre_Theme_park.Tourist_Attraction_Features`]-(T3:`cre_Theme_park.Features`)\nWHERE T3.Feature_Details = 'shopping'\nRETURN T1.Name  AS name",
        "question": "What are the names of the tourist attractions that have parking or shopping as their feature details?",
        "answers": [
            [
                "fun games"
            ],
            [
                "flying elephant"
            ],
            [
                "jungle cruise"
            ],
            [
                "exploration trial"
            ],
            [
                "impressions de France"
            ],
            [
                "cafe"
            ],
            [
                "US museum"
            ],
            [
                "presidents hall"
            ],
            [
                "parking"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (T1:`cre_Theme_park.Tourist_Attractions`)-[T2:`cre_Theme_park.Tourist_Attraction_Features`]-(T3:`cre_Theme_park.Features`)\nWHERE T3.Feature_Details = 'park'\nRETURN T1.Name  AS name \nUNION\nMATCH (T1:`cre_Theme_park.Tourist_Attractions`)-[T2:`cre_Theme_park.Tourist_Attraction_Features`]-(T3:`cre_Theme_park.Features`)\nWHERE T3.Feature_Details = 'shopping'\nRETURN T1.Name  AS name",
        "question": "Find the tourist attractions that have parking or shopping as their feature details. What are the names of the attractions?",
        "answers": [
            [
                "fun games"
            ],
            [
                "flying elephant"
            ],
            [
                "jungle cruise"
            ],
            [
                "exploration trial"
            ],
            [
                "impressions de France"
            ],
            [
                "cafe"
            ],
            [
                "US museum"
            ],
            [
                "presidents hall"
            ],
            [
                "parking"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN count(*)",
        "question": "How many video games exist?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN count(*)",
        "question": "How many video games do you have?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN count(DISTINCT video_games.GType)",
        "question": "How many video game types exist?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN count(DISTINCT video_games.GType)",
        "question": "What is the count of different game types?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN DISTINCT video_games.GType",
        "question": "Show all video game types.",
        "answers": [
            [
                "Collectible card game"
            ],
            [
                "Walking Simulator"
            ],
            [
                "Role-playing game"
            ],
            [
                "Grand strategy"
            ],
            [
                "Frist-person shooter"
            ],
            [
                "Massively multiplayer online game"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN DISTINCT video_games.GType",
        "question": "What are the different types of video games?",
        "answers": [
            [
                "Collectible card game"
            ],
            [
                "Walking Simulator"
            ],
            [
                "Role-playing game"
            ],
            [
                "Grand strategy"
            ],
            [
                "Frist-person shooter"
            ],
            [
                "Massively multiplayer online game"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN video_games.GName,video_games.GType\nORDER BY video_games.GName",
        "question": "Show all video games and their types in the order of their names.",
        "answers": [
            [
                "Call of Destiny",
                "Frist-person shooter"
            ],
            [
                "Europe is the Universe",
                "Grand strategy"
            ],
            [
                "Grand Term Assignment",
                "Role-playing game"
            ],
            [
                "RNG Stone",
                "Collectible card game"
            ],
            [
                "The Vanishing of Eric Calder",
                "Walking Simulator"
            ],
            [
                "Works of Widenius",
                "Massively multiplayer online game"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN video_games.GName,video_games.GType\nORDER BY video_games.GName",
        "question": "What are the names of all the video games and their types in alphabetical order?",
        "answers": [
            [
                "Call of Destiny",
                "Frist-person shooter"
            ],
            [
                "Europe is the Universe",
                "Grand strategy"
            ],
            [
                "Grand Term Assignment",
                "Role-playing game"
            ],
            [
                "RNG Stone",
                "Collectible card game"
            ],
            [
                "The Vanishing of Eric Calder",
                "Walking Simulator"
            ],
            [
                "Works of Widenius",
                "Massively multiplayer online game"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nWHERE video_games.GType = \"Collectible card game\"\nRETURN video_games.GName",
        "question": "Show all video games with type Collectible card game.",
        "answers": [
            [
                "RNG Stone"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nWHERE video_games.GType = \"Collectible card game\"\nRETURN video_games.GName",
        "question": "What are the names of all video games that are collectible cards?",
        "answers": [
            [
                "RNG Stone"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nWHERE video_games.GName = \"Call of Destiny\"\nRETURN video_games.GType",
        "question": "What is the type of video game Call of Destiny.",
        "answers": [
            [
                "Frist-person shooter"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nWHERE video_games.GName = \"Call of Destiny\"\nRETURN video_games.GType",
        "question": "What type of game is Call of Destiny?",
        "answers": [
            [
                "Frist-person shooter"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nWHERE video_games.GType = \"Massively multiplayer online game\"\nRETURN count(*)",
        "question": "How many video games have type Massively multiplayer online game?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nWHERE video_games.GType = \"Massively multiplayer online game\"\nRETURN count(*)",
        "question": "Count the number of video games with Massively multiplayer online game type .",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN video_games.GType,count(*)",
        "question": "Show all video game types and the number of video games in each type.",
        "answers": [
            [
                "Collectible card game",
                1
            ],
            [
                "Walking Simulator",
                1
            ],
            [
                "Role-playing game",
                1
            ],
            [
                "Grand strategy",
                1
            ],
            [
                "Frist-person shooter",
                1
            ],
            [
                "Massively multiplayer online game",
                1
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN video_games.GType,count(*)",
        "question": "What are the types of video games and how many are in each type?",
        "answers": [
            [
                "Collectible card game",
                1
            ],
            [
                "Walking Simulator",
                1
            ],
            [
                "Role-playing game",
                1
            ],
            [
                "Grand strategy",
                1
            ],
            [
                "Frist-person shooter",
                1
            ],
            [
                "Massively multiplayer online game",
                1
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN video_games.GType\nORDER BY video_games.GType DESC\nLIMIT 1",
        "question": "Which game type has most number of games?",
        "answers": [
            [
                "Walking Simulator"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN video_games.GType\nORDER BY video_games.GType DESC\nLIMIT 1",
        "question": "What type has the most games?",
        "answers": [
            [
                "Walking Simulator"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN video_games.GType\nORDER BY video_games.GType\nLIMIT 1",
        "question": "Which game type has least number of games?",
        "answers": [
            [
                "Collectible card game"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN video_games.GType\nORDER BY video_games.GType\nLIMIT 1",
        "question": "What is the type with the fewest games?",
        "answers": [
            [
                "Collectible card game"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (student:`game_1.Student`)\nWHERE student.Advisor = 1121\nRETURN student.StuID",
        "question": "Show ids for all students who have advisor 1121.",
        "answers": [
            [
                1001
            ],
            [
                1005
            ],
            [
                1018
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (student:`game_1.Student`)\nWHERE student.Advisor = 1121\nRETURN student.StuID",
        "question": "What are the ids of all students who have advisor number 1121?",
        "answers": [
            [
                1001
            ],
            [
                1005
            ],
            [
                1018
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (student:`game_1.Student`)\nWHERE student.Major = 600\nRETURN student.Fname",
        "question": "Show first name for all students with major 600.",
        "answers": [
            [
                "Linda"
            ],
            [
                "Tracy"
            ],
            [
                "Shiela"
            ],
            [
                "Dinesh"
            ],
            [
                "Paul"
            ],
            [
                "Andy"
            ],
            [
                "Lisa"
            ],
            [
                "Jandy"
            ],
            [
                "Eric"
            ],
            [
                "Derek"
            ],
            [
                "David"
            ],
            [
                "Steven"
            ],
            [
                "Charles"
            ],
            [
                "Susan"
            ],
            [
                "Mark"
            ],
            [
                "Bruce"
            ],
            [
                "Michael"
            ],
            [
                "Arthur"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (student:`game_1.Student`)\nWHERE student.Major = 600\nRETURN student.Fname",
        "question": "What are the first names for all students who are from the major numbered 600?",
        "answers": [
            [
                "Linda"
            ],
            [
                "Tracy"
            ],
            [
                "Shiela"
            ],
            [
                "Dinesh"
            ],
            [
                "Paul"
            ],
            [
                "Andy"
            ],
            [
                "Lisa"
            ],
            [
                "Jandy"
            ],
            [
                "Eric"
            ],
            [
                "Derek"
            ],
            [
                "David"
            ],
            [
                "Steven"
            ],
            [
                "Charles"
            ],
            [
                "Susan"
            ],
            [
                "Mark"
            ],
            [
                "Bruce"
            ],
            [
                "Michael"
            ],
            [
                "Arthur"
            ]
        ]
    },
    {
        "db_id": "game_1",
        "query": "MATCH (student:`game_1.Student`)\nWITH student.Advisor AS Advisor, count(*) AS count\nWHERE count  >= 2\nRETURN Advisor",
        "question": "Show all advisors who have at least two students.",
        "answers": [
            [
                1121
            ],
            [
                1148
            ],
            [
                2192
            ],
            [
                7271
            ],
            [
                8722
            ],
            [
                7134
            ],
            [
                2311
            ],
            [
                8772
            ],
            [
                5718
            ]
        ]
    }
]