[
    {
        "question": "Show the years, book titles, and publishers for all books, in descending order by year.",
        "query": "MATCH (book_club:`culture_company.book_club`)\nRETURN book_club.Year,book_club.Book_Title,book_club.Publisher\nORDER BY book_club.Year DESC",
        "db_id": "culture_company",
        "answers": [
            [
                1990,
                "Somewhere in the Night",
                "Alyson"
            ],
            [
                1990,
                "Walking Water / After All This",
                "Banned Books"
            ],
            [
                1989,
                "Goldenboy",
                "Alyson"
            ],
            [
                1989,
                "Death Takes the Stage",
                "St. Martin's Press"
            ],
            [
                1989,
                "Unicorn Mountain",
                "William Morrow"
            ],
            [
                1989,
                "Obedience",
                "Mysterious Press"
            ],
            [
                1989,
                "Who\u04f3 Next",
                "International Polygonics"
            ],
            [
                1989,
                "Skiptrace",
                "Banned Books"
            ],
            [
                1989,
                "Lessons In Murder",
                "Naiad Press"
            ],
            [
                1989,
                "Mundane\u04f3 World",
                "Crossing Press"
            ],
            [
                1989,
                "Heavy Gilt",
                "Naiad Press"
            ],
            [
                1989,
                "The Crystal Curtain",
                "Alyson"
            ]
        ]
    },
    {
        "question": "Show all publishers and the number of books for each publisher.",
        "query": "MATCH (book_club:`culture_company.book_club`)\nWITH book_club.Publisher AS Publisher, count(book_club.Publisher) AS count\nRETURN Publisher,count",
        "db_id": "culture_company",
        "answers": [
            [
                "Alyson",
                3
            ],
            [
                "St. Martin's Press",
                1
            ],
            [
                "William Morrow",
                1
            ],
            [
                "Mysterious Press",
                1
            ],
            [
                "International Polygonics",
                1
            ],
            [
                "Banned Books",
                2
            ],
            [
                "Naiad Press",
                2
            ],
            [
                "Crossing Press",
                1
            ]
        ]
    },
    {
        "question": "Return the publisher that has published the most books.",
        "query": "MATCH (book_club:`culture_company.book_club`)\nWITH book_club.Publisher AS Publisher, count(book_club.Publisher) AS count\nRETURN Publisher\nORDER BY count DESC\nLIMIT 1",
        "db_id": "culture_company",
        "answers": [
            [
                "Alyson"
            ]
        ]
    },
    {
        "question": "Show all book categories and the number of books in each category.",
        "query": "MATCH (book_club:`culture_company.book_club`)\nWITH count(book_club.Category) AS count, book_club.Category AS Category\nRETURN Category,count",
        "db_id": "culture_company",
        "answers": [
            [
                "Gay M/SF",
                5
            ],
            [
                "Lesb. M/SF",
                5
            ],
            [
                "Gay SF/F",
                2
            ]
        ]
    },
    {
        "question": "List categories that have at least two books after year 1989.",
        "query": "MATCH (book_club:`culture_company.book_club`)\nWHERE book_club.Year > 1989\nWITH count(*) AS count, book_club.Category AS Category\nWHERE count  >= 2\nRETURN Category",
        "db_id": "culture_company",
        "answers": [
            [
                "Gay SF/F"
            ]
        ]
    },
    {
        "question": "Show all movie titles, years, and directors, ordered by budget.",
        "query": "MATCH (movie:`culture_company.movie`)\nRETURN movie.Title,movie.Year,movie.Director\nORDER BY movie.Budget_million",
        "db_id": "culture_company",
        "answers": [
            [
                "Jill Rips",
                2000,
                "Anthony Hickox"
            ],
            [
                "Storm Catcher",
                1999,
                "Anthony Hickox"
            ],
            [
                "The Boondock Saints",
                1999,
                "Troy Duffy"
            ],
            [
                "The Big Kahuna",
                1999,
                "John Swanbeck"
            ],
            [
                "The Whole Nine Yards",
                2000,
                "Jonathan Lynn"
            ],
            [
                "Battlefield Earth",
                2000,
                "Roger Christian"
            ],
            [
                "Agent Red",
                2000,
                "Damian Lee"
            ],
            [
                "The Art of War",
                2000,
                "Christian Duguay"
            ],
            [
                "3000 Miles to Graceland",
                2001,
                "Demian Lichtenstein"
            ],
            [
                "Get Carter",
                2000,
                "Stephen Kay"
            ]
        ]
    },
    {
        "question": "Count the number of different directors.",
        "query": "MATCH (movie:`culture_company.movie`)\nRETURN count(DISTINCT movie.Director)",
        "db_id": "culture_company",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "question": "Return the title and director of the movie released in the year 2000 or earlier that had the highest worldwide gross.",
        "query": "MATCH (movie:`culture_company.movie`)\nWHERE movie.Year <= 2000\nRETURN movie.Title,movie.Director\nORDER BY movie.Gross_worldwide DESC\nLIMIT 1",
        "db_id": "culture_company",
        "answers": [
            [
                "The Whole Nine Yards",
                "Jonathan Lynn"
            ]
        ]
    },
    {
        "question": "Show all director names who have a movie in the year 1999 or 2000.",
        "query": "MATCH (movie:`culture_company.movie`)\nWHERE movie.Year = 1999 OR movie.Year = 2000\nRETURN movie.Director",
        "db_id": "culture_company",
        "answers": [
            [
                "Troy Duffy"
            ],
            [
                "John Swanbeck"
            ],
            [
                "Anthony Hickox"
            ],
            [
                "Anthony Hickox"
            ],
            [
                "Jonathan Lynn"
            ],
            [
                "Roger Christian"
            ],
            [
                "Stephen Kay"
            ],
            [
                "Christian Duguay"
            ],
            [
                "Damian Lee"
            ]
        ]
    },
    {
        "question": "What is the average, maximum, and minimum budget for all movies before 2000.",
        "query": "MATCH (movie:`culture_company.movie`)\nWHERE movie.Year < 2000\nRETURN avg(movie.Budget_million),max(movie.Budget_million),min(movie.Budget_million)",
        "db_id": "culture_company",
        "answers": [
            [
                6.0,
                7.0,
                5.0
            ]
        ]
    },
    {
        "question": "how many rivers are in idaho",
        "query": "MATCH (river:`geo.river`)\nWHERE river.traverse = 'idaho'\nRETURN count(river.river_name)",
        "db_id": "geo",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "how many capitals does rhode island have",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'rhode island'\nRETURN count(state.capital)",
        "db_id": "geo",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "how many major cities are there",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000\nRETURN count(city.city_name)",
        "db_id": "geo",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "how many colorado rivers are there",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'colorado'\nRETURN count(river.river_name)",
        "db_id": "geo",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "how many states do not have rivers",
        "query": "MATCH (state:`geo.state`)\nWHERE NOT (state:`geo.state`)-[]-(:`geo.river`)\nRETURN count(DISTINCT state.state_name)",
        "db_id": "geo",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "how many states have a city named springfield",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN count(city.state_name)",
        "db_id": "geo",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "how many major cities are in texas",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'texas'\nRETURN count(city.city_name)",
        "db_id": "geo",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "how many states does the missouri run through",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'missouri'\nRETURN count(river.traverse)",
        "db_id": "geo",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "what is the height of the highest mountain in texas",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'texas'\nRETURN max(DISTINCT highlow.highest_elevation)",
        "db_id": "geo",
        "answers": [
            [
                null
            ]
        ]
    },
    {
        "question": "how many major rivers cross ohio",
        "query": "MATCH (river:`geo.river`)\nWHERE river.length > 750 AND river.traverse = 'ohio'\nRETURN count(river.river_name)",
        "db_id": "geo",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "how many states are next to major rivers",
        "query": "MATCH (river:`geo.river`)\nWHERE river.length > 750\nRETURN count(DISTINCT river.traverse)",
        "db_id": "geo",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "how many states have major rivers",
        "query": "MATCH (river:`geo.river`)\nWHERE river.length > 750\nRETURN count(river.traverse)",
        "db_id": "geo",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "how many cities are in texas",
        "query": "MATCH (city:`geo.city`)\nWHERE city.state_name = 'texas'\nRETURN count(city.city_name)",
        "db_id": "geo",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "how many cities named austin are there in the usa",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'austin'\nRETURN count(city.city_name)",
        "db_id": "geo",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "How many tips have been written in 2015",
        "query": "MATCH (tip:`yelp.tip`)\nWHERE tip.year = 2015\nRETURN count(DISTINCT tip.text)",
        "db_id": "yelp",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "How many Target are there in \" Los Angeles \" ?",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.city = 'Los Angeles' AND business.name = 'Target'\nRETURN count(DISTINCT business.business_id)",
        "db_id": "yelp",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Find the number of users called Michelle",
        "query": "MATCH (user:`yelp.user`)\nWHERE user.name = 'Michelle'\nRETURN count(DISTINCT user.name)",
        "db_id": "yelp",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Return me the number of cities that has \" Panda Express \" .",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.name = 'Panda Express'\nRETURN count(DISTINCT business.city)",
        "db_id": "yelp",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Find the total number of reviews written in March",
        "query": "MATCH (review:`yelp.review`)\nWHERE review.month = 'March'\nRETURN count(DISTINCT review.text)",
        "db_id": "yelp",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "return me the number of papers after 2000 .",
        "query": "MATCH (publication:`academic.publication`)\nWHERE publication.year > 2000\nRETURN count(DISTINCT publication.title)",
        "db_id": "academic",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "return me the number of the organizations in \" North America \" .",
        "query": "MATCH (organization:`academic.organization`)\nWHERE organization.continent = 'North America'\nRETURN count(DISTINCT organization.name)",
        "db_id": "academic",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "How many actors were born in \" Los Angeles \" after 2000 ?",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_city = 'Los Angeles' AND actor.birth_year > 2000\nRETURN count(DISTINCT actor.name)",
        "db_id": "imdb",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "How many female actors were born in \" New York City \" after 1980 ?",
        "query": "MATCH (actor:`imdb.actor`)\nWHERE actor.birth_city = 'New York City' AND actor.birth_year > 1980 AND actor.gender = 'female'\nRETURN count(DISTINCT actor.name)",
        "db_id": "imdb",
        "answers": [
            [
                0
            ]
        ]
    }
]