[
    {
        "db_id": "insurance_policies",
        "query": "MATCH (customer_policies:`insurance_policies.Customer_Policies`)\nRETURN customer_policies.Policy_Type_Code\nORDER BY customer_policies.Policy_Type_Code DESC\nLIMIT 1",
        "question": "Find the policy type the most customers choose.",
        "answers": [
            [
                "Travel"
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (settlements:`insurance_policies.Settlements`)\nRETURN count(*)",
        "question": "How many settlements are there in total?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (settlements:`insurance_policies.Settlements`)\nRETURN count(*)",
        "question": "Count the total number of settlements made.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (payments:`insurance_policies.Payments`)\nWHERE payments.Payment_Method_Code = 'Visa'\nRETURN payments.Payment_ID,payments.Date_Payment_Made,payments.Amount_Payment",
        "question": "Which Payments were processed with Visa? List the payment Id, the date and the amount.",
        "answers": [
            [
                678,
                "2017-12-16",
                459407
            ],
            [
                754,
                "2018-02-24",
                7343
            ],
            [
                779,
                "2017-05-28",
                155654
            ],
            [
                791,
                "2017-05-03",
                172309
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (payments:`insurance_policies.Payments`)\nWHERE payments.Payment_Method_Code = 'Visa'\nRETURN payments.Payment_ID,payments.Date_Payment_Made,payments.Amount_Payment",
        "question": "Give me the payment Id, the date and the amount for all the payments processed with Visa.",
        "answers": [
            [
                678,
                "2017-12-16",
                459407
            ],
            [
                754,
                "2018-02-24",
                7343
            ],
            [
                779,
                "2017-05-28",
                155654
            ],
            [
                791,
                "2017-05-03",
                172309
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (T1:`insurance_policies.Claims`)-[]-(T2:`insurance_policies.Settlements`)\nWITH T1.Date_Claim_Settled AS Date_Claim_Settled, count(*) AS count, T1.Date_Claim_Made AS Date_Claim_Made, T1.Claim_ID AS Claim_ID\nWHERE count  = 1\nRETURN Claim_ID,Date_Claim_Made,Date_Claim_Settled",
        "question": "List the date the claim was made, the date it was settled and the amount settled for all the claims which had exactly one settlement.",
        "answers": [
            [
                563,
                "2016-08-02",
                "2017-09-04"
            ],
            [
                569,
                "2018-07-15",
                "2017-11-19"
            ],
            [
                571,
                "2017-08-03",
                "2018-02-18"
            ],
            [
                843,
                "2017-10-14",
                "2018-02-20"
            ],
            [
                957,
                "2018-11-08",
                "2017-09-15"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Appointment`)-[]-(T2:`hospital_1.Physician`)\nRETURN T2.Name",
        "question": "List the name of physicians who took some appointment.",
        "answers": [
            [
                "John Dorian"
            ],
            [
                "Elliot Reid"
            ],
            [
                "John Dorian"
            ],
            [
                "Percival Cox"
            ],
            [
                "Percival Cox"
            ],
            [
                "Elliot Reid"
            ],
            [
                "Christopher Turk"
            ],
            [
                "Molly Clock"
            ],
            [
                "Elliot Reid"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Appointment`)-[]-(T2:`hospital_1.Physician`)\nRETURN T2.Name",
        "question": "What are the names of all the physicians who took appointments.",
        "answers": [
            [
                "John Dorian"
            ],
            [
                "Elliot Reid"
            ],
            [
                "John Dorian"
            ],
            [
                "Percival Cox"
            ],
            [
                "Percival Cox"
            ],
            [
                "Elliot Reid"
            ],
            [
                "Christopher Turk"
            ],
            [
                "Molly Clock"
            ],
            [
                "Elliot Reid"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Affiliated_With`]-(T3:`hospital_1.Department`)\nWHERE T2.PrimaryAffiliation = 1\nRETURN T1.Name,T3.Name",
        "question": "Find the names of all physicians and their primary affiliated departments' names.",
        "answers": [
            [
                "Percival Cox",
                "General Medicine"
            ],
            [
                "Elliot Reid",
                "General Medicine"
            ],
            [
                "Bob Kelso",
                "General Medicine"
            ],
            [
                "John Dorian",
                "General Medicine"
            ],
            [
                "Keith Dudemeister",
                "General Medicine"
            ],
            [
                "Christopher Turk",
                "Surgery"
            ],
            [
                "John Wen",
                "Surgery"
            ],
            [
                "Todd Quinlan",
                "Surgery"
            ],
            [
                "Molly Clock",
                "Psychiatry"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Affiliated_With`]-(T3:`hospital_1.Department`)\nWHERE T2.PrimaryAffiliation = 1\nRETURN T1.Name,T3.Name",
        "question": "What are the name and primarily affiliated department name of each physician?",
        "answers": [
            [
                "Percival Cox",
                "General Medicine"
            ],
            [
                "Elliot Reid",
                "General Medicine"
            ],
            [
                "Bob Kelso",
                "General Medicine"
            ],
            [
                "John Dorian",
                "General Medicine"
            ],
            [
                "Keith Dudemeister",
                "General Medicine"
            ],
            [
                "Christopher Turk",
                "Surgery"
            ],
            [
                "John Wen",
                "Surgery"
            ],
            [
                "Todd Quinlan",
                "Surgery"
            ],
            [
                "Molly Clock",
                "Psychiatry"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Patient`)-[]-(T2:`hospital_1.Appointment`)\nRETURN T1.Name\nORDER BY T2.Start DESC\nLIMIT 1",
        "question": "What is the name of the patient who made the most recent appointment?",
        "answers": [
            [
                "Dennis Doe"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Patient`)-[]-(T2:`hospital_1.Appointment`)\nRETURN T1.Name\nORDER BY T2.Start DESC\nLIMIT 1",
        "question": "Find the name of the patient who made the appointment with the most recent start date.",
        "answers": [
            [
                "Dennis Doe"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (stay:`hospital_1.Stay`)\nWHERE stay.Room = 112\nRETURN count(stay.Patient)",
        "question": "How many patients stay in room 112?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (stay:`hospital_1.Stay`)\nWHERE stay.Room = 112\nRETURN count(stay.Patient)",
        "question": "Count the number of patients who stayed in room 112.",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Stay`)-[]-(T2:`hospital_1.Patient`)-[]-(T3:`hospital_1.Prescribes`)-[]-(T4:`hospital_1.Medication`)\nWHERE T1.Room = 111\nRETURN T4.Name",
        "question": "Find the name of medication used on the patient who stays in room 111?",
        "answers": [
            [
                "Procrastin-X"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Stay`)-[]-(T2:`hospital_1.Patient`)-[]-(T3:`hospital_1.Prescribes`)-[]-(T4:`hospital_1.Medication`)\nWHERE T1.Room = 111\nRETURN T4.Name",
        "question": "What is the name of the medication used for the patient staying in room 111?",
        "answers": [
            [
                "Procrastin-X"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (stay:`hospital_1.Stay`)\nWHERE stay.Room = 111\nRETURN stay.Patient\nORDER BY stay.StayStart DESC\nLIMIT 1",
        "question": "Find the patient who most recently stayed in room 111.",
        "answers": [
            [
                100000001
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (stay:`hospital_1.Stay`)\nWHERE stay.Room = 111\nRETURN stay.Patient\nORDER BY stay.StayStart DESC\nLIMIT 1",
        "question": "What is the id of the patient who stayed in room 111 most recently?",
        "answers": [
            [
                100000001
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[]-(T2:`hospital_1.Patient`)\nRETURN T1.Name,count(*)",
        "question": "How many patients do each physician take care of? List their names and number of patients they take care of.",
        "answers": [
            [
                "John Dorian",
                1
            ],
            [
                "Elliot Reid",
                2
            ],
            [
                "Christopher Turk",
                1
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[]-(T2:`hospital_1.Patient`)\nRETURN T1.Name,count(*)",
        "question": "Return the name of each physician and the number of patients he or she treats.",
        "answers": [
            [
                "John Dorian",
                1
            ],
            [
                "Elliot Reid",
                2
            ],
            [
                "Christopher Turk",
                1
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[]-(T2:`hospital_1.Patient`)\nWITH T1.Name AS Name, count(*) AS count\nWHERE count  > 1\nRETURN Name",
        "question": "Find the name of physicians who are in charge of more than one patient.",
        "answers": [
            [
                "Elliot Reid"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[]-(T2:`hospital_1.Patient`)\nWITH T1.Name AS Name, count(*) AS count\nWHERE count  > 1\nRETURN Name",
        "question": "Which physicians are in charge of more than one patient? Give me their names.",
        "answers": [
            [
                "Elliot Reid"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Block`)-[]-(T2:`hospital_1.Room`)\nRETURN count(*),T1.BlockFloor",
        "question": "Find the number of rooms located on each block floor.",
        "answers": [
            [
                9,
                1
            ],
            [
                9,
                2
            ],
            [
                9,
                3
            ],
            [
                9,
                4
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Block`)-[]-(T2:`hospital_1.Room`)\nRETURN count(*),T1.BlockFloor",
        "question": "How many rooms does each block floor have?",
        "answers": [
            [
                9,
                1
            ],
            [
                9,
                2
            ],
            [
                9,
                3
            ],
            [
                9,
                4
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Block`)-[]-(T2:`hospital_1.Room`)\nRETURN count(*),T1.BlockCode",
        "question": "Find the number of rooms for different block code?",
        "answers": [
            [
                12,
                1
            ],
            [
                12,
                2
            ],
            [
                12,
                3
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Block`)-[]-(T2:`hospital_1.Room`)\nRETURN count(*),T1.BlockCode",
        "question": "How many rooms are located for each block code?",
        "answers": [
            [
                12,
                1
            ],
            [
                12,
                2
            ],
            [
                12,
                3
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (room:`hospital_1.Room`)\nWHERE room.Unavailable = 0\nRETURN DISTINCT room.BlockCode",
        "question": "Tell me the distinct block codes where some rooms are available.",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (room:`hospital_1.Room`)\nRETURN count(DISTINCT room.RoomType)",
        "question": "Find the number of distinct room types available.",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Medication`)-[]-(T2:`hospital_1.Prescribes`)\nRETURN count(*),T1.Name",
        "question": "Find the number of medications prescribed for each brand.",
        "answers": [
            [
                1,
                "Procrastin-X"
            ],
            [
                2,
                "Thesisin"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Medication`)-[]-(T2:`hospital_1.Prescribes`)\nRETURN count(*),T1.Name",
        "question": "How many medications are prescribed for each brand?",
        "answers": [
            [
                1,
                "Procrastin-X"
            ],
            [
                2,
                "Thesisin"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (physician:`hospital_1.Physician`)\nWHERE physician.Position =~'.*[S|s]enior.*'\nRETURN physician.Name",
        "question": "Find the name of physicians whose position title contains the word 'senior'.",
        "answers": [
            [
                "Percival Cox"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (physician:`hospital_1.Physician`)\nWHERE physician.Position =~'.*[S|s]enior.*'\nRETURN physician.Name",
        "question": "What are the names of the physicians who have 'senior' in their titles.",
        "answers": [
            [
                "Percival Cox"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (undergoes:`hospital_1.Undergoes`)\nRETURN undergoes.Patient\nORDER BY undergoes.DateUndergoes\nLIMIT 1",
        "question": "Find the patient who has the most recent undergoing treatment?",
        "answers": [
            [
                100000001
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Undergoes`)-[]-(T2:`hospital_1.Patient`)-[]-(T3:`hospital_1.Stay`)\nWHERE T3.Room = 111\nRETURN DISTINCT T2.Name",
        "question": "Find the names of all patients who have an undergoing treatment and are staying in room 111.",
        "answers": [
            [
                "John Smith"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Undergoes`)-[]-(T2:`hospital_1.Patient`)-[]-(T3:`hospital_1.Stay`)\nWHERE T3.Room = 111\nRETURN DISTINCT T2.Name",
        "question": "What are the names of patients who are staying in room 111 and have an undergoing treatment?",
        "answers": [
            [
                "John Smith"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Undergoes`)-[]-(T2:`hospital_1.Nurse`)\nRETURN DISTINCT T2.Name",
        "question": "Find the names of nurses who are nursing an undergoing treatment.",
        "answers": [
            [
                "Carla Espinosa"
            ],
            [
                "Laverne Roberts"
            ],
            [
                "Paul Flowers"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Undergoes`)-[]-(T2:`hospital_1.Nurse`)\nRETURN DISTINCT T2.Name",
        "question": "Which nurses are in charge of patients undergoing treatments?",
        "answers": [
            [
                "Carla Espinosa"
            ],
            [
                "Laverne Roberts"
            ],
            [
                "Paul Flowers"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (medication:`hospital_1.Medication`)\nRETURN DISTINCT medication.Name\nORDER BY medication.Name",
        "question": "List the names of all distinct medications, ordered in an alphabetical order.",
        "answers": [
            [
                "Awakin"
            ],
            [
                "Crescavitin"
            ],
            [
                "Melioraurin"
            ],
            [
                "Procrastin-X"
            ],
            [
                "Thesisin"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (medication:`hospital_1.Medication`)\nRETURN DISTINCT medication.Name\nORDER BY medication.Name",
        "question": "What is the alphabetically ordered list of all distinct medications?",
        "answers": [
            [
                "Awakin"
            ],
            [
                "Crescavitin"
            ],
            [
                "Melioraurin"
            ],
            [
                "Procrastin-X"
            ],
            [
                "Thesisin"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[]-(T2:`hospital_1.Prescribes`)\nRETURN T1.Name\nORDER BY T2.Dose DESC\nLIMIT 1",
        "question": "What are the names of the physician who prescribed the highest dose?",
        "answers": [
            [
                "John Dorian"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[]-(T2:`hospital_1.Prescribes`)\nRETURN T1.Name\nORDER BY T2.Dose DESC\nLIMIT 1",
        "question": "Find the physician who prescribed the highest dose. What is his or her name?",
        "answers": [
            [
                "John Dorian"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T2:`hospital_1.Department`)-[T1:`hospital_1.Affiliated_With`]-()\nWHERE T1.PrimaryAffiliation = 1\nRETURN DISTINCT T2.Name",
        "question": "List the names of departments where some physicians are primarily affiliated with.",
        "answers": [
            [
                "General Medicine"
            ],
            [
                "Surgery"
            ],
            [
                "Psychiatry"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T2:`hospital_1.Department`)-[T1:`hospital_1.Affiliated_With`]-()\nWHERE T1.PrimaryAffiliation = 1\nRETURN DISTINCT T2.Name",
        "question": "What are the names of departments that have primarily affiliated physicians.",
        "answers": [
            [
                "General Medicine"
            ],
            [
                "Surgery"
            ],
            [
                "Psychiatry"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (procedures:`hospital_1.Procedures`)\nRETURN max(procedures.Cost),min(procedures.Cost),avg(procedures.Cost)",
        "question": "Tell me the highest, lowest, and average cost of procedures.",
        "answers": [
            [
                10000.0,
                25.0,
                4324.857142857143
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (procedures:`hospital_1.Procedures`)\nRETURN procedures.Name,procedures.Cost\nORDER BY procedures.Cost DESC",
        "question": "List the name and cost of all procedures sorted by the cost from the highest to the lowest.",
        "answers": [
            [
                "Complete Walletectomy",
                10000.0
            ],
            [
                "Reversible Pancreomyoplasty",
                5600.0
            ],
            [
                "Obfuscated Dermogastrotomy",
                4899.0
            ],
            [
                "Folded Demiophtalmectomy",
                4500.0
            ],
            [
                "Obtuse Pyloric Recombobulation",
                3750.0
            ],
            [
                "Reverse Rhinopodoplasty",
                1500.0
            ],
            [
                "Follicular Demiectomy",
                25.0
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (procedures:`hospital_1.Procedures`)\nRETURN procedures.Name,procedures.Cost\nORDER BY procedures.Cost DESC",
        "question": "Sort the list of names and costs of all procedures in the descending order of cost.",
        "answers": [
            [
                "Complete Walletectomy",
                10000.0
            ],
            [
                "Reversible Pancreomyoplasty",
                5600.0
            ],
            [
                "Obfuscated Dermogastrotomy",
                4899.0
            ],
            [
                "Folded Demiophtalmectomy",
                4500.0
            ],
            [
                "Obtuse Pyloric Recombobulation",
                3750.0
            ],
            [
                "Reverse Rhinopodoplasty",
                1500.0
            ],
            [
                "Follicular Demiectomy",
                25.0
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (procedures:`hospital_1.Procedures`)\nRETURN procedures.Name\nORDER BY procedures.Cost\nLIMIT 3",
        "question": "Find the three most expensive procedures.",
        "answers": [
            [
                "Follicular Demiectomy"
            ],
            [
                "Reverse Rhinopodoplasty"
            ],
            [
                "Obtuse Pyloric Recombobulation"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Trained_In`]-(T3:`hospital_1.Procedures`)\nWHERE T3.Cost > 5000\nRETURN T1.Name",
        "question": "Find the physicians who are trained in a procedure that costs more than 5000.",
        "answers": [
            [
                "John Wen"
            ],
            [
                "Todd Quinlan"
            ],
            [
                "John Wen"
            ],
            [
                "Christopher Turk"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Trained_In`]-(T3:`hospital_1.Procedures`)\nWHERE T3.Cost > 5000\nRETURN T1.Name",
        "question": "Which physicians are trained in procedures that are more expensive than 5000?",
        "answers": [
            [
                "John Wen"
            ],
            [
                "Todd Quinlan"
            ],
            [
                "John Wen"
            ],
            [
                "Christopher Turk"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Trained_In`]-(T3:`hospital_1.Procedures`)\nRETURN T1.Name\nORDER BY T3.Cost DESC\nLIMIT 1",
        "question": "Find the physician who was trained in the most expensive procedure?",
        "answers": [
            [
                "John Wen"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Trained_In`]-(T3:`hospital_1.Procedures`)\nRETURN T1.Name\nORDER BY T3.Cost DESC\nLIMIT 1",
        "question": "Which physician was trained in the procedure that costs the most.",
        "answers": [
            [
                "John Wen"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Trained_In`]-(T3:`hospital_1.Procedures`)\nWHERE T1.Name = \"John Wen\"\nRETURN T3.Name",
        "question": "Find the names of procedures which physician John Wen was trained in.",
        "answers": [
            [
                "Obfuscated Dermogastrotomy"
            ],
            [
                "Complete Walletectomy"
            ],
            [
                "Reversible Pancreomyoplasty"
            ],
            [
                "Follicular Demiectomy"
            ],
            [
                "Obtuse Pyloric Recombobulation"
            ],
            [
                "Reverse Rhinopodoplasty"
            ],
            [
                "Folded Demiophtalmectomy"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Trained_In`]-(T3:`hospital_1.Procedures`)\nWHERE T1.Name = \"John Wen\"\nRETURN T3.Name",
        "question": "What are the names of procedures physician John Wen was trained in?",
        "answers": [
            [
                "Obfuscated Dermogastrotomy"
            ],
            [
                "Complete Walletectomy"
            ],
            [
                "Reversible Pancreomyoplasty"
            ],
            [
                "Follicular Demiectomy"
            ],
            [
                "Obtuse Pyloric Recombobulation"
            ],
            [
                "Reverse Rhinopodoplasty"
            ],
            [
                "Folded Demiophtalmectomy"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (procedures:`hospital_1.Procedures`)\nWHERE procedures.Cost > 1000\nRETURN procedures.Name  AS name \nUNION\nMATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Trained_In`]-(T3:`hospital_1.Procedures`)\nWHERE T1.Name = \"John Wen\"\nRETURN T3.Name  AS name",
        "question": "Find all procedures which cost more than 1000 or which physician John Wen was trained in.",
        "answers": [
            [
                "Reverse Rhinopodoplasty"
            ],
            [
                "Obtuse Pyloric Recombobulation"
            ],
            [
                "Folded Demiophtalmectomy"
            ],
            [
                "Complete Walletectomy"
            ],
            [
                "Obfuscated Dermogastrotomy"
            ],
            [
                "Reversible Pancreomyoplasty"
            ],
            [
                "Follicular Demiectomy"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (procedures:`hospital_1.Procedures`)\nWHERE procedures.Cost > 1000\nRETURN procedures.Name  AS name \nUNION\nMATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Trained_In`]-(T3:`hospital_1.Procedures`)\nWHERE T1.Name = \"John Wen\"\nRETURN T3.Name  AS name",
        "question": "What are the procedures that cost more than 1000 or are specialized in by physician John Wen?",
        "answers": [
            [
                "Reverse Rhinopodoplasty"
            ],
            [
                "Obtuse Pyloric Recombobulation"
            ],
            [
                "Folded Demiophtalmectomy"
            ],
            [
                "Complete Walletectomy"
            ],
            [
                "Obfuscated Dermogastrotomy"
            ],
            [
                "Reversible Pancreomyoplasty"
            ],
            [
                "Follicular Demiectomy"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Affiliated_With`]-(T3:`hospital_1.Department`)\nWHERE T3.Name = 'Surgery' OR T3.Name = 'Psychiatry'\nRETURN T1.Name",
        "question": "Find the name of physicians who are affiliated with Surgery or Psychiatry department.",
        "answers": [
            [
                "Christopher Turk"
            ],
            [
                "John Wen"
            ],
            [
                "Todd Quinlan"
            ],
            [
                "Molly Clock"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Affiliated_With`]-(T3:`hospital_1.Department`)\nWHERE T3.Name = 'Surgery' OR T3.Name = 'Psychiatry'\nRETURN T1.Name",
        "question": "Which physicians are affiliated with either Surgery or Psychiatry department? Give me their names.",
        "answers": [
            [
                "Christopher Turk"
            ],
            [
                "John Wen"
            ],
            [
                "Todd Quinlan"
            ],
            [
                "Molly Clock"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (appointment:`hospital_1.Appointment`)\nRETURN count(*)",
        "question": "Count how many appointments have been made in total.",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Nurse`)-[T2:`hospital_1.On_Call`]-()\nRETURN DISTINCT T1.Name",
        "question": "Find the names of nurses who are on call.",
        "answers": [
            [
                "Carla Espinosa"
            ],
            [
                "Laverne Roberts"
            ],
            [
                "Paul Flowers"
            ]
        ]
    }
]