[
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Course_Authors_and_Tutors`)-[]-(T2:`e_learning.Courses`)\nWHERE T2.course_name = \"advanced database\"\nRETURN T1.login_name",
        "question": "Find the login name of the course author that teaches the course with name \"advanced database\".",
        "answers": [
            [
                "al75"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Course_Authors_and_Tutors`)-[]-(T2:`e_learning.Courses`)\nWHERE T2.course_name = \"advanced database\"\nRETURN T1.login_name",
        "question": "Which course author teaches the \"advanced database\" course? Give me his or her login name.",
        "answers": [
            [
                "al75"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Course_Authors_and_Tutors`)-[]-(T2:`e_learning.Courses`)\nWHERE T2.course_name = \"operating system\" OR T2.course_name = \"data structure\"\nRETURN T1.address_line_1",
        "question": "Find the addresses of the course authors who teach the course with name \"operating system\" or \"data structure\".",
        "answers": [
            [
                "8928 Kunze Valley Apt. 747\nSouth Jedidiahmouth, DE 28167"
            ],
            [
                "425 White Brooks\nEmmaleefort, IN 97850-2510"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Course_Authors_and_Tutors`)-[]-(T2:`e_learning.Courses`)\nWHERE T2.course_name = \"operating system\" OR T2.course_name = \"data structure\"\nRETURN T1.address_line_1",
        "question": "What are the addresses of the course authors who teach either \"operating system\" or \"data structure\" course.",
        "answers": [
            [
                "8928 Kunze Valley Apt. 747\nSouth Jedidiahmouth, DE 28167"
            ],
            [
                "425 White Brooks\nEmmaleefort, IN 97850-2510"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Course_Authors_and_Tutors`)-[]-(T2:`e_learning.Courses`)\nWITH T2.author_id AS author_id, count(*) AS count, T1.address_line_1 AS address_line_1\nWHERE count  >= 2\nRETURN address_line_1,author_id",
        "question": "Find the addresses and author IDs of the course authors that teach at least two courses.",
        "answers": [
            [
                "5284 Champlin Roads\nCassinport, WY 54636",
                5
            ],
            [
                "92220 Hellen Skyway Apt. 635\nRennerview, MS 81036",
                6
            ],
            [
                "0256 Walter Meadows Suite 523\nNorbertoborough, AZ 49193",
                8
            ],
            [
                "139 O'Conner Circles\nVirginieland, KS 23365",
                13
            ],
            [
                "3602 Boehm Forest\nZulaufton, DC 35229-0366",
                14
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Courses`)-[]-(T2:`e_learning.Subjects`)\nWHERE T2.subject_name = \"Computer Science\"\nRETURN T1.course_name,T1.course_description",
        "question": "Find the names and descriptions of courses that belong to the subject named \"Computer Science\".",
        "answers": [
            [
                "AI",
                "AI"
            ],
            [
                "operating system",
                "operating system"
            ],
            [
                "machine learning",
                "machine learning"
            ],
            [
                "database",
                "database"
            ],
            [
                "data structure",
                "data structure"
            ],
            [
                "advanced database",
                "advanced database"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Courses`)-[]-(T2:`e_learning.Subjects`)\nWHERE T2.subject_name = \"Computer Science\"\nRETURN T1.course_name,T1.course_description",
        "question": "What are the names and descriptions of the all courses under the \"Computer Science\" subject?",
        "answers": [
            [
                "AI",
                "AI"
            ],
            [
                "operating system",
                "operating system"
            ],
            [
                "machine learning",
                "machine learning"
            ],
            [
                "database",
                "database"
            ],
            [
                "data structure",
                "data structure"
            ],
            [
                "advanced database",
                "advanced database"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Courses`)-[]-(T2:`e_learning.Subjects`)\nRETURN T1.subject_id,T2.subject_name,count(*)",
        "question": "Find the subject ID, subject name, and the corresponding number of available courses for each subject.",
        "answers": [
            [
                1,
                "Computer Science",
                6
            ],
            [
                2,
                "Arts",
                4
            ],
            [
                3,
                "Language",
                5
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Courses`)-[]-(T2:`e_learning.Subjects`)\nRETURN T1.subject_id,T2.subject_name,count(*)",
        "question": "What are the subject ID, subject name, and the number of available courses for each subject?",
        "answers": [
            [
                1,
                "Computer Science",
                6
            ],
            [
                2,
                "Arts",
                4
            ],
            [
                3,
                "Language",
                5
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Courses`)-[]-(T2:`e_learning.Student_Course_Enrolment`)\nWITH count(T1.course_name) AS cnt, T1\nRETURN T1.course_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the name of the course that has the most student enrollment?",
        "answers": [
            [
                "French"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Courses`)-[]-(T2:`e_learning.Student_Course_Enrolment`)\nWITH count(T1.course_name) AS cnt, T1\nRETURN T1.course_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Which course is enrolled in by the most students? Give me the course name.",
        "answers": [
            [
                "French"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Courses`)-[]-(T2:`e_learning.Student_Course_Enrolment`)\nWITH count(*) AS count, T1.course_name AS course_name\nWHERE count  = 1\nRETURN course_name",
        "question": "What are the names of the courses that have exactly 1 student enrollment?",
        "answers": [
            [
                "Chinese Painting"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Courses`)-[]-(T2:`e_learning.Student_Course_Enrolment`)\nWITH count(*) AS count, T1.course_name AS course_name\nWHERE count  = 1\nRETURN course_name",
        "question": "Find the names of the courses that have just one student enrollment.",
        "answers": [
            [
                "Chinese Painting"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Courses`)-[]-(T2:`e_learning.Student_Course_Enrolment`)\nWITH count(*) AS count, T1.course_name AS course_name, T1.course_description AS course_description\nWHERE count  > 2\nRETURN course_description,course_name",
        "question": "What are the descriptions and names of the courses that have student enrollment bigger than 2?",
        "answers": [
            [
                "French",
                "French"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Courses`)-[]-(T2:`e_learning.Student_Course_Enrolment`)\nRETURN T1.course_name,count(*)",
        "question": "What is the name of each course and the corresponding number of student enrollment?",
        "answers": [
            [
                "database",
                2
            ],
            [
                "advanced database",
                2
            ],
            [
                "Art history",
                2
            ],
            [
                "French",
                3
            ],
            [
                "Japanese",
                2
            ],
            [
                "AI",
                2
            ],
            [
                "Writing in French",
                2
            ],
            [
                "Spanish",
                2
            ],
            [
                "modern Arts",
                2
            ],
            [
                "Chinese Painting",
                1
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Courses`)-[]-(T2:`e_learning.Student_Course_Enrolment`)\nRETURN T1.course_name,count(*)",
        "question": "List the name and the number of enrolled student for each course.",
        "answers": [
            [
                "database",
                2
            ],
            [
                "advanced database",
                2
            ],
            [
                "Art history",
                2
            ],
            [
                "French",
                3
            ],
            [
                "Japanese",
                2
            ],
            [
                "AI",
                2
            ],
            [
                "Writing in French",
                2
            ],
            [
                "Spanish",
                2
            ],
            [
                "modern Arts",
                2
            ],
            [
                "Chinese Painting",
                1
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Student_Course_Enrolment`)-[]-(T2:`e_learning.Students`)\nWITH T1.student_id AS student_id, count(*) AS count, T2.personal_name AS personal_name\nWHERE count  >= 2\nRETURN student_id,personal_name",
        "question": "Find the student ID and personal name of the student with at least two enrollments.",
        "answers": [
            [
                8,
                "Marshall"
            ],
            [
                10,
                "Alicia"
            ],
            [
                14,
                "Cary"
            ],
            [
                15,
                "Eliza"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Student_Course_Enrolment`)-[]-(T2:`e_learning.Students`)\nWITH T2.middle_name AS middle_name, T1.student_id AS student_id, count(*) AS count\nWHERE count  <= 2\nRETURN student_id,middle_name",
        "question": "Find the student ID and middle name for all the students with at most two enrollments.",
        "answers": [
            [
                2,
                "Luella"
            ],
            [
                3,
                "Brandt"
            ],
            [
                4,
                "Casimir"
            ],
            [
                6,
                "Asa"
            ],
            [
                9,
                "Kailey"
            ],
            [
                10,
                "Vicente"
            ],
            [
                11,
                "Kolby"
            ],
            [
                12,
                "Karley"
            ],
            [
                13,
                "Camilla"
            ],
            [
                14,
                "Ursula"
            ]
        ]
    },
    {
        "db_id": "e_learning",
        "query": "MATCH (T1:`e_learning.Student_Course_Enrolment`)-[]-(T2:`e_learning.Students`)\nWITH T2.middle_name AS middle_name, T1.student_id AS student_id, count(*) AS count\nWHERE count  <= 2\nRETURN student_id,middle_name",
        "question": "What are the student IDs and middle names of the students enrolled in at most two courses?",
        "answers": [
            [
                2,
                "Luella"
            ],
            [
                3,
                "Brandt"
            ],
            [
                4,
                "Casimir"
            ],
            [
                6,
                "Asa"
            ],
            [
                9,
                "Kailey"
            ],
            [
                10,
                "Vicente"
            ],
            [
                11,
                "Kolby"
            ],
            [
                12,
                "Karley"
            ],
            [
                13,
                "Camilla"
            ],
            [
                14,
                "Ursula"
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (payments:`insurance_policies.Payments`)\nRETURN payments.Payment_Method_Code,payments.Date_Payment_Made,payments.Amount_Payment\nORDER BY payments.Date_Payment_Made ASC",
        "question": "List the method, date and amount of all the payments, in ascending order of date.",
        "answers": [
            [
                "Visa",
                "2017-05-03",
                172309
            ],
            [
                "Discover Card",
                "2017-05-04",
                123255
            ],
            [
                "MasterCard",
                "2017-05-28",
                448613
            ],
            [
                "Visa",
                "2017-05-28",
                155654
            ],
            [
                "MasterCard",
                "2017-06-24",
                456098
            ],
            [
                "MasterCard",
                "2017-07-31",
                423154
            ],
            [
                "Discover Card",
                "2017-08-06",
                38324
            ],
            [
                "Discover Card",
                "2017-10-07",
                71246
            ],
            [
                "Visa",
                "2017-12-16",
                459407
            ],
            [
                "MasterCard",
                "2018-01-10",
                407235
            ],
            [
                "American Express",
                "2018-01-19",
                177130
            ],
            [
                "MasterCard",
                "2018-01-28",
                319142
            ],
            [
                "MasterCard",
                "2018-02-16",
                241730
            ],
            [
                "MasterCard",
                "2018-02-18",
                235893
            ],
            [
                "Visa",
                "2018-02-24",
                7343
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (payments:`insurance_policies.Payments`)\nRETURN payments.Payment_Method_Code,payments.Date_Payment_Made,payments.Amount_Payment\nORDER BY payments.Date_Payment_Made ASC",
        "question": "What are the method, date and amount of each payment? Sort the list in ascending order of date.",
        "answers": [
            [
                "Visa",
                "2017-05-03",
                172309
            ],
            [
                "Discover Card",
                "2017-05-04",
                123255
            ],
            [
                "MasterCard",
                "2017-05-28",
                448613
            ],
            [
                "Visa",
                "2017-05-28",
                155654
            ],
            [
                "MasterCard",
                "2017-06-24",
                456098
            ],
            [
                "MasterCard",
                "2017-07-31",
                423154
            ],
            [
                "Discover Card",
                "2017-08-06",
                38324
            ],
            [
                "Discover Card",
                "2017-10-07",
                71246
            ],
            [
                "Visa",
                "2017-12-16",
                459407
            ],
            [
                "MasterCard",
                "2018-01-10",
                407235
            ],
            [
                "American Express",
                "2018-01-19",
                177130
            ],
            [
                "MasterCard",
                "2018-01-28",
                319142
            ],
            [
                "MasterCard",
                "2018-02-16",
                241730
            ],
            [
                "MasterCard",
                "2018-02-18",
                235893
            ],
            [
                "Visa",
                "2018-02-24",
                7343
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (claims:`insurance_policies.Claims`)\nRETURN claims.Amount_Settled,claims.Amount_Claimed\nORDER BY claims.Amount_Claimed DESC\nLIMIT 1",
        "question": "Among all the claims, what is the settlement amount of the claim with the largest claim amount? List both the settlement amount and claim amount.",
        "answers": [
            [
                1528,
                89632
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (claims:`insurance_policies.Claims`)\nRETURN claims.Amount_Settled,claims.Amount_Claimed\nORDER BY claims.Amount_Claimed DESC\nLIMIT 1",
        "question": "Find the settlement amount of the claim with the largest claim amount. Show both the settlement amount and claim amount.",
        "answers": [
            [
                1528,
                89632
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (claims:`insurance_policies.Claims`)\nRETURN claims.Amount_Settled,claims.Amount_Claimed\nORDER BY claims.Amount_Settled ASC\nLIMIT 1",
        "question": "Among all the claims, what is the amount claimed in the claim with the least amount settled? List both the settlement amount and claim amount.",
        "answers": [
            [
                930,
                49743
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (claims:`insurance_policies.Claims`)\nRETURN claims.Amount_Settled,claims.Amount_Claimed\nORDER BY claims.Amount_Settled ASC\nLIMIT 1",
        "question": "Find the claimed amount in the claim with the least amount settled. Show both the settlement amount and claim amount.",
        "answers": [
            [
                930,
                49743
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (claims:`insurance_policies.Claims`)\nWITH avg(claims.Amount_Claimed) AS amount_claimed\nMATCH (claims:`insurance_policies.Claims`)\nWHERE  claims.Amount_Claimed >  amount_claimed \nRETURN claims.Date_Claim_Made,claims.Date_Claim_Settled",
        "question": "Among all the claims, which claims have a claimed amount larger than the average? List the date the claim was made and the date it was settled.",
        "answers": [
            [
                "2016-08-12",
                "2018-01-27"
            ],
            [
                "2017-02-24",
                "2018-01-21"
            ],
            [
                "2018-06-14",
                "2017-12-20"
            ],
            [
                "2017-08-03",
                "2018-02-18"
            ],
            [
                "2016-08-26",
                "2017-09-04"
            ],
            [
                "2018-07-13",
                "2017-11-22"
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (claims:`insurance_policies.Claims`)\nWITH avg(claims.Amount_Claimed) AS amount_claimed\nMATCH (claims:`insurance_policies.Claims`)\nWHERE  claims.Amount_Claimed >  amount_claimed \nRETURN claims.Date_Claim_Made,claims.Date_Claim_Settled",
        "question": "Give me the claim date, settlement date for all the claims whose claimed amount is larger than the average.",
        "answers": [
            [
                "2016-08-12",
                "2018-01-27"
            ],
            [
                "2017-02-24",
                "2018-01-21"
            ],
            [
                "2018-06-14",
                "2017-12-20"
            ],
            [
                "2017-08-03",
                "2018-02-18"
            ],
            [
                "2016-08-26",
                "2017-09-04"
            ],
            [
                "2018-07-13",
                "2017-11-22"
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (T1:`insurance_policies.Claims`)-[]-(T2:`insurance_policies.Settlements`)\nRETURN T1.Claim_ID,count(*)",
        "question": "How many settlements does each claim correspond to? List the claim id and the number of settlements.",
        "answers": [
            [
                486,
                2
            ],
            [
                563,
                1
            ],
            [
                569,
                1
            ],
            [
                571,
                1
            ],
            [
                621,
                2
            ],
            [
                761,
                2
            ],
            [
                801,
                4
            ],
            [
                843,
                1
            ],
            [
                957,
                1
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (T1:`insurance_policies.Claims`)-[]-(T2:`insurance_policies.Settlements`)\nRETURN T1.Claim_ID,count(*)",
        "question": "Find the number of settlements each claim corresponds to. Show the number together with the claim id.",
        "answers": [
            [
                486,
                2
            ],
            [
                563,
                1
            ],
            [
                569,
                1
            ],
            [
                571,
                1
            ],
            [
                621,
                2
            ],
            [
                761,
                2
            ],
            [
                801,
                4
            ],
            [
                843,
                1
            ],
            [
                957,
                1
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (claims:`insurance_policies.Claims`)\nRETURN claims.Date_Claim_Made\nORDER BY claims.Date_Claim_Made ASC\nLIMIT 1",
        "question": "Of all the claims, what was the earliest date when any claim was made?",
        "answers": [
            [
                "2016-08-02"
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (claims:`insurance_policies.Claims`)\nRETURN claims.Date_Claim_Made\nORDER BY claims.Date_Claim_Made ASC\nLIMIT 1",
        "question": "Tell me the the date when the first claim was made.",
        "answers": [
            [
                "2016-08-02"
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (T1:`insurance_policies.Customers`)-[]-(T2:`insurance_policies.Customer_Policies`)\nWITH T1.Customer_ID AS Customer_ID, count(*) AS count, T1.Customer_Details AS Customer_Details\nWHERE count  > 1\nRETURN Customer_Details,Customer_ID",
        "question": "Who are the customers that had more than 1 policy? List the customer details and id.",
        "answers": [
            [
                "Ellsworth Paucek",
                2
            ],
            [
                "Mrs. Hanna Willms",
                3
            ],
            [
                "Dr. Diana Rath",
                4
            ],
            [
                "Lauriane Ferry PhD",
                6
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (settlements:`insurance_policies.Settlements`)\nRETURN settlements.Date_Claim_Made,settlements.Date_Claim_Settled",
        "question": "What are the claim dates and settlement dates of all the settlements?",
        "answers": [
            [
                "2018-08-07",
                "2018-01-16"
            ],
            [
                "2017-08-27",
                "2018-02-04"
            ],
            [
                "2016-09-05",
                "2018-03-02"
            ],
            [
                "2016-05-18",
                "2018-02-11"
            ],
            [
                "2017-05-19",
                "2017-10-06"
            ],
            [
                "2018-11-10",
                "2018-02-15"
            ],
            [
                "2018-05-12",
                "2017-11-30"
            ],
            [
                "2016-07-04",
                "2018-02-20"
            ],
            [
                "2017-04-18",
                "2017-12-24"
            ],
            [
                "2017-07-31",
                "2018-01-27"
            ],
            [
                "2017-09-22",
                "2018-02-14"
            ],
            [
                "2017-03-04",
                "2018-02-20"
            ],
            [
                "2017-04-14",
                "2017-11-15"
            ],
            [
                "2017-03-29",
                "2018-02-20"
            ],
            [
                "2016-07-19",
                "2017-11-04"
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (settlements:`insurance_policies.Settlements`)\nRETURN settlements.Date_Claim_Made,settlements.Date_Claim_Settled",
        "question": "Tell me the the claim date and settlement date for each settlement case.",
        "answers": [
            [
                "2018-08-07",
                "2018-01-16"
            ],
            [
                "2017-08-27",
                "2018-02-04"
            ],
            [
                "2016-09-05",
                "2018-03-02"
            ],
            [
                "2016-05-18",
                "2018-02-11"
            ],
            [
                "2017-05-19",
                "2017-10-06"
            ],
            [
                "2018-11-10",
                "2018-02-15"
            ],
            [
                "2018-05-12",
                "2017-11-30"
            ],
            [
                "2016-07-04",
                "2018-02-20"
            ],
            [
                "2017-04-18",
                "2017-12-24"
            ],
            [
                "2017-07-31",
                "2018-01-27"
            ],
            [
                "2017-09-22",
                "2018-02-14"
            ],
            [
                "2017-03-04",
                "2018-02-20"
            ],
            [
                "2017-04-14",
                "2017-11-15"
            ],
            [
                "2017-03-29",
                "2018-02-20"
            ],
            [
                "2016-07-19",
                "2017-11-04"
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (payments:`insurance_policies.Payments`)\nRETURN payments.Payment_Method_Code\nORDER BY payments.Payment_Method_Code ASC\nLIMIT 1",
        "question": "With which kind of payment method were the least number of payments processed?",
        "answers": [
            [
                "American Express"
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (payments:`insurance_policies.Payments`)\nRETURN payments.Payment_Method_Code\nORDER BY payments.Payment_Method_Code ASC\nLIMIT 1",
        "question": "What is the payment method that were used the least often?",
        "answers": [
            [
                "American Express"
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (customers:`insurance_policies.Customers`)\nRETURN DISTINCT customers.Customer_Details",
        "question": "What are all the distinct details of the customers?",
        "answers": [
            [
                "America Jaskolski"
            ],
            [
                "Ellsworth Paucek"
            ],
            [
                "Mrs. Hanna Willms"
            ],
            [
                "Dr. Diana Rath"
            ],
            [
                "Selena Gerhold"
            ],
            [
                "Lauriane Ferry PhD"
            ],
            [
                "Sydnie Friesen"
            ],
            [
                "Dayana Robel"
            ],
            [
                "Mr. Edwardo Blanda I"
            ],
            [
                "Augustine Kerluke"
            ],
            [
                "Buddy Marquardt"
            ],
            [
                "Mr. Randal Lynch III"
            ],
            [
                "Mrs. Liza Heller V"
            ],
            [
                "Mrs. Lilly Graham III"
            ],
            [
                "Miss Felicita Reichel"
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (customers:`insurance_policies.Customers`)\nRETURN DISTINCT customers.Customer_Details",
        "question": "Return the distinct customer details.",
        "answers": [
            [
                "America Jaskolski"
            ],
            [
                "Ellsworth Paucek"
            ],
            [
                "Mrs. Hanna Willms"
            ],
            [
                "Dr. Diana Rath"
            ],
            [
                "Selena Gerhold"
            ],
            [
                "Lauriane Ferry PhD"
            ],
            [
                "Sydnie Friesen"
            ],
            [
                "Dayana Robel"
            ],
            [
                "Mr. Edwardo Blanda I"
            ],
            [
                "Augustine Kerluke"
            ],
            [
                "Buddy Marquardt"
            ],
            [
                "Mr. Randal Lynch III"
            ],
            [
                "Mrs. Liza Heller V"
            ],
            [
                "Mrs. Lilly Graham III"
            ],
            [
                "Miss Felicita Reichel"
            ]
        ]
    },
    {
        "db_id": "insurance_policies",
        "query": "MATCH (customer_policies:`insurance_policies.Customer_Policies`)\nRETURN customer_policies.Policy_Type_Code\nORDER BY customer_policies.Policy_Type_Code DESC\nLIMIT 1",
        "question": "Which kind of policy type was chosen by the most customers?",
        "answers": [
            [
                "Travel"
            ]
        ]
    }
]