[
    {
        "db_id": "customer_deliveries",
        "query": "MATCH (t2:`customer_deliveries.Addresses`)-[t1:`customer_deliveries.Customer_Addresses`]-()\nRETURN t2.state_province_county,count(*)",
        "question": "List the state names and the number of customers living in each state.",
        "answers": [
            [
                "Nebraska",
                1
            ],
            [
                "Colorado",
                2
            ],
            [
                "Idaho",
                1
            ],
            [
                "California",
                2
            ],
            [
                "Tennessee",
                4
            ],
            [
                "Maine",
                1
            ],
            [
                "Wyoming",
                1
            ],
            [
                "Illinois",
                1
            ],
            [
                "Michigan",
                2
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (authors:`icfp_1.Authors`)\nRETURN count(*)",
        "question": "Count the number of authors.",
        "answers": [
            [
                13
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (inst:`icfp_1.Inst`)\nRETURN count(*)",
        "question": "Count the number of institutions.",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (papers:`icfp_1.Papers`)\nRETURN count(*)",
        "question": "Count the number of total papers.",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t1.fname = 'Jeremy' AND t1.lname = 'Gibbons'\nRETURN t3.title",
        "question": "What are the titles of papers published by \"Jeremy Gibbons\"?",
        "answers": [
            [
                "Just do it: Simple Monadic Equational Reasoning"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t1.fname = 'Jeremy' AND t1.lname = 'Gibbons'\nRETURN t3.title",
        "question": "Find the titles of all the papers written by \"Jeremy Gibbons\"",
        "answers": [
            [
                "Just do it: Simple Monadic Equational Reasoning"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t1.fname = 'Aaron' AND t1.lname = 'Turon'\nRETURN t3.title",
        "question": "Find all the papers published by \"Aaron Turon\".",
        "answers": [
            [
                "Functional Pearl: Modular Rollback through Control Logging"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t1.fname = 'Aaron' AND t1.lname = 'Turon'\nRETURN t3.title",
        "question": "Find the titles of all the papers written by \"Aaron Turon\".",
        "answers": [
            [
                "Functional Pearl: Modular Rollback through Control Logging"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t1.fname = 'Atsushi' AND t1.lname = 'Ohori'\nRETURN count(*)",
        "question": "How many papers have \"Atsushi Ohori\" published?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t1.fname = 'Atsushi' AND t1.lname = 'Ohori'\nRETURN count(*)",
        "question": "How many papers are \"Atsushi Ohori\" the author of?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t1.fname = 'Matthias' AND t1.lname = 'Blume'\nRETURN DISTINCT t3.name",
        "question": "What is the name of the institution that \"Matthias Blume\" belongs to?",
        "answers": [
            [
                "Google"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t1.fname = 'Matthias' AND t1.lname = 'Blume'\nRETURN DISTINCT t3.name",
        "question": "Which institution is the author \"Matthias Blume\" belong to? Give me the name of the institution.",
        "answers": [
            [
                "Google"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t1.fname = 'Katsuhiro' AND t1.lname = 'Ueno'\nRETURN DISTINCT t3.name",
        "question": "Which institution does \"Katsuhiro Ueno\" belong to?",
        "answers": [
            [
                "Tohoku University"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t1.fname = 'Katsuhiro' AND t1.lname = 'Ueno'\nRETURN DISTINCT t3.name",
        "question": "What is the name of the institution the author \"Katsuhiro Ueno\" belongs to?",
        "answers": [
            [
                "Tohoku University"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t3.name = 'University of Oxford'\nRETURN DISTINCT t1.fname,t1.lname",
        "question": "Who belong to the institution \"University of Oxford\"? Show the first names and last names.",
        "answers": [
            [
                "Jeremy",
                "Gibbons"
            ],
            [
                "Ralf",
                "Hinze"
            ],
            [
                "Daniel W. H.",
                "James"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t3.name = 'University of Oxford'\nRETURN DISTINCT t1.fname,t1.lname",
        "question": "Find the first names and last names of the authors whose institution affiliation is \"University of Oxford\".",
        "answers": [
            [
                "Jeremy",
                "Gibbons"
            ],
            [
                "Ralf",
                "Hinze"
            ],
            [
                "Daniel W. H.",
                "James"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t3.name = 'Google'\nRETURN DISTINCT t1.fname,t1.lname",
        "question": "Which authors belong to the institution \"Google\"? Show the first names and last names.",
        "answers": [
            [
                "Matthias",
                "Blume"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t3.name = 'Google'\nRETURN DISTINCT t1.fname,t1.lname",
        "question": "Find the first names and last names of the authors whose institution affiliation is \"Google\".",
        "answers": [
            [
                "Matthias",
                "Blume"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t3.title = 'Binders Unbound'\nRETURN t1.lname",
        "question": "What are the last names of the author of the paper titled \"Binders Unbound\"?",
        "answers": [
            [
                "Yorgey"
            ],
            [
                "Weirich"
            ],
            [
                "Sheard"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t3.title = 'Binders Unbound'\nRETURN t1.lname",
        "question": "Who is the author of the paper titled \"Binders Unbound\"? Give me the last name.",
        "answers": [
            [
                "Yorgey"
            ],
            [
                "Weirich"
            ],
            [
                "Sheard"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t3.title = 'Nameless ,  Painless'\nRETURN t1.fname,t1.lname",
        "question": "Find the first and last name of the author(s) who wrote the paper \"Nameless, Painless\".",
        "answers": []
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t3.title = 'Nameless ,  Painless'\nRETURN t1.fname,t1.lname",
        "question": "What are the first and last name of the author who published the paper titled \"Nameless, Painless\"?",
        "answers": []
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Papers`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t3.name = 'Indiana University'\nRETURN DISTINCT t1.title",
        "question": "What are the papers published under the institution \"Indiana University\"?",
        "answers": [
            [
                "An Equivalence-Preserving CPS Translation via Multi-Language Semantics"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Papers`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t3.name = 'Indiana University'\nRETURN DISTINCT t1.title",
        "question": "List the titles of the papers whose authors are from the institution \"Indiana University\".",
        "answers": [
            [
                "An Equivalence-Preserving CPS Translation via Multi-Language Semantics"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Papers`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t3.name = 'Google'\nRETURN DISTINCT t1.title",
        "question": "Find all the papers published by the institution \"Google\".",
        "answers": [
            [
                "An Equivalence-Preserving CPS Translation via Multi-Language Semantics"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Papers`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t3.name = 'Google'\nRETURN DISTINCT t1.title",
        "question": "Which papers were written by authors from the institution \"Google\"?",
        "answers": [
            [
                "An Equivalence-Preserving CPS Translation via Multi-Language Semantics"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Papers`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t3.name = 'Tokohu University'\nRETURN count(DISTINCT t1.title)",
        "question": "How many papers are published by the institution \"Tokohu University\"?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Papers`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t3.name = 'Tokohu University'\nRETURN count(DISTINCT t1.title)",
        "question": "Find the number of papers published by authors from the institution \"Tokohu University\".",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Papers`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t3.name = 'University of Pennsylvania'\nRETURN count(DISTINCT t1.title)",
        "question": "Find the number of papers published by the institution \"University of Pennsylvania\".",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Papers`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Inst`)\nWHERE t3.name = 'University of Pennsylvania'\nRETURN count(DISTINCT t1.title)",
        "question": "How many papers are written by authors from the institution \"University of Pennsylvania\"?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t1.fname = 'Olin' AND t1.lname = 'Shivers'\nRETURN t3.title",
        "question": "Find the papers which have \"Olin Shivers\" as an author.",
        "answers": [
            [
                "Functional Pearl: Modular Rollback through Control Logging"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t1.fname = 'Olin' AND t1.lname = 'Shivers'\nRETURN t3.title",
        "question": "Which papers did the author \"Olin Shivers\" write? Give me the paper titles.",
        "answers": [
            [
                "Functional Pearl: Modular Rollback through Control Logging"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t1.fname = 'Stephanie' AND t1.lname = 'Weirich'\nRETURN t3.title",
        "question": "Which papers have \"Stephanie Weirich\" as an author?",
        "answers": [
            [
                "Binders Unbound"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Authors`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWHERE t1.fname = 'Stephanie' AND t1.lname = 'Weirich'\nRETURN t3.title",
        "question": "Find the titles of the papers the author \"Stephanie Weirich\" wrote.",
        "answers": [
            [
                "Binders Unbound"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Inst`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWITH t1, count(t1.name) AS cnt\nRETURN t1.name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Find the name of the organization that has published the largest number of papers.",
        "answers": [
            [
                "University of Oxford"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (t1:`icfp_1.Inst`)-[]-(t2:`icfp_1.Authorship`)-[]-(t3:`icfp_1.Papers`)\nWITH t1, count(t1.name) AS cnt\nRETURN t1.name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Which institution has the most papers? Find the name of the institution.",
        "answers": [
            [
                "University of Oxford"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (authors:`icfp_1.Authors`)\nWHERE authors.lname = 'Ueno'\nRETURN authors.fname",
        "question": "What is the first name of the author with last name \"Ueno\"?",
        "answers": [
            [
                "Katsuhiro"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (authors:`icfp_1.Authors`)\nWHERE authors.lname = 'Ueno'\nRETURN authors.fname",
        "question": "Which authors have last name \"Ueno\"? List their first names.",
        "answers": [
            [
                "Katsuhiro"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (authors:`icfp_1.Authors`)\nWHERE authors.fname = 'Amal'\nRETURN authors.lname",
        "question": "Find the last name of the author with first name \"Amal\".",
        "answers": [
            [
                "Ahmed"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (authors:`icfp_1.Authors`)\nWHERE authors.fname = 'Amal'\nRETURN authors.lname",
        "question": "Which authors have first name \"Amal\"? List their last names.",
        "answers": [
            [
                "Ahmed"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (authors:`icfp_1.Authors`)\nRETURN authors.fname\nORDER BY authors.fname",
        "question": "Find the first names of all the authors ordered in alphabetical order.",
        "answers": [
            [
                "Aaron"
            ],
            [
                "Amal"
            ],
            [
                "Atsushi"
            ],
            [
                "Brent"
            ],
            [
                "Daniel W. H."
            ],
            [
                "Jeremy"
            ],
            [
                "Katsuhiro"
            ],
            [
                "Matthias"
            ],
            [
                "Nicolas"
            ],
            [
                "Olin"
            ],
            [
                "Ralf"
            ],
            [
                "Stephanie"
            ],
            [
                "Tim"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (authors:`icfp_1.Authors`)\nRETURN authors.fname\nORDER BY authors.fname",
        "question": "Sort the first names of all the authors in alphabetical order.",
        "answers": [
            [
                "Aaron"
            ],
            [
                "Amal"
            ],
            [
                "Atsushi"
            ],
            [
                "Brent"
            ],
            [
                "Daniel W. H."
            ],
            [
                "Jeremy"
            ],
            [
                "Katsuhiro"
            ],
            [
                "Matthias"
            ],
            [
                "Nicolas"
            ],
            [
                "Olin"
            ],
            [
                "Ralf"
            ],
            [
                "Stephanie"
            ],
            [
                "Tim"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (authors:`icfp_1.Authors`)\nRETURN authors.lname\nORDER BY authors.lname",
        "question": "Retrieve all the last names of authors in alphabetical order.",
        "answers": [
            [
                "Ahmed"
            ],
            [
                "Blume"
            ],
            [
                "Gibbons"
            ],
            [
                "Hinze"
            ],
            [
                "James"
            ],
            [
                "Ohori"
            ],
            [
                "Pouillard"
            ],
            [
                "Sheard"
            ],
            [
                "Shivers"
            ],
            [
                "Turon"
            ],
            [
                "Ueno"
            ],
            [
                "Weirich"
            ],
            [
                "Yorgey"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (authors:`icfp_1.Authors`)\nRETURN authors.lname\nORDER BY authors.lname",
        "question": "Give me a list of all the last names of authors sorted in alphabetical order",
        "answers": [
            [
                "Ahmed"
            ],
            [
                "Blume"
            ],
            [
                "Gibbons"
            ],
            [
                "Hinze"
            ],
            [
                "James"
            ],
            [
                "Ohori"
            ],
            [
                "Pouillard"
            ],
            [
                "Sheard"
            ],
            [
                "Shivers"
            ],
            [
                "Turon"
            ],
            [
                "Ueno"
            ],
            [
                "Weirich"
            ],
            [
                "Yorgey"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (authors:`icfp_1.Authors`)\nRETURN authors.fname,authors.lname\nORDER BY authors.lname",
        "question": "Retrieve all the first and last names of authors in the alphabetical order of last names.",
        "answers": [
            [
                "Amal",
                "Ahmed"
            ],
            [
                "Matthias",
                "Blume"
            ],
            [
                "Jeremy",
                "Gibbons"
            ],
            [
                "Ralf",
                "Hinze"
            ],
            [
                "Daniel W. H.",
                "James"
            ],
            [
                "Atsushi",
                "Ohori"
            ],
            [
                "Nicolas",
                "Pouillard"
            ],
            [
                "Tim",
                "Sheard"
            ],
            [
                "Olin",
                "Shivers"
            ],
            [
                "Aaron",
                "Turon"
            ],
            [
                "Katsuhiro",
                "Ueno"
            ],
            [
                "Stephanie",
                "Weirich"
            ],
            [
                "Brent",
                "Yorgey"
            ]
        ]
    },
    {
        "db_id": "icfp_1",
        "query": "MATCH (authors:`icfp_1.Authors`)\nRETURN authors.fname,authors.lname\nORDER BY authors.lname",
        "question": "Sort the list of all the first and last names of authors in alphabetical order of the last names.",
        "answers": [
            [
                "Amal",
                "Ahmed"
            ],
            [
                "Matthias",
                "Blume"
            ],
            [
                "Jeremy",
                "Gibbons"
            ],
            [
                "Ralf",
                "Hinze"
            ],
            [
                "Daniel W. H.",
                "James"
            ],
            [
                "Atsushi",
                "Ohori"
            ],
            [
                "Nicolas",
                "Pouillard"
            ],
            [
                "Tim",
                "Sheard"
            ],
            [
                "Olin",
                "Shivers"
            ],
            [
                "Aaron",
                "Turon"
            ],
            [
                "Katsuhiro",
                "Ueno"
            ],
            [
                "Stephanie",
                "Weirich"
            ],
            [
                "Brent",
                "Yorgey"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN count(*)",
        "question": "How many bank branches are there?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN count(*)",
        "question": "Count the number of bank branches.",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nWHERE bank.state = 'Utah'\nRETURN avg(bank.no_of_customers)",
        "question": "Find the average number of customers in all banks of Utah state.",
        "answers": [
            [
                123.0
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nWHERE bank.state = 'Utah'\nRETURN avg(bank.no_of_customers)",
        "question": "What is the average number of customers across banks in the state of Utah?",
        "answers": [
            [
                123.0
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN avg(bank.no_of_customers)",
        "question": "Find the average number of customers cross all banks.",
        "answers": [
            [
                286.5
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN avg(bank.no_of_customers)",
        "question": "What is the average number of bank customers?",
        "answers": [
            [
                286.5
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nWHERE bank.bname = 'morningside'\nRETURN bank.city,bank.state",
        "question": "Find the city and state of the bank branch named morningside.",
        "answers": [
            [
                "New York City",
                "New York"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nWHERE bank.bname = 'morningside'\nRETURN bank.city,bank.state",
        "question": "What city and state is the bank with the name morningside in?",
        "answers": [
            [
                "New York City",
                "New York"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nWHERE bank.state = 'New York'\nRETURN bank.bname",
        "question": "Find the branch names of banks in the New York state.",
        "answers": [
            [
                "morningside"
            ],
            [
                "broadway"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nWHERE bank.state = 'New York'\nRETURN bank.bname",
        "question": "What are the names of banks in the state of New York?",
        "answers": [
            [
                "morningside"
            ],
            [
                "broadway"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nRETURN customer.cust_name\nORDER BY customer.acc_bal",
        "question": "List the name of all customers sorted by their account balance in ascending order.",
        "answers": [
            [
                "Jack"
            ],
            [
                "Mary"
            ],
            [
                "Owen"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nRETURN customer.cust_name\nORDER BY customer.acc_bal",
        "question": "What are the names of all customers, ordered by account balance?",
        "answers": [
            [
                "Jack"
            ],
            [
                "Mary"
            ],
            [
                "Owen"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nWHERE customer.no_of_loans = 0\nRETURN customer.state,customer.acc_type,customer.credit_score",
        "question": "Find the state, account type, and credit score of the customer whose number of loan is 0.",
        "answers": [
            [
                "New York",
                "saving",
                210
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nWHERE customer.no_of_loans = 0\nRETURN customer.state,customer.acc_type,customer.credit_score",
        "question": "What are the states, account types, and credit scores for customers who have 0 loans?",
        "answers": [
            [
                "New York",
                "saving",
                210
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN count(DISTINCT bank.city)",
        "question": "Find the number of different cities which banks are located at.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN count(DISTINCT bank.city)",
        "question": "In how many different cities are banks located?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN count(DISTINCT bank.state)",
        "question": "Find the number of different states which banks are located at.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN count(DISTINCT bank.state)",
        "question": "In how many different states are banks located?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nRETURN count(DISTINCT customer.acc_type)",
        "question": "How many distinct types of accounts are there?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nRETURN count(DISTINCT customer.acc_type)",
        "question": "Count the number of different account types.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nWHERE customer.cust_name =~'.*[A|a].*'\nRETURN customer.cust_name,customer.acc_bal",
        "question": "Find the name and account balance of the customer whose name includes the letter \u2018a\u2019.",
        "answers": [
            [
                "Mary",
                2000
            ],
            [
                "Jack",
                1000
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nWHERE customer.cust_name =~'.*[A|a].*'\nRETURN customer.cust_name,customer.acc_bal",
        "question": "What are the names and account balances of customers with the letter a in their names?",
        "answers": [
            [
                "Mary",
                2000
            ],
            [
                "Jack",
                1000
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nWITH avg(customer.credit_score) AS credit_score\nMATCH (customer:`loan_1.customer`)\nWHERE  customer.credit_score <  credit_score \nRETURN customer.cust_name",
        "question": "Find the name of customers whose credit score is below the average credit scores of all customers.",
        "answers": [
            [
                "Mary"
            ],
            [
                "Jack"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nWITH avg(customer.credit_score) AS credit_score\nMATCH (customer:`loan_1.customer`)\nWHERE  customer.credit_score <  credit_score \nRETURN customer.cust_name",
        "question": "What are the names of customers with credit score less than the average credit score across customers?",
        "answers": [
            [
                "Mary"
            ],
            [
                "Jack"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN bank.bname\nORDER BY bank.no_of_customers DESC\nLIMIT 1",
        "question": "Find the branch name of the bank that has the most number of customers.",
        "answers": [
            [
                "broadway"
            ]
        ]
    }
]