[
    {
        "question": "Find the payment method code used by more than 3 parties.",
        "query": "MATCH (parties:`e_government.Parties`)\nWITH count(*) AS count, parties.payment_method_code AS payment_method_code\nWHERE count  > 3\nRETURN payment_method_code",
        "db_id": "e_government",
        "answers": [
            [
                "Cheque"
            ],
            [
                "Credit Card"
            ],
            [
                "Cash"
            ]
        ]
    },
    {
        "question": "Count the number of different payment method codes used by parties.",
        "query": "MATCH (parties:`e_government.Parties`)\nRETURN count(DISTINCT parties.payment_method_code)",
        "db_id": "e_government",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "question": "Show the name, home city, and age for all drivers.",
        "query": "MATCH (driver:`school_bus.driver`)\nRETURN driver.Name,driver.Home_city,driver.Age",
        "db_id": "school_bus",
        "answers": [
            [
                "Matthew Ritter",
                "Hartford",
                40
            ],
            [
                "Dan Carter",
                "Bethel",
                30
            ],
            [
                "Minnie Gonzalez",
                "Hartford",
                46
            ],
            [
                "Angel Acre",
                "Hartford",
                42
            ],
            [
                "Brandon McGee",
                "Hartford",
                45
            ],
            [
                "Edwin Vargas",
                "Hartford",
                52
            ],
            [
                "Douglas McCrory",
                "Hartford",
                36
            ],
            [
                "Timothy Ackert",
                "Coventry",
                35
            ],
            [
                "Jason Rojas",
                "East Hartford",
                38
            ],
            [
                "Henry Genga",
                "East Hartford",
                37
            ],
            [
                "Tim Larson",
                "East Hartford",
                36
            ],
            [
                "Geoff Luxenberg",
                "Manchester",
                52
            ]
        ]
    },
    {
        "question": "Show the party and the number of drivers in each party.",
        "query": "MATCH (driver:`school_bus.driver`)\nWITH driver.Party AS Party, count(driver.Party) AS count\nRETURN Party,count",
        "db_id": "school_bus",
        "answers": [
            [
                "Dem",
                10
            ],
            [
                "Rep",
                2
            ]
        ]
    },
    {
        "question": "Show the name of drivers in descending order of age.",
        "query": "MATCH (driver:`school_bus.driver`)\nRETURN driver.Name\nORDER BY driver.Age DESC",
        "db_id": "school_bus",
        "answers": [
            [
                "Edwin Vargas"
            ],
            [
                "Geoff Luxenberg"
            ],
            [
                "Minnie Gonzalez"
            ],
            [
                "Brandon McGee"
            ],
            [
                "Angel Acre"
            ],
            [
                "Matthew Ritter"
            ],
            [
                "Jason Rojas"
            ],
            [
                "Henry Genga"
            ],
            [
                "Douglas McCrory"
            ],
            [
                "Tim Larson"
            ],
            [
                "Timothy Ackert"
            ],
            [
                "Dan Carter"
            ]
        ]
    },
    {
        "question": "Show all different home cities.",
        "query": "MATCH (driver:`school_bus.driver`)\nRETURN DISTINCT driver.Home_city",
        "db_id": "school_bus",
        "answers": [
            [
                "Hartford"
            ],
            [
                "Bethel"
            ],
            [
                "Coventry"
            ],
            [
                "East Hartford"
            ],
            [
                "Manchester"
            ]
        ]
    },
    {
        "question": "Show the home city with the most number of drivers.",
        "query": "MATCH (driver:`school_bus.driver`)\nWITH driver.Home_city AS Home_city, count(driver.Home_city) AS count\nRETURN Home_city\nORDER BY count DESC\nLIMIT 1",
        "db_id": "school_bus",
        "answers": [
            [
                "Hartford"
            ]
        ]
    },
    {
        "question": "Show the party with drivers from Hartford and drivers older than 40.",
        "query": "MATCH (driver:`school_bus.driver`)\nWHERE driver.Home_city = 'Hartford' AND driver.Age > 40\nRETURN driver.Party",
        "db_id": "school_bus",
        "answers": [
            [
                "Dem"
            ],
            [
                "Dem"
            ],
            [
                "Dem"
            ],
            [
                "Dem"
            ]
        ]
    },
    {
        "question": "Show home city where at least two drivers older than 40 are from.",
        "query": "MATCH (driver:`school_bus.driver`)\nWHERE driver.Age > 40\nWITH count(*) AS count, driver.Home_city AS Home_city\nWHERE count  >= 2\nRETURN Home_city",
        "db_id": "school_bus",
        "answers": [
            [
                "Hartford"
            ]
        ]
    },
    {
        "question": "Show the names of the drivers without a school bus.",
        "query": "MATCH (driver:`school_bus.driver`)\nWHERE NOT (driver:`school_bus.driver`)-[:`school_bus.school_bus`]-()\nRETURN driver.Name",
        "db_id": "school_bus",
        "answers": [
            [
                "Matthew Ritter"
            ],
            [
                "Dan Carter"
            ],
            [
                "Brandon McGee"
            ],
            [
                "Edwin Vargas"
            ],
            [
                "Timothy Ackert"
            ],
            [
                "Tim Larson"
            ],
            [
                "Geoff Luxenberg"
            ]
        ]
    },
    {
        "question": "Show the types of schools that have two schools.",
        "query": "MATCH (school:`school_bus.school`)\nWITH count(*) AS count, school.Type AS Type\nWHERE count  = 2\nRETURN Type",
        "db_id": "school_bus",
        "answers": [
            [
                "Public"
            ]
        ]
    },
    {
        "question": "Show the school name and type for schools without a school bus.",
        "query": "MATCH (school:`school_bus.school`)\nWHERE NOT (school:`school_bus.school`)-[:`school_bus.school_bus`]-()\nRETURN school.School,school.Type",
        "db_id": "school_bus",
        "answers": [
            [
                "St. Francis Assisi",
                "Private Catholic"
            ],
            [
                "Columbia University",
                "Private"
            ]
        ]
    },
    {
        "question": "List names for drivers from Hartford city and younger than 40.",
        "query": "MATCH (driver:`school_bus.driver`)\nWHERE driver.Home_city = 'Hartford' AND driver.Age < 40\nRETURN driver.Name",
        "db_id": "school_bus",
        "answers": [
            [
                "Douglas McCrory"
            ]
        ]
    },
    {
        "question": "List the id, country, city and name of the airports ordered alphabetically by the name.",
        "query": "MATCH (airport:`flight_company.airport`)\nRETURN airport.id,airport.Country,airport.City,airport.name\nORDER BY airport.name",
        "db_id": "flight_company",
        "answers": [
            [
                1,
                "Iceland",
                "Akureyri",
                "Akureyri Airport"
            ],
            [
                4,
                "United States",
                "Baltimore",
                "Baltimore-Washington Airport"
            ],
            [
                6,
                "Norway",
                "Bergen",
                "Bergen Airport"
            ],
            [
                7,
                "Denmark",
                "Billund",
                "Billund Airport"
            ],
            [
                5,
                "Spain",
                "Barcelona",
                "El Prat Airport"
            ],
            [
                8,
                "United States",
                "Boston",
                "Logan International Airport"
            ],
            [
                9,
                "Belgium",
                "Brussels",
                "National Airport"
            ],
            [
                2,
                "Netherlands",
                "Amsterdam",
                "Schiphol Airport"
            ],
            [
                3,
                "United States",
                "Anchorage",
                "Ted Stevens Airport"
            ]
        ]
    },
    {
        "question": "Count the number of accounts.",
        "query": "MATCH (accounts:`cre_Docs_and_Epenses.Accounts`)\nRETURN count(*)",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Show all account ids and account details.",
        "query": "MATCH (accounts:`cre_Docs_and_Epenses.Accounts`)\nRETURN accounts.Account_ID,accounts.Account_Details",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                7,
                "495.063"
            ],
            [
                61,
                "930.14"
            ],
            [
                98,
                "6035.84"
            ],
            [
                136,
                "199.52"
            ],
            [
                164,
                "12223.93"
            ],
            [
                209,
                "11130.23"
            ],
            [
                211,
                "1230.454"
            ],
            [
                240,
                "6352.31"
            ],
            [
                262,
                "147.96"
            ],
            [
                280,
                "187.14"
            ],
            [
                321,
                "745.817"
            ],
            [
                346,
                "127.9"
            ],
            [
                414,
                "25.41"
            ],
            [
                427,
                "1168.32"
            ],
            [
                451,
                "658.26"
            ]
        ]
    },
    {
        "question": "Count the number of statements.",
        "query": "MATCH (statements:`cre_Docs_and_Epenses.Statements`)\nRETURN count(*)",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "List all statement ids and statement details.",
        "query": "MATCH (statements:`cre_Docs_and_Epenses.Statements`)\nRETURN statements.Statement_ID,statements.Statement_Details",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                57,
                "Open Project"
            ],
            [
                192,
                "Private Project"
            ]
        ]
    },
    {
        "question": "Show statement id, statement detail, account detail for accounts.",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Accounts`)-[]-(T2:`cre_Docs_and_Epenses.Statements`)\nRETURN T1.Statement_ID,T2.Statement_Details,T1.Account_Details",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                57,
                "Open Project",
                "6035.84"
            ],
            [
                57,
                "Open Project",
                "495.063"
            ],
            [
                57,
                "Open Project",
                "187.14"
            ],
            [
                57,
                "Open Project",
                "147.96"
            ],
            [
                57,
                "Open Project",
                "1168.32"
            ],
            [
                57,
                "Open Project",
                "25.41"
            ],
            [
                57,
                "Open Project",
                "930.14"
            ],
            [
                57,
                "Open Project",
                "11130.23"
            ],
            [
                57,
                "Open Project",
                "199.52"
            ],
            [
                192,
                "Private Project",
                "658.26"
            ],
            [
                192,
                "Private Project",
                "745.817"
            ],
            [
                192,
                "Private Project",
                "6352.31"
            ],
            [
                192,
                "Private Project",
                "127.9"
            ],
            [
                192,
                "Private Project",
                "1230.454"
            ],
            [
                192,
                "Private Project",
                "12223.93"
            ]
        ]
    },
    {
        "question": "Show all statement id and the number of accounts for each statement.",
        "query": "MATCH (accounts:`cre_Docs_and_Epenses.Accounts`)\nWITH accounts.Statement_ID AS Statement_ID, count(accounts.Statement_ID) AS count\nRETURN Statement_ID,count",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                57,
                9
            ],
            [
                192,
                6
            ]
        ]
    },
    {
        "question": "Show the statement id and the statement detail for the statement with most number of accounts.",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Accounts`)-[]-(T2:`cre_Docs_and_Epenses.Statements`)\nWITH count(T1.Statement_ID) AS count, T1.Statement_ID AS Statement_ID, T2.Statement_Details AS Statement_Details\nRETURN Statement_ID,Statement_Details\nORDER BY count DESC\nLIMIT 1",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                57,
                "Open Project"
            ]
        ]
    },
    {
        "question": "Show the number of documents.",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nRETURN count(*)",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Show the ids and names of all documents.",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nRETURN documents.Document_ID,documents.Document_Name",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                29,
                "Review on UK files"
            ],
            [
                42,
                "Review on Canadian files"
            ],
            [
                57,
                "Review on French files"
            ],
            [
                121,
                "Review on USA files"
            ],
            [
                181,
                "Chapter on private files"
            ],
            [
                192,
                "Book on USA files"
            ],
            [
                226,
                "Review on UK files"
            ],
            [
                227,
                "Deontae files"
            ],
            [
                240,
                "Winona Book"
            ],
            [
                300,
                "Trenton Presentation"
            ],
            [
                309,
                "Noel CV"
            ],
            [
                318,
                "King Book"
            ],
            [
                367,
                "Jevon Paper"
            ],
            [
                371,
                "Katheryn statement"
            ],
            [
                383,
                "Review on UK files"
            ]
        ]
    },
    {
        "question": "Find names and ids of all documents with document type code BK.",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWHERE documents.Document_Type_Code = 'BK'\nRETURN documents.Document_Name,documents.Document_ID",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                "Review on Canadian files",
                42
            ],
            [
                "Review on USA files",
                121
            ],
            [
                "Review on UK files",
                226
            ],
            [
                "Deontae files",
                227
            ],
            [
                "Winona Book",
                240
            ],
            [
                "Noel CV",
                309
            ]
        ]
    },
    {
        "question": "What are the names and ids of documents that have the type code BK?",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWHERE documents.Document_Type_Code = 'BK'\nRETURN documents.Document_Name,documents.Document_ID",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                "Review on Canadian files",
                42
            ],
            [
                "Review on USA files",
                121
            ],
            [
                "Review on UK files",
                226
            ],
            [
                "Deontae files",
                227
            ],
            [
                "Winona Book",
                240
            ],
            [
                "Noel CV",
                309
            ]
        ]
    },
    {
        "question": "How many documents are with document type code BK for each product id?",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWHERE documents.Document_Type_Code = 'BK'\nWITH documents.Project_ID AS Project_ID, count(documents.Project_ID) AS count\nRETURN count,Project_ID",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                3,
                105
            ],
            [
                2,
                30
            ],
            [
                1,
                35
            ]
        ]
    },
    {
        "question": "Show project ids and the number of documents in each project.",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWITH documents.Project_ID AS Project_ID, count(documents.Project_ID) AS count\nRETURN Project_ID,count",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                30,
                3
            ],
            [
                105,
                5
            ],
            [
                195,
                1
            ],
            [
                134,
                3
            ],
            [
                35,
                3
            ]
        ]
    },
    {
        "question": "What is the id of the project with least number of documents?",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWITH documents.Project_ID AS Project_ID, count(documents.Project_ID) AS count\nRETURN Project_ID\nORDER BY count ASC\nLIMIT 1",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                195
            ]
        ]
    },
    {
        "question": "Show the ids for projects with at least 2 documents.",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWITH count(*) AS count, documents.Project_ID AS Project_ID\nWHERE count  >= 2\nRETURN Project_ID",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                30
            ],
            [
                105
            ],
            [
                134
            ],
            [
                35
            ]
        ]
    },
    {
        "question": "List document type codes and the number of documents in each code.",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWITH documents.Document_Type_Code AS Document_Type_Code, count(documents.Document_Type_Code) AS count\nRETURN Document_Type_Code,count",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                "CV",
                3
            ],
            [
                "BK",
                6
            ],
            [
                "PP",
                5
            ],
            [
                "FM",
                1
            ]
        ]
    },
    {
        "question": "What is the document type code with most number of documents?",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWITH documents.Document_Type_Code AS Document_Type_Code, count(documents.Document_Type_Code) AS count\nRETURN Document_Type_Code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                "BK"
            ]
        ]
    },
    {
        "question": "Show the document type code with fewer than 3 documents.",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWITH documents.Document_Type_Code AS Document_Type_Code, count(*) AS count\nWHERE count  < 3\nRETURN Document_Type_Code",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                "FM"
            ]
        ]
    },
    {
        "question": "Show the statement detail and the corresponding document name for the statement with detail 'Private Project'.",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Statements`)-[]-(T2:`cre_Docs_and_Epenses.Documents`)\nWHERE T1.Statement_Details = 'Private Project'\nRETURN T1.Statement_Details,T2.Document_Name",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                "Private Project",
                "Book on USA files"
            ]
        ]
    },
    {
        "question": "What is the document type description for document type named Film?",
        "query": "MATCH (ref_document_types:`cre_Docs_and_Epenses.Ref_Document_Types`)\nWHERE ref_document_types.Document_Type_Name = 'Film'\nRETURN ref_document_types.Document_Type_Description",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                "fun"
            ]
        ]
    },
    {
        "question": "Show the number of projects.",
        "query": "MATCH (projects:`cre_Docs_and_Epenses.Projects`)\nRETURN count(*)",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "List ids and details for all projects.",
        "query": "MATCH (projects:`cre_Docs_and_Epenses.Projects`)\nRETURN projects.Project_ID,projects.Project_Details",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                30,
                "Society Research project"
            ],
            [
                35,
                "Internet of Things project"
            ],
            [
                105,
                "Graph Database project"
            ],
            [
                134,
                "Human Resource project"
            ],
            [
                195,
                "Population Research project"
            ]
        ]
    },
    {
        "question": "Count the number of budget codes.",
        "query": "MATCH (ref_budget_codes:`cre_Docs_and_Epenses.Ref_Budget_Codes`)\nRETURN count(*)",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "List all budget type codes and descriptions.",
        "query": "MATCH (ref_budget_codes:`cre_Docs_and_Epenses.Ref_Budget_Codes`)\nRETURN ref_budget_codes.Budget_Type_Code,ref_budget_codes.Budget_Type_Description",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                "GV",
                "Government"
            ],
            [
                "ORG",
                "Organisation"
            ],
            [
                "SF",
                "Self founded"
            ]
        ]
    },
    {
        "question": "What is the description for the budget type with code ORG?",
        "query": "MATCH (ref_budget_codes:`cre_Docs_and_Epenses.Ref_Budget_Codes`)\nWHERE ref_budget_codes.Budget_Type_Code = 'ORG'\nRETURN ref_budget_codes.Budget_Type_Description",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                "Organisation"
            ]
        ]
    },
    {
        "question": "Count the number of documents with expenses.",
        "query": "MATCH (documents_with_expenses:`cre_Docs_and_Epenses.Documents_with_Expenses`)\nRETURN count(*)",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "question": "Give the ids of documents with expenses that have the budget code 'SF'.",
        "query": "MATCH (documents_with_expenses:`cre_Docs_and_Epenses.Documents_with_Expenses`)\nWHERE documents_with_expenses.Budget_Type_Code = 'SF'\nRETURN documents_with_expenses.Document_ID",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                309
            ],
            [
                367
            ]
        ]
    },
    {
        "question": "Show budget type codes and the number of documents in each budget type.",
        "query": "MATCH (documents_with_expenses:`cre_Docs_and_Epenses.Documents_with_Expenses`)\nWITH count(documents_with_expenses.Budget_Type_Code) AS count, documents_with_expenses.Budget_Type_Code AS Budget_Type_Code\nRETURN Budget_Type_Code,count",
        "db_id": "cre_Docs_and_Epenses",
        "answers": [
            [
                "GV",
                6
            ],
            [
                "SF",
                2
            ],
            [
                "ORG",
                2
            ]
        ]
    },
    {
        "question": "Find the total number of scientists.",
        "query": "MATCH (scientists:`scientist_1.Scientists`)\nRETURN count(*)",
        "db_id": "scientist_1",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "question": "Find the number of distinct projects.",
        "query": "MATCH (projects:`scientist_1.Projects`)\nRETURN count(DISTINCT projects.Name)",
        "db_id": "scientist_1",
        "answers": [
            [
                14
            ]
        ]
    },
    {
        "question": "Find the name of project that continues for the longest time.",
        "query": "MATCH (projects:`scientist_1.Projects`)\nRETURN projects.Name\nORDER BY projects.Hours DESC\nLIMIT 1",
        "db_id": "scientist_1",
        "answers": [
            [
                "A Magnetic Primer Designer"
            ]
        ]
    },
    {
        "question": "Find the name of projects that require between 100 and 300 hours of work.",
        "query": "MATCH (projects:`scientist_1.Projects`)\nWHERE 100<=projects.Hours<=300\nRETURN projects.Name",
        "db_id": "scientist_1",
        "answers": [
            [
                "Winds: Studying Bernoullis Principle"
            ],
            [
                "Aerodynamics and Bridge Design"
            ],
            [
                "Aerodynamics and Gas Mileage"
            ],
            [
                "A Matter of Time"
            ],
            [
                "A Puzzling Parallax"
            ]
        ]
    },
    {
        "question": "List the names of all scientists sorted in alphabetical order.",
        "query": "MATCH (scientists:`scientist_1.Scientists`)\nRETURN scientists.Name\nORDER BY scientists.Name",
        "db_id": "scientist_1",
        "answers": [
            [
                "Anand Manikutty"
            ],
            [
                "Carol Smith"
            ],
            [
                "David Smith"
            ],
            [
                "Elizabeth Doe"
            ],
            [
                "Eric Goldsmith"
            ],
            [
                "George ODonnell"
            ],
            [
                "Joe Stevens"
            ],
            [
                "John Doe"
            ],
            [
                "Kumar Swamy"
            ],
            [
                "Mary-Anne Foster"
            ],
            [
                "Michael Rogers"
            ],
            [
                "Zacary Efron"
            ]
        ]
    },
    {
        "question": "Find the number of scientists involved for each project name.",
        "query": "MATCH (T1:`scientist_1.Projects`)-[T2:`scientist_1.AssignedTo`]-()\nWITH T1.Name AS Name, count(T1.Name) AS count\nRETURN count,Name",
        "db_id": "scientist_1",
        "answers": [
            [
                1,
                "Winds: Studying Bernoullis Principle"
            ],
            [
                2,
                "Aerodynamics and Gas Mileage"
            ],
            [
                1,
                "Aerodynamics and Ice Hockey"
            ],
            [
                1,
                "A Matter of Time"
            ],
            [
                1,
                "A Puzzling Parallax"
            ],
            [
                3,
                "Build Your Own Telescope"
            ],
            [
                1,
                "Juicy: Extracting Apple Juice with Pectinase"
            ],
            [
                2,
                "A Silver-Cleaning Battery"
            ]
        ]
    },
    {
        "question": "Find the number of scientists involved for the projects that require more than 300 hours.",
        "query": "MATCH (T1:`scientist_1.Projects`)-[T2:`scientist_1.AssignedTo`]-()\nWHERE T1.Hours > 300\nWITH T1.Name AS Name, count(T1.Name) AS count\nRETURN count,Name",
        "db_id": "scientist_1",
        "answers": [
            [
                1,
                "Aerodynamics and Ice Hockey"
            ],
            [
                3,
                "Build Your Own Telescope"
            ],
            [
                1,
                "Juicy: Extracting Apple Juice with Pectinase"
            ],
            [
                2,
                "A Silver-Cleaning Battery"
            ]
        ]
    }
]