[
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN faculty.Rank,faculty.Sex,count(*)",
        "question": "How many faculty members do we have for each rank and gender?",
        "answers": [
            [
                "Instructor",
                "M",
                5
            ],
            [
                "Professor",
                "M",
                27
            ],
            [
                "AssocProf",
                "M",
                7
            ],
            [
                "Instructor",
                "F",
                3
            ],
            [
                "AsstProf",
                "M",
                12
            ],
            [
                "AsstProf",
                "F",
                3
            ],
            [
                "AssocProf",
                "F",
                1
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN faculty.Rank\nORDER BY faculty.Rank ASC\nLIMIT 1",
        "question": "Which rank has the smallest number of faculty members?",
        "answers": [
            [
                "AssocProf"
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN faculty.Rank\nORDER BY faculty.Rank ASC\nLIMIT 1",
        "question": "Find the faculty rank that has the least members.",
        "answers": [
            [
                "AssocProf"
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (activity:`activity_1.Activity`)\nRETURN activity.activity_name",
        "question": "What activities do we have?",
        "answers": [
            [
                "Mountain Climbing"
            ],
            [
                "Canoeing"
            ],
            [
                "Kayaking"
            ],
            [
                "Spelunking"
            ],
            [
                "Extreme Canasta"
            ],
            [
                "Soccer"
            ],
            [
                "Baseball"
            ],
            [
                "Accordion Ensemble"
            ],
            [
                "Football"
            ],
            [
                "Volleyball"
            ],
            [
                "Canasta"
            ],
            [
                "Chess"
            ],
            [
                "Crossword Puzzles"
            ],
            [
                "Proselytizing"
            ],
            [
                "Square Dancing"
            ],
            [
                "Bungee Jumping"
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (activity:`activity_1.Activity`)\nRETURN activity.activity_name",
        "question": "List all the activities we have.",
        "answers": [
            [
                "Mountain Climbing"
            ],
            [
                "Canoeing"
            ],
            [
                "Kayaking"
            ],
            [
                "Spelunking"
            ],
            [
                "Extreme Canasta"
            ],
            [
                "Soccer"
            ],
            [
                "Baseball"
            ],
            [
                "Accordion Ensemble"
            ],
            [
                "Football"
            ],
            [
                "Volleyball"
            ],
            [
                "Canasta"
            ],
            [
                "Chess"
            ],
            [
                "Crossword Puzzles"
            ],
            [
                "Proselytizing"
            ],
            [
                "Square Dancing"
            ],
            [
                "Bungee Jumping"
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (activity:`activity_1.Activity`)\nRETURN count(*)",
        "question": "How many activities do we have?",
        "answers": [
            [
                16
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (activity:`activity_1.Activity`)\nRETURN count(*)",
        "question": "Find the number of activities available.",
        "answers": [
            [
                16
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH ()-[faculty_participates_in:`activity_1.Faculty_Participates_in`]-()\nRETURN count(DISTINCT faculty_participates_in.FacID)",
        "question": "How many faculty members participate in an activity?",
        "answers": [
            [
                18
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (T1:`activity_1.Activity`)-[T2:`activity_1.Faculty_Participates_in`]-()\nWITH count(T1.actid) AS cnt, T1\nRETURN T1.activity_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the name of the activity that has the most faculty members involved in?",
        "answers": [
            [
                "Crossword Puzzles"
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (T1:`activity_1.Activity`)-[T2:`activity_1.Faculty_Participates_in`]-()\nWITH count(T1.actid) AS cnt, T1\nRETURN T1.activity_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Which activity has the most faculty members participating in? Find the activity name.",
        "answers": [
            [
                "Crossword Puzzles"
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (T1:`activity_1.Activity`)-[T2:`activity_1.Participates_in`]-()\nWITH count(T1.actid) AS cnt, T1\nRETURN T1.activity_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the name of the activity with the most students?",
        "answers": [
            [
                "Football"
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (T1:`activity_1.Activity`)-[T2:`activity_1.Participates_in`]-()\nWITH count(T1.actid) AS cnt, T1\nRETURN T1.activity_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Find the name of the activity that has the largest number of student participants.",
        "answers": [
            [
                "Football"
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (orders:`tracking_orders.Orders`)\nRETURN orders.order_id\nORDER BY orders.date_order_placed DESC\nLIMIT 1",
        "question": "What is the id of the most recent order?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (orders:`tracking_orders.Orders`)\nRETURN orders.order_id\nORDER BY orders.date_order_placed DESC\nLIMIT 1",
        "question": "Find the id of the order made most recently.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (orders:`tracking_orders.Orders`)\nRETURN orders.order_id,orders.customer_id\nORDER BY orders.date_order_placed\nLIMIT 1",
        "question": "what are the order id and customer id of the oldest order?",
        "answers": [
            [
                15,
                8
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (orders:`tracking_orders.Orders`)\nRETURN orders.order_id,orders.customer_id\nORDER BY orders.date_order_placed\nLIMIT 1",
        "question": "Find the order id and customer id associated with the oldest order.",
        "answers": [
            [
                15,
                8
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (order_items:`tracking_orders.Order_Items`)\nWHERE order_items.product_id = 11\nRETURN order_items.order_item_id",
        "question": "Find the ids of all the order items whose product id is 11.",
        "answers": [
            [
                5
            ],
            [
                9
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (order_items:`tracking_orders.Order_Items`)\nWHERE order_items.product_id = 11\nRETURN order_items.order_item_id",
        "question": "Find all the order items whose product id is 11. What are the order item ids?",
        "answers": [
            [
                5
            ],
            [
                9
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Customers`)-[]-(T2:`tracking_orders.Orders`)\nWHERE T2.order_status = \"On Road\"\nRETURN DISTINCT T1.customer_details",
        "question": "Find the details of all the distinct customers who have orders with status \"On Road\".",
        "answers": [
            [
                "commodi"
            ],
            [
                "deleniti"
            ],
            [
                "est"
            ],
            [
                "doloribus"
            ],
            [
                "officia"
            ],
            [
                "rerum"
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Customers`)-[]-(T2:`tracking_orders.Orders`)\nWHERE T2.order_status = \"On Road\"\nRETURN DISTINCT T1.customer_details",
        "question": "What are the distinct customers who have orders with status \"On Road\"? Give me the customer details?",
        "answers": [
            [
                "commodi"
            ],
            [
                "deleniti"
            ],
            [
                "est"
            ],
            [
                "doloribus"
            ],
            [
                "officia"
            ],
            [
                "rerum"
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Customers`)-[]-(T2:`tracking_orders.Orders`)\nWHERE T2.date_order_placed >= \"2009-01-01\" AND T2.date_order_placed <= \"2010-01-01\"\nRETURN T1.customer_name",
        "question": "Give me the names of customers who have placed orders between 2009-01-01 and 2010-01-01.",
        "answers": [
            [
                "George"
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Customers`)-[]-(T2:`tracking_orders.Orders`)\nWHERE T2.date_order_placed >= \"2009-01-01\" AND T2.date_order_placed <= \"2010-01-01\"\nRETURN T1.customer_name",
        "question": "Which customers made orders between 2009-01-01 and 2010-01-01? Find their names.",
        "answers": [
            [
                "George"
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Orders`)-[]-(T2:`tracking_orders.Order_Items`)\nWHERE T1.date_order_placed >= \"1975-01-01\" AND T1.date_order_placed <= \"1976-01-01\"\nRETURN DISTINCT T2.product_id",
        "question": "Give me a list of distinct product ids from orders placed between 1975-01-01 and 1976-01-01?",
        "answers": [
            [
                4
            ],
            [
                11
            ],
            [
                15
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Orders`)-[]-(T2:`tracking_orders.Order_Items`)\nWHERE T1.date_order_placed >= \"1975-01-01\" AND T1.date_order_placed <= \"1976-01-01\"\nRETURN DISTINCT T2.product_id",
        "question": "What are the distinct ids of products ordered between 1975-01-01 and 1976-01-01??",
        "answers": [
            [
                4
            ],
            [
                11
            ],
            [
                15
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Orders`)-[]-(T2:`tracking_orders.Shipments`)\nWHERE T2.invoice_number = 10\nRETURN T1.date_order_placed",
        "question": "What is the placement date of the order whose invoice number is 10?",
        "answers": [
            [
                "1983-09-08 12:32:49"
            ],
            [
                "1997-01-27 19:12:01"
            ],
            [
                "1982-12-29 21:10:11"
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Orders`)-[]-(T2:`tracking_orders.Shipments`)\nWHERE T2.invoice_number = 10\nRETURN T1.date_order_placed",
        "question": "On what day was the order with invoice number 10 placed?",
        "answers": [
            [
                "1983-09-08 12:32:49"
            ],
            [
                "1997-01-27 19:12:01"
            ],
            [
                "1982-12-29 21:10:11"
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Orders`)-[]-(T2:`tracking_orders.Order_Items`)-[]-(T3:`tracking_orders.Products`)\nRETURN count(*),T3.product_id",
        "question": "List the count and id of each product in all the orders.",
        "answers": [
            [
                1,
                1
            ],
            [
                2,
                3
            ],
            [
                2,
                4
            ],
            [
                1,
                7
            ],
            [
                1,
                8
            ],
            [
                2,
                11
            ],
            [
                1,
                12
            ],
            [
                2,
                14
            ],
            [
                3,
                15
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Orders`)-[]-(T2:`tracking_orders.Order_Items`)-[]-(T3:`tracking_orders.Products`)\nRETURN count(*),T3.product_id",
        "question": "For each product, return its id and the number of times it was ordered.",
        "answers": [
            [
                1,
                1
            ],
            [
                2,
                3
            ],
            [
                2,
                4
            ],
            [
                1,
                7
            ],
            [
                1,
                8
            ],
            [
                2,
                11
            ],
            [
                1,
                12
            ],
            [
                2,
                14
            ],
            [
                3,
                15
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (shipments:`tracking_orders.Shipments`)\nWHERE shipments.shipment_date > \"2000-01-01\"\nRETURN shipments.order_id",
        "question": "Find the ids of orders which are shipped after 2000-01-01.",
        "answers": [
            [
                10
            ],
            [
                12
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (shipments:`tracking_orders.Shipments`)\nWHERE shipments.shipment_date > \"2000-01-01\"\nRETURN shipments.order_id",
        "question": "Which orders have shipment after 2000-01-01? Give me the order ids.",
        "answers": [
            [
                10
            ],
            [
                12
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (shipments:`tracking_orders.Shipments`)\nWITH max(shipments.shipment_date) AS shipment_date\nMATCH (shipments:`tracking_orders.Shipments`)\nWHERE  shipments.shipment_date =  shipment_date \nRETURN shipments.order_id",
        "question": "Find the id of the order which is shipped most recently.",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (shipments:`tracking_orders.Shipments`)\nWITH max(shipments.shipment_date) AS shipment_date\nMATCH (shipments:`tracking_orders.Shipments`)\nWHERE  shipments.shipment_date =  shipment_date \nRETURN shipments.order_id",
        "question": "Which order has the most recent shipment? Give me the order id.",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (products:`tracking_orders.Products`)\nRETURN DISTINCT products.product_name\nORDER BY products.product_name",
        "question": "List the names of all distinct products in alphabetical order.",
        "answers": [
            [
                "book"
            ],
            [
                "clothes"
            ],
            [
                "food"
            ],
            [
                "music"
            ],
            [
                "phone"
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (products:`tracking_orders.Products`)\nRETURN DISTINCT products.product_name\nORDER BY products.product_name",
        "question": "Sort all the distinct products in alphabetical order.",
        "answers": [
            [
                "book"
            ],
            [
                "clothes"
            ],
            [
                "food"
            ],
            [
                "music"
            ],
            [
                "phone"
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (invoices:`tracking_orders.Invoices`)\nWHERE invoices.invoice_date < \"1989-09-03\" OR invoices.invoice_date > \"2007-12-25\"\nRETURN invoices.invoice_number",
        "question": "Find the invoice numbers which are created before 1989-09-03 or after 2007-12-25.",
        "answers": [
            [
                4
            ],
            [
                5
            ],
            [
                6
            ],
            [
                8
            ],
            [
                9
            ],
            [
                11
            ],
            [
                12
            ],
            [
                13
            ],
            [
                15
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (invoices:`tracking_orders.Invoices`)\nWHERE invoices.invoice_date < \"1989-09-03\" OR invoices.invoice_date > \"2007-12-25\"\nRETURN invoices.invoice_number",
        "question": "What are the invoice numbers created before 1989-09-03 or after 2007-12-25?",
        "answers": [
            [
                4
            ],
            [
                5
            ],
            [
                6
            ],
            [
                8
            ],
            [
                9
            ],
            [
                11
            ],
            [
                12
            ],
            [
                13
            ],
            [
                15
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (invoices:`tracking_orders.Invoices`)\nWHERE invoices.invoice_date < \"1989-09-03\" OR invoices.invoice_date > \"2007-12-25\"\nRETURN DISTINCT invoices.invoice_details",
        "question": "Find the distinct details of invoices which are created before 1989-09-03 or after 2007-12-25.",
        "answers": [
            [
                "tempore"
            ],
            [
                "labore"
            ],
            [
                "optio"
            ],
            [
                "doloremque"
            ],
            [
                "quo"
            ],
            [
                "earum"
            ],
            [
                "ea"
            ],
            [
                "voluptatem"
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (invoices:`tracking_orders.Invoices`)\nWHERE invoices.invoice_date < \"1989-09-03\" OR invoices.invoice_date > \"2007-12-25\"\nRETURN DISTINCT invoices.invoice_details",
        "question": "What are the distinct details of invoices created before 1989-09-03 or after 2007-12-25?",
        "answers": [
            [
                "tempore"
            ],
            [
                "labore"
            ],
            [
                "optio"
            ],
            [
                "doloremque"
            ],
            [
                "quo"
            ],
            [
                "earum"
            ],
            [
                "ea"
            ],
            [
                "voluptatem"
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Orders`)-[]-(T2:`tracking_orders.Customers`)\nWITH count(*) AS count, T2.customer_name AS customer_name\nWHERE count  >= 2\nRETURN customer_name,count",
        "question": "For each customer who has at least two orders, find the customer name and number of orders made.",
        "answers": [
            [
                "George",
                3
            ],
            [
                "Beulah",
                2
            ],
            [
                "Jeramie",
                3
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Orders`)-[]-(T2:`tracking_orders.Customers`)\nWITH count(*) AS count, T2.customer_name AS customer_name\nWHERE count  >= 2\nRETURN customer_name,count",
        "question": "Which customers have made at least two orders? Give me each customer name and number of orders made.",
        "answers": [
            [
                "George",
                3
            ],
            [
                "Beulah",
                2
            ],
            [
                "Jeramie",
                3
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Orders`)-[]-(T2:`tracking_orders.Customers`)\nWITH count(*) AS count, T2.customer_name AS customer_name\nWHERE count  <= 2\nRETURN customer_name",
        "question": "Find the name of the customers who have at most two orders.",
        "answers": [
            [
                "Alberto"
            ],
            [
                "Leilani"
            ],
            [
                "Hadley"
            ],
            [
                "Violet"
            ],
            [
                "Parker"
            ],
            [
                "Devan"
            ],
            [
                "Beulah"
            ],
            [
                "Hershel"
            ]
        ]
    },
    {
        "db_id": "tracking_orders",
        "query": "MATCH (T1:`tracking_orders.Orders`)-[]-(T2:`tracking_orders.Customers`)\nWITH count(*) AS count, T2.customer_name AS customer_name\nWHERE count  <= 2\nRETURN customer_name",
        "question": "What are the names of the customers who have made two or less orders?",
        "answers": [
            [
                "Alberto"
            ],
            [
                "Leilani"
            ],
            [
                "Hadley"
            ],
            [
                "Violet"
            ],
            [
                "Parker"
            ],
            [
                "Devan"
            ],
            [
                "Beulah"
            ],
            [
                "Hershel"
            ]
        ]
    },
    {
        "db_id": "architecture",
        "query": "MATCH (architect:`architecture.architect`)\nWHERE architect.gender = 'female'\nRETURN count(*)",
        "question": "How many architects are female?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "architecture",
        "query": "MATCH (architect:`architecture.architect`)\nWHERE architect.gender = 'male'\nRETURN architect.name,architect.nationality,architect.id\nORDER BY architect.name",
        "question": "List the name, nationality and id of all male architects ordered by their names lexicographically.",
        "answers": [
            [
                "Frank Gehry",
                "Canadian",
                "2"
            ],
            [
                "Frank Lloyd Wright",
                "American",
                "1"
            ],
            [
                "Le Corbusier",
                "Swiss, French",
                "5"
            ],
            [
                "Mies Van Der Rohe",
                "German, American",
                "4"
            ]
        ]
    },
    {
        "db_id": "architecture",
        "query": "MATCH (bridge:`architecture.bridge`)\nRETURN avg(bridge.length_feet)",
        "question": "What is the average length in feet of the bridges?",
        "answers": [
            [
                244.64
            ]
        ]
    },
    {
        "db_id": "architecture",
        "query": "MATCH (mill:`architecture.mill`)\nWHERE mill.type = 'Grondzeiler'\nRETURN mill.name,mill.built_year",
        "question": "What are the names and year of construction for the mills of 'Grondzeiler' type?",
        "answers": [
            [
                "Le Vieux Molen",
                1840
            ],
            [
                "Moulin Bertrand",
                1890
            ],
            [
                "Moulin de Fexhe",
                1843
            ],
            [
                "Moulin du Ch\u00e2teau",
                1856
            ],
            [
                "Moulin de Pousset",
                1819
            ]
        ]
    },
    {
        "db_id": "architecture",
        "query": "MATCH (mill:`architecture.mill`)\nWHERE mill.location <> 'Donceel'\nRETURN mill.name",
        "question": "What are the names of the mills which are not located in 'Donceel'?",
        "answers": [
            [
                "Le Vieux Molen"
            ],
            [
                "Moulin de Fexhe"
            ],
            [
                "Moulin de Momalle"
            ],
            [
                "Moulin du Ch\u00e2teau"
            ],
            [
                "Moulin de Pousset"
            ]
        ]
    },
    {
        "db_id": "architecture",
        "query": "MATCH (bridge:`architecture.bridge`)\nWHERE bridge.name = 'Kolob Arch' OR bridge.name = 'Rainbow Bridge'\nRETURN bridge.location",
        "question": "What is the location of the bridge named 'Kolob Arch' or 'Rainbow Bridge'?",
        "answers": [
            [
                "Zion National Park , Utah , USA"
            ],
            [
                "Glen Canyon National Recreation Area , Utah , USA"
            ]
        ]
    },
    {
        "db_id": "architecture",
        "query": "MATCH (mill:`architecture.mill`)\nWHERE mill.name =~'.*[M|m]oulin.*'\nRETURN mill.name",
        "question": "Which of the mill names contains the french word 'Moulin'?",
        "answers": [
            [
                "Moulin Bertrand"
            ],
            [
                "Moulin de Fexhe"
            ],
            [
                "Moulin de Momalle"
            ],
            [
                "Moulin du Ch\u00e2teau"
            ],
            [
                "Moulin de Pousset"
            ]
        ]
    },
    {
        "db_id": "architecture",
        "query": "MATCH (mill:`architecture.mill`)\nRETURN mill.type,count(*)\nORDER BY mill.type DESC\nLIMIT 1",
        "question": "What is the most common mill type, and how many are there?",
        "answers": [
            [
                "Grondzeiler",
                5
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (book_club:`culture_company.book_club`)\nRETURN count(*)",
        "question": "Count the number of book clubs.",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (book_club:`culture_company.book_club`)\nWHERE book_club.Year > 1989\nRETURN book_club.Book_Title,book_club.Author_or_Editor",
        "question": "show the titles, and authors or editors for all books made after the year 1989.",
        "answers": [
            [
                "Somewhere in the Night",
                "Jeffrey N. McMahan"
            ],
            [
                "Walking Water / After All This",
                "Thom Nickels"
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (book_club:`culture_company.book_club`)\nRETURN DISTINCT book_club.Publisher",
        "question": "Show all distinct publishers for books.",
        "answers": [
            [
                "Alyson"
            ],
            [
                "St. Martin's Press"
            ],
            [
                "William Morrow"
            ],
            [
                "Mysterious Press"
            ],
            [
                "International Polygonics"
            ],
            [
                "Banned Books"
            ],
            [
                "Naiad Press"
            ],
            [
                "Crossing Press"
            ]
        ]
    },
    {
        "db_id": "culture_company",
        "query": "MATCH (book_club:`culture_company.book_club`)\nRETURN book_club.Year,book_club.Book_Title,book_club.Publisher\nORDER BY book_club.Year DESC",
        "question": "Show the years, book titles, and publishers for all books, in descending order by year.",
        "answers": [
            [
                1990,
                "Somewhere in the Night",
                "Alyson"
            ],
            [
                1990,
                "Walking Water / After All This",
                "Banned Books"
            ],
            [
                1989,
                "Goldenboy",
                "Alyson"
            ],
            [
                1989,
                "Death Takes the Stage",
                "St. Martin's Press"
            ],
            [
                1989,
                "Unicorn Mountain",
                "William Morrow"
            ],
            [
                1989,
                "Obedience",
                "Mysterious Press"
            ],
            [
                1989,
                "Who\u04f3 Next",
                "International Polygonics"
            ],
            [
                1989,
                "Skiptrace",
                "Banned Books"
            ],
            [
                1989,
                "Lessons In Murder",
                "Naiad Press"
            ],
            [
                1989,
                "Mundane\u04f3 World",
                "Crossing Press"
            ],
            [
                1989,
                "Heavy Gilt",
                "Naiad Press"
            ],
            [
                1989,
                "The Crystal Curtain",
                "Alyson"
            ]
        ]
    }
]