[
    {
        "db_id": "e_government",
        "query": "MATCH (organizations:`e_government.Organizations`)\nRETURN organizations.organization_name\nORDER BY organizations.date_formed DESC\nLIMIT 1",
        "question": "What is the name of the organization that was formed most recently?",
        "answers": [
            [
                "Liberal Democrats"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (t1:`e_government.Organizations`)-[t2:`e_government.Organization_Contact_Individuals`]-(t3:`e_government.Individuals`)\nWHERE t1.organization_name = \"Labour Party\"\nRETURN t3.individual_last_name\nORDER BY t2.date_contact_to DESC\nLIMIT 1",
        "question": "Find the last name of the latest contact individual of the organization \"Labour Party\".",
        "answers": [
            [
                "Bradtke"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (t1:`e_government.Organizations`)-[t2:`e_government.Organization_Contact_Individuals`]-(t3:`e_government.Individuals`)\nWHERE t1.organization_name = \"Labour Party\"\nRETURN t3.individual_last_name\nORDER BY t2.date_contact_to DESC\nLIMIT 1",
        "question": "What is the last name of the contact individual from the Labour party organization who was contacted most recently?",
        "answers": [
            [
                "Bradtke"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (services:`e_government.Services`)\nRETURN count(*)",
        "question": "Count the number of services.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (parties:`e_government.Parties`)\nWITH count(*) AS count, parties.payment_method_code AS payment_method_code\nWHERE count  > 3\nRETURN payment_method_code",
        "question": "Find the payment method code used by more than 3 parties.",
        "answers": [
            [
                "Cheque"
            ],
            [
                "Credit Card"
            ],
            [
                "Cash"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (parties:`e_government.Parties`)\nWITH count(*) AS count, parties.payment_method_code AS payment_method_code\nWHERE count  > 3\nRETURN payment_method_code",
        "question": "What are the payment method codes that have been used by more than 3 parties?",
        "answers": [
            [
                "Cheque"
            ],
            [
                "Credit Card"
            ],
            [
                "Cash"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (parties:`e_government.Parties`)\nRETURN count(DISTINCT parties.payment_method_code)",
        "question": "How many distinct payment methods are used by parties?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (parties:`e_government.Parties`)\nRETURN count(DISTINCT parties.payment_method_code)",
        "question": "Count the number of different payment method codes used by parties.",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (t1:`e_government.Parties`)-[t2:`e_government.Party_Services`]-()\nWITH t1, count(t1.party_email) AS cnt\nRETURN t1.party_email\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Which is the email of the party that has used the services the most number of times?",
        "answers": [
            [
                "frida57@example.org"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (t1:`e_government.Parties`)-[t2:`e_government.Party_Services`]-()\nWITH t1, count(t1.party_email) AS cnt\nRETURN t1.party_email\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Return the party email that has used party services the greatest number of times.",
        "answers": [
            [
                "frida57@example.org"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (t1:`e_government.Organizations`)-[t2:`e_government.Organization_Contact_Individuals`]-()\nWITH t1, count(t1.organization_name) AS cnt\nRETURN t1.organization_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the name of organization that has the greatest number of contact individuals?",
        "answers": [
            [
                "Conservative"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (t1:`e_government.Individuals`)-[t2:`e_government.Organization_Contact_Individuals`]-()\nRETURN DISTINCT t1.individual_last_name",
        "question": "Find the last name of the individuals that have been contact individuals of an organization.",
        "answers": [
            [
                "Schuster"
            ],
            [
                "Kertzmann"
            ],
            [
                "Jacobs"
            ],
            [
                "D'Amore"
            ],
            [
                "Rutherford"
            ],
            [
                "Rau"
            ],
            [
                "Rogahn"
            ],
            [
                "Bradtke"
            ],
            [
                "Dooley"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (t1:`e_government.Individuals`)-[t2:`e_government.Organization_Contact_Individuals`]-()\nRETURN DISTINCT t1.individual_last_name",
        "question": "What are the last names of individuals who have been contact individuals for an organization?",
        "answers": [
            [
                "Schuster"
            ],
            [
                "Kertzmann"
            ],
            [
                "Jacobs"
            ],
            [
                "D'Amore"
            ],
            [
                "Rutherford"
            ],
            [
                "Rau"
            ],
            [
                "Rogahn"
            ],
            [
                "Bradtke"
            ],
            [
                "Dooley"
            ]
        ]
    },
    {
        "db_id": "school_bus",
        "query": "MATCH (driver:`school_bus.driver`)\nRETURN driver.Name,driver.Home_city,driver.Age",
        "question": "Show the name, home city, and age for all drivers.",
        "answers": [
            [
                "Matthew Ritter",
                "Hartford",
                40
            ],
            [
                "Dan Carter",
                "Bethel",
                30
            ],
            [
                "Minnie Gonzalez",
                "Hartford",
                46
            ],
            [
                "Angel Acre",
                "Hartford",
                42
            ],
            [
                "Brandon McGee",
                "Hartford",
                45
            ],
            [
                "Edwin Vargas",
                "Hartford",
                52
            ],
            [
                "Douglas McCrory",
                "Hartford",
                36
            ],
            [
                "Timothy Ackert",
                "Coventry",
                35
            ],
            [
                "Jason Rojas",
                "East Hartford",
                38
            ],
            [
                "Henry Genga",
                "East Hartford",
                37
            ],
            [
                "Tim Larson",
                "East Hartford",
                36
            ],
            [
                "Geoff Luxenberg",
                "Manchester",
                52
            ]
        ]
    },
    {
        "db_id": "school_bus",
        "query": "MATCH (driver:`school_bus.driver`)\nRETURN driver.Party,count(*)",
        "question": "Show the party and the number of drivers in each party.",
        "answers": [
            [
                "Dem",
                10
            ],
            [
                "Rep",
                2
            ]
        ]
    },
    {
        "db_id": "school_bus",
        "query": "MATCH (driver:`school_bus.driver`)\nRETURN driver.Name\nORDER BY driver.Age DESC",
        "question": "Show the name of drivers in descending order of age.",
        "answers": [
            [
                "Edwin Vargas"
            ],
            [
                "Geoff Luxenberg"
            ],
            [
                "Minnie Gonzalez"
            ],
            [
                "Brandon McGee"
            ],
            [
                "Angel Acre"
            ],
            [
                "Matthew Ritter"
            ],
            [
                "Jason Rojas"
            ],
            [
                "Henry Genga"
            ],
            [
                "Douglas McCrory"
            ],
            [
                "Tim Larson"
            ],
            [
                "Timothy Ackert"
            ],
            [
                "Dan Carter"
            ]
        ]
    },
    {
        "db_id": "school_bus",
        "query": "MATCH (driver:`school_bus.driver`)\nRETURN DISTINCT driver.Home_city",
        "question": "Show all different home cities.",
        "answers": [
            [
                "Hartford"
            ],
            [
                "Bethel"
            ],
            [
                "Coventry"
            ],
            [
                "East Hartford"
            ],
            [
                "Manchester"
            ]
        ]
    },
    {
        "db_id": "school_bus",
        "query": "MATCH (driver:`school_bus.driver`)\nWHERE driver.Home_city = 'Hartford' AND driver.Age > 40\nRETURN driver.Party",
        "question": "Show the party with drivers from Hartford and drivers older than 40.",
        "answers": [
            [
                "Dem"
            ],
            [
                "Dem"
            ],
            [
                "Dem"
            ],
            [
                "Dem"
            ]
        ]
    },
    {
        "db_id": "school_bus",
        "query": "MATCH (driver:`school_bus.driver`)\nWHERE driver.Age > 40\nWITH count(*) AS count, driver.Home_city AS Home_city\nWHERE count  >= 2\nRETURN Home_city",
        "question": "Show home city where at least two drivers older than 40 are from.",
        "answers": [
            [
                "Hartford"
            ]
        ]
    },
    {
        "db_id": "school_bus",
        "query": "MATCH (school:`school_bus.school`)\nWITH count(*) AS count, school.Type AS Type\nWHERE count  = 2\nRETURN Type",
        "question": "Show the types of schools that have two schools.",
        "answers": [
            [
                "Public"
            ]
        ]
    },
    {
        "db_id": "school_bus",
        "query": "MATCH (T2:`school_bus.school`)-[T1:`school_bus.school_bus`]-(T3:`school_bus.driver`)\nRETURN T2.School,T3.Name",
        "question": "Show the school name and driver name for all school buses.",
        "answers": [
            [
                "Noelani Elementary School",
                "Henry Genga"
            ],
            [
                "State Elementary School Menteng 01",
                "Angel Acre"
            ],
            [
                "Punahou School",
                "Minnie Gonzalez"
            ],
            [
                "Occidental College",
                "Douglas McCrory"
            ],
            [
                "Harvard Law School",
                "Jason Rojas"
            ]
        ]
    },
    {
        "db_id": "school_bus",
        "query": "MATCH ()-[school_bus:`school_bus.school_bus`]-()\nRETURN max(school_bus.Years_Working),min(school_bus.Years_Working),avg(school_bus.Years_Working)",
        "question": "What is the maximum, minimum and average years spent working on a school bus?",
        "answers": [
            [
                10,
                2,
                5.8
            ]
        ]
    },
    {
        "db_id": "school_bus",
        "query": "MATCH (T2:`school_bus.school`)-[T1:`school_bus.school_bus`]-()\nRETURN T2.Type,count(*)",
        "question": "Show the type of school and the number of buses for each type.",
        "answers": [
            [
                "Public",
                2
            ],
            [
                "Private",
                3
            ]
        ]
    },
    {
        "db_id": "school_bus",
        "query": "MATCH (driver:`school_bus.driver`)\nWHERE driver.Home_city = 'Hartford' OR driver.Age < 40\nRETURN count(*)",
        "question": "How many drivers are from Hartford city or younger than 40?",
        "answers": [
            [
                11
            ]
        ]
    },
    {
        "db_id": "school_bus",
        "query": "MATCH (driver:`school_bus.driver`)\nWHERE driver.Home_city = 'Hartford' AND driver.Age < 40\nRETURN driver.Name",
        "question": "List names for drivers from Hartford city and younger than 40.",
        "answers": [
            [
                "Douglas McCrory"
            ]
        ]
    },
    {
        "db_id": "school_bus",
        "query": "MATCH (t1:`school_bus.driver`)-[t2:`school_bus.school_bus`]-()\nRETURN t1.Name\nORDER BY t2.Years_Working DESC\nLIMIT 1",
        "question": "find the name of driver who is driving the school bus with the longest working history.",
        "answers": [
            [
                "Henry Genga"
            ]
        ]
    },
    {
        "db_id": "flight_company",
        "query": "MATCH (flight:`flight_company.flight`)\nRETURN flight.Vehicle_Flight_number,flight.Date,flight.Pilot\nORDER BY flight.Altitude ASC",
        "question": "List the vehicle flight number, date and pilot of all the flights, ordered by altitude.",
        "answers": [
            [
                "M2-F1 #0",
                "March 1, 1963",
                "Thompson"
            ],
            [
                "M2-F1 #1",
                "August 16, 1963",
                "Thompson"
            ],
            [
                "M2-F1 #6",
                "September 3, 1963",
                "Thompson"
            ],
            [
                "M2-F1 #13",
                "October 25, 1963",
                "Thompson"
            ],
            [
                "M2-F1 #14",
                "November 8, 1963",
                "Thompson"
            ],
            [
                "M2-F1 #21",
                "January 29, 1964",
                "Thompson"
            ],
            [
                "M2-F1 #33",
                "March 30, 1964",
                "Peterson"
            ],
            [
                "M2-F1 #39",
                "May 19, 1964",
                "Peterson"
            ],
            [
                "M2-F1 #61",
                "July 16, 1965",
                "Thompson"
            ],
            [
                "M2-F1 #64",
                "August 30, 1965",
                "Thompson"
            ],
            [
                "M2-F1 #70",
                "October 8, 1965",
                "Thompson"
            ],
            [
                "M2-F1 #71",
                "March 28, 1966",
                "Thompson"
            ],
            [
                "M2-F1 #73",
                "August 4, 1966",
                "Peterson"
            ]
        ]
    },
    {
        "db_id": "flight_company",
        "query": "MATCH (airport:`flight_company.airport`)\nRETURN airport.id,airport.Country,airport.City,airport.name\nORDER BY airport.name",
        "question": "List the id, country, city and name of the airports ordered alphabetically by the name.",
        "answers": [
            [
                1,
                "Iceland",
                "Akureyri",
                "Akureyri Airport"
            ],
            [
                4,
                "United States",
                "Baltimore",
                "Baltimore-Washington Airport"
            ],
            [
                6,
                "Norway",
                "Bergen",
                "Bergen Airport"
            ],
            [
                7,
                "Denmark",
                "Billund",
                "Billund Airport"
            ],
            [
                5,
                "Spain",
                "Barcelona",
                "El Prat Airport"
            ],
            [
                8,
                "United States",
                "Boston",
                "Logan International Airport"
            ],
            [
                9,
                "Belgium",
                "Brussels",
                "National Airport"
            ],
            [
                2,
                "Netherlands",
                "Amsterdam",
                "Schiphol Airport"
            ],
            [
                3,
                "United States",
                "Anchorage",
                "Ted Stevens Airport"
            ]
        ]
    },
    {
        "db_id": "flight_company",
        "query": "MATCH (T1:`flight_company.operate_company`)-[]-(t2:`flight_company.flight`)\nRETURN T1.name,T1.Type",
        "question": "What are the names and types of the companies that have ever operated a flight?",
        "answers": [
            [
                "Air China",
                "Corporate"
            ],
            [
                "Air China Cargo",
                "Joint Venture"
            ],
            [
                "Air Hong Kong",
                "Joint Venture"
            ],
            [
                "Dragonair",
                "Subsidiary"
            ],
            [
                "Dragonair",
                "Subsidiary"
            ],
            [
                "Cathay Pacific Cargo",
                "Subsidiary"
            ],
            [
                "Cathay Pacific Cargo",
                "Subsidiary"
            ],
            [
                "Cathay Pacific Catering Services (HK) Limited",
                "Subsidiary"
            ],
            [
                "Cathay Pacific Services Limited",
                "Subsidiary"
            ],
            [
                "Dragonair Holidays",
                "Subsidiary"
            ],
            [
                "Vogue Laundry Service Limited",
                "Subsidiary"
            ],
            [
                "Vogue Laundry Service Limited",
                "Subsidiary"
            ],
            [
                "VN/CX Catering Services Limited",
                "Joint Venture"
            ]
        ]
    },
    {
        "db_id": "flight_company",
        "query": "MATCH (T1:`flight_company.operate_company`)-[]-(t2:`flight_company.flight`)\nWITH T1.name AS name, count(*) AS count, T1.id AS id\nWHERE count  > 1\nRETURN id,name",
        "question": "What are the ids and names of the companies that operated more than one flight?",
        "answers": [
            [
                4,
                "Dragonair"
            ],
            [
                5,
                "Cathay Pacific Cargo"
            ],
            [
                11,
                "Vogue Laundry Service Limited"
            ]
        ]
    },
    {
        "db_id": "flight_company",
        "query": "MATCH (operate_company:`flight_company.operate_company`)\nRETURN operate_company.Type,count(*)\nORDER BY operate_company.Type DESC\nLIMIT 1",
        "question": "What is the most common company type, and how many are there?",
        "answers": [
            [
                "Subsidiary",
                8
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (accounts:`cre_Docs_and_Epenses.Accounts`)\nRETURN count(*)",
        "question": "Count the number of accounts.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (accounts:`cre_Docs_and_Epenses.Accounts`)\nRETURN accounts.Account_ID,accounts.Account_Details",
        "question": "Show all account ids and account details.",
        "answers": [
            [
                7,
                "495.063"
            ],
            [
                61,
                "930.14"
            ],
            [
                98,
                "6035.84"
            ],
            [
                136,
                "199.52"
            ],
            [
                164,
                "12223.93"
            ],
            [
                209,
                "11130.23"
            ],
            [
                211,
                "1230.454"
            ],
            [
                240,
                "6352.31"
            ],
            [
                262,
                "147.96"
            ],
            [
                280,
                "187.14"
            ],
            [
                321,
                "745.817"
            ],
            [
                346,
                "127.9"
            ],
            [
                414,
                "25.41"
            ],
            [
                427,
                "1168.32"
            ],
            [
                451,
                "658.26"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (accounts:`cre_Docs_and_Epenses.Accounts`)\nRETURN accounts.Account_ID,accounts.Account_Details",
        "question": "What are the ids and details of all accounts?",
        "answers": [
            [
                7,
                "495.063"
            ],
            [
                61,
                "930.14"
            ],
            [
                98,
                "6035.84"
            ],
            [
                136,
                "199.52"
            ],
            [
                164,
                "12223.93"
            ],
            [
                209,
                "11130.23"
            ],
            [
                211,
                "1230.454"
            ],
            [
                240,
                "6352.31"
            ],
            [
                262,
                "147.96"
            ],
            [
                280,
                "187.14"
            ],
            [
                321,
                "745.817"
            ],
            [
                346,
                "127.9"
            ],
            [
                414,
                "25.41"
            ],
            [
                427,
                "1168.32"
            ],
            [
                451,
                "658.26"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (statements:`cre_Docs_and_Epenses.Statements`)\nRETURN count(*)",
        "question": "How many statements do we have?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (statements:`cre_Docs_and_Epenses.Statements`)\nRETURN count(*)",
        "question": "Count the number of statements.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (statements:`cre_Docs_and_Epenses.Statements`)\nRETURN statements.Statement_ID,statements.Statement_Details",
        "question": "List all statement ids and statement details.",
        "answers": [
            [
                57,
                "Open Project"
            ],
            [
                192,
                "Private Project"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (statements:`cre_Docs_and_Epenses.Statements`)\nRETURN statements.Statement_ID,statements.Statement_Details",
        "question": "What are the ids and details of all statements?",
        "answers": [
            [
                57,
                "Open Project"
            ],
            [
                192,
                "Private Project"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Accounts`)-[]-(T2:`cre_Docs_and_Epenses.Statements`)\nRETURN T1.Statement_ID,T2.Statement_Details,T1.Account_Details",
        "question": "Show statement id, statement detail, account detail for accounts.",
        "answers": [
            [
                57,
                "Open Project",
                "25.41"
            ],
            [
                57,
                "Open Project",
                "147.96"
            ],
            [
                57,
                "Open Project",
                "6035.84"
            ],
            [
                57,
                "Open Project",
                "1168.32"
            ],
            [
                57,
                "Open Project",
                "199.52"
            ],
            [
                57,
                "Open Project",
                "495.063"
            ],
            [
                57,
                "Open Project",
                "930.14"
            ],
            [
                57,
                "Open Project",
                "187.14"
            ],
            [
                57,
                "Open Project",
                "11130.23"
            ],
            [
                192,
                "Private Project",
                "658.26"
            ],
            [
                192,
                "Private Project",
                "6352.31"
            ],
            [
                192,
                "Private Project",
                "127.9"
            ],
            [
                192,
                "Private Project",
                "12223.93"
            ],
            [
                192,
                "Private Project",
                "745.817"
            ],
            [
                192,
                "Private Project",
                "1230.454"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Accounts`)-[]-(T2:`cre_Docs_and_Epenses.Statements`)\nRETURN T1.Statement_ID,T2.Statement_Details,T1.Account_Details",
        "question": "What are the statement ids, statement details, and account details, for all accounts?",
        "answers": [
            [
                57,
                "Open Project",
                "25.41"
            ],
            [
                57,
                "Open Project",
                "147.96"
            ],
            [
                57,
                "Open Project",
                "6035.84"
            ],
            [
                57,
                "Open Project",
                "1168.32"
            ],
            [
                57,
                "Open Project",
                "199.52"
            ],
            [
                57,
                "Open Project",
                "495.063"
            ],
            [
                57,
                "Open Project",
                "930.14"
            ],
            [
                57,
                "Open Project",
                "187.14"
            ],
            [
                57,
                "Open Project",
                "11130.23"
            ],
            [
                192,
                "Private Project",
                "658.26"
            ],
            [
                192,
                "Private Project",
                "6352.31"
            ],
            [
                192,
                "Private Project",
                "127.9"
            ],
            [
                192,
                "Private Project",
                "12223.93"
            ],
            [
                192,
                "Private Project",
                "745.817"
            ],
            [
                192,
                "Private Project",
                "1230.454"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (accounts:`cre_Docs_and_Epenses.Accounts`)\nRETURN accounts.Statement_ID,count(*)",
        "question": "Show all statement id and the number of accounts for each statement.",
        "answers": [
            [
                57,
                9
            ],
            [
                192,
                6
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (accounts:`cre_Docs_and_Epenses.Accounts`)\nRETURN accounts.Statement_ID,count(*)",
        "question": "What are the different statement ids on accounts, and the number of accounts for each?",
        "answers": [
            [
                57,
                9
            ],
            [
                192,
                6
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Accounts`)-[]-(T2:`cre_Docs_and_Epenses.Statements`)\nWITH count(T1.Statement_ID) AS cnt, T1, T2\nRETURN T1.Statement_ID,T2.Statement_Details\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Show the statement id and the statement detail for the statement with most number of accounts.",
        "answers": [
            [
                57,
                "Open Project"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (T1:`cre_Docs_and_Epenses.Accounts`)-[]-(T2:`cre_Docs_and_Epenses.Statements`)\nWITH count(T1.Statement_ID) AS cnt, T1, T2\nRETURN T1.Statement_ID,T2.Statement_Details\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What are the statement id and statement detail for the statement that has the most corresponding accounts?",
        "answers": [
            [
                57,
                "Open Project"
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nRETURN count(*)",
        "question": "Show the number of documents.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nRETURN count(*)",
        "question": "Count the number of documents.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "cre_Docs_and_Epenses",
        "query": "MATCH (documents:`cre_Docs_and_Epenses.Documents`)\nWHERE documents.Document_Name = 'Noel CV' OR documents.Document_Name = 'King Book'\nRETURN documents.Document_Type_Code,documents.Document_Name,documents.Document_Description",
        "question": "List the document type code, document name, and document description for the document with name 'Noel CV' or name 'King Book'.",
        "answers": [
            [
                "BK",
                "Noel CV",
                null
            ],
            [
                "PP",
                "King Book",
                null
            ]
        ]
    }
]