[
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T1:`medicine_enzyme_interaction.medicine`)-[T2:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-()\nWITH count(*) AS count, T1.id AS id, T1.Trade_Name AS Trade_Name\nWHERE count  >= 3\nRETURN id,Trade_Name",
        "question": "What are the ids and trade names of the medicine that can interact with at least 3 enzymes?",
        "answers": [
            [
                2,
                "Abilify"
            ],
            [
                3,
                "Saphris"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T1:`medicine_enzyme_interaction.enzyme`)-[T2:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-()\nWHERE T2.interaction_type = 'inhibitor'\nRETURN DISTINCT T1.name,T1.Location,T1.Product",
        "question": "What are the distinct name, location and products of the enzymes which has any 'inhibitor' interaction?",
        "answers": [
            [
                "ALA synthase",
                "Mitochondrion",
                "\u03b4-Aminolevulinic acid"
            ],
            [
                "ALA dehydratase",
                "Cytosol",
                "Porphobilinogen"
            ],
            [
                "PBG deaminase",
                "Cytosol",
                "Hydroxymethyl bilane"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (T1:`medicine_enzyme_interaction.enzyme`)-[T2:`medicine_enzyme_interaction.medicine_enzyme_interaction`]-()\nWHERE T2.interaction_type = 'inhibitor'\nRETURN DISTINCT T1.name,T1.Location,T1.Product",
        "question": "What are the different names, locations, and products of the enzymes that are capable inhibitor interactions?",
        "answers": [
            [
                "ALA synthase",
                "Mitochondrion",
                "\u03b4-Aminolevulinic acid"
            ],
            [
                "ALA dehydratase",
                "Cytosol",
                "Porphobilinogen"
            ],
            [
                "PBG deaminase",
                "Cytosol",
                "Hydroxymethyl bilane"
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (medicine:`medicine_enzyme_interaction.medicine`)\nRETURN count(DISTINCT medicine.FDA_approved)",
        "question": "How many distinct FDA approval statuses are there for the medicines?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (medicine:`medicine_enzyme_interaction.medicine`)\nRETURN count(DISTINCT medicine.FDA_approved)",
        "question": "How many different FDA approval statuses exist for medicines?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (medicine:`medicine_enzyme_interaction.medicine`)\nRETURN medicine.Trade_Name,count(*)",
        "question": "find the number of medicines offered by each trade.",
        "answers": [
            [
                "Solian",
                1
            ],
            [
                "Abilify",
                1
            ],
            [
                "Saphris",
                1
            ],
            [
                "Lonasen",
                1
            ],
            [
                "Prazinil",
                1
            ],
            [
                "Clofekton",
                1
            ],
            [
                "Clozaril",
                1
            ],
            [
                "Fanapt",
                1
            ],
            [
                "Latuda",
                1
            ],
            [
                "Buronil",
                1
            ],
            [
                "Cremin",
                1
            ],
            [
                "Zyprexa",
                1
            ],
            [
                "Invega",
                1
            ],
            [
                "Lullan",
                1
            ],
            [
                "Seroquel",
                1
            ],
            [
                "Roxiam",
                1
            ],
            [
                "Risperdal",
                1
            ],
            [
                "Serdolect",
                1
            ],
            [
                "Sulpirid",
                1
            ],
            [
                "Geodon",
                1
            ],
            [
                "Nipolept",
                1
            ]
        ]
    },
    {
        "db_id": "medicine_enzyme_interaction",
        "query": "MATCH (medicine:`medicine_enzyme_interaction.medicine`)\nRETURN medicine.Trade_Name,count(*)",
        "question": "How many medicines are offered by each trade name?",
        "answers": [
            [
                "Solian",
                1
            ],
            [
                "Abilify",
                1
            ],
            [
                "Saphris",
                1
            ],
            [
                "Lonasen",
                1
            ],
            [
                "Prazinil",
                1
            ],
            [
                "Clofekton",
                1
            ],
            [
                "Clozaril",
                1
            ],
            [
                "Fanapt",
                1
            ],
            [
                "Latuda",
                1
            ],
            [
                "Buronil",
                1
            ],
            [
                "Cremin",
                1
            ],
            [
                "Zyprexa",
                1
            ],
            [
                "Invega",
                1
            ],
            [
                "Lullan",
                1
            ],
            [
                "Seroquel",
                1
            ],
            [
                "Roxiam",
                1
            ],
            [
                "Risperdal",
                1
            ],
            [
                "Serdolect",
                1
            ],
            [
                "Sulpirid",
                1
            ],
            [
                "Geodon",
                1
            ],
            [
                "Nipolept",
                1
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nRETURN university.School,university.Nickname\nORDER BY university.Founded",
        "question": "List all schools and their nicknames in the order of founded year.",
        "answers": [
            [
                "University of Delaware",
                "Fightin' Blue Hens"
            ],
            [
                "Rutgers University",
                "Scarlet Knights"
            ],
            [
                "Lebanon Valley College",
                "Flying Dutchmen"
            ],
            [
                "University of Rhode Island",
                "Rams"
            ],
            [
                "Stony Brook University",
                "Seawolves"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nRETURN university.School,university.Nickname\nORDER BY university.Founded",
        "question": "What are the different schools and their nicknames, ordered by their founding years?",
        "answers": [
            [
                "University of Delaware",
                "Fightin' Blue Hens"
            ],
            [
                "Rutgers University",
                "Scarlet Knights"
            ],
            [
                "Lebanon Valley College",
                "Flying Dutchmen"
            ],
            [
                "University of Rhode Island",
                "Rams"
            ],
            [
                "Stony Brook University",
                "Seawolves"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Affiliation = 'Public'\nRETURN university.School,university.Location",
        "question": "List all public schools and their locations.",
        "answers": [
            [
                "University of Delaware",
                "Newark, DE"
            ],
            [
                "University of Rhode Island",
                "Kingston, RI"
            ],
            [
                "Rutgers University",
                "New Brunswick, NJ"
            ],
            [
                "Stony Brook University",
                "Stony Brook, NY"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Affiliation = 'Public'\nRETURN university.School,university.Location",
        "question": "What are the public schools and what are their locations?",
        "answers": [
            [
                "University of Delaware",
                "Newark, DE"
            ],
            [
                "University of Rhode Island",
                "Kingston, RI"
            ],
            [
                "Rutgers University",
                "New Brunswick, NJ"
            ],
            [
                "Stony Brook University",
                "Stony Brook, NY"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nRETURN university.Founded\nORDER BY university.Enrollment DESC\nLIMIT 1",
        "question": "When was the school with the largest enrollment founded?",
        "answers": [
            [
                1766.0
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nRETURN university.Founded\nORDER BY university.Enrollment DESC\nLIMIT 1",
        "question": "Return the founded year for the school with the largest enrollment.",
        "answers": [
            [
                1766.0
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Affiliation <> 'Public'\nRETURN university.Founded\nORDER BY university.Founded DESC\nLIMIT 1",
        "question": "Find the founded year of the newest non public school.",
        "answers": [
            [
                1866.0
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Affiliation <> 'Public'\nRETURN university.Founded\nORDER BY university.Founded DESC\nLIMIT 1",
        "question": "What is the founded year of the non public school that was founded most recently?",
        "answers": [
            [
                1866.0
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (basketball_match:`university_basketball.basketball_match`)\nRETURN count(DISTINCT basketball_match.School_ID)",
        "question": "How many schools are in the basketball match?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (basketball_match:`university_basketball.basketball_match`)\nRETURN count(DISTINCT basketball_match.School_ID)",
        "question": "Count the number of schools that have had basketball matches.",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (basketball_match:`university_basketball.basketball_match`)\nRETURN basketball_match.ACC_Percent\nORDER BY basketball_match.ACC_Percent DESC\nLIMIT 1",
        "question": "What is the highest acc percent score in the competition?",
        "answers": [
            [
                ".875"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (basketball_match:`university_basketball.basketball_match`)\nRETURN basketball_match.ACC_Percent\nORDER BY basketball_match.ACC_Percent DESC\nLIMIT 1",
        "question": "Return the highest acc percent across all basketball matches.",
        "answers": [
            [
                ".875"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (t1:`university_basketball.university`)-[]-(t2:`university_basketball.basketball_match`)\nRETURN t1.Primary_conference\nORDER BY t2.ACC_Percent\nLIMIT 1",
        "question": "What is the primary conference of the school that has the lowest acc percent score in the competition?",
        "answers": [
            [
                "America East Conference ( D-I )"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (t1:`university_basketball.university`)-[]-(t2:`university_basketball.basketball_match`)\nRETURN t1.Primary_conference\nORDER BY t2.ACC_Percent\nLIMIT 1",
        "question": "Return the primary conference of the school with the lowest acc percentage score.",
        "answers": [
            [
                "America East Conference ( D-I )"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (t1:`university_basketball.university`)-[]-(t2:`university_basketball.basketball_match`)\nRETURN t2.Team_Name,t2.ACC_Regular_Season\nORDER BY t1.Founded\nLIMIT 1",
        "question": "What is the team name and acc regular season score of the school that was founded for the longest time?",
        "answers": [
            [
                "North Carolina",
                "14\u20132"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (t1:`university_basketball.university`)-[]-(t2:`university_basketball.basketball_match`)\nRETURN t2.Team_Name,t2.ACC_Regular_Season\nORDER BY t1.Founded\nLIMIT 1",
        "question": "Return the name of the team and the acc during the regular season for the school that was founded the earliest.",
        "answers": [
            [
                "North Carolina",
                "14\u20132"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (t1:`university_basketball.university`)-[]-(t2:`university_basketball.basketball_match`)\nWHERE t2.Team_Name = 'Clemson'\nRETURN t2.All_Games,t1.Location",
        "question": "Find the location and all games score of the school that has Clemson as its team name.",
        "answers": [
            [
                "24\u201310",
                "New Brunswick, NJ"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (t1:`university_basketball.university`)-[]-(t2:`university_basketball.basketball_match`)\nWHERE t2.Team_Name = 'Clemson'\nRETURN t2.All_Games,t1.Location",
        "question": "What are the all games score and location of the school called Clemson?",
        "answers": [
            [
                "24\u201310",
                "New Brunswick, NJ"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Founded < 1850\nRETURN avg(university.Enrollment)",
        "question": "What are the average enrollment size of the universities that are founded before 1850?",
        "answers": [
            [
                37967.5
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Founded < 1850\nRETURN avg(university.Enrollment)",
        "question": "Return the average enrollment of universities founded before 1850.",
        "answers": [
            [
                37967.5
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nRETURN university.Enrollment,university.Primary_conference\nORDER BY university.Founded\nLIMIT 1",
        "question": "Show the enrollment and primary_conference of the oldest college.",
        "answers": [
            [
                19067.0,
                "Colonial Athletic Association ( D-I )"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nRETURN university.Enrollment,university.Primary_conference\nORDER BY university.Founded\nLIMIT 1",
        "question": "What are the enrollment and primary conference for the university which was founded the earliest?",
        "answers": [
            [
                19067.0,
                "Colonial Athletic Association ( D-I )"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE NOT (university)-[]-(:`university_basketball.basketball_match`)    \nRETURN count(*)",
        "question": "How many schools do not participate in the basketball match?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE NOT (university)-[]-(:`university_basketball.basketball_match`)    \nRETURN count(*)",
        "question": "Count the number of universities that do not participate in the baketball match.",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Founded > 1850 OR university.Affiliation = 'Public'\nRETURN university.School",
        "question": "Find the schools that were either founded after 1850 or public.",
        "answers": [
            [
                "University of Delaware"
            ],
            [
                "Lebanon Valley College"
            ],
            [
                "University of Rhode Island"
            ],
            [
                "Rutgers University"
            ],
            [
                "Stony Brook University"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Founded > 1850 OR university.Affiliation = 'Public'\nRETURN university.School",
        "question": "What are the schools that were either founded before 1850 or are public?",
        "answers": [
            [
                "University of Delaware"
            ],
            [
                "Lebanon Valley College"
            ],
            [
                "University of Rhode Island"
            ],
            [
                "Rutgers University"
            ],
            [
                "Stony Brook University"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Enrollment > 20000\nRETURN count(*),university.Affiliation",
        "question": "Find the number of universities that have over a 20000 enrollment size for each affiliation type.",
        "answers": [
            [
                2,
                "Public"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Enrollment > 20000\nRETURN count(*),university.Affiliation",
        "question": "What are the different affiliations, and how many schools with each have an enrollment size of above 20000?",
        "answers": [
            [
                2,
                "Public"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nRETURN max(university.Enrollment)",
        "question": "What is the maximum enrollment across all schools?",
        "answers": [
            [
                56868.0
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (university:`university_basketball.university`)\nRETURN max(university.Enrollment)",
        "question": "Return the maximum enrollment across all schools.",
        "answers": [
            [
                56868.0
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (basketball_match:`university_basketball.basketball_match`)\nRETURN basketball_match.Team_Name\nORDER BY basketball_match.All_Home DESC",
        "question": "List names of all teams in the basketball competition, ordered by all home scores in descending order.",
        "answers": [
            [
                "Duke"
            ],
            [
                "Virginia Tech"
            ],
            [
                "North Carolina"
            ],
            [
                "Clemson"
            ]
        ]
    },
    {
        "db_id": "university_basketball",
        "query": "MATCH (basketball_match:`university_basketball.basketball_match`)\nRETURN basketball_match.Team_Name\nORDER BY basketball_match.All_Home DESC",
        "question": "What are the names of all the teams in the basketball competition, sorted by all home scores in descending order?",
        "answers": [
            [
                "Duke"
            ],
            [
                "Virginia Tech"
            ],
            [
                "North Carolina"
            ],
            [
                "Clemson"
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (chip_model:`phone_1.chip_model`)\nWHERE 2002<=chip_model.Launch_year<=2004\nRETURN chip_model.Model_name",
        "question": "the names of models that launched between 2002 and 2004.",
        "answers": [
            [
                "X5"
            ],
            [
                "X5 high end"
            ],
            [
                "X3 Basic"
            ],
            [
                "X3 Advanced"
            ],
            [
                "X3i"
            ],
            [
                "X30 low-end"
            ],
            [
                "X30 mid-range"
            ],
            [
                "X30 high-end"
            ],
            [
                "X50 Standard"
            ],
            [
                "X50 Advanced"
            ],
            [
                "X50v"
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (chip_model:`phone_1.chip_model`)\nRETURN chip_model.Model_name,chip_model.RAM_MiB\nORDER BY chip_model.RAM_MiB ASC\nLIMIT 1",
        "question": "Which model has the least amount of RAM? List the model name and the amount of RAM.",
        "answers": [
            [
                "X5",
                32.0
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (phone:`phone_1.phone`)\nWHERE phone.Hardware_Model_name = \"LG-P760\"\nRETURN phone.chip_model,phone.screen_mode",
        "question": "What are the chip model and screen mode of the phone with hardware model name \"LG-P760\"?",
        "answers": [
            [
                "X51v",
                "3"
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (phone:`phone_1.phone`)\nWHERE phone.Company_name = 'Nokia Corporation'\nRETURN count(*)",
        "question": "How many phone hardware models are produced by the company named \"Nokia Corporation\"?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (T1:`phone_1.chip_model`)-[]-(T2:`phone_1.phone`)\nWHERE T1.Launch_year = 2002 OR T1.RAM_MiB > 32\nRETURN T2.Hardware_Model_name,T2.Company_name",
        "question": "List the hardware model name and company name for all the phones that were launched in year 2002 or have RAM size greater than 32.",
        "answers": [
            [
                "XPERIA T, XPERIA J",
                "Sony Mobile Communications"
            ],
            [
                "LG-P760",
                "LG Electronics"
            ],
            [
                "Lumia 920, Lumia 820, Lumia 620",
                "Nokia Corporation"
            ],
            [
                "Z520e",
                "HTC Corporation"
            ],
            [
                "GT-I9100",
                "Samsung Electronics Co Ltd"
            ],
            [
                "Nokia 700",
                "Nokia Corporation"
            ],
            [
                "U8815 Asura",
                "Huawei Technologies Co.Ltd."
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (phone:`phone_1.phone`)\nWHERE phone.Accreditation_type =~'.*[F|f]ull.*'\nRETURN phone.Hardware_Model_name,phone.Company_name",
        "question": "Find all phones that have word 'Full' in their accreditation types. List the Hardware Model name and Company name.",
        "answers": [
            [
                "XPERIA T, XPERIA J",
                "Sony Mobile Communications"
            ],
            [
                "LG-P760",
                "LG Electronics"
            ],
            [
                "Lumia 920, Lumia 820, Lumia 620",
                "Nokia Corporation"
            ],
            [
                "GT-I9300",
                "Samsung Electronics Co Ltd"
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (phone:`phone_1.phone`)\nRETURN phone.Company_name,count(*)\nORDER BY phone.Company_name ASC\nLIMIT 1",
        "question": "Find the name of the company that has the least number of phone models. List the company name and the number of phone model produced by that company.",
        "answers": [
            [
                "HTC Corporation",
                1
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (phone:`phone_1.phone`)\nWITH count(*) AS count, phone.Company_name AS Company_name\nWHERE count  > 1\nRETURN Company_name",
        "question": "List the name of the company that produced more than one phone model.",
        "answers": [
            [
                "Nokia Corporation"
            ],
            [
                "Samsung Electronics Co Ltd"
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (screen_mode:`phone_1.screen_mode`)\nRETURN max(screen_mode.used_kb),min(screen_mode.used_kb),avg(screen_mode.used_kb)",
        "question": "List the maximum, minimum and average number of used kb in screen mode.",
        "answers": [
            [
                20.0,
                8.0,
                14.857142857142858
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (T1:`phone_1.chip_model`)-[]-(T2:`phone_1.phone`)\nWHERE T1.Launch_year = 2002\nRETURN T2.Hardware_Model_name\nORDER BY T1.RAM_MiB DESC\nLIMIT 1",
        "question": "List the name of the phone model launched in year 2002 and with the highest RAM size.",
        "answers": [
            [
                "XPERIA T, XPERIA J"
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (phone:`phone_1.phone`)\nRETURN phone.Accreditation_type,count(*)",
        "question": "Find the number of phones for each accreditation type.",
        "answers": [
            [
                "Full",
                4
            ],
            [
                "Provisional",
                4
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (phone:`phone_1.phone`)\nRETURN phone.Accreditation_type,count(*)",
        "question": "How many phones belongs to each accreditation type?",
        "answers": [
            [
                "Full",
                4
            ],
            [
                "Provisional",
                4
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (phone:`phone_1.phone`)\nWITH phone.Accreditation_level AS Accreditation_level, count(*) AS count\nWHERE count  > 3\nRETURN Accreditation_level",
        "question": "Find the accreditation level that more than 3 phones use.",
        "answers": [
            [
                "joyn"
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (chip_model:`phone_1.chip_model`)\nWHERE chip_model.WiFi = 'No'\nRETURN count(*)",
        "question": "How many models do not have the wifi function?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (chip_model:`phone_1.chip_model`)\nWHERE chip_model.WiFi = 'No'\nRETURN count(*)",
        "question": "Count the number of chip model that do not have wifi.",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (chip_model:`phone_1.chip_model`)\nRETURN chip_model.Model_name\nORDER BY chip_model.Launch_year",
        "question": "List all the model names sorted by their launch year.",
        "answers": [
            [
                "X5"
            ],
            [
                "X5 high end"
            ],
            [
                "X3 Basic"
            ],
            [
                "X3 Advanced"
            ],
            [
                "X3i"
            ],
            [
                "X30 low-end"
            ],
            [
                "X30 mid-range"
            ],
            [
                "X30 high-end"
            ],
            [
                "X50 Standard"
            ],
            [
                "X50 Advanced"
            ],
            [
                "X50v"
            ],
            [
                "X51 low-end"
            ],
            [
                "X51 mid-range"
            ],
            [
                "X51v"
            ]
        ]
    },
    {
        "db_id": "phone_1",
        "query": "MATCH (chip_model:`phone_1.chip_model`)\nWHERE NOT (chip_model)-[]-(:`phone_1.phone`)    \nRETURN avg(chip_model.RAM_MiB)",
        "question": "Find the average ram mib size of the chip models that are never used by any phone.",
        "answers": [
            [
                60.0
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (country:`match_season.country`)\nRETURN count(*)",
        "question": "How many countries are there in total?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (country:`match_season.country`)\nRETURN count(*)",
        "question": "Count the number of countries.",
        "answers": [
            [
                6
            ]
        ]
    }
]