[
    {
        "db_id": "party_host",
        "query": "MATCH (host:`party_host.host`)\nRETURN host.Name,host.Nationality\nORDER BY host.Age DESC\nLIMIT 1",
        "question": "What are the name and the nationality of the host of the highest age?",
        "answers": [
            [
                "Derrick Dial",
                "United States"
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (region:`storm_record.region`)\nRETURN count(*)",
        "question": "Count the number of regions.",
        "answers": [
            [
                13
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (region:`storm_record.region`)\nRETURN region.Region_code,region.Region_name\nORDER BY region.Region_code",
        "question": "Show all region code and region name sorted by the codes.",
        "answers": [
            [
                "AD",
                "Andorra"
            ],
            [
                "AF",
                "Afghanistan"
            ],
            [
                "AG",
                "Antigua and Barbuda"
            ],
            [
                "AI",
                "Anguilla"
            ],
            [
                "AL",
                "Albania"
            ],
            [
                "AO",
                "Angola"
            ],
            [
                "AQ",
                "Antarctica"
            ],
            [
                "CY",
                "Cyprus"
            ],
            [
                "CZ",
                "Czech Republic"
            ],
            [
                "DJ",
                "Djibouti"
            ],
            [
                "DK",
                "Denmark"
            ],
            [
                "DS",
                "American Samoa"
            ],
            [
                "DZ",
                "Algeria"
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (region:`storm_record.region`)\nRETURN region.Region_name\nORDER BY region.Region_name",
        "question": "List all region names in alphabetical order.",
        "answers": [
            [
                "Afghanistan"
            ],
            [
                "Albania"
            ],
            [
                "Algeria"
            ],
            [
                "American Samoa"
            ],
            [
                "Andorra"
            ],
            [
                "Angola"
            ],
            [
                "Anguilla"
            ],
            [
                "Antarctica"
            ],
            [
                "Antigua and Barbuda"
            ],
            [
                "Cyprus"
            ],
            [
                "Czech Republic"
            ],
            [
                "Denmark"
            ],
            [
                "Djibouti"
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (region:`storm_record.region`)\nWHERE region.Region_name <> 'Denmark'\nRETURN region.Region_name",
        "question": "Show names for all regions except for Denmark.",
        "answers": [
            [
                "Afghanistan"
            ],
            [
                "Albania"
            ],
            [
                "Algeria"
            ],
            [
                "American Samoa"
            ],
            [
                "Andorra"
            ],
            [
                "Angola"
            ],
            [
                "Anguilla"
            ],
            [
                "Antarctica"
            ],
            [
                "Antigua and Barbuda"
            ],
            [
                "Cyprus"
            ],
            [
                "Czech Republic"
            ],
            [
                "Djibouti"
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (region:`storm_record.region`)\nWHERE region.Region_name <> 'Denmark'\nRETURN region.Region_name",
        "question": "Return the names of all regions other than Denmark.",
        "answers": [
            [
                "Afghanistan"
            ],
            [
                "Albania"
            ],
            [
                "Algeria"
            ],
            [
                "American Samoa"
            ],
            [
                "Andorra"
            ],
            [
                "Angola"
            ],
            [
                "Anguilla"
            ],
            [
                "Antarctica"
            ],
            [
                "Antigua and Barbuda"
            ],
            [
                "Cyprus"
            ],
            [
                "Czech Republic"
            ],
            [
                "Djibouti"
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (storm:`storm_record.storm`)\nWHERE storm.Number_Deaths > 0\nRETURN count(*)",
        "question": "Count the number of storms in which at least 1 person died.",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (storm:`storm_record.storm`)\nWHERE storm.Number_Deaths >= 1\nRETURN storm.Name,storm.Dates_active,storm.Number_Deaths",
        "question": "List name, dates active, and number of deaths for all storms with at least 1 death.",
        "answers": [
            [
                "Two",
                "August3\u2013August10",
                7
            ],
            [
                "Three",
                "August5\u2013August14",
                52
            ],
            [
                "Four",
                "August26\u2013September2",
                7
            ],
            [
                "Five",
                "September7\u2013September17",
                3
            ],
            [
                "Six",
                "September18\u2013September25",
                2
            ],
            [
                "9 cyclones",
                "May19 \u2013October26",
                71
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (storm:`storm_record.storm`)\nWHERE storm.Max_speed > 1000\nRETURN avg(storm.Damage_millions_USD),max(storm.Damage_millions_USD)",
        "question": "Show the average and maximum damage for all storms with max speed higher than 1000.",
        "answers": [
            [
                6.5195,
                13.0
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (storm:`storm_record.storm`)\nWHERE storm.Max_speed > 1000\nRETURN avg(storm.Damage_millions_USD),max(storm.Damage_millions_USD)",
        "question": "What is the average and maximum damage in millions for storms that had a max speed over 1000?",
        "answers": [
            [
                6.5195,
                13.0
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (storm:`storm_record.storm`)\nRETURN storm.Name,storm.Damage_millions_USD\nORDER BY storm.Max_speed DESC",
        "question": "List name and damage for all storms in a descending order of max speed.",
        "answers": [
            [
                "Nine",
                13.0
            ],
            [
                "Six",
                0.039
            ],
            [
                "One",
                13.0
            ],
            [
                "Five",
                1.49
            ],
            [
                "Eight",
                13.0
            ],
            [
                "Seven",
                13.0
            ],
            [
                "Two",
                10.75
            ],
            [
                "Three",
                13.0
            ],
            [
                "Four",
                4.05
            ],
            [
                "9 cyclones",
                29.3
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (T1:`storm_record.region`)-[T2:`storm_record.affected_region`]-()\nRETURN T1.Region_name,count(*)",
        "question": "Show the name for regions and the number of storms for each region.",
        "answers": [
            [
                "Afghanistan",
                2
            ],
            [
                "Albania",
                2
            ],
            [
                "Algeria",
                1
            ],
            [
                "Denmark",
                1
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (T1:`storm_record.storm`)-[T2:`storm_record.affected_region`]-()\nRETURN T1.Name,count(*)",
        "question": "List the name for storms and the number of affected regions for each storm.",
        "answers": [
            [
                "One",
                2
            ],
            [
                "Three",
                1
            ],
            [
                "Four",
                1
            ],
            [
                "Five",
                2
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (T2:`storm_record.region`)-[T1:`storm_record.affected_region`]-(T3:`storm_record.storm`)\nWHERE T3.Number_Deaths >= 10\nRETURN T2.Region_name",
        "question": "Return the names of the regions affected by storms that had a death count of at least 10.",
        "answers": [
            [
                "Algeria"
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (T2:`storm_record.region`)-[T1:`storm_record.affected_region`]-(T3:`storm_record.storm`)\nWHERE T2.Region_name = 'Denmark'\nRETURN T3.Name",
        "question": "Show all storm names affecting region \"Denmark\".",
        "answers": [
            [
                "Five"
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (T1:`storm_record.region`)-[T2:`storm_record.affected_region`]-()\nWITH count(*) AS count, T1.Region_name AS Region_name\nWHERE count  >= 2\nRETURN Region_name",
        "question": "Show the region name with at least two storms.",
        "answers": [
            [
                "Afghanistan"
            ],
            [
                "Albania"
            ]
        ]
    },
    {
        "db_id": "storm_record",
        "query": "MATCH (T2:`storm_record.region`)-[T1:`storm_record.affected_region`]-(T3:`storm_record.storm`)\nRETURN T2.Region_name\nORDER BY T3.Number_Deaths DESC\nLIMIT 1",
        "question": "Find the names of the regions which were affected by the storm that killed the greatest number of people.",
        "answers": [
            [
                "Algeria"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN count(*)",
        "question": "How many counties are there in total?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN count(*)",
        "question": "Count the total number of counties.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name,county.Population",
        "question": "Show the county name and population of all counties.",
        "answers": [
            [
                "Howard",
                21000.0
            ],
            [
                "Baltimore County",
                90000.0
            ],
            [
                "Colony",
                79000.0
            ],
            [
                "Mansfield",
                87200.0
            ],
            [
                "Manning",
                13300.0
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN county.County_name,county.Population",
        "question": "What are the name and population of each county?",
        "answers": [
            [
                "Howard",
                21000.0
            ],
            [
                "Baltimore County",
                90000.0
            ],
            [
                "Colony",
                79000.0
            ],
            [
                "Mansfield",
                87200.0
            ],
            [
                "Manning",
                13300.0
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN avg(county.Population)",
        "question": "Show the average population of all counties.",
        "answers": [
            [
                58100.0
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN avg(county.Population)",
        "question": "On average how large is the population of the counties?",
        "answers": [
            [
                58100.0
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN max(county.Population),min(county.Population)",
        "question": "Return the maximum and minimum population among all counties.",
        "answers": [
            [
                90000.0,
                13300.0
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nRETURN max(county.Population),min(county.Population)",
        "question": "What are the maximum and minimum population of the counties?",
        "answers": [
            [
                90000.0,
                13300.0
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (election:`election.election`)\nRETURN DISTINCT election.District",
        "question": "Show all the distinct districts for elections.",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ],
            [
                4
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (election:`election.election`)\nRETURN DISTINCT election.District",
        "question": "What are the distinct districts for elections?",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ],
            [
                4
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nWHERE county.County_name = 'Howard'\nRETURN county.Zip_code",
        "question": "Show the zip code of the county with name \"Howard\".",
        "answers": [
            [
                "D21"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (county:`election.county`)\nWHERE county.County_name = 'Howard'\nRETURN county.Zip_code",
        "question": "What is the zip code the county named \"Howard\" is located in?",
        "answers": [
            [
                "D21"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (election:`election.election`)\nWHERE election.District = 1\nRETURN election.Delegate",
        "question": "Show the delegate from district 1 in election.",
        "answers": [
            [
                "Bates, Gail H. Gail H. Bates"
            ],
            [
                "Miller, Warren E. Warren E. Miller"
            ],
            [
                "Pendergrass, Shane E. Shane Pendergrass"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (election:`election.election`)\nWHERE election.District = 1\nRETURN election.Delegate",
        "question": "Who is the delegate of district 1 in the elections?",
        "answers": [
            [
                "Bates, Gail H. Gail H. Bates"
            ],
            [
                "Miller, Warren E. Warren E. Miller"
            ],
            [
                "Pendergrass, Shane E. Shane Pendergrass"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (election:`election.election`)\nRETURN election.Delegate,election.Committee",
        "question": "Show the delegate and committee information of elections.",
        "answers": [
            [
                "Bates, Gail H. Gail H. Bates",
                "Appropriations"
            ],
            [
                "Miller, Warren E. Warren E. Miller",
                "Economic Matters"
            ],
            [
                "DeBoy, Steven J. Sr. Steven J. DeBoy, Sr.",
                "Appropriations"
            ],
            [
                "Malone, James E. Jr. James E. Malone, Jr.",
                "Environmental Matters (Vice-Chair)"
            ],
            [
                "Bobo, Elizabeth Elizabeth Bobo",
                "Environmental Matters"
            ],
            [
                "Pendergrass, Shane E. Shane Pendergrass",
                "Health and Government Operations"
            ],
            [
                "Guzzone, Guy Guy Guzzone",
                "Appropriations"
            ],
            [
                "Turner, Frank S. Frank S. Turner",
                "Ways and Means"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (election:`election.election`)\nRETURN election.Delegate,election.Committee",
        "question": "What are the delegate and committee information for each election record?",
        "answers": [
            [
                "Bates, Gail H. Gail H. Bates",
                "Appropriations"
            ],
            [
                "Miller, Warren E. Warren E. Miller",
                "Economic Matters"
            ],
            [
                "DeBoy, Steven J. Sr. Steven J. DeBoy, Sr.",
                "Appropriations"
            ],
            [
                "Malone, James E. Jr. James E. Malone, Jr.",
                "Environmental Matters (Vice-Chair)"
            ],
            [
                "Bobo, Elizabeth Elizabeth Bobo",
                "Environmental Matters"
            ],
            [
                "Pendergrass, Shane E. Shane Pendergrass",
                "Health and Government Operations"
            ],
            [
                "Guzzone, Guy Guy Guzzone",
                "Appropriations"
            ],
            [
                "Turner, Frank S. Frank S. Turner",
                "Ways and Means"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (party:`election.party`)\nRETURN count(DISTINCT party.Governor)",
        "question": "How many distinct governors are there?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (party:`election.party`)\nRETURN count(DISTINCT party.Governor)",
        "question": "Count the number of distinct governors.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (party:`election.party`)\nWHERE party.Party = 'Democratic'\nRETURN party.Lieutenant_Governor,party.Comptroller",
        "question": "Show the lieutenant governor and comptroller from the democratic party.",
        "answers": [
            [
                "Sandra Frankel",
                "Carl McCall"
            ],
            [
                "Dennis Mehiel",
                "Alan Hevesi"
            ],
            [
                "David Paterson",
                "Alan Hevesi"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (party:`election.party`)\nWHERE party.Party = 'Democratic'\nRETURN party.Lieutenant_Governor,party.Comptroller",
        "question": "Who are the lieutenant governor and comptroller from the democratic party?",
        "answers": [
            [
                "Sandra Frankel",
                "Carl McCall"
            ],
            [
                "Dennis Mehiel",
                "Alan Hevesi"
            ],
            [
                "David Paterson",
                "Alan Hevesi"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (party:`election.party`)\nWHERE party.Governor = 'Eliot Spitzer'\nRETURN DISTINCT party.Year",
        "question": "In which distinct years was the governor \"Eliot Spitzer\"?",
        "answers": [
            [
                2006.0
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (party:`election.party`)\nWHERE party.Governor = 'Eliot Spitzer'\nRETURN DISTINCT party.Year",
        "question": "Find the distinct years when the governor was named \"Eliot Spitzer\".",
        "answers": [
            [
                2006.0
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.county`)-[]-(T2:`election.election`)\nRETURN T2.Delegate,T1.County_name",
        "question": "Show the delegates and the names of county they belong to.",
        "answers": [
            [
                "Miller, Warren E. Warren E. Miller",
                "Howard"
            ],
            [
                "Bates, Gail H. Gail H. Bates",
                "Howard"
            ],
            [
                "Pendergrass, Shane E. Shane Pendergrass",
                "Howard"
            ],
            [
                "DeBoy, Steven J. Sr. Steven J. DeBoy, Sr.",
                "Baltimore County"
            ],
            [
                "Bobo, Elizabeth Elizabeth Bobo",
                "Baltimore County"
            ],
            [
                "Turner, Frank S. Frank S. Turner",
                "Colony"
            ],
            [
                "Malone, James E. Jr. James E. Malone, Jr.",
                "Colony"
            ],
            [
                "Guzzone, Guy Guy Guzzone",
                "Mansfield"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.county`)-[]-(T2:`election.election`)\nRETURN T2.Delegate,T1.County_name",
        "question": "What are the delegate and name of the county they belong to, for each county?",
        "answers": [
            [
                "Miller, Warren E. Warren E. Miller",
                "Howard"
            ],
            [
                "Bates, Gail H. Gail H. Bates",
                "Howard"
            ],
            [
                "Pendergrass, Shane E. Shane Pendergrass",
                "Howard"
            ],
            [
                "DeBoy, Steven J. Sr. Steven J. DeBoy, Sr.",
                "Baltimore County"
            ],
            [
                "Bobo, Elizabeth Elizabeth Bobo",
                "Baltimore County"
            ],
            [
                "Turner, Frank S. Frank S. Turner",
                "Colony"
            ],
            [
                "Malone, James E. Jr. James E. Malone, Jr.",
                "Colony"
            ],
            [
                "Guzzone, Guy Guy Guzzone",
                "Mansfield"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.county`)-[]-(T2:`election.election`)\nWHERE T1.Population < 100000\nRETURN T2.Delegate",
        "question": "Which delegates are from counties with population smaller than 100000?",
        "answers": [
            [
                "Miller, Warren E. Warren E. Miller"
            ],
            [
                "Bates, Gail H. Gail H. Bates"
            ],
            [
                "Pendergrass, Shane E. Shane Pendergrass"
            ],
            [
                "DeBoy, Steven J. Sr. Steven J. DeBoy, Sr."
            ],
            [
                "Bobo, Elizabeth Elizabeth Bobo"
            ],
            [
                "Turner, Frank S. Frank S. Turner"
            ],
            [
                "Malone, James E. Jr. James E. Malone, Jr."
            ],
            [
                "Guzzone, Guy Guy Guzzone"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.county`)-[]-(T2:`election.election`)\nWHERE T1.Population < 100000\nRETURN T2.Delegate",
        "question": "Find the delegates who are from counties with population below 100000.",
        "answers": [
            [
                "Miller, Warren E. Warren E. Miller"
            ],
            [
                "Bates, Gail H. Gail H. Bates"
            ],
            [
                "Pendergrass, Shane E. Shane Pendergrass"
            ],
            [
                "DeBoy, Steven J. Sr. Steven J. DeBoy, Sr."
            ],
            [
                "Bobo, Elizabeth Elizabeth Bobo"
            ],
            [
                "Turner, Frank S. Frank S. Turner"
            ],
            [
                "Malone, James E. Jr. James E. Malone, Jr."
            ],
            [
                "Guzzone, Guy Guy Guzzone"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.county`)-[]-(T2:`election.election`)\nWHERE T1.Population > 50000\nRETURN count(DISTINCT T2.Delegate)",
        "question": "How many distinct delegates are from counties with population larger than 50000?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.county`)-[]-(T2:`election.election`)\nWHERE T1.Population > 50000\nRETURN count(DISTINCT T2.Delegate)",
        "question": "Count the number of distinct delegates who are from counties with population above 50000.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.county`)-[]-(T2:`election.election`)\nWHERE T2.Committee = 'Appropriations'\nRETURN T1.County_name",
        "question": "What are the names of the county that the delegates on \"Appropriations\" committee belong to?",
        "answers": [
            [
                "Howard"
            ],
            [
                "Baltimore County"
            ],
            [
                "Mansfield"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.county`)-[]-(T2:`election.election`)\nWHERE T2.Committee = 'Appropriations'\nRETURN T1.County_name",
        "question": "Which county do the delegates on \"Appropriations\" committee belong to? Give me the county names.",
        "answers": [
            [
                "Howard"
            ],
            [
                "Baltimore County"
            ],
            [
                "Mansfield"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.election`)-[]-(T2:`election.party`)\nRETURN T1.Delegate,T2.Party",
        "question": "Show the delegates and the names of the party they belong to.",
        "answers": [
            [
                "Bates, Gail H. Gail H. Bates",
                "Democratic"
            ],
            [
                "Guzzone, Guy Guy Guzzone",
                "Democratic"
            ],
            [
                "Miller, Warren E. Warren E. Miller",
                "Democratic"
            ],
            [
                "Malone, James E. Jr. James E. Malone, Jr.",
                "Liberal"
            ],
            [
                "DeBoy, Steven J. Sr. Steven J. DeBoy, Sr.",
                "Liberal"
            ],
            [
                "Bobo, Elizabeth Elizabeth Bobo",
                "Democratic"
            ],
            [
                "Pendergrass, Shane E. Shane Pendergrass",
                "Independence"
            ],
            [
                "Turner, Frank S. Frank S. Turner",
                "Working Families"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.election`)-[]-(T2:`election.party`)\nRETURN T1.Delegate,T2.Party",
        "question": "For each delegate, find the names of the party they are part of.",
        "answers": [
            [
                "Bates, Gail H. Gail H. Bates",
                "Democratic"
            ],
            [
                "Guzzone, Guy Guy Guzzone",
                "Democratic"
            ],
            [
                "Miller, Warren E. Warren E. Miller",
                "Democratic"
            ],
            [
                "Malone, James E. Jr. James E. Malone, Jr.",
                "Liberal"
            ],
            [
                "DeBoy, Steven J. Sr. Steven J. DeBoy, Sr.",
                "Liberal"
            ],
            [
                "Bobo, Elizabeth Elizabeth Bobo",
                "Democratic"
            ],
            [
                "Pendergrass, Shane E. Shane Pendergrass",
                "Independence"
            ],
            [
                "Turner, Frank S. Frank S. Turner",
                "Working Families"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.election`)-[]-(T2:`election.party`)\nWHERE T1.District = 1\nRETURN T2.Governor",
        "question": "Who were the governors of the parties associated with delegates from district 1?",
        "answers": [
            [
                "Peter Vallone"
            ],
            [
                "Peter Vallone"
            ],
            [
                "Tom Golisano"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.election`)-[]-(T2:`election.party`)\nWHERE T1.District = 1\nRETURN T2.Governor",
        "question": "Find the parties associated with the delegates from district 1. Who served as governors of the parties?",
        "answers": [
            [
                "Peter Vallone"
            ],
            [
                "Peter Vallone"
            ],
            [
                "Tom Golisano"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.election`)-[]-(T2:`election.party`)\nWHERE T1.District = 1 OR T1.District = 2\nRETURN T2.Comptroller",
        "question": "Who were the comptrollers of the parties associated with the delegates from district 1 or district 2?",
        "answers": [
            [
                "Carl McCall"
            ],
            [
                "Carl McCall"
            ],
            [
                "Carl McCall"
            ],
            [
                "Alan Hevesi"
            ],
            [
                "John Faso"
            ]
        ]
    },
    {
        "db_id": "election",
        "query": "MATCH (T1:`election.election`)-[]-(T2:`election.party`)\nWHERE T1.District = 1 OR T1.District = 2\nRETURN T2.Comptroller",
        "question": "Find the parties associated with the delegates from district 1 or 2. Who served as comptrollers of the parties?",
        "answers": [
            [
                "Carl McCall"
            ],
            [
                "Carl McCall"
            ],
            [
                "Carl McCall"
            ],
            [
                "Alan Hevesi"
            ],
            [
                "John Faso"
            ]
        ]
    }
]