[
    {
        "question": "How many settlements does each claim correspond to? List the claim id and the number of settlements.",
        "query": "MATCH (T1:`insurance_policies.Claims`)-[]-(T2:`insurance_policies.Settlements`)\nWITH T1.Claim_ID AS Claim_ID, count(T1.Claim_ID) AS count\nRETURN Claim_ID,count",
        "db_id": "insurance_policies",
        "answers": [
            [
                486,
                2
            ],
            [
                563,
                1
            ],
            [
                569,
                1
            ],
            [
                571,
                1
            ],
            [
                621,
                2
            ],
            [
                761,
                2
            ],
            [
                801,
                4
            ],
            [
                843,
                1
            ],
            [
                957,
                1
            ]
        ]
    },
    {
        "question": "Which claim incurred the most number of settlements? List the claim id, the date the claim was made, and the number.",
        "query": "MATCH (T1:`insurance_policies.Claims`)-[]-(T2:`insurance_policies.Settlements`)\nWITH T1.Claim_ID AS Claim_ID, T1.Date_Claim_Made AS Date_Claim_Made, count(T1.Claim_ID) AS count\nRETURN Claim_ID,Date_Claim_Made,count\nORDER BY count DESC\nLIMIT 1",
        "db_id": "insurance_policies",
        "answers": [
            [
                801,
                "2017-10-21",
                4
            ]
        ]
    },
    {
        "question": "Tell me the the date when the first claim was made.",
        "query": "MATCH (claims:`insurance_policies.Claims`)\nRETURN claims.Date_Claim_Made\nORDER BY claims.Date_Claim_Made ASC\nLIMIT 1",
        "db_id": "insurance_policies",
        "answers": [
            [
                "2016-08-02"
            ]
        ]
    },
    {
        "question": "Who are the customers that had more than 1 policy? List the customer details and id.",
        "query": "MATCH (T1:`insurance_policies.Customers`)-[]-(T2:`insurance_policies.Customer_Policies`)\nWITH count(*) AS count, T1.Customer_ID AS Customer_ID, T1.Customer_Details AS Customer_Details\nWHERE count  > 1\nRETURN Customer_Details,Customer_ID",
        "db_id": "insurance_policies",
        "answers": [
            [
                "Ellsworth Paucek",
                2
            ],
            [
                "Mrs. Hanna Willms",
                3
            ],
            [
                "Dr. Diana Rath",
                4
            ],
            [
                "Lauriane Ferry PhD",
                6
            ]
        ]
    },
    {
        "question": "Tell me the the claim date and settlement date for each settlement case.",
        "query": "MATCH (settlements:`insurance_policies.Settlements`)\nRETURN settlements.Date_Claim_Made,settlements.Date_Claim_Settled",
        "db_id": "insurance_policies",
        "answers": [
            [
                "2018-08-07",
                "2018-01-16"
            ],
            [
                "2017-08-27",
                "2018-02-04"
            ],
            [
                "2016-09-05",
                "2018-03-02"
            ],
            [
                "2016-05-18",
                "2018-02-11"
            ],
            [
                "2017-05-19",
                "2017-10-06"
            ],
            [
                "2018-11-10",
                "2018-02-15"
            ],
            [
                "2018-05-12",
                "2017-11-30"
            ],
            [
                "2016-07-04",
                "2018-02-20"
            ],
            [
                "2017-04-18",
                "2017-12-24"
            ],
            [
                "2017-07-31",
                "2018-01-27"
            ],
            [
                "2017-09-22",
                "2018-02-14"
            ],
            [
                "2017-03-04",
                "2018-02-20"
            ],
            [
                "2017-04-14",
                "2017-11-15"
            ],
            [
                "2017-03-29",
                "2018-02-20"
            ],
            [
                "2016-07-19",
                "2017-11-04"
            ]
        ]
    },
    {
        "question": "What is the most popular payment method?",
        "query": "MATCH (payments:`insurance_policies.Payments`)\nWITH payments.Payment_Method_Code AS Payment_Method_Code, count(payments.Payment_Method_Code) AS count\nRETURN Payment_Method_Code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "insurance_policies",
        "answers": [
            [
                "MasterCard"
            ]
        ]
    },
    {
        "question": "Which payment method is used the most often?",
        "query": "MATCH (payments:`insurance_policies.Payments`)\nWITH payments.Payment_Method_Code AS Payment_Method_Code, count(payments.Payment_Method_Code) AS count\nRETURN Payment_Method_Code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "insurance_policies",
        "answers": [
            [
                "MasterCard"
            ]
        ]
    },
    {
        "question": "Return the distinct customer details.",
        "query": "MATCH (customers:`insurance_policies.Customers`)\nRETURN DISTINCT customers.Customer_Details",
        "db_id": "insurance_policies",
        "answers": [
            [
                "America Jaskolski"
            ],
            [
                "Ellsworth Paucek"
            ],
            [
                "Mrs. Hanna Willms"
            ],
            [
                "Dr. Diana Rath"
            ],
            [
                "Selena Gerhold"
            ],
            [
                "Lauriane Ferry PhD"
            ],
            [
                "Sydnie Friesen"
            ],
            [
                "Dayana Robel"
            ],
            [
                "Mr. Edwardo Blanda I"
            ],
            [
                "Augustine Kerluke"
            ],
            [
                "Buddy Marquardt"
            ],
            [
                "Mr. Randal Lynch III"
            ],
            [
                "Mrs. Liza Heller V"
            ],
            [
                "Mrs. Lilly Graham III"
            ],
            [
                "Miss Felicita Reichel"
            ]
        ]
    },
    {
        "question": "Find the policy type the most customers choose.",
        "query": "MATCH (customer_policies:`insurance_policies.Customer_Policies`)\nWITH count(customer_policies.Policy_Type_Code) AS count, customer_policies.Policy_Type_Code AS Policy_Type_Code\nRETURN Policy_Type_Code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "insurance_policies",
        "answers": [
            [
                "Travel"
            ]
        ]
    },
    {
        "question": "Count the total number of settlements made.",
        "query": "MATCH (settlements:`insurance_policies.Settlements`)\nRETURN count(*)",
        "db_id": "insurance_policies",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Which Payments were processed with Visa? List the payment Id, the date and the amount.",
        "query": "MATCH (payments:`insurance_policies.Payments`)\nWHERE payments.Payment_Method_Code = 'Visa'\nRETURN payments.Payment_ID,payments.Date_Payment_Made,payments.Amount_Payment",
        "db_id": "insurance_policies",
        "answers": [
            [
                678,
                "2017-12-16",
                459407
            ],
            [
                754,
                "2018-02-24",
                7343
            ],
            [
                779,
                "2017-05-28",
                155654
            ],
            [
                791,
                "2017-05-03",
                172309
            ]
        ]
    },
    {
        "question": "List the date the claim was made, the date it was settled and the amount settled for all the claims which had exactly one settlement.",
        "query": "MATCH (T1:`insurance_policies.Claims`)-[]-(T2:`insurance_policies.Settlements`)\nWITH count(*) AS count, T1.Claim_ID AS Claim_ID, T1.Date_Claim_Made AS Date_Claim_Made, T1.Date_Claim_Settled AS Date_Claim_Settled\nWHERE count  = 1\nRETURN Claim_ID,Date_Claim_Made,Date_Claim_Settled",
        "db_id": "insurance_policies",
        "answers": [
            [
                563,
                "2016-08-02",
                "2017-09-04"
            ],
            [
                569,
                "2018-07-15",
                "2017-11-19"
            ],
            [
                571,
                "2017-08-03",
                "2018-02-18"
            ],
            [
                843,
                "2017-10-14",
                "2018-02-20"
            ],
            [
                957,
                "2018-11-08",
                "2017-09-15"
            ]
        ]
    },
    {
        "question": "What are names of patients who made an appointment?",
        "query": "MATCH (T1:`hospital_1.Appointment`)-[]-(T2:`hospital_1.Patient`)\nRETURN T2.Name",
        "db_id": "hospital_1",
        "answers": [
            [
                "John Smith"
            ],
            [
                "John Smith"
            ],
            [
                "John Smith"
            ],
            [
                "Grace Ritchie"
            ],
            [
                "Grace Ritchie"
            ],
            [
                "Random J. Patient"
            ],
            [
                "Dennis Doe"
            ],
            [
                "Dennis Doe"
            ],
            [
                "Dennis Doe"
            ]
        ]
    },
    {
        "question": "what are name and phone number of patients who had more than one appointment?",
        "query": "MATCH (T1:`hospital_1.Appointment`)-[]-(T2:`hospital_1.Patient`)\nWITH count(*) AS count, T2.Phone AS Phone, T2.Name AS Name\nWHERE count  > 1\nRETURN Name,Phone",
        "db_id": "hospital_1",
        "answers": [
            [
                "John Smith",
                "555-0256"
            ],
            [
                "Grace Ritchie",
                "555-0512"
            ],
            [
                "Dennis Doe",
                "555-2048"
            ]
        ]
    },
    {
        "question": "List the name of physicians who took some appointment.",
        "query": "MATCH (T1:`hospital_1.Appointment`)-[]-(T2:`hospital_1.Physician`)\nRETURN T2.Name",
        "db_id": "hospital_1",
        "answers": [
            [
                "John Dorian"
            ],
            [
                "Elliot Reid"
            ],
            [
                "John Dorian"
            ],
            [
                "Percival Cox"
            ],
            [
                "Percival Cox"
            ],
            [
                "Elliot Reid"
            ],
            [
                "Christopher Turk"
            ],
            [
                "Molly Clock"
            ],
            [
                "Elliot Reid"
            ]
        ]
    },
    {
        "question": "Find the names of all physicians and their primary affiliated departments' names.",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Affiliated_With`]-(T3:`hospital_1.Department`)\nWHERE T2.PrimaryAffiliation = 1\nRETURN T1.Name,T3.Name",
        "db_id": "hospital_1",
        "answers": [
            [
                "Bob Kelso",
                "General Medicine"
            ],
            [
                "Elliot Reid",
                "General Medicine"
            ],
            [
                "Keith Dudemeister",
                "General Medicine"
            ],
            [
                "John Dorian",
                "General Medicine"
            ],
            [
                "Percival Cox",
                "General Medicine"
            ],
            [
                "Todd Quinlan",
                "Surgery"
            ],
            [
                "John Wen",
                "Surgery"
            ],
            [
                "Christopher Turk",
                "Surgery"
            ],
            [
                "Molly Clock",
                "Psychiatry"
            ]
        ]
    },
    {
        "question": "Find the name of the patient who made the appointment with the most recent start date.",
        "query": "MATCH (T1:`hospital_1.Patient`)-[]-(T2:`hospital_1.Appointment`)\nRETURN T1.Name\nORDER BY T2.Start DESC\nLIMIT 1",
        "db_id": "hospital_1",
        "answers": [
            [
                "Dennis Doe"
            ]
        ]
    },
    {
        "question": "Count the number of patients who stayed in room 112.",
        "query": "MATCH (stay:`hospital_1.Stay`)\nWHERE stay.Room = 112\nRETURN count(stay.Patient)",
        "db_id": "hospital_1",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "question": "Find the patient who most recently stayed in room 111.",
        "query": "MATCH (stay:`hospital_1.Stay`)\nWHERE stay.Room = 111\nRETURN stay.Patient\nORDER BY stay.StayStart DESC\nLIMIT 1",
        "db_id": "hospital_1",
        "answers": [
            [
                100000001
            ]
        ]
    },
    {
        "question": "What is the name of the nurse has the most appointments?",
        "query": "MATCH (T1:`hospital_1.Nurse`)-[]-(T2:`hospital_1.Appointment`)\nWITH T1.Name AS Name, count(T1.EmployeeID) AS count\nRETURN Name\nORDER BY count DESC\nLIMIT 1",
        "db_id": "hospital_1",
        "answers": [
            [
                "Carla Espinosa"
            ]
        ]
    },
    {
        "question": "How many patients do each physician take care of? List their names and number of patients they take care of.",
        "query": "MATCH (T1:`hospital_1.Physician`)-[]-(T2:`hospital_1.Patient`)\nWITH T1.Name AS Name, count(T1.EmployeeID) AS count\nRETURN Name,count",
        "db_id": "hospital_1",
        "answers": [
            [
                "John Dorian",
                1
            ],
            [
                "Elliot Reid",
                2
            ],
            [
                "Christopher Turk",
                1
            ]
        ]
    },
    {
        "question": "Find the name of physicians who are in charge of more than one patient.",
        "query": "MATCH (T1:`hospital_1.Physician`)-[]-(T2:`hospital_1.Patient`)\nWITH T1.Name AS Name, count(*) AS count\nWHERE count  > 1\nRETURN Name",
        "db_id": "hospital_1",
        "answers": [
            [
                "Elliot Reid"
            ]
        ]
    },
    {
        "question": "Tell me the distinct block codes where some rooms are available.",
        "query": "MATCH (room:`hospital_1.Room`)\nWHERE room.Unavailable = 0\nRETURN DISTINCT room.BlockCode",
        "db_id": "hospital_1",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ]
        ]
    },
    {
        "question": "Find the number of distinct room types available.",
        "query": "MATCH (room:`hospital_1.Room`)\nRETURN count(DISTINCT room.RoomType)",
        "db_id": "hospital_1",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "question": "Find the number of medications prescribed for each brand.",
        "query": "MATCH (T1:`hospital_1.Medication`)-[]-(T2:`hospital_1.Prescribes`)\nWITH T1.Name AS Name, count(T1.Brand) AS count\nRETURN count,Name",
        "db_id": "hospital_1",
        "answers": [
            [
                1,
                "Procrastin-X"
            ],
            [
                2,
                "Thesisin"
            ]
        ]
    },
    {
        "question": "Find the name of physicians whose position title contains the word 'senior'.",
        "query": "MATCH (physician:`hospital_1.Physician`)\nWHERE physician.Position =~'.*[S|s]enior.*'\nRETURN physician.Name",
        "db_id": "hospital_1",
        "answers": [
            [
                "Percival Cox"
            ]
        ]
    },
    {
        "question": "Find the names of nurses who are nursing an undergoing treatment.",
        "query": "MATCH (T1:`hospital_1.Undergoes`)-[]-(T2:`hospital_1.Nurse`)\nRETURN DISTINCT T2.Name",
        "db_id": "hospital_1",
        "answers": [
            [
                "Carla Espinosa"
            ],
            [
                "Laverne Roberts"
            ],
            [
                "Paul Flowers"
            ]
        ]
    },
    {
        "question": "List the names of all distinct medications, ordered in an alphabetical order.",
        "query": "MATCH (medication:`hospital_1.Medication`)\nRETURN DISTINCT medication.Name\nORDER BY medication.Name",
        "db_id": "hospital_1",
        "answers": [
            [
                "Awakin"
            ],
            [
                "Crescavitin"
            ],
            [
                "Melioraurin"
            ],
            [
                "Procrastin-X"
            ],
            [
                "Thesisin"
            ]
        ]
    },
    {
        "question": "Tell me the highest, lowest, and average cost of procedures.",
        "query": "MATCH (procedures:`hospital_1.Procedures`)\nRETURN max(procedures.Cost),min(procedures.Cost),avg(procedures.Cost)",
        "db_id": "hospital_1",
        "answers": [
            [
                10000.0,
                25.0,
                4324.857142857143
            ]
        ]
    },
    {
        "question": "List the name and cost of all procedures sorted by the cost from the highest to the lowest.",
        "query": "MATCH (procedures:`hospital_1.Procedures`)\nRETURN procedures.Name,procedures.Cost\nORDER BY procedures.Cost DESC",
        "db_id": "hospital_1",
        "answers": [
            [
                "Complete Walletectomy",
                10000.0
            ],
            [
                "Reversible Pancreomyoplasty",
                5600.0
            ],
            [
                "Obfuscated Dermogastrotomy",
                4899.0
            ],
            [
                "Folded Demiophtalmectomy",
                4500.0
            ],
            [
                "Obtuse Pyloric Recombobulation",
                3750.0
            ],
            [
                "Reverse Rhinopodoplasty",
                1500.0
            ],
            [
                "Follicular Demiectomy",
                25.0
            ]
        ]
    },
    {
        "question": "Find the three most expensive procedures.",
        "query": "MATCH (procedures:`hospital_1.Procedures`)\nRETURN procedures.Name\nORDER BY procedures.Cost\nLIMIT 3",
        "db_id": "hospital_1",
        "answers": [
            [
                "Follicular Demiectomy"
            ],
            [
                "Reverse Rhinopodoplasty"
            ],
            [
                "Obtuse Pyloric Recombobulation"
            ]
        ]
    },
    {
        "question": "Find the physicians who are trained in a procedure that costs more than 5000.",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Trained_In`]-(T3:`hospital_1.Procedures`)\nWHERE T3.Cost > 5000\nRETURN T1.Name",
        "db_id": "hospital_1",
        "answers": [
            [
                "John Wen"
            ],
            [
                "Todd Quinlan"
            ],
            [
                "Christopher Turk"
            ],
            [
                "John Wen"
            ]
        ]
    },
    {
        "question": "Which physician was trained in the procedure that costs the most.",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Trained_In`]-(T3:`hospital_1.Procedures`)\nRETURN T1.Name\nORDER BY T3.Cost DESC\nLIMIT 1",
        "db_id": "hospital_1",
        "answers": [
            [
                "John Wen"
            ]
        ]
    },
    {
        "question": "What is the average cost of procedures that physician John Wen was trained in?",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Trained_In`]-(T3:`hospital_1.Procedures`)\nWHERE T1.Name = 'John Wen'\nRETURN avg(T3.Cost)",
        "db_id": "hospital_1",
        "answers": [
            [
                4324.857142857143
            ]
        ]
    },
    {
        "question": "Find the names of procedures which physician John Wen was trained in.",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Trained_In`]-(T3:`hospital_1.Procedures`)\nWHERE T1.Name = 'John Wen'\nRETURN T3.Name",
        "db_id": "hospital_1",
        "answers": [
            [
                "Reverse Rhinopodoplasty"
            ],
            [
                "Obfuscated Dermogastrotomy"
            ],
            [
                "Follicular Demiectomy"
            ],
            [
                "Folded Demiophtalmectomy"
            ],
            [
                "Complete Walletectomy"
            ],
            [
                "Obtuse Pyloric Recombobulation"
            ],
            [
                "Reversible Pancreomyoplasty"
            ]
        ]
    },
    {
        "question": "Find all procedures which cost more than 1000 or which physician John Wen was trained in.",
        "query": "MATCH (procedures:`hospital_1.Procedures`)\nWHERE procedures.Cost > 1000\nRETURN procedures.Name  AS name \nUNION\nMATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Trained_In`]-(T3:`hospital_1.Procedures`)\nWHERE T1.Name = 'John Wen'\nRETURN T3.Name  AS name",
        "db_id": "hospital_1",
        "answers": [
            [
                "Reverse Rhinopodoplasty"
            ],
            [
                "Obtuse Pyloric Recombobulation"
            ],
            [
                "Folded Demiophtalmectomy"
            ],
            [
                "Complete Walletectomy"
            ],
            [
                "Obfuscated Dermogastrotomy"
            ],
            [
                "Reversible Pancreomyoplasty"
            ],
            [
                "Follicular Demiectomy"
            ]
        ]
    },
    {
        "question": "Find the name of physicians who are affiliated with Surgery or Psychiatry department.",
        "query": "MATCH (T1:`hospital_1.Physician`)-[T2:`hospital_1.Affiliated_With`]-(T3:`hospital_1.Department`)\nWHERE T3.Name = 'Surgery' OR T3.Name = 'Psychiatry'\nRETURN T1.Name",
        "db_id": "hospital_1",
        "answers": [
            [
                "Todd Quinlan"
            ],
            [
                "John Wen"
            ],
            [
                "Christopher Turk"
            ],
            [
                "Molly Clock"
            ]
        ]
    },
    {
        "question": "Count how many appointments have been made in total.",
        "query": "MATCH (appointment:`hospital_1.Appointment`)\nRETURN count(*)",
        "db_id": "hospital_1",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "question": "List the name of ships in ascending order of tonnage.",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN ship.Name\nORDER BY ship.Tonnage ASC",
        "db_id": "ship_mission",
        "answers": [
            [
                "Ariadne"
            ],
            [
                "Farringford"
            ],
            [
                "Author"
            ],
            [
                "Trader"
            ],
            [
                "Dromonby"
            ],
            [
                "Corbridge"
            ],
            [
                "Clan McTavish"
            ],
            [
                "Appam"
            ]
        ]
    },
    {
        "question": "List the name of ships whose nationality is not \"United States\".",
        "query": "MATCH (ship:`ship_mission.ship`)\nWHERE ship.Nationality <> 'United States'\nRETURN ship.Name",
        "db_id": "ship_mission",
        "answers": [
            [
                "Corbridge"
            ],
            [
                "Dromonby"
            ],
            [
                "Author"
            ],
            [
                "Trader"
            ],
            [
                "Appam"
            ]
        ]
    },
    {
        "question": "Show the name of ships whose nationality is either United States or United Kingdom.",
        "query": "MATCH (ship:`ship_mission.ship`)\nWHERE ship.Nationality = 'United States' OR ship.Nationality = 'United Kingdom'\nRETURN ship.Name",
        "db_id": "ship_mission",
        "answers": [
            [
                "Corbridge"
            ],
            [
                "Farringford"
            ],
            [
                "Dromonby"
            ],
            [
                "Author"
            ],
            [
                "Trader"
            ],
            [
                "Ariadne"
            ],
            [
                "Appam"
            ],
            [
                "Clan McTavish"
            ]
        ]
    },
    {
        "question": "Show different types of ships and the number of ships of each type.",
        "query": "MATCH (ship:`ship_mission.ship`)\nWITH ship.Type AS Type, count(ship.Type) AS count\nRETURN Type,count",
        "db_id": "ship_mission",
        "answers": [
            [
                "Cargo ship",
                5
            ],
            [
                "Battle ship",
                3
            ]
        ]
    },
    {
        "question": "Please show the most common type of ships.",
        "query": "MATCH (ship:`ship_mission.ship`)\nWITH ship.Type AS Type, count(ship.Type) AS count\nRETURN Type\nORDER BY count DESC\nLIMIT 1",
        "db_id": "ship_mission",
        "answers": [
            [
                "Cargo ship"
            ]
        ]
    },
    {
        "question": "List the nations that have more than two ships.",
        "query": "MATCH (ship:`ship_mission.ship`)\nWITH ship.Nationality AS Nationality, count(*) AS count\nWHERE count  > 2\nRETURN Nationality",
        "db_id": "ship_mission",
        "answers": [
            [
                "United Kingdom"
            ],
            [
                "United States"
            ]
        ]
    },
    {
        "question": "Show codes and fates of missions, and names of ships involved.",
        "query": "MATCH (T1:`ship_mission.mission`)-[]-(T2:`ship_mission.ship`)\nRETURN T1.Code,T1.Fate,T2.Name",
        "db_id": "ship_mission",
        "answers": [
            [
                "VMV-1",
                "Decommissioned 1950",
                "Corbridge"
            ],
            [
                "VMV-2",
                "Decommissioned 1950",
                "Farringford"
            ],
            [
                "VMV-3",
                "Lost (burned) 1931",
                "Dromonby"
            ],
            [
                "VMV-4 Former: Sterling",
                "Retired 1939",
                "Trader"
            ],
            [
                "VMV-5",
                "Decommissioned 1959",
                "Ariadne"
            ],
            [
                "VMV-6",
                "Decommissioned 1960",
                "Appam"
            ],
            [
                "VMV-7",
                "Lost (burned and sunk) 1933",
                "Clan McTavish"
            ]
        ]
    },
    {
        "question": "Show names of ships involved in a mission launched after 1928.",
        "query": "MATCH (T1:`ship_mission.mission`)-[]-(T2:`ship_mission.ship`)\nWHERE T1.Launched_Year > 1928\nRETURN T2.Name",
        "db_id": "ship_mission",
        "answers": [
            [
                "Corbridge"
            ],
            [
                "Farringford"
            ],
            [
                "Dromonby"
            ],
            [
                "Ariadne"
            ],
            [
                "Appam"
            ],
            [
                "Clan McTavish"
            ]
        ]
    },
    {
        "question": "Show the distinct fate of missions that involve ships with nationality \"United States\"",
        "query": "MATCH (T1:`ship_mission.mission`)-[]-(T2:`ship_mission.ship`)\nWHERE T2.Nationality = 'United States'\nRETURN DISTINCT T1.Fate",
        "db_id": "ship_mission",
        "answers": [
            [
                "Decommissioned 1950"
            ],
            [
                "Decommissioned 1959"
            ],
            [
                "Lost (burned and sunk) 1933"
            ]
        ]
    },
    {
        "question": "List the name of ships that are not involved in any mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nWHERE NOT (ship:`ship_mission.ship`)-[]-(:`ship_mission.mission`)\nRETURN ship.Name",
        "db_id": "ship_mission",
        "answers": [
            [
                "Author"
            ]
        ]
    },
    {
        "question": "Find the number of students in total.",
        "query": "MATCH (list:`student_1.list`)\nRETURN count(*)",
        "db_id": "student_1",
        "answers": [
            [
                60
            ]
        ]
    },
    {
        "question": "Find the last names of students studying in room 111.",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Classroom = 111\nRETURN list.LastName",
        "db_id": "student_1",
        "answers": [
            [
                "DANESE"
            ],
            [
                "GOODNOE"
            ],
            [
                "LEAPER"
            ],
            [
                "FULVIO"
            ]
        ]
    },
    {
        "question": "Find the first names of students studying in room 108.",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Classroom = 108\nRETURN list.FirstName",
        "db_id": "student_1",
        "answers": [
            [
                " LYNNETTE"
            ],
            [
                " BRITT"
            ]
        ]
    },
    {
        "question": "List the first names of all the students in room 107.",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Classroom = 107\nRETURN DISTINCT list.FirstName",
        "db_id": "student_1",
        "answers": [
            [
                " SHERWOOD"
            ],
            [
                " ROBBY"
            ],
            [
                " CRYSTA"
            ],
            [
                " VERTIE"
            ],
            [
                " CHRISSY"
            ],
            [
                " JORDON"
            ]
        ]
    }
]