[
    {
        "question": "Show all main industry for all companies.",
        "query": "MATCH (company:`gas_company.company`)\nRETURN DISTINCT company.Main_Industry",
        "db_id": "gas_company",
        "answers": [
            [
                "Oil and gas"
            ],
            [
                "Conglomerate"
            ],
            [
                "Banking"
            ]
        ]
    },
    {
        "question": "List all headquarters and the number of companies in each headquarter.",
        "query": "MATCH (company:`gas_company.company`)\nWITH company.Headquarters AS Headquarters, count(company.Headquarters) AS count\nRETURN Headquarters,count",
        "db_id": "gas_company",
        "answers": [
            [
                "USA",
                4
            ],
            [
                "Netherlands",
                1
            ],
            [
                "China",
                2
            ],
            [
                "UK",
                2
            ],
            [
                "Brazil",
                1
            ]
        ]
    },
    {
        "question": "Show gas station id, location, and manager_name for all gas stations ordered by open year.",
        "query": "MATCH (gas_station:`gas_company.gas_station`)\nRETURN gas_station.Station_ID,gas_station.Location,gas_station.Manager_Name\nORDER BY gas_station.Open_Year",
        "db_id": "gas_company",
        "answers": [
            [
                1,
                "Herne Hill",
                "BrianWingrave"
            ],
            [
                2,
                "Channel Hill",
                "SimonMarloe"
            ],
            [
                3,
                "Reading North",
                "Simon Cope Derek Marloe"
            ],
            [
                4,
                "Herne St",
                "Colin Denman"
            ],
            [
                5,
                "Reading",
                "Colin Denman"
            ],
            [
                6,
                "Herne Ave",
                "Tom Whit"
            ],
            [
                7,
                "Hennry Hill",
                "Bryan Taylor"
            ],
            [
                8,
                "Jane Ave",
                "BryanDenman"
            ],
            [
                9,
                "Maindy Hill",
                "Tony Bristow"
            ],
            [
                10,
                "Maindy Ave",
                "Luke Rowe"
            ],
            [
                11,
                "Newport Rd",
                "Jon Rowe"
            ]
        ]
    },
    {
        "question": "Show all locations and the number of gas stations in each location ordered by the count.",
        "query": "MATCH (gas_station:`gas_company.gas_station`)\nWITH gas_station.Location AS Location, count(gas_station.Location) AS count\nRETURN Location,count\nORDER BY count",
        "db_id": "gas_company",
        "answers": [
            [
                "Herne Hill",
                1
            ],
            [
                "Channel Hill",
                1
            ],
            [
                "Reading North",
                1
            ],
            [
                "Herne St",
                1
            ],
            [
                "Reading",
                1
            ],
            [
                "Herne Ave",
                1
            ],
            [
                "Hennry Hill",
                1
            ],
            [
                "Jane Ave",
                1
            ],
            [
                "Maindy Hill",
                1
            ],
            [
                "Maindy Ave",
                1
            ],
            [
                "Newport Rd",
                1
            ]
        ]
    },
    {
        "question": "Show company name and main industry without a gas station.",
        "query": "MATCH (company:`gas_company.company`)\nWHERE NOT (company:`gas_company.company`)-[:`gas_company.station_company`]-()\nRETURN company.Company,company.Main_Industry",
        "db_id": "gas_company",
        "answers": [
            [
                "General Electric",
                "Conglomerate"
            ],
            [
                "Industrial and Commercial Bank of China",
                "Banking"
            ],
            [
                "HSBC",
                "Banking"
            ],
            [
                "Berkshire Hathaway",
                "Conglomerate"
            ],
            [
                "Wells Fargo",
                "Banking"
            ]
        ]
    },
    {
        "question": "Show the manager name with most number of gas stations opened after 2000.",
        "query": "MATCH (gas_station:`gas_company.gas_station`)\nWHERE gas_station.Open_Year > 2000\nWITH count(gas_station.Manager_Name) AS count, gas_station.Manager_Name AS Manager_Name\nRETURN Manager_Name\nORDER BY count DESC\nLIMIT 1",
        "db_id": "gas_company",
        "answers": [
            [
                "Colin Denman"
            ]
        ]
    },
    {
        "question": "order all gas station locations by the opening year.",
        "query": "MATCH (gas_station:`gas_company.gas_station`)\nRETURN gas_station.Location\nORDER BY gas_station.Open_Year",
        "db_id": "gas_company",
        "answers": [
            [
                "Herne Hill"
            ],
            [
                "Channel Hill"
            ],
            [
                "Reading North"
            ],
            [
                "Herne St"
            ],
            [
                "Reading"
            ],
            [
                "Herne Ave"
            ],
            [
                "Hennry Hill"
            ],
            [
                "Jane Ave"
            ],
            [
                "Maindy Hill"
            ],
            [
                "Maindy Ave"
            ],
            [
                "Newport Rd"
            ]
        ]
    },
    {
        "question": "find the rank, company names, market values of the companies in the banking industry order by their sales and profits in billion.",
        "query": "MATCH (company:`gas_company.company`)\nWHERE company.Main_Industry = 'Banking'\nRETURN company.Rank,company.Company,company.Market_Value\nORDER BY company.Sales_billion,company.Profits_billion",
        "db_id": "gas_company",
        "answers": [
            [
                5,
                "Industrial and Commercial Bank of China",
                237.4
            ],
            [
                9,
                "Wells Fargo",
                178.7
            ],
            [
                6,
                "HSBC",
                164.3
            ]
        ]
    },
    {
        "question": "Count the number of regions.",
        "query": "MATCH (region:`party_people.region`)\nRETURN count(*)",
        "db_id": "party_people",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "Count the number of different parties.",
        "query": "MATCH (party:`party_people.party`)\nRETURN count(DISTINCT party.Party_name)",
        "db_id": "party_people",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "Show the ministers and the time they took and left office, listed by the time they left office.",
        "query": "MATCH (party:`party_people.party`)\nRETURN party.Minister,party.Took_office,party.Left_office\nORDER BY party.Left_office",
        "db_id": "party_people",
        "answers": [
            [
                "Dr. Kwame Nkrumah (MP)",
                "1957",
                "1958"
            ],
            [
                "Kojo Botsio (MP)",
                "1958",
                "1959"
            ],
            [
                "Ebenezer Ako-Adjei (MP)",
                "1959",
                "1960"
            ],
            [
                "Imoru Egala (MP)",
                "1960",
                "1961"
            ],
            [
                "Ebenezer Ako-Adjei (MP)",
                "1961",
                "1962"
            ]
        ]
    },
    {
        "question": "Show all ministers who do not belong to Progress Party.",
        "query": "MATCH (party:`party_people.party`)\nWHERE party.Party_name <> 'Progress Party'\nRETURN party.Minister",
        "db_id": "party_people",
        "answers": [
            [
                "Dr. Kwame Nkrumah (MP)"
            ],
            [
                "Ebenezer Ako-Adjei (MP)"
            ],
            [
                "Imoru Egala (MP)"
            ],
            [
                "Ebenezer Ako-Adjei (MP)"
            ]
        ]
    },
    {
        "question": "Show all ministers and parties they belong to in descending order of the time they took office.",
        "query": "MATCH (party:`party_people.party`)\nRETURN party.Minister,party.Party_name\nORDER BY party.Took_office DESC",
        "db_id": "party_people",
        "answers": [
            [
                "Ebenezer Ako-Adjei (MP)",
                "Sinefine Party"
            ],
            [
                "Imoru Egala (MP)",
                "Convention Union Party"
            ],
            [
                "Ebenezer Ako-Adjei (MP)",
                "3"
            ],
            [
                "Kojo Botsio (MP)",
                "Progress Party"
            ],
            [
                "Dr. Kwame Nkrumah (MP)",
                "Convention Peoples Party"
            ]
        ]
    },
    {
        "question": "Return the minister who left office at the latest time.",
        "query": "MATCH (party:`party_people.party`)\nRETURN party.Minister\nORDER BY party.Left_office DESC\nLIMIT 1",
        "db_id": "party_people",
        "answers": [
            [
                "Ebenezer Ako-Adjei (MP)"
            ]
        ]
    },
    {
        "question": "Show all party names and their region names.",
        "query": "MATCH (T1:`party_people.party`)-[]-(T2:`party_people.region`)\nRETURN T1.Party_name,T2.Region_name",
        "db_id": "party_people",
        "answers": [
            [
                "Convention Peoples Party",
                "United Kingdom"
            ],
            [
                "Progress Party",
                "United Kingdom"
            ],
            [
                "3",
                "Japan"
            ],
            [
                "Convention Union Party",
                "United States"
            ],
            [
                "Sinefine Party",
                "United States"
            ]
        ]
    },
    {
        "question": "Count the number of party events.",
        "query": "MATCH (party_events:`party_people.party_events`)\nRETURN count(*)",
        "db_id": "party_people",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "question": "find the event names that have more than 2 records.",
        "query": "MATCH (party_events:`party_people.party_events`)\nWITH count(*) AS count, party_events.Event_Name AS Event_Name\nWHERE count  > 2\nRETURN Event_Name",
        "db_id": "party_people",
        "answers": [
            [
                "Annaual Meeting"
            ]
        ]
    },
    {
        "question": "List the names of pilots in ascending order of rank.",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nRETURN pilot.Pilot_name\nORDER BY pilot.Rank ASC",
        "db_id": "pilot_record",
        "answers": [
            [
                "Jermaine O'Neal"
            ],
            [
                "Patrick O'Bryant"
            ],
            [
                "Charles Oakley"
            ],
            [
                "Hakeem Olajuwon"
            ],
            [
                "Dan O'Sullivan"
            ]
        ]
    },
    {
        "question": "List the distinct positions of pilots older than 30.",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nWHERE pilot.Age > 30\nRETURN DISTINCT pilot.Position",
        "db_id": "pilot_record",
        "answers": [
            [
                "Center Team"
            ],
            [
                "Forward-Center Team"
            ]
        ]
    },
    {
        "question": "Show the names of pilots from team \"Bradley\" or \"Fordham\".",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nWHERE pilot.Team = 'Bradley' OR pilot.Team = 'Fordham'\nRETURN pilot.Pilot_name",
        "db_id": "pilot_record",
        "answers": [
            [
                "Patrick O'Bryant"
            ],
            [
                "Dan O'Sullivan"
            ]
        ]
    },
    {
        "question": "What are the different nationalities of pilots? Show each nationality and the number of pilots of each nationality.",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nWITH pilot.Nationality AS Nationality, count(pilot.Nationality) AS count\nRETURN Nationality,count",
        "db_id": "pilot_record",
        "answers": [
            [
                "United States",
                3
            ],
            [
                "United Kindom",
                1
            ],
            [
                "Nigeria",
                1
            ]
        ]
    },
    {
        "question": "Show the most common nationality of pilots.",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nWITH pilot.Nationality AS Nationality, count(pilot.Nationality) AS count\nRETURN Nationality\nORDER BY count DESC\nLIMIT 1",
        "db_id": "pilot_record",
        "answers": [
            [
                "United States"
            ]
        ]
    },
    {
        "question": "List the names of pilots that do not have any record.",
        "query": "MATCH (pilot:`pilot_record.pilot`)\nWHERE NOT (pilot:`pilot_record.pilot`)-[:`pilot_record.pilot_record`]-()\nRETURN pilot.Pilot_name",
        "db_id": "pilot_record",
        "answers": [
            [
                "Hakeem Olajuwon"
            ]
        ]
    },
    {
        "question": "List all document ids and receipt dates of documents.",
        "query": "MATCH (documents:`cre_Doc_Control_Systems.Documents`)\nRETURN documents.document_id,documents.receipt_date",
        "db_id": "cre_Doc_Control_Systems",
        "answers": [
            [
                1,
                "2008-04-21 20:42:25"
            ],
            [
                2,
                "1974-05-08 00:00:46"
            ],
            [
                3,
                "2014-12-25 17:22:44"
            ],
            [
                4,
                "1973-11-05 21:48:53"
            ],
            [
                7,
                "1982-09-27 14:52:15"
            ],
            [
                10,
                "1976-09-15 19:24:17"
            ],
            [
                12,
                "1996-05-31 06:51:58"
            ],
            [
                13,
                "2015-04-03 09:36:19"
            ],
            [
                14,
                "2017-07-02 17:39:09"
            ],
            [
                15,
                "1986-12-14 14:18:59"
            ],
            [
                17,
                "1983-09-26 09:32:56"
            ],
            [
                20,
                "1996-07-27 03:30:40"
            ],
            [
                23,
                "1999-04-17 14:19:32"
            ],
            [
                24,
                "2005-09-30 00:10:02"
            ],
            [
                25,
                "1985-11-05 17:59:34"
            ]
        ]
    },
    {
        "question": "How many employees does each role have? List role description, id and number of employees.",
        "query": "MATCH (T1:`cre_Doc_Control_Systems.Roles`)-[]-(T2:`cre_Doc_Control_Systems.Employees`)\nWITH count(T2.role_code) AS count, T2.role_code AS role_code, T1.role_description AS role_description\nRETURN role_description,role_code,count",
        "db_id": "cre_Doc_Control_Systems",
        "answers": [
            [
                "Editor",
                "ED",
                2
            ],
            [
                "Photo",
                "PT",
                2
            ],
            [
                "Manager",
                "MG",
                1
            ],
            [
                "Proof Manager",
                "PR",
                1
            ]
        ]
    },
    {
        "question": "List the document type code for the document with the id 2.",
        "query": "MATCH (documents:`cre_Doc_Control_Systems.Documents`)\nWHERE documents.document_id = 2\nRETURN documents.document_type_code",
        "db_id": "cre_Doc_Control_Systems",
        "answers": [
            [
                "Paper"
            ]
        ]
    },
    {
        "question": "List the document ids for any documents with the status code done and the type code paper.",
        "query": "MATCH (documents:`cre_Doc_Control_Systems.Documents`)\nWHERE documents.document_status_code = 'done' AND documents.document_type_code = 'Paper'\nRETURN documents.document_id",
        "db_id": "cre_Doc_Control_Systems",
        "answers": [
            [
                2
            ],
            [
                3
            ],
            [
                4
            ],
            [
                17
            ]
        ]
    },
    {
        "question": "List all department names ordered by their starting date.",
        "query": "MATCH (department:`company_1.department`)\nRETURN department.Dname\nORDER BY department.Mgr_start_date",
        "db_id": "company_1",
        "answers": [
            [
                "Headquarters"
            ],
            [
                "Research"
            ],
            [
                "Administration"
            ]
        ]
    },
    {
        "question": "find all dependent names who have a spouse relation with some employee.",
        "query": "MATCH (dependent:`company_1.dependent`)\nWHERE dependent.Relationship = 'Spouse'\nRETURN dependent.Dependent_name",
        "db_id": "company_1",
        "answers": [
            [
                "Joy"
            ],
            [
                "Abner"
            ],
            [
                "Elizabeth"
            ]
        ]
    },
    {
        "question": "Return the first names and last names of employees who earn more than 30000 in salary.",
        "query": "MATCH (employee:`company_1.employee`)\nWHERE employee.Salary > 30000\nRETURN employee.Fname,employee.Lname",
        "db_id": "company_1",
        "answers": [
            [
                "Franklin",
                "Wong"
            ],
            [
                "Ramesh",
                "Narayan"
            ],
            [
                "James",
                "Borg"
            ],
            [
                "Jennifier",
                "Wallace"
            ]
        ]
    },
    {
        "question": "Find the number of employees of each gender whose salary is lower than 50000.",
        "query": "MATCH (employee:`company_1.employee`)\nWHERE employee.Salary < 50000\nWITH employee.Sex AS Sex, count(employee.Sex) AS count\nRETURN count,Sex",
        "db_id": "company_1",
        "answers": [
            [
                4,
                "M"
            ],
            [
                3,
                "F"
            ]
        ]
    },
    {
        "question": "list the first and last names, and the addresses of all employees in the ascending order of their birth date.",
        "query": "MATCH (employee:`company_1.employee`)\nRETURN employee.Fname,employee.Lname,employee.Address\nORDER BY employee.Bdate",
        "db_id": "company_1",
        "answers": [
            [
                "James",
                "Borg",
                "450 Stone, Houston, TX"
            ],
            [
                "Jennifier",
                "Wallace",
                "291 Berry, Bellaire, TX"
            ],
            [
                "Franklin",
                "Wong",
                "638 Voss, Houston, TX"
            ],
            [
                "Ramesh",
                "Narayan",
                "975 Fire Oak, Humble, TX"
            ],
            [
                "Jonh",
                "Smith",
                "731 Fondren, Houston, TX"
            ],
            [
                "Alicia",
                "Zelaya",
                "3321 Castle, Spring, TX"
            ],
            [
                "Ahmad",
                "Jabbar",
                "980 Dallas, Houston, TX"
            ],
            [
                "Joyce",
                "English",
                "5631 Rice, Houston, TX"
            ]
        ]
    },
    {
        "question": "How many events have each participants attended? List the participant id, type and the number.",
        "query": "MATCH (T1:`local_govt_in_alabama.Participants`)-[T2:`local_govt_in_alabama.Participants_in_Events`]-()\nWITH T1.Participant_Type_Code AS Participant_Type_Code, count(T1.Participant_ID) AS count, T1.Participant_ID AS Participant_ID\nRETURN Participant_ID,Participant_Type_Code,count",
        "db_id": "local_govt_in_alabama",
        "answers": [
            [
                26,
                "Organizer",
                2
            ],
            [
                36,
                "Organizer",
                1
            ],
            [
                37,
                "Participant",
                2
            ],
            [
                60,
                "Participant",
                1
            ],
            [
                63,
                "Participant",
                1
            ],
            [
                64,
                "Participant",
                1
            ],
            [
                66,
                "Participant",
                4
            ],
            [
                86,
                "Organizer",
                2
            ],
            [
                90,
                "Participant",
                3
            ],
            [
                96,
                "Organizer",
                1
            ]
        ]
    },
    {
        "question": "List the type of the services in alphabetical order.",
        "query": "MATCH (services:`local_govt_in_alabama.Services`)\nRETURN services.Service_Type_Code\nORDER BY services.Service_Type_Code",
        "db_id": "local_govt_in_alabama",
        "answers": [
            [
                "Birth Proof"
            ],
            [
                "Death Proof"
            ],
            [
                "Marriage"
            ],
            [
                "Property Change"
            ]
        ]
    },
    {
        "question": "List the service id and details for the events.",
        "query": "MATCH (events:`local_govt_in_alabama.Events`)\nRETURN events.Service_ID,events.Event_Details",
        "db_id": "local_govt_in_alabama",
        "answers": [
            [
                5,
                "Success"
            ],
            [
                8,
                "Success"
            ],
            [
                8,
                "Fail"
            ],
            [
                2,
                "Fail"
            ],
            [
                5,
                "Fail"
            ],
            [
                6,
                "Fail"
            ],
            [
                6,
                "Fail"
            ],
            [
                8,
                "Fail"
            ],
            [
                8,
                "Fail"
            ],
            [
                5,
                "Success"
            ],
            [
                2,
                "Fail"
            ],
            [
                2,
                "Success"
            ],
            [
                5,
                "Success"
            ],
            [
                2,
                "Fail"
            ],
            [
                2,
                "Success"
            ]
        ]
    },
    {
        "question": "Which service id and type has the least number of participants?",
        "query": "MATCH (T1:`local_govt_in_alabama.Participants`)-[T2:`local_govt_in_alabama.Participants_in_Events`]-(T3:`local_govt_in_alabama.Events`)-[]-(T4:`local_govt_in_alabama.Services`)\nWITH T4.Service_Type_Code AS Service_Type_Code, count(T3.Service_ID) AS count, T3.Service_ID AS Service_ID\nRETURN Service_ID,Service_Type_Code\nORDER BY count ASC\nLIMIT 1",
        "db_id": "local_govt_in_alabama",
        "answers": [
            [
                6,
                "Birth Proof"
            ]
        ]
    },
    {
        "question": "How many events did not have any participants?",
        "query": "MATCH (events:`local_govt_in_alabama.Events`)\nWHERE NOT (events:`local_govt_in_alabama.Events`)-[:`local_govt_in_alabama.Participants_in_Events`]-()\nRETURN count(*)",
        "db_id": "local_govt_in_alabama",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "List the names of technicians in ascending order of age.",
        "query": "MATCH (technician:`machine_repair.technician`)\nRETURN technician.Name\nORDER BY technician.Age ASC",
        "db_id": "machine_repair",
        "answers": [
            [
                "Mark Sewell"
            ],
            [
                "Lou Boudreau"
            ],
            [
                "Charlie Hollocher"
            ],
            [
                "John Brown"
            ],
            [
                "Joe Sewell"
            ],
            [
                "Mickey Cochrane"
            ],
            [
                "Tony Sewell"
            ],
            [
                "Eddie Collins"
            ],
            [
                "Joe Cochrane"
            ],
            [
                "Eddie Collins"
            ]
        ]
    },
    {
        "question": "List the name of technicians whose team is not \"NYY\".",
        "query": "MATCH (technician:`machine_repair.technician`)\nWHERE technician.Team <> 'NYY'\nRETURN technician.Name",
        "db_id": "machine_repair",
        "answers": [
            [
                "Tony Sewell"
            ],
            [
                "Mark Sewell"
            ],
            [
                "Charlie Hollocher"
            ],
            [
                "Lou Boudreau"
            ],
            [
                "Eddie Collins"
            ],
            [
                "Joe Cochrane"
            ],
            [
                "Eddie Collins"
            ],
            [
                "Mickey Cochrane"
            ]
        ]
    },
    {
        "question": "Show the name of technicians aged either 36 or 37",
        "query": "MATCH (technician:`machine_repair.technician`)\nWHERE technician.Age = 36 OR technician.Age = 37\nRETURN technician.Name",
        "db_id": "machine_repair",
        "answers": [
            [
                "Joe Sewell"
            ],
            [
                "John Brown"
            ]
        ]
    },
    {
        "question": "Show different teams of technicians and the number of technicians in each team.",
        "query": "MATCH (technician:`machine_repair.technician`)\nWITH count(technician.Team) AS count, technician.Team AS Team\nRETURN Team,count",
        "db_id": "machine_repair",
        "answers": [
            [
                "NYY",
                2
            ],
            [
                "CLE",
                4
            ],
            [
                "CHC",
                1
            ],
            [
                "CWS",
                2
            ],
            [
                "PHA",
                1
            ]
        ]
    },
    {
        "question": "Please show the team that has the most number of technicians.",
        "query": "MATCH (technician:`machine_repair.technician`)\nWITH count(technician.Team) AS count, technician.Team AS Team\nRETURN Team\nORDER BY count DESC\nLIMIT 1",
        "db_id": "machine_repair",
        "answers": [
            [
                "CLE"
            ]
        ]
    },
    {
        "question": "Show the team that have at least two technicians.",
        "query": "MATCH (technician:`machine_repair.technician`)\nWITH count(*) AS count, technician.Team AS Team\nWHERE count  >= 2\nRETURN Team",
        "db_id": "machine_repair",
        "answers": [
            [
                "NYY"
            ],
            [
                "CLE"
            ],
            [
                "CWS"
            ]
        ]
    },
    {
        "question": "Show names of technicians and the number of machines they are assigned to repair.",
        "query": "MATCH (T1:`machine_repair.repair_assignment`)-[]-(T2:`machine_repair.technician`)\nWITH count(T2.Name) AS count, T2.Name AS Name\nRETURN Name,count",
        "db_id": "machine_repair",
        "answers": [
            [
                "Joe Sewell",
                5
            ],
            [
                "John Brown",
                1
            ],
            [
                "Tony Sewell",
                1
            ],
            [
                "Charlie Hollocher",
                1
            ],
            [
                "Eddie Collins",
                1
            ]
        ]
    },
    {
        "question": "List the names of technicians who have not been assigned to repair machines.",
        "query": "MATCH (technician:`machine_repair.technician`)\nWHERE NOT (technician:`machine_repair.technician`)-[]-(:`machine_repair.repair_assignment`)\nRETURN technician.Name",
        "db_id": "machine_repair",
        "answers": [
            [
                "Mark Sewell"
            ],
            [
                "Lou Boudreau"
            ],
            [
                "Joe Cochrane"
            ],
            [
                "Eddie Collins"
            ],
            [
                "Mickey Cochrane"
            ]
        ]
    },
    {
        "question": "Count the number of entrepreneurs.",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN count(*)",
        "db_id": "entrepreneur",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "question": "List the companies of entrepreneurs in descending order of money requested.",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN entrepreneur.Company\nORDER BY entrepreneur.Money_Requested DESC",
        "db_id": "entrepreneur",
        "answers": [
            [
                "Umbrolly"
            ],
            [
                "Grails Ltd"
            ],
            [
                "Elizabeth Galton Ltd"
            ],
            [
                "Mycorrhizal Systems"
            ],
            [
                "Le Beanock"
            ],
            [
                "IV Cam"
            ]
        ]
    }
]