[
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nWHERE catalog_contents.length < '3' OR catalog_contents.width > '5'\nRETURN catalog_contents.catalog_entry_name",
        "question": "Find the names of the products with length smaller than 3 or height greater than 5.",
        "answers": [
            [
                "Root beer"
            ],
            [
                "Cream Soda"
            ],
            [
                "Ginger Beer"
            ],
            [
                "Dr Pepper"
            ],
            [
                "Fenta Orange"
            ],
            [
                "Wanglaoji"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nWHERE catalog_contents.length < '3' OR catalog_contents.width > '5'\nRETURN catalog_contents.catalog_entry_name",
        "question": "Which catalog contents have length below 3 or above 5? Find the catalog entry names.",
        "answers": [
            [
                "Root beer"
            ],
            [
                "Cream Soda"
            ],
            [
                "Ginger Beer"
            ],
            [
                "Dr Pepper"
            ],
            [
                "Fenta Orange"
            ],
            [
                "Wanglaoji"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nWHERE catalog_contents.price_in_dollars > 700\nRETURN catalog_contents.catalog_entry_name,catalog_contents.capacity",
        "question": "Find the name and capacity of products with price greater than 700 (in USD).",
        "answers": [
            [
                "Vimto",
                "6"
            ],
            [
                "Sprite Lemo",
                "8"
            ],
            [
                "Dr Pepper",
                "1"
            ],
            [
                "Diet Pepsi",
                "9"
            ],
            [
                "Diet Mountain Dew",
                "8"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nWHERE catalog_contents.price_in_dollars > 700\nRETURN catalog_contents.catalog_entry_name,catalog_contents.capacity",
        "question": "Which catalog contents has price above 700 dollars? Show their catalog entry names and capacities.",
        "answers": [
            [
                "Vimto",
                "6"
            ],
            [
                "Sprite Lemo",
                "8"
            ],
            [
                "Dr Pepper",
                "1"
            ],
            [
                "Diet Pepsi",
                "9"
            ],
            [
                "Diet Mountain Dew",
                "8"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalogs:`product_catalog.Catalogs`)\nWITH catalogs.date_of_latest_revision AS date_of_latest_revision, count(*) AS count\nWHERE count  > 1\nRETURN date_of_latest_revision",
        "question": "Find the dates on which more than one revisions were made.",
        "answers": [
            [
                "2017-09-26 12:10:36"
            ],
            [
                "2017-10-26 01:16:51"
            ],
            [
                "2017-12-04 06:48:13"
            ],
            [
                "2017-03-30 09:15:37"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalogs:`product_catalog.Catalogs`)\nWITH catalogs.date_of_latest_revision AS date_of_latest_revision, count(*) AS count\nWHERE count  > 1\nRETURN date_of_latest_revision",
        "question": "On which days more than one revisions were made on catalogs.",
        "answers": [
            [
                "2017-09-26 12:10:36"
            ],
            [
                "2017-10-26 01:16:51"
            ],
            [
                "2017-12-04 06:48:13"
            ],
            [
                "2017-03-30 09:15:37"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nRETURN count(*)",
        "question": "Find the total number of catalog contents.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nWHERE catalog_contents.next_entry_id > 8\nRETURN catalog_contents.catalog_entry_name",
        "question": "Name all the products with next entry ID greater than 8.",
        "answers": [
            [
                "Sprite Lemo"
            ],
            [
                "Diet Pepsi"
            ],
            [
                "Wanglaoji"
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN count(*)",
        "question": "How many aircrafts do we have?",
        "answers": [
            [
                16
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN count(*)",
        "question": "How many aircrafts exist in the database?",
        "answers": [
            [
                16
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN aircraft.name,aircraft.distance",
        "question": "Show name and distance for all aircrafts.",
        "answers": [
            [
                "Boeing 747-400",
                8430
            ],
            [
                "Boeing 737-800",
                3383
            ],
            [
                "Airbus A340-300",
                7120
            ],
            [
                "British Aerospace Jetstream 41",
                1502
            ],
            [
                "Embraer ERJ-145",
                1530
            ],
            [
                "SAAB 340",
                2128
            ],
            [
                "Piper Archer III",
                520
            ],
            [
                "Tupolev 154",
                4103
            ],
            [
                "Schwitzer 2-33",
                30
            ],
            [
                "Lockheed L1011",
                6900
            ],
            [
                "Boeing 757-300",
                4010
            ],
            [
                "Boeing 777-300",
                6441
            ],
            [
                "Boeing 767-400ER",
                6475
            ],
            [
                "Airbus A320",
                2605
            ],
            [
                "Airbus A319",
                1805
            ],
            [
                "Boeing 727",
                1504
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN aircraft.name,aircraft.distance",
        "question": "What are the names and distances for all airplanes?",
        "answers": [
            [
                "Boeing 747-400",
                8430
            ],
            [
                "Boeing 737-800",
                3383
            ],
            [
                "Airbus A340-300",
                7120
            ],
            [
                "British Aerospace Jetstream 41",
                1502
            ],
            [
                "Embraer ERJ-145",
                1530
            ],
            [
                "SAAB 340",
                2128
            ],
            [
                "Piper Archer III",
                520
            ],
            [
                "Tupolev 154",
                4103
            ],
            [
                "Schwitzer 2-33",
                30
            ],
            [
                "Lockheed L1011",
                6900
            ],
            [
                "Boeing 757-300",
                4010
            ],
            [
                "Boeing 777-300",
                6441
            ],
            [
                "Boeing 767-400ER",
                6475
            ],
            [
                "Airbus A320",
                2605
            ],
            [
                "Airbus A319",
                1805
            ],
            [
                "Boeing 727",
                1504
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nWHERE aircraft.distance > 1000\nRETURN aircraft.aid",
        "question": "Show ids for all aircrafts with more than 1000 distance.",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ],
            [
                4
            ],
            [
                5
            ],
            [
                6
            ],
            [
                8
            ],
            [
                9
            ],
            [
                10
            ],
            [
                11
            ],
            [
                12
            ],
            [
                13
            ],
            [
                14
            ],
            [
                15
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nWHERE aircraft.distance > 1000\nRETURN aircraft.aid",
        "question": "What are the ids of all aircrafts that can cover a distance of more than 1000?",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ],
            [
                4
            ],
            [
                5
            ],
            [
                6
            ],
            [
                8
            ],
            [
                9
            ],
            [
                10
            ],
            [
                11
            ],
            [
                12
            ],
            [
                13
            ],
            [
                14
            ],
            [
                15
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nWHERE 1000<=aircraft.distance<=5000\nRETURN count(*)",
        "question": "How many aircrafts have distance between 1000 and 5000?",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nWHERE 1000<=aircraft.distance<=5000\nRETURN count(*)",
        "question": "What is the count of aircrafts that have a distance between 1000 and 5000?",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nWHERE aircraft.aid = 12\nRETURN aircraft.name,aircraft.distance",
        "question": "What is the name and distance for aircraft with id 12?",
        "answers": [
            [
                "Boeing 767-400ER",
                6475
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nWHERE aircraft.aid = 12\nRETURN aircraft.name,aircraft.distance",
        "question": "What is the name and distance for the aircraft that has an id of 12?",
        "answers": [
            [
                "Boeing 767-400ER",
                6475
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN min(aircraft.distance),avg(aircraft.distance),max(aircraft.distance)",
        "question": "What is the minimum, average, and maximum distance of all aircrafts.",
        "answers": [
            [
                30,
                3655.375,
                8430
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN min(aircraft.distance),avg(aircraft.distance),max(aircraft.distance)",
        "question": "Return the minimum, average and maximum distances traveled across all aircrafts.",
        "answers": [
            [
                30,
                3655.375,
                8430
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN aircraft.aid,aircraft.name\nORDER BY aircraft.distance DESC\nLIMIT 1",
        "question": "Show the id and name of the aircraft with the maximum distance.",
        "answers": [
            [
                1,
                "Boeing 747-400"
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN aircraft.aid,aircraft.name\nORDER BY aircraft.distance DESC\nLIMIT 1",
        "question": "What is the id and name of the aircraft that can cover the maximum distance?",
        "answers": [
            [
                1,
                "Boeing 747-400"
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN aircraft.name\nORDER BY aircraft.distance\nLIMIT 3",
        "question": "Show the name of aircrafts with top three lowest distances.",
        "answers": [
            [
                "Schwitzer 2-33"
            ],
            [
                "Piper Archer III"
            ],
            [
                "British Aerospace Jetstream 41"
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nRETURN aircraft.name\nORDER BY aircraft.distance\nLIMIT 3",
        "question": "What are the aircrafts with top 3 shortest lengthes? List their names.",
        "answers": [
            [
                "Schwitzer 2-33"
            ],
            [
                "Piper Archer III"
            ],
            [
                "British Aerospace Jetstream 41"
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nWITH avg(aircraft.distance) AS distance\nMATCH (aircraft:`flight_1.aircraft`)\nWHERE  aircraft.distance >  distance \nRETURN aircraft.name",
        "question": "Show names for all aircrafts with distances more than the average.",
        "answers": [
            [
                "Boeing 747-400"
            ],
            [
                "Airbus A340-300"
            ],
            [
                "Tupolev 154"
            ],
            [
                "Lockheed L1011"
            ],
            [
                "Boeing 757-300"
            ],
            [
                "Boeing 777-300"
            ],
            [
                "Boeing 767-400ER"
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (aircraft:`flight_1.aircraft`)\nWITH avg(aircraft.distance) AS distance\nMATCH (aircraft:`flight_1.aircraft`)\nWHERE  aircraft.distance >  distance \nRETURN aircraft.name",
        "question": "What are the names of all aircrafts that can cover more distances than average?",
        "answers": [
            [
                "Boeing 747-400"
            ],
            [
                "Airbus A340-300"
            ],
            [
                "Tupolev 154"
            ],
            [
                "Lockheed L1011"
            ],
            [
                "Boeing 757-300"
            ],
            [
                "Boeing 777-300"
            ],
            [
                "Boeing 767-400ER"
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nRETURN count(*)",
        "question": "What is the number of employees?",
        "answers": [
            [
                31
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nRETURN employee.name,employee.salary\nORDER BY employee.salary",
        "question": "Show name and salary for all employees sorted by salary.",
        "answers": [
            [
                "Milo Brooks",
                20
            ],
            [
                "Donald King",
                18050
            ],
            [
                "Richard Jackson",
                23980
            ],
            [
                "Patricia Jones",
                24450
            ],
            [
                "Linda Davis",
                27984
            ],
            [
                "Elizabeth Taylor",
                32021
            ],
            [
                "Haywood Kelly",
                32899
            ],
            [
                "Chad Stewart",
                33546
            ],
            [
                "David Anderson",
                43001
            ],
            [
                "Barbara Wilson",
                43723
            ],
            [
                "Robert Brown",
                44740
            ],
            [
                "Michael Miller",
                48090
            ],
            [
                "William Moore",
                48250
            ],
            [
                "Jennifer Thomas",
                54921
            ],
            [
                "William Ward",
                84476
            ],
            [
                "Michael Miller",
                99890
            ],
            [
                "Larry West",
                101745
            ],
            [
                "William Jones",
                105743
            ],
            [
                "Eric Cooper",
                114323
            ],
            [
                "James Smith",
                120433
            ],
            [
                "Dorthy Lewis",
                152013
            ],
            [
                "John Williams",
                153972
            ],
            [
                "Mary Johnson",
                178345
            ],
            [
                "Karen Scott",
                205187
            ],
            [
                "Mark Young",
                205187
            ],
            [
                "Lawrence Sperry",
                212156
            ],
            [
                "Angela Martinez",
                212156
            ],
            [
                "Joseph Thompson",
                212156
            ],
            [
                "Betty Adams",
                227489
            ],
            [
                "Lisa Walker",
                256481
            ],
            [
                "George Wright",
                289950
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nRETURN employee.name,employee.salary\nORDER BY employee.salary",
        "question": "What is the name and salary of all employees in order of salary?",
        "answers": [
            [
                "Milo Brooks",
                20
            ],
            [
                "Donald King",
                18050
            ],
            [
                "Richard Jackson",
                23980
            ],
            [
                "Patricia Jones",
                24450
            ],
            [
                "Linda Davis",
                27984
            ],
            [
                "Elizabeth Taylor",
                32021
            ],
            [
                "Haywood Kelly",
                32899
            ],
            [
                "Chad Stewart",
                33546
            ],
            [
                "David Anderson",
                43001
            ],
            [
                "Barbara Wilson",
                43723
            ],
            [
                "Robert Brown",
                44740
            ],
            [
                "Michael Miller",
                48090
            ],
            [
                "William Moore",
                48250
            ],
            [
                "Jennifer Thomas",
                54921
            ],
            [
                "William Ward",
                84476
            ],
            [
                "Michael Miller",
                99890
            ],
            [
                "Larry West",
                101745
            ],
            [
                "William Jones",
                105743
            ],
            [
                "Eric Cooper",
                114323
            ],
            [
                "James Smith",
                120433
            ],
            [
                "Dorthy Lewis",
                152013
            ],
            [
                "John Williams",
                153972
            ],
            [
                "Mary Johnson",
                178345
            ],
            [
                "Karen Scott",
                205187
            ],
            [
                "Mark Young",
                205187
            ],
            [
                "Lawrence Sperry",
                212156
            ],
            [
                "Angela Martinez",
                212156
            ],
            [
                "Joseph Thompson",
                212156
            ],
            [
                "Betty Adams",
                227489
            ],
            [
                "Lisa Walker",
                256481
            ],
            [
                "George Wright",
                289950
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nWHERE employee.salary > 100000\nRETURN employee.eid",
        "question": "Show ids for all employees with at least 100000 salary.",
        "answers": [
            [
                242518965
            ],
            [
                141582651
            ],
            [
                11564812
            ],
            [
                567354612
            ],
            [
                552455318
            ],
            [
                550156548
            ],
            [
                390487451
            ],
            [
                355548984
            ],
            [
                310454876
            ],
            [
                142519864
            ],
            [
                269734834
            ],
            [
                552455348
            ],
            [
                556784565
            ],
            [
                573284895
            ],
            [
                574489456
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nWHERE employee.salary > 100000\nRETURN employee.eid",
        "question": "What is the id of every employee who has at least a salary of  100000?",
        "answers": [
            [
                242518965
            ],
            [
                141582651
            ],
            [
                11564812
            ],
            [
                567354612
            ],
            [
                552455318
            ],
            [
                550156548
            ],
            [
                390487451
            ],
            [
                355548984
            ],
            [
                310454876
            ],
            [
                142519864
            ],
            [
                269734834
            ],
            [
                552455348
            ],
            [
                556784565
            ],
            [
                573284895
            ],
            [
                574489456
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nWHERE 100000<=employee.salary<=200000\nRETURN count(*)",
        "question": "How many employees have salary between 100000 and 200000?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nWHERE 100000<=employee.salary<=200000\nRETURN count(*)",
        "question": "What is the number of employees that have a salary between 100000 and 200000?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nWHERE employee.eid = 242518965\nRETURN employee.name,employee.salary",
        "question": "What is the name and salary for employee with id 242518965?",
        "answers": [
            [
                "James Smith",
                120433
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nWHERE employee.eid = 242518965\nRETURN employee.name,employee.salary",
        "question": "What is the name and salary of the employee with the id 242518965?",
        "answers": [
            [
                "James Smith",
                120433
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nRETURN employee.eid,employee.name\nORDER BY employee.salary DESC\nLIMIT 1",
        "question": "Show the id and name of the employee with maximum salary.",
        "answers": [
            [
                269734834,
                "George Wright"
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nRETURN employee.eid,employee.name\nORDER BY employee.salary DESC\nLIMIT 1",
        "question": "What is the id and name of the employee with the highest salary?",
        "answers": [
            [
                269734834,
                "George Wright"
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nRETURN employee.name\nORDER BY employee.salary ASC\nLIMIT 3",
        "question": "Show the name of employees with three lowest salaries.",
        "answers": [
            [
                "Milo Brooks"
            ],
            [
                "Donald King"
            ],
            [
                "Richard Jackson"
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nRETURN employee.name\nORDER BY employee.salary ASC\nLIMIT 3",
        "question": "What is the name of the 3 employees who get paid the least?",
        "answers": [
            [
                "Milo Brooks"
            ],
            [
                "Donald King"
            ],
            [
                "Richard Jackson"
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nWITH avg(employee.salary) AS salary\nMATCH (employee:`flight_1.employee`)\nWHERE  employee.salary >  salary \nRETURN employee.name",
        "question": "Show names for all employees with salary more than the average.",
        "answers": [
            [
                "James Smith"
            ],
            [
                "Mary Johnson"
            ],
            [
                "John Williams"
            ],
            [
                "Lisa Walker"
            ],
            [
                "Karen Scott"
            ],
            [
                "Lawrence Sperry"
            ],
            [
                "Angela Martinez"
            ],
            [
                "Joseph Thompson"
            ],
            [
                "Betty Adams"
            ],
            [
                "George Wright"
            ],
            [
                "Dorthy Lewis"
            ],
            [
                "Mark Young"
            ],
            [
                "Eric Cooper"
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nWITH avg(employee.salary) AS salary\nMATCH (employee:`flight_1.employee`)\nWHERE  employee.salary >  salary \nRETURN employee.name",
        "question": "What are the names of all employees who have a salary higher than average?",
        "answers": [
            [
                "James Smith"
            ],
            [
                "Mary Johnson"
            ],
            [
                "John Williams"
            ],
            [
                "Lisa Walker"
            ],
            [
                "Karen Scott"
            ],
            [
                "Lawrence Sperry"
            ],
            [
                "Angela Martinez"
            ],
            [
                "Joseph Thompson"
            ],
            [
                "Betty Adams"
            ],
            [
                "George Wright"
            ],
            [
                "Dorthy Lewis"
            ],
            [
                "Mark Young"
            ],
            [
                "Eric Cooper"
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nWHERE employee.name = 'Mark Young'\nRETURN employee.eid,employee.salary",
        "question": "Show the id and salary of Mark Young.",
        "answers": [
            [
                556784565,
                205187
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (employee:`flight_1.employee`)\nWHERE employee.name = 'Mark Young'\nRETURN employee.eid,employee.salary",
        "question": "What is the id and salary of the employee named Mark Young?",
        "answers": [
            [
                556784565,
                205187
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (flight:`flight_1.flight`)\nRETURN count(*)",
        "question": "What is the number of flights?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "flight_1",
        "query": "MATCH (flight:`flight_1.flight`)\nRETURN flight.flno,flight.origin,flight.destination\nORDER BY flight.origin",
        "question": "Show flight number, origin, destination of all flights in the alphabetical order of the departure cities.",
        "answers": [
            [
                76,
                "Chicago",
                "Los Angeles"
            ],
            [
                68,
                "Chicago",
                "New York"
            ],
            [
                99,
                "Los Angeles",
                "Washington D.C."
            ],
            [
                13,
                "Los Angeles",
                "Chicago"
            ],
            [
                346,
                "Los Angeles",
                "Dallas"
            ],
            [
                387,
                "Los Angeles",
                "Boston"
            ],
            [
                7,
                "Los Angeles",
                "Sydney"
            ],
            [
                2,
                "Los Angeles",
                "Tokyo"
            ],
            [
                33,
                "Los Angeles",
                "Honolulu"
            ],
            [
                34,
                "Los Angeles",
                "Honolulu"
            ]
        ]
    }
]