[
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN city.state_name",
        "question": "which state is the city springfield located in",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN city.state_name",
        "question": "what states in the united states have a city of springfield",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'boulder'\nRETURN city.population",
        "question": "how many people live in boulder",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'boulder'\nRETURN city.population",
        "question": "what is the population of boulder",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'boulder'\nRETURN city.population",
        "question": "how many people lived in boulder",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'boulder'\nRETURN city.population",
        "question": "number of people in boulder",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'boulder'\nRETURN city.population",
        "question": "what is the population of boulder city",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'boulder'\nRETURN city.population",
        "question": "how big is the city of boulder",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'boulder'\nRETURN city.population",
        "question": "population of boulder",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'boulder'\nRETURN city.population",
        "question": "what is the population in boulder",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'boulder'\nRETURN city.population",
        "question": "people in boulder",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'boulder'\nRETURN city.population",
        "question": "how many people in boulder",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'boulder'\nRETURN city.population",
        "question": "how many inhabitants does boulder have",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'boulder'\nRETURN city.population",
        "question": "number of citizens in boulder",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'boulder'\nRETURN city.population",
        "question": "how many citizens in boulder",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'delaware'\nRETURN highlow.highest_elevation",
        "question": "what is the highest elevation in delaware",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'delaware'\nRETURN highlow.highest_elevation",
        "question": "how high is the highest point of delaware",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'delaware'\nRETURN highlow.highest_elevation",
        "question": "how tall is the highest point in delaware",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'delaware'\nRETURN highlow.highest_elevation",
        "question": "what is the highest point in delaware in meters",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'delaware'\nRETURN highlow.highest_elevation",
        "question": "how high is the highest point in delaware",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'texas'\nRETURN highlow.highest_point",
        "question": "where is the highest point in texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'texas'\nRETURN highlow.highest_point",
        "question": "what is the highest point in texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'texas'\nRETURN highlow.highest_point",
        "question": "what is the high point of texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'texas'\nRETURN highlow.highest_point",
        "question": "what is the highest mountain in texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'texas'\nRETURN highlow.highest_point",
        "question": "could you tell me what is the highest point in the state of texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'alabama'\nWITH highlow.lowest_elevation AS lowest_elevation\nMATCH (highlow:`geo.highlow`)\nWHERE  highlow.lowest_elevation <  lowest_elevation \nRETURN count(highlow.state_name)",
        "question": "count the states which have elevations lower than what alabama has",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.highest_point = 'guadalupe peak'\nRETURN highlow.highest_elevation",
        "question": "how high is guadalupe peak",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.highest_point = 'guadalupe peak'\nRETURN highlow.highest_elevation",
        "question": "how tall is guadalupe peak",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.highest_point = 'guadalupe peak'\nRETURN highlow.highest_elevation",
        "question": "what is the maximum elevation of guadalupe peak",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'rio grande'\nRETURN river.length",
        "question": "how long is the rio grande river",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'rio grande'\nRETURN river.length",
        "question": "what is the length of the rio grande river",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'rio grande'\nRETURN river.length",
        "question": "what length is the rio grande",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'rio grande'\nRETURN river.length",
        "question": "how long is the rio grande",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'rio grande'\nRETURN river.length",
        "question": "how long is the rio grande river in miles",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'rio grande'\nRETURN river.length",
        "question": "how long is rio grande",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'rhode island'\nRETURN count(state.capital)",
        "question": "how many capitals does rhode island have",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000\nRETURN count(city.city_name)",
        "question": "how many major cities are there",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'colorado'\nRETURN count(river.river_name)",
        "question": "how many colorado rivers are there",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'colorado'\nRETURN count(river.river_name)",
        "question": "how many rivers are called colorado",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'seattle' AND city.state_name = 'washington'\nRETURN city.population",
        "question": "what is the population of seattle washington",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'seattle' AND city.state_name = 'washington'\nRETURN city.population",
        "question": "how many people live in seattle washington",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN count(border_info.border)",
        "question": "how many states border kentucky",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN count(border_info.border)",
        "question": "how many states does kentucky border",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN count(border_info.border)",
        "question": "kentucky borders how many states",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN count(border_info.border)",
        "question": "number of states bordering kentucky",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nWHERE border_info.state_name = 'kentucky'\nRETURN count(border_info.border)",
        "question": "what is the number of neighboring states for kentucky",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.length > 750 AND river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "name the major rivers in illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.length > 750 AND river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what are the major rivers in illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.length > 750 AND river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what are major rivers in illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.length > 750 AND river.traverse = 'illinois'\nRETURN river.river_name",
        "question": "what major rivers run through illinois",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'texas'\nRETURN state.capital",
        "question": "what are the capital city in texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'texas'\nRETURN state.capital",
        "question": "what is the capital of texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'texas'\nRETURN state.capital",
        "question": "what is the capital of the texas state",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'texas'\nRETURN state.capital",
        "question": "what is capital of texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'texas'\nRETURN state.capital",
        "question": "what is the capital of the state texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'texas'\nRETURN state.capital",
        "question": "can you tell me the capital of texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (t2:`geo.state`)-[]-(t1:`geo.border_info`)\nWHERE t1.state_name = 'texas'\nRETURN t2.capital",
        "question": "what are the capitals of states that border texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (t2:`geo.state`)-[]-(t1:`geo.border_info`)\nWHERE t1.state_name = 'texas'\nRETURN t2.capital",
        "question": "what are the capital cities of the states which border texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (t2:`geo.state`)-[]-(t1:`geo.border_info`)\nWHERE t1.state_name = 'texas'\nRETURN t2.capital",
        "question": "what are the capitals of the states that border texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (t2:`geo.state`)-[]-(t1:`geo.border_info`)\nWHERE t1.state_name = 'texas'\nRETURN t2.capital",
        "question": "which capitals are in the states that border texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'kansas'\nRETURN city.city_name",
        "question": "what are the major cities in kansas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'kansas'\nRETURN city.city_name",
        "question": "what are the major cities in the state of kansas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'kansas'\nRETURN city.city_name",
        "question": "what major cities are located in kansas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'kansas'\nRETURN city.city_name",
        "question": "show major cities in kansas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'kansas'\nRETURN city.city_name",
        "question": "what are the names of the major cities in kansas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'kansas'\nRETURN city.city_name",
        "question": "what are the major cities of kansas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'kansas'\nRETURN city.city_name",
        "question": "what is the major cities in kansas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000\nRETURN city.city_name",
        "question": "what are the major cities in the usa",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000\nRETURN city.city_name",
        "question": "what are the major cities of the united states",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000\nRETURN city.city_name",
        "question": "what are the major cities of the us",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (t2:`geo.state`)-[]-(t1:`geo.border_info`)\nWHERE t1.state_name = 'texas'\nRETURN t2.population",
        "question": "what are the populations of states which border texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'wisconsin'\nRETURN city.population",
        "question": "what are the populations of the major cities of wisconsin",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'wisconsin'\nRETURN city.population",
        "question": "what are the populations of all the major cities in wisconsin",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'wisconsin'\nRETURN city.population",
        "question": "what is the population of the major cities in wisconsin",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (t2:`geo.state`)-[]-(t1:`geo.city`)\nWHERE t1.city_name = 'durham'\nRETURN t2.capital",
        "question": "what is the capital of states that have cities named durham",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'wyoming'\nRETURN state.density",
        "question": "what is the density of the wyoming",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'wyoming'\nRETURN state.density",
        "question": "what is the population density of wyoming",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'wyoming'\nRETURN state.density",
        "question": "what is the density of wyoming",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'iowa'\nRETURN highlow.lowest_point",
        "question": "what is the lowest point in iowa",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'iowa'\nRETURN highlow.lowest_point",
        "question": "what is the lowest point in iowa in meters",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'iowa'\nRETURN highlow.lowest_point",
        "question": "what is the lowest point in the state of iowa",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'iowa'\nRETURN highlow.lowest_point",
        "question": "where is the lowest point in iowa",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'iowa'\nRETURN highlow.lowest_point",
        "question": "what is the lowest point of iowa",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'iowa'\nRETURN highlow.lowest_point",
        "question": "where is the lowest spot in iowa",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.length > 750\nRETURN river.traverse",
        "question": "what states contain at least one major rivers",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (mountain:`geo.mountain`)\nWHERE mountain.mountain_name = 'whitney'\nRETURN mountain.state_name",
        "question": "which state is mount whitney in",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (mountain:`geo.mountain`)\nWHERE mountain.mountain_name = 'whitney'\nRETURN mountain.state_name",
        "question": "in what state is mount whitney",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (mountain:`geo.mountain`)\nWHERE mountain.mountain_name = 'whitney'\nRETURN mountain.state_name",
        "question": "where is mount whitney",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (mountain:`geo.mountain`)\nWHERE mountain.mountain_name = 'whitney'\nRETURN mountain.state_name",
        "question": "where is mount whitney located",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'austin' AND city.population > 150000\nRETURN city.state_name",
        "question": "which states have a major city named austin",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.capital = 'salem'\nRETURN state.state_name",
        "question": "what state is salem the capital of",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.capital = 'salem'\nRETURN state.state_name",
        "question": "what states capital is salem",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.capital = 'salem'\nRETURN state.state_name",
        "question": "salem is the capital of which state",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.capital = 'salem'\nRETURN state.state_name",
        "question": "what state has the capital salem",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN count(city.state_name)",
        "question": "how many states have a city named springfield",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN count(city.state_name)",
        "question": "how many states have a city called springfield",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN count(city.state_name)",
        "question": "how many states have cities named springfield",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'springfield'\nRETURN count(city.state_name)",
        "question": "how many states have cities or towns named springfield",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'texas'\nRETURN count(city.city_name)",
        "question": "how many major cities are in texas",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'texas'\nRETURN count(city.city_name)",
        "question": "how many big cities are in texas",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.population > 150000 AND city.state_name = 'texas'\nRETURN count(city.city_name)",
        "question": "how many major cities are there in texas",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'missouri'\nRETURN count(river.traverse)",
        "question": "how many states does the missouri run through",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'missouri'\nRETURN count(river.traverse)",
        "question": "how many states does the missouri river flow through",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'missouri'\nRETURN count(river.traverse)",
        "question": "how many states does the missouri river run through",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (border_info:`geo.border_info`)\nRETURN count(DISTINCT border_info.state_name)",
        "question": "how many states border at least one other state",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.state_name = 'texas'\nRETURN max(DISTINCT highlow.highest_elevation)",
        "question": "what is the height of the highest mountain in texas",
        "answers": [
            [
                null
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (lake:`geo.lake`)\nWHERE lake.area > 750\nRETURN lake.lake_name",
        "question": "what are the major lakes in united states",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (lake:`geo.lake`)\nWHERE lake.area > 750\nRETURN lake.lake_name",
        "question": "show me all the major lakes in the us",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.length > 750 AND river.traverse = 'ohio'\nRETURN count(river.river_name)",
        "question": "how many major rivers cross ohio",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.length > 750\nRETURN count(DISTINCT river.traverse)",
        "question": "how many states are next to major rivers",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (mountain:`geo.mountain`)\nWHERE mountain.mountain_name = 'mckinley'\nRETURN mountain.mountain_altitude",
        "question": "what is the height of mount mckinley",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (mountain:`geo.mountain`)\nWHERE mountain.state_name = 'alaska'\nRETURN mountain.mountain_name",
        "question": "what mountains are in alaska",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.length > 750\nRETURN count(river.traverse)",
        "question": "how many states have major rivers",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.state_name = 'texas'\nRETURN count(city.city_name)",
        "question": "how many cities are in texas",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.state_name = 'texas'\nRETURN count(city.city_name)",
        "question": "how many cities does texas have",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (t1:`geo.state`)-[]-(t2:`geo.highlow`)\nRETURN t1.state_name",
        "question": "what states have a capital that is the highest point in the state",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (t2:`geo.state`)-[]-(t1:`geo.city`)\nWHERE t1.population <= 150000\nRETURN t2.capital",
        "question": "which capitals are not major cities",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.state_name = 'massachusetts'\nRETURN state.country_name",
        "question": "where is massachusetts",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (city:`geo.city`)\nWHERE city.city_name = 'austin'\nRETURN count(city.city_name)",
        "question": "how many cities named austin are there in the usa",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "geo",
        "query": "MATCH (river:`geo.river`)\nWHERE river.river_name = 'colorado' AND river.traverse = 'texas'\nRETURN river.length",
        "question": "what is the length of the colorado river in texas",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (state:`geo.state`)\nWHERE state.capital = 'austin'\nRETURN state.density",
        "question": "what is the population density in the state with capital austin",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (highlow:`geo.highlow`)\nWHERE highlow.lowest_point = 'death valley'\nRETURN highlow.lowest_elevation",
        "question": "what is the elevation of death valley",
        "answers": []
    },
    {
        "db_id": "geo",
        "query": "MATCH (t2:`geo.border_info`)-[]-(t1:`geo.border_info`)-[]-(t3:`geo.border_info`)-[]-(t4:`geo.border_info`)\nWHERE t4.state_name = 'texas'\nRETURN t1.border",
        "question": "what states border states that border states that border states that border texas",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "papers that are coauthored by Peter Mertens and Dina Barbian",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "papers written by Peter Mertens and Dina Barbian",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "what are the papers that have Peter Mertens and Dina Barbian as co-authors",
        "answers": []
    }
]