[
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nWHERE student.Age > 22\nRETURN student.Fname",
        "question": "What are the first names of all the students aged above 22?",
        "answers": [
            [
                "Paul"
            ],
            [
                "Bruce"
            ],
            [
                "Sarah"
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nWHERE student.Major = 600\nRETURN max(student.Age),min(student.Age)",
        "question": "What are the maximum and minimum age of students with major 600?",
        "answers": [
            [
                27,
                16
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nWHERE student.Major = 600\nRETURN max(student.Age),min(student.Age)",
        "question": "Tell me the ages of the oldest and youngest students studying major 600.",
        "answers": [
            [
                27,
                16
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nWHERE voting_record.Registration_Date = \"08/30/2015\"\nRETURN DISTINCT voting_record.President_Vote",
        "question": "What are the distinct president votes on 08/30/2015?",
        "answers": [
            [
                1004
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nWHERE voting_record.Registration_Date = \"08/30/2015\"\nRETURN DISTINCT voting_record.President_Vote",
        "question": "Show all the distinct president votes made on 08/30/2015.",
        "answers": [
            [
                1004
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN DISTINCT voting_record.Registration_Date,voting_record.Election_Cycle",
        "question": "Report the distinct registration date and the election cycle.",
        "answers": [
            [
                "08/30/2015",
                "Spring"
            ],
            [
                "08/30/2014",
                "Spring"
            ],
            [
                "08/30/2013",
                "Spring"
            ],
            [
                "08/30/2012",
                "Spring"
            ],
            [
                "08/30/2015",
                "Fall"
            ],
            [
                "08/30/2014",
                "Fall"
            ],
            [
                "08/30/2013",
                "Fall"
            ],
            [
                "08/30/2012",
                "Fall"
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN DISTINCT voting_record.Registration_Date,voting_record.Election_Cycle",
        "question": "What are the distinct registration dates and the election cycles?",
        "answers": [
            [
                "08/30/2015",
                "Spring"
            ],
            [
                "08/30/2014",
                "Spring"
            ],
            [
                "08/30/2013",
                "Spring"
            ],
            [
                "08/30/2012",
                "Spring"
            ],
            [
                "08/30/2015",
                "Fall"
            ],
            [
                "08/30/2014",
                "Fall"
            ],
            [
                "08/30/2013",
                "Fall"
            ],
            [
                "08/30/2012",
                "Fall"
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN DISTINCT voting_record.President_Vote,voting_record.Vice_President_Vote",
        "question": "Report the distinct president vote and the vice president vote.",
        "answers": [
            [
                1004,
                1007
            ],
            [
                1014,
                1007
            ],
            [
                1004,
                1017
            ],
            [
                1024,
                1017
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN DISTINCT voting_record.President_Vote,voting_record.Vice_President_Vote",
        "question": "List all the distinct president votes and the vice president votes.",
        "answers": [
            [
                1004,
                1007
            ],
            [
                1014,
                1007
            ],
            [
                1004,
                1017
            ],
            [
                1024,
                1017
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nRETURN student.Advisor,count(*)",
        "question": "For each advisor, report the total number of students advised by him or her.",
        "answers": [
            [
                1121,
                3
            ],
            [
                7712,
                1
            ],
            [
                7792,
                1
            ],
            [
                8423,
                1
            ],
            [
                1148,
                3
            ],
            [
                8918,
                1
            ],
            [
                9172,
                1
            ],
            [
                2192,
                4
            ],
            [
                7723,
                1
            ],
            [
                8741,
                1
            ],
            [
                8721,
                1
            ],
            [
                7271,
                2
            ],
            [
                8722,
                3
            ],
            [
                7134,
                2
            ],
            [
                8723,
                1
            ],
            [
                2311,
                3
            ],
            [
                8772,
                3
            ],
            [
                5718,
                2
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nWITH student.Advisor AS Advisor, count(*) AS count\nWHERE count  > 2\nRETURN Advisor",
        "question": "Report all advisors that advise more than 2 students.",
        "answers": [
            [
                1121
            ],
            [
                1148
            ],
            [
                2192
            ],
            [
                8722
            ],
            [
                2311
            ],
            [
                8772
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nWITH student.Advisor AS Advisor, count(*) AS count\nWHERE count  > 2\nRETURN Advisor",
        "question": "Which advisors have more than two students?",
        "answers": [
            [
                1121
            ],
            [
                1148
            ],
            [
                2192
            ],
            [
                8722
            ],
            [
                2311
            ],
            [
                8772
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nWITH count(*) AS count, student.Major AS Major\nWHERE count  < 3\nRETURN Major",
        "question": "Report all majors that have less than 3 students.",
        "answers": [
            [
                540
            ],
            [
                100
            ],
            [
                50
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nWITH count(*) AS count, student.Major AS Major\nWHERE count  < 3\nRETURN Major",
        "question": "What are the majors only less than three students are studying?",
        "answers": [
            [
                540
            ],
            [
                100
            ],
            [
                50
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN voting_record.Election_Cycle,count(*)",
        "question": "For each election cycle, report the number of voting records.",
        "answers": [
            [
                "Spring",
                5
            ],
            [
                "Fall",
                5
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN voting_record.Election_Cycle,count(*)",
        "question": "Count the number of voting records for each election cycle.",
        "answers": [
            [
                "Spring",
                5
            ],
            [
                "Fall",
                5
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nRETURN student.Major\nORDER BY student.Major DESC\nLIMIT 1",
        "question": "Which major has the most students?",
        "answers": [
            [
                600
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nRETURN student.Major\nORDER BY student.Major DESC\nLIMIT 1",
        "question": "Find the major that is studied by the largest number of students.",
        "answers": [
            [
                600
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nWITH student.Advisor AS Advisor, count(*) AS count\nWHERE count  > 2\nRETURN Advisor",
        "question": "Report the distinct advisors who have more than 2 students.",
        "answers": [
            [
                1121
            ],
            [
                1148
            ],
            [
                2192
            ],
            [
                8722
            ],
            [
                2311
            ],
            [
                8772
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nWITH student.Advisor AS Advisor, count(*) AS count\nWHERE count  > 2\nRETURN Advisor",
        "question": "Which advisors are advising more than 2 students?",
        "answers": [
            [
                1121
            ],
            [
                1148
            ],
            [
                2192
            ],
            [
                8722
            ],
            [
                2311
            ],
            [
                8772
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (products:`products_gen_characteristics.Products`)\nRETURN count(*)",
        "question": "Count the number of products.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (ref_colors:`products_gen_characteristics.Ref_Colors`)\nRETURN count(*)",
        "question": "How many colors are there?",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (ref_colors:`products_gen_characteristics.Ref_Colors`)\nRETURN count(*)",
        "question": "Count the number of colors.",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (characteristics:`products_gen_characteristics.Characteristics`)\nRETURN count(*)",
        "question": "How many characteristics are there?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (characteristics:`products_gen_characteristics.Characteristics`)\nRETURN count(*)",
        "question": "Count the number of characteristics.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (products:`products_gen_characteristics.Products`)\nRETURN products.product_name,products.typical_buying_price",
        "question": "What are the names and buying prices of all the products?",
        "answers": [
            [
                "cumin",
                ""
            ],
            [
                "peper",
                "352447.2874677"
            ],
            [
                "basil",
                "503.8431967"
            ],
            [
                "borage",
                ""
            ],
            [
                "chili",
                ""
            ],
            [
                "ginger",
                "5.578"
            ],
            [
                "sesame",
                "1284268.0659"
            ],
            [
                "caraway",
                "24493"
            ],
            [
                "catnip",
                "12008702.623"
            ],
            [
                "flax",
                "339404395.7"
            ],
            [
                "chervil",
                ""
            ],
            [
                "voluptatem",
                "162"
            ],
            [
                "cinnam",
                "1686539.4"
            ],
            [
                "lotus",
                "43221310.465574"
            ],
            [
                "laurel",
                ""
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (products:`products_gen_characteristics.Products`)\nRETURN products.product_name,products.typical_buying_price",
        "question": "Return the names and typical buying prices for all products.",
        "answers": [
            [
                "cumin",
                ""
            ],
            [
                "peper",
                "352447.2874677"
            ],
            [
                "basil",
                "503.8431967"
            ],
            [
                "borage",
                ""
            ],
            [
                "chili",
                ""
            ],
            [
                "ginger",
                "5.578"
            ],
            [
                "sesame",
                "1284268.0659"
            ],
            [
                "caraway",
                "24493"
            ],
            [
                "catnip",
                "12008702.623"
            ],
            [
                "flax",
                "339404395.7"
            ],
            [
                "chervil",
                ""
            ],
            [
                "voluptatem",
                "162"
            ],
            [
                "cinnam",
                "1686539.4"
            ],
            [
                "lotus",
                "43221310.465574"
            ],
            [
                "laurel",
                ""
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (ref_colors:`products_gen_characteristics.Ref_Colors`)\nRETURN ref_colors.color_description",
        "question": "List the description of all the colors.",
        "answers": [
            [
                "red"
            ],
            [
                "green"
            ],
            [
                "yellow"
            ],
            [
                "blue"
            ],
            [
                "black"
            ],
            [
                "white"
            ],
            [
                "purple"
            ],
            [
                "gray"
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (ref_colors:`products_gen_characteristics.Ref_Colors`)\nRETURN ref_colors.color_description",
        "question": "What are the descriptions for each color?",
        "answers": [
            [
                "red"
            ],
            [
                "green"
            ],
            [
                "yellow"
            ],
            [
                "blue"
            ],
            [
                "black"
            ],
            [
                "white"
            ],
            [
                "purple"
            ],
            [
                "gray"
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (characteristics:`products_gen_characteristics.Characteristics`)\nRETURN DISTINCT characteristics.characteristic_name",
        "question": "Find the names of all the product characteristics.",
        "answers": [
            [
                "slow"
            ],
            [
                "fast"
            ],
            [
                "warm"
            ],
            [
                "hot"
            ],
            [
                "cool"
            ],
            [
                "error"
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (characteristics:`products_gen_characteristics.Characteristics`)\nRETURN DISTINCT characteristics.characteristic_name",
        "question": "What are the different names of the product characteristics?",
        "answers": [
            [
                "slow"
            ],
            [
                "fast"
            ],
            [
                "warm"
            ],
            [
                "hot"
            ],
            [
                "cool"
            ],
            [
                "error"
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (T1:`products_gen_characteristics.Products`)-[]-(T2:`products_gen_characteristics.Ref_Colors`)\nWHERE T2.color_description = 'yellow'\nRETURN T1.product_name",
        "question": "What is the name of the product with the color description 'yellow'?",
        "answers": [
            [
                "borage"
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (T1:`products_gen_characteristics.Products`)-[]-(T2:`products_gen_characteristics.Ref_Colors`)\nWHERE T2.color_description = 'yellow'\nRETURN T1.product_name",
        "question": "Give the name of the products that have a color description 'yellow'.",
        "answers": [
            [
                "borage"
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (T1:`products_gen_characteristics.Ref_Product_Categories`)-[]-(T2:`products_gen_characteristics.Products`)\nWHERE T2.product_description =~'.*[T|t].*'\nRETURN T1.product_category_description",
        "question": "Find the category descriptions of the products whose descriptions include letter 't'.",
        "answers": [
            [
                "Herbs"
            ],
            [
                "Herbs"
            ],
            [
                "Seeds"
            ],
            [
                "Seeds"
            ],
            [
                "Seeds"
            ],
            [
                "Spices"
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (T1:`products_gen_characteristics.Ref_Product_Categories`)-[]-(T2:`products_gen_characteristics.Products`)\nWHERE T2.product_description =~'.*[T|t].*'\nRETURN T1.product_category_description",
        "question": "What are the descriptions of the categories that products with product descriptions that contain the letter t are in?",
        "answers": [
            [
                "Herbs"
            ],
            [
                "Herbs"
            ],
            [
                "Seeds"
            ],
            [
                "Seeds"
            ],
            [
                "Seeds"
            ],
            [
                "Spices"
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (t1:`products_gen_characteristics.Products`)-[]-(t2:`products_gen_characteristics.Ref_Colors`)\nWITH t2, count(t2.color_description) AS cnt\nRETURN t2.color_description\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the description of the color for most products?",
        "answers": [
            [
                "blue"
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (t1:`products_gen_characteristics.Products`)-[t2:`products_gen_characteristics.Product_Characteristics`]-(t3:`products_gen_characteristics.Characteristics`)\nWITH t3, count(t3.characteristic_name) AS cnt\nRETURN t3.characteristic_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the characteristic name used by most number of the products?",
        "answers": [
            [
                "fast"
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (t1:`products_gen_characteristics.Products`)-[t2:`products_gen_characteristics.Product_Characteristics`]-(t3:`products_gen_characteristics.Characteristics`)\nWITH count(*) AS count, t3.characteristic_name AS characteristic_name\nWHERE count  >= 2\nRETURN characteristic_name",
        "question": "What are characteristic names used at least twice across all products?",
        "answers": [
            [
                "slow"
            ],
            [
                "fast"
            ],
            [
                "warm"
            ]
        ]
    },
    {
        "db_id": "products_gen_characteristics",
        "query": "MATCH (t1:`products_gen_characteristics.Products`)-[t2:`products_gen_characteristics.Product_Characteristics`]-(t3:`products_gen_characteristics.Characteristics`)\nWITH count(*) AS count, t3.characteristic_name AS characteristic_name\nWHERE count  >= 2\nRETURN characteristic_name",
        "question": "Give the names of characteristics that are in two or more products?",
        "answers": [
            [
                "slow"
            ],
            [
                "fast"
            ],
            [
                "warm"
            ]
        ]
    },
    {
        "db_id": "swimming",
        "query": "MATCH (event:`swimming.event`)\nRETURN event.Name\nORDER BY event.Year DESC",
        "question": "List all the event names by year from the most recent to the oldest.",
        "answers": [
            [
                "European FINA"
            ],
            [
                "FINA"
            ],
            [
                "IPC"
            ],
            [
                "World Junior"
            ],
            [
                "World Master"
            ],
            [
                "Pacific"
            ]
        ]
    },
    {
        "db_id": "swimming",
        "query": "MATCH (stadium:`swimming.stadium`)\nRETURN stadium.name\nORDER BY stadium.Capacity DESC\nLIMIT 1",
        "question": "Find the name of the stadium that has the maximum capacity.",
        "answers": [
            [
                "Nou Mestalla"
            ]
        ]
    },
    {
        "db_id": "swimming",
        "query": "MATCH (stadium:`swimming.stadium`)\nWITH avg(stadium.Capacity) AS capacity\nMATCH (stadium:`swimming.stadium`)\nWHERE  stadium.Capacity <  capacity \nRETURN stadium.name",
        "question": "Find the names of stadiums whose capacity is smaller than the average capacity.",
        "answers": [
            [
                "Northumberland Development Project"
            ],
            [
                "Fisht Olympic Stadium"
            ],
            [
                "Arena Baltika"
            ],
            [
                "Yubileyniy Stadium"
            ]
        ]
    },
    {
        "db_id": "swimming",
        "query": "MATCH (stadium:`swimming.stadium`)\nWHERE stadium.Country <> 'Russia'\nRETURN count(*)",
        "question": "How many stadiums are not in country \"Russia\"?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "swimming",
        "query": "MATCH (swimmer:`swimming.swimmer`)\nRETURN swimmer.name\nORDER BY swimmer.meter_100",
        "question": "Find the names of all swimmers, sorted by their 100 meter scores in ascending order.",
        "answers": [
            [
                "S\u00e9bastien Rouault"
            ],
            [
                "Przemys\u0142aw Sta\u0144czyk"
            ],
            [
                "Oussama Mellouli"
            ],
            [
                "Sergiy Fesenko"
            ],
            [
                "Grant Hackett"
            ],
            [
                "Craig Stevens"
            ],
            [
                "Federico Colbertaldo"
            ],
            [
                "Ryan Cochrane"
            ]
        ]
    },
    {
        "db_id": "swimming",
        "query": "MATCH (swimmer:`swimming.swimmer`)\nWITH swimmer.Nationality AS Nationality, count(*) AS count\nWHERE count  > 1\nRETURN Nationality,count",
        "question": "List countries that have more than one swimmer.",
        "answers": [
            [
                "Australia",
                2
            ]
        ]
    },
    {
        "db_id": "swimming",
        "query": "MATCH (swimmer:`swimming.swimmer`)\nWHERE swimmer.Nationality = 'Australia'\nRETURN swimmer.meter_200,swimmer.meter_300",
        "question": "Find all 200 meter and 300 meter results of swimmers with nationality \"Australia\".",
        "answers": [
            [
                "1:56.34",
                "2:55.90"
            ],
            [
                "1:57.21",
                "2:56.95"
            ]
        ]
    },
    {
        "db_id": "swimming",
        "query": "MATCH (t1:`swimming.swimmer`)-[t2:`swimming.record`]-()\nWHERE t2.Result = 'Win'\nRETURN t1.name",
        "question": "Find the names of swimmers who has a result of \"win\".",
        "answers": [
            [
                "Craig Stevens"
            ],
            [
                "Craig Stevens"
            ],
            [
                "Craig Stevens"
            ],
            [
                "Federico Colbertaldo"
            ],
            [
                "Sergiy Fesenko"
            ],
            [
                "Grant Hackett"
            ],
            [
                "Ryan Cochrane"
            ],
            [
                "Oussama Mellouli"
            ],
            [
                "Oussama Mellouli"
            ]
        ]
    },
    {
        "db_id": "swimming",
        "query": "MATCH (t1:`swimming.stadium`)-[]-(t2:`swimming.event`)\nWHERE t2.Name = 'World Junior'\nRETURN t1.name,t1.Capacity",
        "question": "Find the name and capacity of the stadium where the event named \"World Junior\" happened.",
        "answers": [
            [
                "Baku Olympic Stadium",
                68000
            ]
        ]
    },
    {
        "db_id": "swimming",
        "query": "MATCH (stadium:`swimming.stadium`)\nWHERE NOT (stadium)-[]-(:`swimming.event`)    \nRETURN stadium.name",
        "question": "Find the names of stadiums which have never had any event.",
        "answers": [
            [
                "Ferenc Pusk\u00e1s Stadion"
            ],
            [
                "Stade des Lumi\u00e8res"
            ],
            [
                "Northumberland Development Project"
            ],
            [
                "Arena Baltika"
            ]
        ]
    },
    {
        "db_id": "swimming",
        "query": "MATCH (t1:`swimming.swimmer`)-[t2:`swimming.record`]-()\nWITH t1, count(t2.None) AS cnt\nRETURN t1.name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Find the name of the swimmer who has the most records.",
        "answers": [
            [
                "Craig Stevens"
            ]
        ]
    },
    {
        "db_id": "swimming",
        "query": "MATCH (t1:`swimming.swimmer`)-[t2:`swimming.record`]-()\nWITH count(*) AS count, t1.name AS name\nWHERE count  >= 2\nRETURN name",
        "question": "Find the name of the swimmer who has at least 2 records.",
        "answers": [
            [
                "Craig Stevens"
            ],
            [
                "Sergiy Fesenko"
            ],
            [
                "Oussama Mellouli"
            ]
        ]
    },
    {
        "db_id": "swimming",
        "query": "MATCH (t1:`swimming.swimmer`)-[t2:`swimming.record`]-()\nWHERE t2.Result = 'Win'\nWITH count(*) AS count, t1.name AS name, t1.Nationality AS Nationality\nWHERE count  > 1\nRETURN name,Nationality",
        "question": "Find the name and nationality of the swimmer who has won (i.e., has a result of \"win\") more than 1 time.",
        "answers": [
            [
                "Craig Stevens",
                "Australia"
            ],
            [
                "Oussama Mellouli",
                "Tunisia"
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (railway:`railway.railway`)\nRETURN count(*)",
        "question": "How many railways are there?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (railway:`railway.railway`)\nRETURN railway.Builder\nORDER BY railway.Builder ASC",
        "question": "List the builders of railways in ascending alphabetical order.",
        "answers": [
            [
                "Avonside"
            ],
            [
                "GER Hartford"
            ],
            [
                "GER Stratford"
            ],
            [
                "GNR Doncaster"
            ],
            [
                "GWR Swindon"
            ],
            [
                "GWR Swindon"
            ],
            [
                "MR Derby"
            ],
            [
                "SECR Ashford"
            ],
            [
                "Stephenson"
            ],
            [
                "Swindon Works"
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (railway:`railway.railway`)\nRETURN railway.Wheels,railway.Location",
        "question": "List the wheels and locations of the railways.",
        "answers": [
            [
                "4-4-0",
                "York"
            ],
            [
                "4-4-0",
                "Bo'ness"
            ],
            [
                "4-4-2",
                "Barrow Hill"
            ],
            [
                "4-4-0",
                "Toddington"
            ],
            [
                "0-6-0T",
                "Bressingham"
            ],
            [
                "0-6-0",
                "Barrow Hill"
            ],
            [
                "2-8-0",
                "Shildon"
            ],
            [
                "4-6-0",
                "Swindon"
            ],
            [
                "4-4-2T",
                "Bressingham"
            ],
            [
                "0-6-0ST",
                "Basingstoke"
            ]
        ]
    }
]