[
    {
        "question": "Count the number of schools that have had basketball matches.",
        "query": "MATCH (basketball_match:`university_basketball.basketball_match`)\nRETURN count(DISTINCT basketball_match.School_ID)",
        "db_id": "university_basketball",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "question": "Return the highest acc percent across all basketball matches.",
        "query": "MATCH (basketball_match:`university_basketball.basketball_match`)\nRETURN basketball_match.ACC_Percent\nORDER BY basketball_match.ACC_Percent DESC\nLIMIT 1",
        "db_id": "university_basketball",
        "answers": [
            [
                ".875"
            ]
        ]
    },
    {
        "question": "Return the average enrollment of universities founded before 1850.",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Founded < 1850\nRETURN avg(university.Enrollment)",
        "db_id": "university_basketball",
        "answers": [
            [
                37967.5
            ]
        ]
    },
    {
        "question": "Show the enrollment and primary_conference of the oldest college.",
        "query": "MATCH (university:`university_basketball.university`)\nRETURN university.Enrollment,university.Primary_conference\nORDER BY university.Founded\nLIMIT 1",
        "db_id": "university_basketball",
        "answers": [
            [
                19067.0,
                "Colonial Athletic Association ( D-I )"
            ]
        ]
    },
    {
        "question": "Count the number of universities that do not participate in the baketball match.",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE NOT (university:`university_basketball.university`)-[]-(:`university_basketball.basketball_match`)\nRETURN count(*)",
        "db_id": "university_basketball",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "question": "Find the schools that were either founded after 1850 or public.",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Founded > 1850 OR university.Affiliation = 'Public'\nRETURN university.School",
        "db_id": "university_basketball",
        "answers": [
            [
                "University of Delaware"
            ],
            [
                "Lebanon Valley College"
            ],
            [
                "University of Rhode Island"
            ],
            [
                "Rutgers University"
            ],
            [
                "Stony Brook University"
            ]
        ]
    },
    {
        "question": "Find how many different affiliation types there are.",
        "query": "MATCH (university:`university_basketball.university`)\nRETURN count(DISTINCT university.Affiliation)",
        "db_id": "university_basketball",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "Find the number of universities that have over a 20000 enrollment size for each affiliation type.",
        "query": "MATCH (university:`university_basketball.university`)\nWHERE university.Enrollment > 20000\nWITH university.Affiliation AS Affiliation, count(university.Affiliation) AS count\nRETURN count,Affiliation",
        "db_id": "university_basketball",
        "answers": [
            [
                2,
                "Public"
            ]
        ]
    },
    {
        "question": "Return the maximum enrollment across all schools.",
        "query": "MATCH (university:`university_basketball.university`)\nRETURN max(university.Enrollment)",
        "db_id": "university_basketball",
        "answers": [
            [
                56868.0
            ]
        ]
    },
    {
        "question": "List names of all teams in the basketball competition, ordered by all home scores in descending order.",
        "query": "MATCH (basketball_match:`university_basketball.basketball_match`)\nRETURN basketball_match.Team_Name\nORDER BY basketball_match.All_Home DESC",
        "db_id": "university_basketball",
        "answers": [
            [
                "Duke"
            ],
            [
                "Virginia Tech"
            ],
            [
                "North Carolina"
            ],
            [
                "Clemson"
            ]
        ]
    },
    {
        "question": "the names of models that launched between 2002 and 2004.",
        "query": "MATCH (chip_model:`phone_1.chip_model`)\nWHERE 2002<=chip_model.Launch_year<=2004\nRETURN chip_model.Model_name",
        "db_id": "phone_1",
        "answers": [
            [
                "X5"
            ],
            [
                "X5 high end"
            ],
            [
                "X3 Basic"
            ],
            [
                "X3 Advanced"
            ],
            [
                "X3i"
            ],
            [
                "X30 low-end"
            ],
            [
                "X30 mid-range"
            ],
            [
                "X30 high-end"
            ],
            [
                "X50 Standard"
            ],
            [
                "X50 Advanced"
            ],
            [
                "X50v"
            ]
        ]
    },
    {
        "question": "Which model has the least amount of RAM? List the model name and the amount of RAM.",
        "query": "MATCH (chip_model:`phone_1.chip_model`)\nRETURN chip_model.Model_name,chip_model.RAM_MiB\nORDER BY chip_model.RAM_MiB ASC\nLIMIT 1",
        "db_id": "phone_1",
        "answers": [
            [
                "X5",
                32.0
            ]
        ]
    },
    {
        "question": "What are the chip model and screen mode of the phone with hardware model name \"LG-P760\"?",
        "query": "MATCH (phone:`phone_1.phone`)\nWHERE phone.Hardware_Model_name = \"LG-P760\"\nRETURN phone.chip_model,phone.screen_mode",
        "db_id": "phone_1",
        "answers": [
            [
                "X51v",
                "3"
            ]
        ]
    },
    {
        "question": "How many phone hardware models are produced by the company named \"Nokia Corporation\"?",
        "query": "MATCH (phone:`phone_1.phone`)\nWHERE phone.Company_name = 'Nokia Corporation'\nRETURN count(*)",
        "db_id": "phone_1",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "Find all phones that have word 'Full' in their accreditation types. List the Hardware Model name and Company name.",
        "query": "MATCH (phone:`phone_1.phone`)\nWHERE phone.Accreditation_type =~'.*[F|f]ull.*'\nRETURN phone.Hardware_Model_name,phone.Company_name",
        "db_id": "phone_1",
        "answers": [
            [
                "XPERIA T, XPERIA J",
                "Sony Mobile Communications"
            ],
            [
                "LG-P760",
                "LG Electronics"
            ],
            [
                "Lumia 920, Lumia 820, Lumia 620",
                "Nokia Corporation"
            ],
            [
                "GT-I9300",
                "Samsung Electronics Co Ltd"
            ]
        ]
    },
    {
        "question": "List the name of the company that produced more than one phone model.",
        "query": "MATCH (phone:`phone_1.phone`)\nWITH count(*) AS count, phone.Company_name AS Company_name\nWHERE count  > 1\nRETURN Company_name",
        "db_id": "phone_1",
        "answers": [
            [
                "Nokia Corporation"
            ],
            [
                "Samsung Electronics Co Ltd"
            ]
        ]
    },
    {
        "question": "List the maximum, minimum and average number of used kb in screen mode.",
        "query": "MATCH (screen_mode:`phone_1.screen_mode`)\nRETURN max(screen_mode.used_kb),min(screen_mode.used_kb),avg(screen_mode.used_kb)",
        "db_id": "phone_1",
        "answers": [
            [
                20.0,
                8.0,
                14.857142857142858
            ]
        ]
    },
    {
        "question": "Find the number of phones for each accreditation type.",
        "query": "MATCH (phone:`phone_1.phone`)\nWITH phone.Accreditation_type AS Accreditation_type, count(phone.Accreditation_type) AS count\nRETURN Accreditation_type,count",
        "db_id": "phone_1",
        "answers": [
            [
                "Full",
                4
            ],
            [
                "Provisional",
                4
            ]
        ]
    },
    {
        "question": "Find the accreditation level that more than 3 phones use.",
        "query": "MATCH (phone:`phone_1.phone`)\nWITH count(*) AS count, phone.Accreditation_level AS Accreditation_level\nWHERE count  > 3\nRETURN Accreditation_level",
        "db_id": "phone_1",
        "answers": [
            [
                "joyn"
            ]
        ]
    },
    {
        "question": "Count the number of chip model that do not have wifi.",
        "query": "MATCH (chip_model:`phone_1.chip_model`)\nWHERE chip_model.WiFi = 'No'\nRETURN count(*)",
        "db_id": "phone_1",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "List all the model names sorted by their launch year.",
        "query": "MATCH (chip_model:`phone_1.chip_model`)\nRETURN chip_model.Model_name\nORDER BY chip_model.Launch_year",
        "db_id": "phone_1",
        "answers": [
            [
                "X5"
            ],
            [
                "X5 high end"
            ],
            [
                "X3 Basic"
            ],
            [
                "X3 Advanced"
            ],
            [
                "X3i"
            ],
            [
                "X30 low-end"
            ],
            [
                "X30 mid-range"
            ],
            [
                "X30 high-end"
            ],
            [
                "X50 Standard"
            ],
            [
                "X50 Advanced"
            ],
            [
                "X50v"
            ],
            [
                "X51 low-end"
            ],
            [
                "X51 mid-range"
            ],
            [
                "X51v"
            ]
        ]
    },
    {
        "question": "Count the number of countries.",
        "query": "MATCH (country:`match_season.country`)\nRETURN count(*)",
        "db_id": "match_season",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "question": "Show the country name and capital of all countries.",
        "query": "MATCH (country:`match_season.country`)\nRETURN country.Country_name,country.Capital",
        "db_id": "match_season",
        "answers": [
            [
                "Indonesia",
                "Jakarta"
            ],
            [
                "Iran",
                "Tehran"
            ],
            [
                "Iraq",
                "Baghdad"
            ],
            [
                "Ireland",
                "Dublin"
            ],
            [
                "Isle of Man",
                "Douglas"
            ],
            [
                "United States",
                "Washington"
            ]
        ]
    },
    {
        "question": "Show all distinct positions of matches.",
        "query": "MATCH (match_season:`match_season.match_season`)\nRETURN DISTINCT match_season.Position",
        "db_id": "match_season",
        "answers": [
            [
                "Midfielder"
            ],
            [
                "Defender"
            ],
            [
                "Forward"
            ]
        ]
    },
    {
        "question": "Show the players from college UCLA.",
        "query": "MATCH (match_season:`match_season.match_season`)\nWHERE match_season.College = 'UCLA'\nRETURN match_season.Player",
        "db_id": "match_season",
        "answers": [
            [
                "Carlos Bocanegra Category:Articles with hCards"
            ],
            [
                "Jonathan Bornstein Category:Articles with hCards"
            ]
        ]
    },
    {
        "question": "Show the distinct position of players from college UCLA or Duke.",
        "query": "MATCH (match_season:`match_season.match_season`)\nWHERE match_season.College = 'UCLA' OR match_season.College = 'Duke'\nRETURN DISTINCT match_season.Position",
        "db_id": "match_season",
        "answers": [
            [
                "Defender"
            ]
        ]
    },
    {
        "question": "Show the draft pick numbers and draft classes of players whose positions are defenders.",
        "query": "MATCH (match_season:`match_season.match_season`)\nWHERE match_season.Position = 'Defender'\nRETURN match_season.Draft_Pick_Number,match_season.Draft_Class",
        "db_id": "match_season",
        "answers": [
            [
                87,
                "1996 MLS Inaugural Player Draft"
            ],
            [
                5,
                "1999 MLS College Draft"
            ],
            [
                4,
                "2000 MLS SuperDraft"
            ],
            [
                9,
                "2005 MLS SuperDraft"
            ],
            [
                37,
                "2006 MLS SuperDraft"
            ],
            [
                4,
                "2008 MLS SuperDraft"
            ],
            [
                3,
                "2009 MLS SuperDraft"
            ]
        ]
    },
    {
        "question": "Count the number of different teams involved in match season.",
        "query": "MATCH (match_season:`match_season.match_season`)\nRETURN count(DISTINCT match_season.Team)",
        "db_id": "match_season",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "Show the players and the years played.",
        "query": "MATCH (player:`match_season.player`)\nRETURN player.Player,player.Years_Played",
        "db_id": "match_season",
        "answers": [
            [
                "Cho Soong-Jae (630)",
                "1 (2011)"
            ],
            [
                "Chung Hong (717)",
                "1 (2011)"
            ],
            [
                "Im Kyu-tae (492)",
                "8 (2003\u20132005, 2007\u20132011)"
            ],
            [
                "Jeong Suk-Young (793)",
                "2 (2010\u20132011)"
            ],
            [
                "Kim Hyun-Joon (908)",
                "2 (2010\u20132011)"
            ],
            [
                "Kim Young-Jun (474)",
                "4 (2003\u20132004, 2010\u20132011)"
            ],
            [
                "Lim Yong-Kyu (288)",
                "3 (2009\u20132011)"
            ],
            [
                "Seol Jae-Min (none)",
                "2 (2010-2011)"
            ],
            [
                "An Jae-Sung",
                "3 (2005, 2007\u20132008)"
            ],
            [
                "Bae Nam-Ju",
                "2 (1988, 1990)"
            ]
        ]
    },
    {
        "question": "Show all team names.",
        "query": "MATCH (team:`match_season.team`)\nRETURN team.Name",
        "db_id": "match_season",
        "answers": [
            [
                "Columbus Crew"
            ],
            [
                "Evalyn Feil"
            ],
            [
                "Anais VonRueden"
            ],
            [
                "Miami Fusion"
            ],
            [
                "Enrique Osinski"
            ],
            [
                "Brown Erdman"
            ],
            [
                "Los Angeles Galaxy"
            ],
            [
                "Berneice Hand"
            ],
            [
                "Ryley Goldner"
            ],
            [
                "D.C. United"
            ]
        ]
    },
    {
        "question": "Show the players and years played for players from team \"Columbus Crew\".",
        "query": "MATCH (T1:`match_season.player`)-[]-(T2:`match_season.team`)\nWHERE T2.Name = 'Columbus Crew'\nRETURN T1.Player,T1.Years_Played",
        "db_id": "match_season",
        "answers": [
            [
                "Chung Hong (717)",
                "1 (2011)"
            ],
            [
                "An Jae-Sung",
                "3 (2005, 2007\u20132008)"
            ],
            [
                "Im Kyu-tae (492)",
                "8 (2003\u20132005, 2007\u20132011)"
            ],
            [
                "Jeong Suk-Young (793)",
                "2 (2010\u20132011)"
            ],
            [
                "Seol Jae-Min (none)",
                "2 (2010-2011)"
            ],
            [
                "Cho Soong-Jae (630)",
                "1 (2011)"
            ]
        ]
    },
    {
        "question": "Show the position of players and the corresponding number of players.",
        "query": "MATCH (match_season:`match_season.match_season`)\nWITH match_season.Position AS Position, count(match_season.Position) AS count\nRETURN Position,count",
        "db_id": "match_season",
        "answers": [
            [
                "Midfielder",
                6
            ],
            [
                "Defender",
                7
            ],
            [
                "Forward",
                3
            ]
        ]
    },
    {
        "question": "Return all players sorted by college in ascending alphabetical order.",
        "query": "MATCH (match_season:`match_season.match_season`)\nRETURN match_season.Player\nORDER BY match_season.College ASC",
        "db_id": "match_season",
        "answers": [
            [
                "Sean Franklin Category:Articles with hCards"
            ],
            [
                "Rodrigo Faria Category:Articles with hCards"
            ],
            [
                "Damani Ralph Category:Articles with hCards"
            ],
            [
                "Jay Heaps Category:Articles with hCards"
            ],
            [
                "Steve Ralston Category:Articles with hCards"
            ],
            [
                "Clint Dempsey Category:Articles with hCards"
            ],
            [
                "C. J. Sapong Category:Articles with hCards"
            ],
            [
                "Maurice Edu Category:Articles with hCards"
            ],
            [
                "Omar Gonzalez Category:Articles with hCards"
            ],
            [
                "Carlos Bocanegra Category:Articles with hCards"
            ],
            [
                "Jonathan Bornstein Category:Articles with hCards"
            ],
            [
                "Mike Duhaney Category:Articles with hCards"
            ],
            [
                "Ben Olsen Category:Articles with hCards"
            ],
            [
                "Kyle Martino Category:Articles with hCards"
            ],
            [
                "Michael Parkhurst Category:Articles with hCards"
            ],
            [
                "Andy Najar Category:Articles with hCards"
            ]
        ]
    },
    {
        "question": "Show the most common position of players in match seasons.",
        "query": "MATCH (match_season:`match_season.match_season`)\nWITH match_season.Position AS Position, count(match_season.Position) AS count\nRETURN Position\nORDER BY count DESC\nLIMIT 1",
        "db_id": "match_season",
        "answers": [
            [
                "Defender"
            ]
        ]
    },
    {
        "question": "What is the position that is most common among players in match seasons?",
        "query": "MATCH (match_season:`match_season.match_season`)\nWITH match_season.Position AS Position, count(match_season.Position) AS count\nRETURN Position\nORDER BY count DESC\nLIMIT 1",
        "db_id": "match_season",
        "answers": [
            [
                "Defender"
            ]
        ]
    },
    {
        "question": "Show the top 3 most common colleges of players in match seasons.",
        "query": "MATCH (match_season:`match_season.match_season`)\nWITH match_season.College AS College, count(match_season.College) AS count\nRETURN College\nORDER BY count DESC\nLIMIT 3",
        "db_id": "match_season",
        "answers": [
            [
                "UCLA"
            ],
            [
                "Virginia"
            ],
            [
                "Maryland"
            ]
        ]
    },
    {
        "question": "What are the three colleges from which the most players are from?",
        "query": "MATCH (match_season:`match_season.match_season`)\nWITH match_season.College AS College, count(match_season.College) AS count\nRETURN College\nORDER BY count DESC\nLIMIT 3",
        "db_id": "match_season",
        "answers": [
            [
                "UCLA"
            ],
            [
                "Virginia"
            ],
            [
                "Maryland"
            ]
        ]
    },
    {
        "question": "Show the name of colleges that have at least two players.",
        "query": "MATCH (match_season:`match_season.match_season`)\nWITH count(*) AS count, match_season.College AS College\nWHERE count  >= 2\nRETURN College",
        "db_id": "match_season",
        "answers": [
            [
                "Virginia"
            ],
            [
                "UCLA"
            ],
            [
                "Maryland"
            ]
        ]
    },
    {
        "question": "Count the number of climbers.",
        "query": "MATCH (climber:`climbing.climber`)\nRETURN count(*)",
        "db_id": "climbing",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "question": "List the names of climbers in descending order of points.",
        "query": "MATCH (climber:`climbing.climber`)\nRETURN climber.Name\nORDER BY climber.Points DESC",
        "db_id": "climbing",
        "answers": [
            [
                "Klaus Enders"
            ],
            [
                "Siegfried Schauzu"
            ],
            [
                "Hans Luthringhauser"
            ],
            [
                "Jean Claude Castella"
            ],
            [
                "Horst Owesle"
            ],
            [
                "Georg Auerbacher"
            ],
            [
                "Arseneus Butscher"
            ],
            [
                "Charlie Freedman"
            ],
            [
                "L Currie"
            ],
            [
                "Mick Horsepole"
            ]
        ]
    },
    {
        "question": "List the names of climbers whose country is not Switzerland.",
        "query": "MATCH (climber:`climbing.climber`)\nWHERE climber.Country <> 'Switzerland'\nRETURN climber.Name",
        "db_id": "climbing",
        "answers": [
            [
                "Klaus Enders"
            ],
            [
                "Siegfried Schauzu"
            ],
            [
                "Hans Luthringhauser"
            ],
            [
                "Horst Owesle"
            ],
            [
                "Georg Auerbacher"
            ],
            [
                "Arseneus Butscher"
            ],
            [
                "Charlie Freedman"
            ],
            [
                "L Currie"
            ],
            [
                "Mick Horsepole"
            ]
        ]
    },
    {
        "question": "Return the maximum number of points for climbers from the United Kingdom.",
        "query": "MATCH (climber:`climbing.climber`)\nWHERE climber.Country = 'United Kingdom'\nRETURN max(climber.Points)",
        "db_id": "climbing",
        "answers": [
            [
                3.0
            ]
        ]
    },
    {
        "question": "Count the number of different countries that climbers are from.",
        "query": "MATCH (climber:`climbing.climber`)\nRETURN count(DISTINCT climber.Country)",
        "db_id": "climbing",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "Give the names of mountains in alphabetical order.",
        "query": "MATCH (mountain:`climbing.mountain`)\nRETURN mountain.Name\nORDER BY mountain.Name ASC",
        "db_id": "climbing",
        "answers": [
            [
                "Duwoni / Mt Speke (Vittorio Emanuele Pk)"
            ],
            [
                "Kibo (Uhuru Pk)"
            ],
            [
                "Mawenzi (Hans Meyer Pk)"
            ],
            [
                "Mount Kenya (Batian)"
            ],
            [
                "Mount Kenya (Lenana)"
            ],
            [
                "Ngaliema / Mt Stanley (Margherita Pk)"
            ],
            [
                "Ngaliema / Mt Stanley (Savoia Pk)"
            ]
        ]
    },
    {
        "question": "Return the countries of the mountains that have a height larger than 5000.",
        "query": "MATCH (mountain:`climbing.mountain`)\nWHERE mountain.Height > 5000\nRETURN mountain.Country",
        "db_id": "climbing",
        "answers": [
            [
                "Tanzania"
            ],
            [
                "Kenya"
            ],
            [
                "Tanzania"
            ],
            [
                "DR Congo Uganda"
            ]
        ]
    },
    {
        "question": "Return the name of the mountain with the greatest height.",
        "query": "MATCH (mountain:`climbing.mountain`)\nRETURN mountain.Name\nORDER BY mountain.Height DESC\nLIMIT 1",
        "db_id": "climbing",
        "answers": [
            [
                "Kibo (Uhuru Pk)"
            ]
        ]
    },
    {
        "question": "Show names of climbers and the names of mountains they climb.",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nRETURN T1.Name,T2.Name",
        "db_id": "climbing",
        "answers": [
            [
                "Klaus Enders",
                "Kibo (Uhuru Pk)"
            ],
            [
                "Siegfried Schauzu",
                "Kibo (Uhuru Pk)"
            ],
            [
                "Hans Luthringhauser",
                "Mount Kenya (Batian)"
            ],
            [
                "Jean Claude Castella",
                "Mount Kenya (Batian)"
            ],
            [
                "Horst Owesle",
                "Mount Kenya (Batian)"
            ],
            [
                "Georg Auerbacher",
                "Mawenzi (Hans Meyer Pk)"
            ],
            [
                "Arseneus Butscher",
                "Mount Kenya (Lenana)"
            ],
            [
                "Charlie Freedman",
                "Mount Kenya (Lenana)"
            ],
            [
                "L Currie",
                "Duwoni / Mt Speke (Vittorio Emanuele Pk)"
            ],
            [
                "Mick Horsepole",
                "Duwoni / Mt Speke (Vittorio Emanuele Pk)"
            ]
        ]
    },
    {
        "question": "Show the names of climbers and the heights of mountains they climb.",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nRETURN T1.Name,T2.Height",
        "db_id": "climbing",
        "answers": [
            [
                "Klaus Enders",
                5895.0
            ],
            [
                "Siegfried Schauzu",
                5895.0
            ],
            [
                "Hans Luthringhauser",
                5199.0
            ],
            [
                "Jean Claude Castella",
                5199.0
            ],
            [
                "Horst Owesle",
                5199.0
            ],
            [
                "Georg Auerbacher",
                5148.0
            ],
            [
                "Arseneus Butscher",
                4985.0
            ],
            [
                "Charlie Freedman",
                4985.0
            ],
            [
                "L Currie",
                4890.0
            ],
            [
                "Mick Horsepole",
                4890.0
            ]
        ]
    },
    {
        "question": "Show the height of the mountain climbed by the climber with the maximum points.",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nRETURN T2.Height\nORDER BY T1.Points DESC\nLIMIT 1",
        "db_id": "climbing",
        "answers": [
            [
                5895.0
            ]
        ]
    },
    {
        "question": "Show the distinct names of mountains climbed by climbers from country \"West Germany\".",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nWHERE T1.Country = 'West Germany'\nRETURN DISTINCT T2.Name",
        "db_id": "climbing",
        "answers": [
            [
                "Kibo (Uhuru Pk)"
            ],
            [
                "Mount Kenya (Batian)"
            ],
            [
                "Mawenzi (Hans Meyer Pk)"
            ],
            [
                "Mount Kenya (Lenana)"
            ]
        ]
    },
    {
        "question": "Show the times used by climbers to climb mountains in Country Uganda.",
        "query": "MATCH (T1:`climbing.climber`)-[]-(T2:`climbing.mountain`)\nWHERE T2.Country = 'Uganda'\nRETURN T1.Time",
        "db_id": "climbing",
        "answers": [
            [
                "1:25.40.6"
            ],
            [
                "1:27.28.8"
            ]
        ]
    },
    {
        "question": "Please show the countries and the number of climbers from each country.",
        "query": "MATCH (climber:`climbing.climber`)\nWITH climber.Country AS Country, count(climber.Country) AS count\nRETURN Country,count",
        "db_id": "climbing",
        "answers": [
            [
                "West Germany",
                6
            ],
            [
                "Switzerland",
                1
            ],
            [
                "United Kingdom",
                3
            ]
        ]
    },
    {
        "question": "List the countries that have more than one mountain.",
        "query": "MATCH (mountain:`climbing.mountain`)\nWITH mountain.Country AS Country, count(*) AS count\nWHERE count  > 1\nRETURN Country",
        "db_id": "climbing",
        "answers": [
            [
                "Tanzania"
            ],
            [
                "Kenya"
            ],
            [
                "Uganda"
            ]
        ]
    },
    {
        "question": "List the names of mountains that do not have any climber.",
        "query": "MATCH (mountain:`climbing.mountain`)\nWHERE NOT (mountain:`climbing.mountain`)-[]-(:`climbing.climber`)\nRETURN mountain.Name",
        "db_id": "climbing",
        "answers": [
            [
                "Ngaliema / Mt Stanley (Margherita Pk)"
            ],
            [
                "Ngaliema / Mt Stanley (Savoia Pk)"
            ]
        ]
    },
    {
        "question": "Show the range that has the most number of mountains.",
        "query": "MATCH (mountain:`climbing.mountain`)\nWITH count(mountain.Range) AS count, mountain.Range AS Range\nRETURN Range\nORDER BY count DESC\nLIMIT 1",
        "db_id": "climbing",
        "answers": [
            [
                "Rwenzori"
            ]
        ]
    }
]