[
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (problem_log:`tracking_software_problems.Problem_Log`)\nRETURN problem_log.problem_log_id\nORDER BY problem_log.log_entry_date DESC\nLIMIT 1",
        "question": "Which problem log was created most recently? Give me the log id.",
        "answers": [
            [
                14
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (problem_log:`tracking_software_problems.Problem_Log`)\nRETURN problem_log.problem_log_id,problem_log.problem_id\nORDER BY problem_log.log_entry_date\nLIMIT 1",
        "question": "What is the oldest log id and its corresponding problem id?",
        "answers": [
            [
                11,
                8
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (problem_log:`tracking_software_problems.Problem_Log`)\nRETURN problem_log.problem_log_id,problem_log.problem_id\nORDER BY problem_log.log_entry_date\nLIMIT 1",
        "question": "Find the oldest log id and its corresponding problem id.",
        "answers": [
            [
                11,
                8
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (problem_log:`tracking_software_problems.Problem_Log`)\nWHERE problem_log.problem_id = 10\nRETURN problem_log.problem_log_id,problem_log.log_entry_date",
        "question": "Find all the ids and dates of the logs for the problem whose id is 10.",
        "answers": [
            [
                12,
                "1997-08-31 08:19:12"
            ],
            [
                13,
                "2009-04-10 19:09:30"
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (problem_log:`tracking_software_problems.Problem_Log`)\nWHERE problem_log.problem_id = 10\nRETURN problem_log.problem_log_id,problem_log.log_entry_date",
        "question": "For the problem with id 10, return the ids and dates of its problem logs.",
        "answers": [
            [
                12,
                "1997-08-31 08:19:12"
            ],
            [
                13,
                "2009-04-10 19:09:30"
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (problem_log:`tracking_software_problems.Problem_Log`)\nRETURN problem_log.problem_log_id,problem_log.log_entry_description",
        "question": "List all the log ids and their descriptions from the problem logs.",
        "answers": [
            [
                1,
                "t"
            ],
            [
                2,
                "a"
            ],
            [
                3,
                "b"
            ],
            [
                4,
                "a"
            ],
            [
                5,
                "c"
            ],
            [
                6,
                "h"
            ],
            [
                7,
                "s"
            ],
            [
                8,
                "j"
            ],
            [
                9,
                "p"
            ],
            [
                10,
                "d"
            ],
            [
                11,
                "w"
            ],
            [
                12,
                "c"
            ],
            [
                13,
                "q"
            ],
            [
                14,
                "a"
            ],
            [
                15,
                "v"
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (problem_log:`tracking_software_problems.Problem_Log`)\nRETURN problem_log.problem_log_id,problem_log.log_entry_description",
        "question": "What are the log id and entry description of each problem?",
        "answers": [
            [
                1,
                "t"
            ],
            [
                2,
                "a"
            ],
            [
                3,
                "b"
            ],
            [
                4,
                "a"
            ],
            [
                5,
                "c"
            ],
            [
                6,
                "h"
            ],
            [
                7,
                "s"
            ],
            [
                8,
                "j"
            ],
            [
                9,
                "p"
            ],
            [
                10,
                "d"
            ],
            [
                11,
                "w"
            ],
            [
                12,
                "c"
            ],
            [
                13,
                "q"
            ],
            [
                14,
                "a"
            ],
            [
                15,
                "v"
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (problems:`tracking_software_problems.Problems`)\nWHERE problems.date_problem_reported > \"1978-06-26\"\nRETURN problems.problem_id",
        "question": "What are the ids of the problems which are reported after 1978-06-26?",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ],
            [
                5
            ],
            [
                6
            ],
            [
                7
            ],
            [
                9
            ],
            [
                10
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (problems:`tracking_software_problems.Problems`)\nWHERE problems.date_problem_reported > \"1978-06-26\"\nRETURN problems.problem_id",
        "question": "Find the ids of the problems reported after 1978-06-26.",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ],
            [
                5
            ],
            [
                6
            ],
            [
                7
            ],
            [
                9
            ],
            [
                10
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (problems:`tracking_software_problems.Problems`)\nWHERE problems.date_problem_reported < \"1978-06-26\"\nRETURN problems.problem_id",
        "question": "What are the ids of the problems which are reported before 1978-06-26?",
        "answers": [
            [
                4
            ],
            [
                8
            ],
            [
                11
            ],
            [
                12
            ],
            [
                13
            ],
            [
                14
            ],
            [
                15
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (problems:`tracking_software_problems.Problems`)\nWHERE problems.date_problem_reported < \"1978-06-26\"\nRETURN problems.problem_id",
        "question": "Which problems are reported before 1978-06-26? Give me the ids of the problems.",
        "answers": [
            [
                4
            ],
            [
                8
            ],
            [
                11
            ],
            [
                12
            ],
            [
                13
            ],
            [
                14
            ],
            [
                15
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (T1:`tracking_software_problems.Problems`)-[]-(T2:`tracking_software_problems.Product`)\nRETURN count(*),T2.product_id",
        "question": "For each product which has problems, what are the number of problems and the product id?",
        "answers": [
            [
                4,
                1
            ],
            [
                2,
                2
            ],
            [
                3,
                4
            ],
            [
                1,
                5
            ],
            [
                1,
                6
            ],
            [
                1,
                7
            ],
            [
                1,
                8
            ],
            [
                1,
                13
            ],
            [
                1,
                15
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (T1:`tracking_software_problems.Problems`)-[]-(T2:`tracking_software_problems.Product`)\nRETURN count(*),T2.product_id",
        "question": "For each product with some problems, list the count of problems and the product id.",
        "answers": [
            [
                4,
                1
            ],
            [
                2,
                2
            ],
            [
                3,
                4
            ],
            [
                1,
                5
            ],
            [
                1,
                6
            ],
            [
                1,
                7
            ],
            [
                1,
                8
            ],
            [
                1,
                13
            ],
            [
                1,
                15
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (T1:`tracking_software_problems.Problems`)-[]-(T2:`tracking_software_problems.Product`)\nWHERE T1.date_problem_reported > \"1986-11-13\"\nRETURN count(*),T2.product_id",
        "question": "For each product that has problems, find the number of problems reported after 1986-11-13 and the product id?",
        "answers": [
            [
                1,
                8
            ],
            [
                2,
                1
            ],
            [
                2,
                4
            ],
            [
                1,
                2
            ],
            [
                1,
                15
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (T1:`tracking_software_problems.Problems`)-[]-(T2:`tracking_software_problems.Product`)\nWHERE T1.date_problem_reported > \"1986-11-13\"\nRETURN count(*),T2.product_id",
        "question": "What are the products that have problems reported after 1986-11-13? Give me the product id and the count of problems reported after 1986-11-13.",
        "answers": [
            [
                1,
                8
            ],
            [
                2,
                1
            ],
            [
                2,
                4
            ],
            [
                1,
                2
            ],
            [
                1,
                15
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (product:`tracking_software_problems.Product`)\nRETURN DISTINCT product.product_name\nORDER BY product.product_name",
        "question": "List the names of all the distinct product names in alphabetical order?",
        "answers": [
            [
                "blog"
            ],
            [
                "chat"
            ],
            [
                "doulingo"
            ],
            [
                "game"
            ],
            [
                "hangout"
            ],
            [
                "keep"
            ],
            [
                "learn"
            ],
            [
                "life"
            ],
            [
                "messager"
            ],
            [
                "rose"
            ],
            [
                "snapchat"
            ],
            [
                "teach"
            ],
            [
                "twitter"
            ],
            [
                "wechat"
            ],
            [
                "yellow"
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (product:`tracking_software_problems.Product`)\nRETURN DISTINCT product.product_name\nORDER BY product.product_name",
        "question": "Sort all the distinct product names in alphabetical order.",
        "answers": [
            [
                "blog"
            ],
            [
                "chat"
            ],
            [
                "doulingo"
            ],
            [
                "game"
            ],
            [
                "hangout"
            ],
            [
                "keep"
            ],
            [
                "learn"
            ],
            [
                "life"
            ],
            [
                "messager"
            ],
            [
                "rose"
            ],
            [
                "snapchat"
            ],
            [
                "teach"
            ],
            [
                "twitter"
            ],
            [
                "wechat"
            ],
            [
                "yellow"
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (T1:`tracking_software_problems.Problems`)-[]-(T2:`tracking_software_problems.Product`)\nWITH count(T2.product_name) AS cnt, T2\nRETURN T2.product_name\nORDER BY cnt DESC\nLIMIT 3",
        "question": "Find the top 3 products which have the largest number of problems?",
        "answers": [
            [
                "rose"
            ],
            [
                "wechat"
            ],
            [
                "yellow"
            ]
        ]
    },
    {
        "db_id": "tracking_software_problems",
        "query": "MATCH (T1:`tracking_software_problems.Problems`)-[]-(T2:`tracking_software_problems.Product`)\nWITH count(T2.product_name) AS cnt, T2\nRETURN T2.product_name\nORDER BY cnt DESC\nLIMIT 3",
        "question": "What are the three products that have the most problems?s",
        "answers": [
            [
                "rose"
            ],
            [
                "wechat"
            ],
            [
                "yellow"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (branch:`shop_membership.branch`)\nRETURN branch.Name,branch.Address_road,branch.City\nORDER BY branch.Open_year",
        "question": "Show name, address road, and city for all branches sorted by open year.",
        "answers": [
            [
                "Alexandre",
                "Valleys Place",
                "London"
            ],
            [
                "Popert",
                "Oaks Crescent",
                "London"
            ],
            [
                "Zytogorski",
                "Abbey Rise",
                "Oxford"
            ],
            [
                "Brooke Greville",
                "Glebe Street",
                "Oxford"
            ],
            [
                "Cochrane",
                "Brampton Road",
                "London"
            ],
            [
                "Stanley",
                "Abbott Street",
                "London"
            ],
            [
                "Taverner",
                "Cecilia Avenue",
                "Oxford"
            ],
            [
                "Saint Amant",
                "Concord Road",
                "London"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (branch:`shop_membership.branch`)\nRETURN branch.Name\nORDER BY branch.membership_amount DESC\nLIMIT 3",
        "question": "What are names for top three branches with most number of membership?",
        "answers": [
            [
                "Saint Amant"
            ],
            [
                "Zytogorski"
            ],
            [
                "Stanley"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (branch:`shop_membership.branch`)\nWHERE branch.membership_amount >= '100'\nRETURN DISTINCT branch.City",
        "question": "Show all distinct city where branches with at least 100 memberships are located.",
        "answers": [
            [
                "London"
            ],
            [
                "Oxford"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (branch:`shop_membership.branch`)\nWHERE branch.membership_amount >= '100'\nRETURN DISTINCT branch.City",
        "question": "What are the different cities that have more than 100 memberships?",
        "answers": [
            [
                "London"
            ],
            [
                "Oxford"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (branch:`shop_membership.branch`)\nWITH count(*) AS count, branch.Open_year AS Open_year\nWHERE count  >= 2\nRETURN Open_year",
        "question": "List all open years when at least two shops are opened.",
        "answers": [
            [
                "2009"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (branch:`shop_membership.branch`)\nWITH count(*) AS count, branch.Open_year AS Open_year\nWHERE count  >= 2\nRETURN Open_year",
        "question": "What are the opening years in which at least two shops opened?",
        "answers": [
            [
                "2009"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (branch:`shop_membership.branch`)\nWHERE branch.Open_year = '2011' OR branch.City = 'London'\nRETURN min(branch.membership_amount),max(branch.membership_amount)",
        "question": "Show minimum and maximum amount of memberships for all branches opened in 2011 or located at city London.",
        "answers": [
            [
                "11",
                "91"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (branch:`shop_membership.branch`)\nWHERE branch.Open_year < '2010'\nRETURN branch.City,count(*)",
        "question": "Show the city and the number of branches opened before 2010 for each city.",
        "answers": [
            [
                "London",
                2
            ],
            [
                "Oxford",
                2
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (branch:`shop_membership.branch`)\nWHERE branch.Open_year < '2010'\nRETURN branch.City,count(*)",
        "question": "For each city, how many branches opened before 2010?",
        "answers": [
            [
                "London",
                2
            ],
            [
                "Oxford",
                2
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (member:`shop_membership.member`)\nRETURN member.Card_Number,member.Name,member.Hometown\nORDER BY member.Level DESC",
        "question": "Show card number, name, and hometown for all members in a descending order of level.",
        "answers": [
            [
                "LE99",
                "Jeremy Jarmon",
                "Collierville, Tennessee"
            ],
            [
                "LT98",
                "Myron Pryor",
                "Louisville, Kentucky"
            ],
            [
                "RT91",
                "Corey Peters",
                "Louisville, Kentucky"
            ],
            [
                "RE95",
                "Ventrell Jenkins",
                "Columbia, South Carolina"
            ],
            [
                "OLB56",
                "Braxton Kelley",
                "LaGrange, Georgia"
            ],
            [
                "SLB51",
                "Johnny Williams",
                "Jacksonville, Florida"
            ],
            [
                "RCB32",
                "Trevard Lindley",
                "Hiram, Georgia"
            ],
            [
                "LCB7",
                "David Jones",
                "Red Jacket, West Virginia"
            ],
            [
                "MLB4",
                "Micah Johnson",
                "Fort Campbell, Kentucky"
            ],
            [
                "FS10",
                "Matt Lentz",
                "Simpsonville, South Carolina"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (member:`shop_membership.member`)\nRETURN member.Level\nORDER BY member.Level DESC\nLIMIT 1",
        "question": "Show the membership level with most number of members.",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (T1:`shop_membership.membership_register_branch`)-[]-(T2:`shop_membership.branch`)\nWHERE T1.Register_Year > '2015'\nRETURN T2.Name,count(*)",
        "question": "Show all branch names with the number of members in each branch registered after 2015.",
        "answers": [
            [
                "Alexandre",
                3
            ],
            [
                "Zytogorski",
                1
            ],
            [
                "Cochrane",
                1
            ],
            [
                "Taverner",
                1
            ],
            [
                "Popert",
                1
            ],
            [
                "Brooke Greville",
                1
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (T1:`shop_membership.membership_register_branch`)-[]-(T2:`shop_membership.branch`)\nWHERE T1.Register_Year > '2015'\nRETURN T2.Name,count(*)",
        "question": "For each branch id, what are the names of the branches that were registered after 2015?",
        "answers": [
            [
                "Alexandre",
                3
            ],
            [
                "Zytogorski",
                1
            ],
            [
                "Cochrane",
                1
            ],
            [
                "Taverner",
                1
            ],
            [
                "Popert",
                1
            ],
            [
                "Brooke Greville",
                1
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (member:`shop_membership.member`)\nWHERE NOT (member)-[]-(:`shop_membership.membership_register_branch`)    \nRETURN member.Name",
        "question": "Show member names without any registered branch.",
        "answers": [
            [
                "David Jones"
            ],
            [
                "Matt Lentz"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (member:`shop_membership.member`)\nWHERE NOT (member)-[]-(:`shop_membership.membership_register_branch`)    \nRETURN member.Name",
        "question": "What are the names of the members that have never registered at any branch?",
        "answers": [
            [
                "David Jones"
            ],
            [
                "Matt Lentz"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (branch:`shop_membership.branch`)\nWHERE NOT (branch)-[]-(:`shop_membership.membership_register_branch`)    \nRETURN branch.Name,branch.City",
        "question": "List the branch name and city without any registered members.",
        "answers": [
            [
                "Stanley",
                "London"
            ],
            [
                "Saint Amant",
                "London"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (branch:`shop_membership.branch`)\nWHERE NOT (branch)-[]-(:`shop_membership.membership_register_branch`)    \nRETURN branch.Name,branch.City",
        "question": "What are the names and cities of the branches that do not have any registered members?",
        "answers": [
            [
                "Stanley",
                "London"
            ],
            [
                "Saint Amant",
                "London"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (T1:`shop_membership.membership_register_branch`)-[]-(T2:`shop_membership.branch`)\nWHERE T1.Register_Year = '2016'\nWITH T2, count(T1.Branch_ID) AS cnt\nRETURN T2.Name,T2.Open_year\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the name and open year for the branch with most number of memberships registered in 2016?",
        "answers": [
            [
                "Alexandre",
                "2001"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (T1:`shop_membership.membership_register_branch`)-[]-(T2:`shop_membership.branch`)\nWHERE T1.Register_Year = '2016'\nWITH T2, count(T1.Branch_ID) AS cnt\nRETURN T2.Name,T2.Open_year\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the name and opening year for the branch that registered the most members in 2016?",
        "answers": [
            [
                "Alexandre",
                "2001"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (T1:`shop_membership.membership_register_branch`)-[]-(T2:`shop_membership.member`)\nWHERE T1.Register_Year = '2016'\nRETURN T2.Name,T2.Hometown",
        "question": "Show the member name and hometown who registered a branch in 2016.",
        "answers": [
            [
                "Jeremy Jarmon",
                "Collierville, Tennessee"
            ],
            [
                "Myron Pryor",
                "Louisville, Kentucky"
            ],
            [
                "Ventrell Jenkins",
                "Columbia, South Carolina"
            ],
            [
                "Braxton Kelley",
                "LaGrange, Georgia"
            ],
            [
                "Johnny Williams",
                "Jacksonville, Florida"
            ],
            [
                "Trevard Lindley",
                "Hiram, Georgia"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (T1:`shop_membership.membership_register_branch`)-[]-(T2:`shop_membership.member`)\nWHERE T1.Register_Year = '2016'\nRETURN T2.Name,T2.Hometown",
        "question": "What are the member names and hometowns of those who registered at a branch in 2016?",
        "answers": [
            [
                "Jeremy Jarmon",
                "Collierville, Tennessee"
            ],
            [
                "Myron Pryor",
                "Louisville, Kentucky"
            ],
            [
                "Ventrell Jenkins",
                "Columbia, South Carolina"
            ],
            [
                "Braxton Kelley",
                "LaGrange, Georgia"
            ],
            [
                "Johnny Williams",
                "Jacksonville, Florida"
            ],
            [
                "Trevard Lindley",
                "Hiram, Georgia"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (branch:`shop_membership.branch`)\nWHERE branch.Open_year = '2001' AND branch.membership_amount > '100'\nRETURN branch.City",
        "question": "Show all city with a branch opened in 2001 and a branch with more than 100 membership.",
        "answers": [
            [
                "London"
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (T2:`shop_membership.member`)-[T1:`shop_membership.purchase`]-()\nWHERE T2.Level = 6\nRETURN count(*)",
        "question": "What is the total number of purchases for members with level 6?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "shop_membership",
        "query": "MATCH (T2:`shop_membership.member`)-[T1:`shop_membership.purchase`]-()\nWHERE T2.Level = 6\nRETURN count(*)",
        "question": "What are the total purchases for members rated at level 6?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nRETURN count(*)",
        "question": "Find the number of students in total.",
        "answers": [
            [
                34
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nRETURN count(*)",
        "question": "How many students are there in total?",
        "answers": [
            [
                34
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN count(*)",
        "question": "Find the number of voting records in total.",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN count(*)",
        "question": "How many voting records do we have?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN count(DISTINCT voting_record.President_Vote)",
        "question": "Find the distinct number of president votes.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN count(DISTINCT voting_record.President_Vote)",
        "question": "How many distinct president votes are recorded?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nRETURN max(student.Age)",
        "question": "Find the maximum age of all the students.",
        "answers": [
            [
                27
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nRETURN max(student.Age)",
        "question": "What is the oldest age among the students?",
        "answers": [
            [
                27
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nWHERE student.Major = 50\nRETURN student.LName",
        "question": "Find the last names of students with major 50.",
        "answers": [
            [
                "Epp"
            ],
            [
                "Schmidt"
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nWHERE student.Major = 50\nRETURN student.LName",
        "question": "What are the last names of students studying major 50?",
        "answers": [
            [
                "Epp"
            ],
            [
                "Schmidt"
            ]
        ]
    },
    {
        "db_id": "voter_2",
        "query": "MATCH (student:`voter_2.Student`)\nWHERE student.Age > 22\nRETURN student.Fname",
        "question": "Find the first names of students with age above 22.",
        "answers": [
            [
                "Paul"
            ],
            [
                "Bruce"
            ],
            [
                "Sarah"
            ]
        ]
    }
]