[
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (T1:`assets_maintenance.Staff`)-[]-(T2:`assets_maintenance.Engineer_Visits`)-[]-(T3:`assets_maintenance.Maintenance_Engineers`)\nRETURN T1.staff_name,T3.first_name,T3.last_name",
        "question": "Which staff have contacted which engineers? List the staff name and the engineer first name and last name.",
        "answers": [
            [
                "Berneice",
                "Etha",
                "Reinger"
            ],
            [
                "Berneice",
                "Lorine",
                "Morar"
            ],
            [
                "Edmond",
                "Cullen",
                "Kunde"
            ],
            [
                "Edmond",
                "Archibald",
                "Streich"
            ],
            [
                "Edmond",
                "Naomi",
                "Price"
            ],
            [
                "Rodger",
                "Archibald",
                "Streich"
            ],
            [
                "Kadin",
                "Archibald",
                "Streich"
            ],
            [
                "Kadin",
                "Archibald",
                "Streich"
            ],
            [
                "Kadin",
                "Archibald",
                "Streich"
            ],
            [
                "Kadin",
                "Archibald",
                "Streich"
            ],
            [
                "Christophe",
                "Nellie",
                "Hirthe"
            ],
            [
                "Bernice",
                "Lorine",
                "Morar"
            ],
            [
                "Bernice",
                "Courtney",
                "Adams"
            ],
            [
                "Oren",
                "Alexys",
                "Simonis"
            ],
            [
                "Cyrus",
                "Naomi",
                "Price"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (T1:`assets_maintenance.Fault_Log`)-[T2:`assets_maintenance.Fault_Log_Parts`]-()\nWITH T1, count(T1.fault_log_entry_id) AS cnt\nRETURN T1.fault_log_entry_id,T1.fault_description,T1.fault_log_entry_datetime\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Which fault log included the most number of faulty parts? List the fault log id, description and record time.",
        "answers": [
            [
                1,
                "system error",
                "2018-03-21 04:25:00"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (assets:`assets_maintenance.Assets`)\nRETURN DISTINCT assets.asset_model",
        "question": "What are all the distinct asset models?",
        "answers": [
            [
                "58 ub"
            ],
            [
                "35 xt"
            ],
            [
                "63 ok"
            ],
            [
                "69 uv"
            ],
            [
                "90 oq"
            ],
            [
                "91 ub"
            ],
            [
                "27 du"
            ],
            [
                "94 kg"
            ],
            [
                "07 yt"
            ],
            [
                "20 tl"
            ],
            [
                "11 wi"
            ],
            [
                "95 vn"
            ],
            [
                "08 yy"
            ],
            [
                "66 xm"
            ],
            [
                "24 ak"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (assets:`assets_maintenance.Assets`)\nRETURN assets.asset_make,assets.asset_model,assets.asset_details\nORDER BY assets.asset_disposed_date ASC",
        "question": "List the all the assets make, model, details by the disposed date ascendingly.",
        "answers": [
            [
                "IE",
                "24 ak",
                "system3"
            ],
            [
                "DE",
                "90 oq",
                "dell laptop5"
            ],
            [
                "RU",
                "95 vn",
                "machine4"
            ],
            [
                "GB",
                "94 kg",
                "monitor3"
            ],
            [
                "FR",
                "20 tl",
                "machine2"
            ],
            [
                "DE",
                "08 yy",
                "system1"
            ],
            [
                "RU",
                "07 yt",
                "machine1"
            ],
            [
                "IT",
                "63 ok",
                "dell laptop3"
            ],
            [
                "CN",
                "91 ub",
                "monitor1"
            ],
            [
                "PT",
                "58 ub",
                "dell laptop1"
            ],
            [
                "RU",
                "69 uv",
                "dell laptop4"
            ],
            [
                "FR",
                "11 wi",
                "machine3"
            ],
            [
                "IN",
                "35 xt",
                "dell laptop2"
            ],
            [
                "CN",
                "27 du",
                "monitor2"
            ],
            [
                "IN",
                "66 xm",
                "system2"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (parts:`assets_maintenance.Parts`)\nRETURN parts.part_id,parts.chargeable_amount\nORDER BY parts.chargeable_amount ASC\nLIMIT 1",
        "question": "Which part has the least chargeable amount? List the part id and amount.",
        "answers": [
            [
                1,
                "4"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (T1:`assets_maintenance.Third_Party_Companies`)-[]-(T2:`assets_maintenance.Maintenance_Contracts`)\nRETURN T1.company_name\nORDER BY T2.contract_start_date ASC\nLIMIT 1",
        "question": "Which company started the earliest the maintenance contract? Show the company name.",
        "answers": [
            [
                "Grimes, Mosciski and Renner"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (staff:`assets_maintenance.Staff`)\nRETURN staff.gender\nORDER BY staff.gender DESC\nLIMIT 1",
        "question": "Which gender makes up the majority of the staff?",
        "answers": [
            [
                "1"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (T1:`assets_maintenance.Staff`)-[]-(T2:`assets_maintenance.Engineer_Visits`)\nRETURN T1.staff_name,count(*)",
        "question": "How many engineers did each staff contact? List both the contact staff name and number of engineers contacted.",
        "answers": [
            [
                "Berneice",
                2
            ],
            [
                "Edmond",
                3
            ],
            [
                "Rodger",
                1
            ],
            [
                "Kadin",
                4
            ],
            [
                "Christophe",
                1
            ],
            [
                "Bernice",
                2
            ],
            [
                "Oren",
                1
            ],
            [
                "Cyrus",
                1
            ]
        ]
    },
    {
        "db_id": "station_weather",
        "query": "MATCH (station:`station_weather.station`)\nRETURN station.local_authority,station.services",
        "question": "list the local authorities and services provided by all stations.",
        "answers": [
            [
                "Chiltern",
                "Metropolitan line and Chiltern Railways"
            ],
            [
                "Watford",
                "London Overground and London Midland"
            ],
            [
                "Brentwood",
                "Greater Anglia"
            ],
            [
                "Broxbourne",
                "Greater Anglia"
            ],
            [
                "Three Rivers",
                "London Overground"
            ],
            [
                "Thurrock",
                "c2c"
            ],
            [
                "Chiltern",
                "Metropolitan line and Chiltern Railways"
            ],
            [
                "Chiltern",
                "Metropolitan line"
            ],
            [
                "Broxbourne",
                "Greater Anglia"
            ],
            [
                "Three Rivers",
                "Metropolitan line and Chiltern Railways"
            ],
            [
                "Three Rivers",
                "Metropolitan line"
            ]
        ]
    },
    {
        "db_id": "station_weather",
        "query": "MATCH (train:`station_weather.train`)\nRETURN train.train_number,train.name\nORDER BY train.time",
        "question": "show all train numbers and names ordered by their time from early to late.",
        "answers": [
            [
                16650,
                "Parasuram Express"
            ],
            [
                56700,
                "Quilon Fast Passenger"
            ],
            [
                16382,
                "Jayanthi Janatha Express"
            ],
            [
                16381,
                "Jayanthi Janatha Express"
            ],
            [
                16525,
                "Island Express"
            ],
            [
                16723,
                "Ananthapuri Express"
            ],
            [
                16526,
                "Island Express"
            ],
            [
                16724,
                "Ananthapuri Express"
            ],
            [
                56701,
                "Madurai Fast Passenger"
            ],
            [
                16127,
                "Guruvayur Express"
            ],
            [
                16128,
                "Guruvayur Express"
            ]
        ]
    },
    {
        "db_id": "station_weather",
        "query": "MATCH (train:`station_weather.train`)\nWHERE train.destination = 'Chennai'\nRETURN train.time,train.train_number\nORDER BY train.time",
        "question": "Give me the times and numbers of all trains that go to Chennai, ordered by time.",
        "answers": [
            [
                "17:15",
                16724
            ],
            [
                "4:49",
                16128
            ]
        ]
    },
    {
        "db_id": "station_weather",
        "query": "MATCH (train:`station_weather.train`)\nWHERE train.origin = 'Chennai' AND train.destination = 'Guruvayur'\nRETURN train.train_number,train.time",
        "question": "Find the number and time of the train that goes from Chennai to Guruvayur.",
        "answers": [
            [
                16127,
                "22:10"
            ]
        ]
    },
    {
        "db_id": "station_weather",
        "query": "MATCH (train:`station_weather.train`)\nRETURN train.origin,count(*)",
        "question": "Find the number of trains starting from each origin.",
        "answers": [
            [
                "Trivandrum",
                1
            ],
            [
                "Chennai",
                2
            ],
            [
                "Guruvayur",
                1
            ],
            [
                "Kanniyakumari",
                2
            ],
            [
                "Quilon",
                1
            ],
            [
                "Madurai",
                1
            ],
            [
                "Bangalore",
                1
            ],
            [
                "Mumbai",
                1
            ],
            [
                "Nagercoil",
                1
            ]
        ]
    },
    {
        "db_id": "station_weather",
        "query": "MATCH (t1:`station_weather.train`)-[t2:`station_weather.route`]-()\nWITH t1, count(t2.None) AS cnt\nRETURN t1.name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Find the name of the train whose route runs through greatest number of stations.",
        "answers": [
            [
                "Ananthapuri Express"
            ]
        ]
    },
    {
        "db_id": "station_weather",
        "query": "MATCH (t1:`station_weather.station`)-[t2:`station_weather.route`]-()\nRETURN count(*),t1.network_name,t1.services",
        "question": "Find the number of trains for each station, as well as the station network name and services.",
        "answers": [
            [
                3,
                "Amersham",
                "Metropolitan line and Chiltern Railways"
            ],
            [
                2,
                "Bushey",
                "London Overground and London Midland"
            ],
            [
                2,
                "Brentwood",
                "Greater Anglia"
            ],
            [
                2,
                "Broxbourne",
                "Greater Anglia"
            ],
            [
                2,
                "Carpenders Park",
                "London Overground"
            ],
            [
                1,
                "Chafford Hundred",
                "c2c"
            ],
            [
                2,
                "Chalfont & Latimer",
                "Metropolitan line and Chiltern Railways"
            ],
            [
                3,
                "Chesham",
                "Metropolitan line"
            ],
            [
                1,
                "Cheshunt",
                "Greater Anglia"
            ]
        ]
    },
    {
        "db_id": "station_weather",
        "query": "MATCH (weekly_weather:`station_weather.weekly_weather`)\nRETURN avg(weekly_weather.high_temperature),weekly_weather.day_of_week",
        "question": "What is the average high temperature for each day of week?",
        "answers": [
            [
                56.0,
                "Monday"
            ],
            [
                58.0,
                "Tuesday"
            ],
            [
                58.0,
                "Wednesday"
            ],
            [
                57.0,
                "Thursday"
            ],
            [
                55.0,
                "Friday"
            ],
            [
                55.0,
                "Saturday"
            ],
            [
                54.0,
                "Sunday"
            ]
        ]
    },
    {
        "db_id": "station_weather",
        "query": "MATCH (t1:`station_weather.station`)-[t2:`station_weather.route`]-(t3:`station_weather.train`)\nWHERE t1.local_authority = 'Chiltern'\nRETURN t3.name,t3.time",
        "question": "Find names and times of trains that run through stations for the local authority Chiltern.",
        "answers": [
            [
                "Ananthapuri Express",
                "17:15"
            ],
            [
                "Jayanthi Janatha Express",
                "06:30"
            ],
            [
                "Guruvayur Express",
                "22:10"
            ],
            [
                "Island Express",
                "16:59"
            ],
            [
                "Guruvayur Express",
                "22:10"
            ],
            [
                "Island Express",
                "16:59"
            ],
            [
                "Quilon Fast Passenger",
                "04:55"
            ],
            [
                "Madurai Fast Passenger",
                "21:49"
            ]
        ]
    },
    {
        "db_id": "station_weather",
        "query": "MATCH (station:`station_weather.station`)\nRETURN count(DISTINCT station.services)",
        "question": "How many different services are provided by all stations?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "station_weather",
        "query": "MATCH (weekly_weather:`station_weather.weekly_weather`)\nRETURN min(weekly_weather.low_temperature),max(weekly_weather.wind_speed_mph)",
        "question": "show the lowest low temperature and highest wind speed in miles per hour.",
        "answers": [
            [
                46,
                24
            ]
        ]
    },
    {
        "db_id": "station_weather",
        "query": "MATCH (train:`station_weather.train`)\nWITH count(*) AS count, train.origin AS origin\nWHERE count  > 1\nRETURN origin",
        "question": "Find the origins from which more than 1 train starts.",
        "answers": [
            [
                "Chennai"
            ],
            [
                "Kanniyakumari"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (class:`college_1.CLASS`)\nWHERE class.CRS_CODE = \"ACCT-211\"\nRETURN count(DISTINCT class.PROF_NUM)",
        "question": "How many professors are teaching class with code ACCT-211?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (class:`college_1.CLASS`)\nWHERE class.CRS_CODE = \"ACCT-211\"\nRETURN count(DISTINCT class.PROF_NUM)",
        "question": "How many professors teach a class with the code ACCT-211?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.EMPLOYEE`)-[]-(T2:`college_1.CLASS`)\nWHERE T2.CRS_CODE = \"ACCT-211\"\nRETURN DISTINCT T1.EMP_FNAME,T1.EMP_DOB",
        "question": "What are the first names and date of birth of professors teaching course ACCT-211?",
        "answers": [
            [
                "Arnelle",
                "1950-11-2"
            ],
            [
                "Robert",
                "1937-12-30"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.EMPLOYEE`)-[]-(T2:`college_1.CLASS`)\nWHERE T2.CRS_CODE = \"ACCT-211\"\nRETURN DISTINCT T1.EMP_FNAME,T1.EMP_DOB",
        "question": "What are the first names and birthdates of the professors in charge of ACCT-211?",
        "answers": [
            [
                "Arnelle",
                "1950-11-2"
            ],
            [
                "Robert",
                "1937-12-30"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.EMPLOYEE`)-[]-(T2:`college_1.CLASS`)\nWHERE T1.EMP_LNAME = 'Graztevski'\nRETURN count(*)",
        "question": "How many classes are professor whose last name is Graztevski has?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.EMPLOYEE`)-[]-(T2:`college_1.CLASS`)\nWHERE T1.EMP_LNAME = 'Graztevski'\nRETURN count(*)",
        "question": "How many classes does the professor whose last name is Graztevski teach?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (course:`college_1.COURSE`)\nWHERE course.CRS_CODE = 'CIS-220'\nRETURN course.CRS_CREDIT,course.CRS_DESCRIPTION",
        "question": "How many credits does course CIS-220 have, and what its description?",
        "answers": [
            [
                3.0,
                "Intro. to Microcomputing"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (course:`college_1.COURSE`)\nWHERE course.CRS_CODE = 'CIS-220'\nRETURN course.CRS_CREDIT,course.CRS_DESCRIPTION",
        "question": "What is the description for the CIS-220 and how many credits does it have?",
        "answers": [
            [
                3.0,
                "Intro. to Microcomputing"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nWHERE department.DEPT_NAME = 'History'\nRETURN department.DEPT_ADDRESS",
        "question": "what is the address of history department?",
        "answers": [
            [
                "DRE 156, Box 284"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nWHERE department.DEPT_NAME = 'History'\nRETURN department.DEPT_ADDRESS",
        "question": "Where is the history department?",
        "answers": [
            [
                "DRE 156, Box 284"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nWHERE department.SCHOOL_CODE = 'BUS'\nRETURN count(DISTINCT department.DEPT_ADDRESS)",
        "question": "How many different locations does the school with code BUS has?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nWHERE department.SCHOOL_CODE = 'BUS'\nRETURN count(DISTINCT department.DEPT_ADDRESS)",
        "question": "What are the different locations of the school with the code BUS?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nRETURN count(DISTINCT department.DEPT_ADDRESS),department.SCHOOL_CODE",
        "question": "How many different locations does each school have?",
        "answers": [
            [
                4,
                "BUS"
            ],
            [
                7,
                "A&SCI"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nRETURN count(DISTINCT department.DEPT_ADDRESS),department.SCHOOL_CODE",
        "question": "Count different addresses of each school.",
        "answers": [
            [
                4,
                "BUS"
            ],
            [
                7,
                "A&SCI"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (course:`college_1.COURSE`)\nWHERE course.CRS_CODE = 'QM-261'\nRETURN course.CRS_CREDIT,course.CRS_DESCRIPTION",
        "question": "Find the description and credit for the course QM-261?",
        "answers": [
            [
                3.0,
                "Intro. to Statistics"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (course:`college_1.COURSE`)\nWHERE course.CRS_CODE = 'QM-261'\nRETURN course.CRS_CREDIT,course.CRS_DESCRIPTION",
        "question": "What is the course description and number of credits for QM-261?",
        "answers": [
            [
                3.0,
                "Intro. to Statistics"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nRETURN count(DISTINCT department.DEPT_NAME),department.SCHOOL_CODE",
        "question": "Find the number of departments in each school.",
        "answers": [
            [
                4,
                "BUS"
            ],
            [
                7,
                "A&SCI"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nRETURN count(DISTINCT department.DEPT_NAME),department.SCHOOL_CODE",
        "question": "How many departments are in each school?",
        "answers": [
            [
                4,
                "BUS"
            ],
            [
                7,
                "A&SCI"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (class:`college_1.CLASS`)\nRETURN count(*),class.CRS_CODE",
        "question": "How many sections does each course has?",
        "answers": [
            [
                3,
                "ACCT-211"
            ],
            [
                2,
                "ACCT-212"
            ],
            [
                3,
                "CIS-220"
            ],
            [
                1,
                "CIS-420"
            ],
            [
                2,
                "QM-261"
            ],
            [
                2,
                "QM-362"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (class:`college_1.CLASS`)\nRETURN count(*),class.CRS_CODE",
        "question": "How many sections does each course have?",
        "answers": [
            [
                3,
                "ACCT-211"
            ],
            [
                2,
                "ACCT-212"
            ],
            [
                3,
                "CIS-220"
            ],
            [
                1,
                "CIS-420"
            ],
            [
                2,
                "QM-261"
            ],
            [
                2,
                "QM-362"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (class:`college_1.CLASS`)\nWITH count(*) AS count, class.CLASS_ROOM AS CLASS_ROOM\nWHERE count  >= 2\nRETURN count,CLASS_ROOM",
        "question": "Find the number of classes offered for all class rooms that held at least 2 classes.",
        "answers": [
            [
                2,
                "BUS311"
            ],
            [
                2,
                "BUS252"
            ],
            [
                3,
                "KLR209"
            ],
            [
                4,
                "KLR200"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (class:`college_1.CLASS`)\nWITH count(*) AS count, class.CLASS_ROOM AS CLASS_ROOM\nWHERE count  >= 2\nRETURN count,CLASS_ROOM",
        "question": "For each classroom with at least 2 classes, how many classes are offered?",
        "answers": [
            [
                2,
                "BUS311"
            ],
            [
                2,
                "BUS252"
            ],
            [
                3,
                "KLR209"
            ],
            [
                4,
                "KLR200"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[]-(T2:`college_1.COURSE`)-[]-(T3:`college_1.DEPARTMENT`)\nRETURN count(*),T3.SCHOOL_CODE",
        "question": "Find the number of classes in each school.",
        "answers": [
            [
                13,
                "BUS"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.CLASS`)-[]-(T2:`college_1.COURSE`)-[]-(T3:`college_1.DEPARTMENT`)\nRETURN count(*),T3.SCHOOL_CODE",
        "question": "How many classes exist for each school?",
        "answers": [
            [
                13,
                "BUS"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.DEPARTMENT`)-[T2:`college_1.PROFESSOR`]-()\nRETURN count(*),T1.SCHOOL_CODE",
        "question": "What is the number of professors for different school?",
        "answers": [
            [
                10,
                "BUS"
            ],
            [
                12,
                "A&SCI"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.DEPARTMENT`)-[T2:`college_1.PROFESSOR`]-()\nRETURN count(*),T1.SCHOOL_CODE",
        "question": "How many different professors are there for the different schools?",
        "answers": [
            [
                10,
                "BUS"
            ],
            [
                12,
                "A&SCI"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (student:`college_1.STUDENT`)\nRETURN count(*),student.DEPT_CODE",
        "question": "Find the number of students for each department.",
        "answers": [
            [
                1,
                "BIOL"
            ],
            [
                2,
                "CIS"
            ],
            [
                3,
                "ACCT"
            ],
            [
                1,
                "ENGL"
            ],
            [
                1,
                "EDU"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (student:`college_1.STUDENT`)\nRETURN count(*),student.DEPT_CODE",
        "question": "How many students are in each department?",
        "answers": [
            [
                1,
                "BIOL"
            ],
            [
                2,
                "CIS"
            ],
            [
                3,
                "ACCT"
            ],
            [
                1,
                "ENGL"
            ],
            [
                1,
                "EDU"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (student:`college_1.STUDENT`)\nRETURN max(student.STU_GPA),avg(student.STU_GPA),min(student.STU_GPA),student.DEPT_CODE",
        "question": "Find the max, average, and minimum gpa of all students in each department.",
        "answers": [
            [
                2.84,
                2.84,
                2.84,
                "BIOL"
            ],
            [
                3.27,
                3.1799999999999997,
                3.09,
                "CIS"
            ],
            [
                3.15,
                2.776666666666667,
                2.26,
                "ACCT"
            ],
            [
                2.11,
                2.11,
                2.11,
                "ENGL"
            ],
            [
                3.87,
                3.87,
                3.87,
                "EDU"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (student:`college_1.STUDENT`)\nRETURN max(student.STU_GPA),avg(student.STU_GPA),min(student.STU_GPA),student.DEPT_CODE",
        "question": "What is the highest, lowest, and average student GPA for every department?",
        "answers": [
            [
                2.84,
                2.84,
                2.84,
                "BIOL"
            ],
            [
                3.27,
                3.1799999999999997,
                3.09,
                "CIS"
            ],
            [
                3.15,
                2.776666666666667,
                2.26,
                "ACCT"
            ],
            [
                2.11,
                2.11,
                2.11,
                "ENGL"
            ],
            [
                3.87,
                3.87,
                3.87,
                "EDU"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nRETURN count(DISTINCT department.SCHOOL_CODE)",
        "question": "how many schools exist in total?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nRETURN count(DISTINCT department.SCHOOL_CODE)",
        "question": "How many schools are there in the department?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (class:`college_1.CLASS`)\nRETURN count(DISTINCT class.CLASS_CODE)",
        "question": "How many different classes are there?",
        "answers": [
            [
                13
            ]
        ]
    }
]