[
    {
        "question": "List the first and last name of students who are not living in the city with code HKG, and sorted the results by their ages.",
        "query": "MATCH (student:`dorm_1.Student`)\nWHERE student.city_code <> 'HKG'\nRETURN student.Fname,student.LName\nORDER BY student.Age",
        "db_id": "dorm_1",
        "answers": [
            [
                "Derek",
                "Lee"
            ],
            [
                "Mark",
                "Schwartz"
            ],
            [
                "Michael",
                "Woods"
            ],
            [
                "Jun",
                "Han"
            ],
            [
                "Linda",
                "Smith"
            ],
            [
                "Andy",
                "Schultz"
            ],
            [
                "Lisa",
                "Apap"
            ],
            [
                "Charles",
                "Norris"
            ],
            [
                "Arthur",
                "Pang"
            ],
            [
                "Stacy",
                "Prater"
            ],
            [
                "Mark",
                "Goldman"
            ],
            [
                "Paul",
                "Brody"
            ],
            [
                "William",
                "Simms"
            ],
            [
                "Eric",
                "Epp"
            ],
            [
                "Eric",
                "Tai"
            ],
            [
                "George",
                "Andreou"
            ],
            [
                "Dinesh",
                "Kumar"
            ],
            [
                "Jandy",
                "Nelson"
            ],
            [
                "Steven",
                "Davis"
            ],
            [
                "Michael",
                "Leighton"
            ],
            [
                "David",
                "Shieber"
            ],
            [
                "Eric",
                "Rugh"
            ],
            [
                "Sarah",
                "Smith"
            ],
            [
                "Eric",
                "Brown"
            ],
            [
                "Shiela",
                "Jones"
            ],
            [
                "Lisa",
                "Cheng"
            ],
            [
                "David",
                "Adams"
            ],
            [
                "Ian",
                "Thornton"
            ],
            [
                "Paul",
                "Gompers"
            ],
            [
                "Sarah",
                "Schmidt"
            ],
            [
                "Bruce",
                "Wilson"
            ]
        ]
    },
    {
        "question": "Find the number of students in each major.",
        "query": "MATCH (student:`dorm_1.Student`)\nWITH student.Major AS Major, count(student.Major) AS count\nRETURN count,Major",
        "db_id": "dorm_1",
        "answers": [
            [
                18,
                600
            ],
            [
                6,
                520
            ],
            [
                2,
                540
            ],
            [
                5,
                550
            ],
            [
                1,
                100
            ],
            [
                2,
                50
            ]
        ]
    },
    {
        "question": "Find the number of students for the cities where have more than one student.",
        "query": "MATCH (student:`dorm_1.Student`)\nWITH count(*) AS count, student.city_code AS city_code\nWHERE count  > 1\nRETURN count,city_code",
        "db_id": "dorm_1",
        "answers": [
            [
                4,
                "BAL"
            ],
            [
                3,
                "HKG"
            ],
            [
                3,
                "WAS"
            ],
            [
                2,
                "YYZ"
            ],
            [
                4,
                "PIT"
            ],
            [
                3,
                "PHL"
            ],
            [
                3,
                "NYC"
            ]
        ]
    },
    {
        "question": "Count the number of customers.",
        "query": "MATCH (customers:`customer_complaints.Customers`)\nRETURN count(*)",
        "db_id": "customer_complaints",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "question": "Find the emails and phone numbers of all the customers, ordered by email address and phone number.",
        "query": "MATCH (customers:`customer_complaints.Customers`)\nRETURN customers.email_address,customers.phone_number\nORDER BY customers.email_address,customers.phone_number",
        "db_id": "customer_complaints",
        "answers": [
            [
                "cayla.satterfield@example.net",
                "470-803-0244"
            ],
            [
                "hsteuber@example.org",
                "06963347450"
            ],
            [
                "lavonne.frami@example.com",
                "+38(3)9011433816"
            ],
            [
                "paige.hyatt@example.com",
                "1-369-302-7623x576"
            ],
            [
                "rzulauf@example.org",
                "578.019.7943x328"
            ],
            [
                "ubeier@example.org",
                "044-468-4549"
            ],
            [
                "vbogisich@example.org",
                "548.373.3603x59134"
            ],
            [
                "vida86@example.com",
                "997.698.4779x882"
            ]
        ]
    },
    {
        "question": "Find the email and phone number of the customers who have never filed a complaint before.",
        "query": "MATCH (customers:`customer_complaints.Customers`)\nWHERE NOT (customers:`customer_complaints.Customers`)-[]-(:`customer_complaints.Complaints`)\nRETURN customers.email_address,customers.phone_number",
        "db_id": "customer_complaints",
        "answers": [
            [
                "paige.hyatt@example.com",
                "1-369-302-7623x576"
            ]
        ]
    },
    {
        "question": "What are the emails and phone numbers of custoemrs who have never filed a complaint?",
        "query": "MATCH (customers:`customer_complaints.Customers`)\nWHERE NOT (customers:`customer_complaints.Customers`)-[]-(:`customer_complaints.Complaints`)\nRETURN customers.email_address,customers.phone_number",
        "db_id": "customer_complaints",
        "answers": [
            [
                "paige.hyatt@example.com",
                "1-369-302-7623x576"
            ]
        ]
    },
    {
        "question": "What is the description of the product named \"Chocolate\"?",
        "query": "MATCH (products:`customer_complaints.Products`)\nWHERE products.product_name = 'Chocolate'\nRETURN products.product_description",
        "db_id": "customer_complaints",
        "answers": [
            [
                "Handmade chocolate"
            ]
        ]
    },
    {
        "question": "Find the name and category of the most expensive product.",
        "query": "MATCH (products:`customer_complaints.Products`)\nRETURN products.product_name,products.product_category_code\nORDER BY products.product_price DESC\nLIMIT 1",
        "db_id": "customer_complaints",
        "answers": [
            [
                "Keyboard",
                "Hardware"
            ]
        ]
    },
    {
        "question": "Count the number of different complaint type codes.",
        "query": "MATCH (complaints:`customer_complaints.Complaints`)\nRETURN count(DISTINCT complaints.complaint_type_code)",
        "db_id": "customer_complaints",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "Find the number of complaints with Product Failure type for each complaint status.",
        "query": "MATCH (complaints:`customer_complaints.Complaints`)\nWHERE complaints.complaint_type_code = 'Product Failure'\nWITH complaints.complaint_status_code AS complaint_status_code, count(complaints.complaint_status_code) AS count\nRETURN complaint_status_code,count",
        "db_id": "customer_complaints",
        "answers": [
            [
                "Closed",
                1
            ],
            [
                "Open",
                1
            ]
        ]
    },
    {
        "question": "Count the number of submissions.",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN count(*)",
        "db_id": "workshop_paper",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "question": "List the authors of submissions in ascending order of scores.",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN submission.Author\nORDER BY submission.Scores ASC",
        "db_id": "workshop_paper",
        "answers": [
            [
                "Steve Niehaus"
            ],
            [
                "Sherman Smith"
            ],
            [
                "Sammy Green"
            ],
            [
                "Steve Raible"
            ],
            [
                "Jeff Lloyd"
            ],
            [
                "Randy Johnson"
            ],
            [
                "Andy Bolton"
            ],
            [
                "Rick Engles"
            ],
            [
                "Don Bitterlich"
            ],
            [
                "Steve Myer"
            ]
        ]
    },
    {
        "question": "For each submission, show the author and their affiliated college.",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN submission.Author,submission.College",
        "db_id": "workshop_paper",
        "answers": [
            [
                "Steve Niehaus",
                "Notre Dame"
            ],
            [
                "Sammy Green",
                "Florida"
            ],
            [
                "Sherman Smith",
                "Miami (OH)"
            ],
            [
                "Steve Raible",
                "Georgia Tech"
            ],
            [
                "Jeff Lloyd",
                "West Texas State"
            ],
            [
                "Rick Engles",
                "Tulsa"
            ],
            [
                "Don Bitterlich",
                "Temple"
            ],
            [
                "Steve Myer",
                "New Mexico"
            ],
            [
                "Randy Johnson",
                "Georgia"
            ],
            [
                "Andy Bolton",
                "Fisk"
            ]
        ]
    },
    {
        "question": "Show the names of authors from college \"Florida\" or \"Temple\"",
        "query": "MATCH (submission:`workshop_paper.submission`)\nWHERE submission.College = 'Florida' OR submission.College = 'Temple'\nRETURN submission.Author",
        "db_id": "workshop_paper",
        "answers": [
            [
                "Sammy Green"
            ],
            [
                "Don Bitterlich"
            ]
        ]
    },
    {
        "question": "Find the author who achieved the highest score in a submission.",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN submission.Author\nORDER BY submission.Scores DESC\nLIMIT 1",
        "db_id": "workshop_paper",
        "answers": [
            [
                "Steve Myer"
            ]
        ]
    },
    {
        "question": "Show different colleges along with the number of authors of submission from each college.",
        "query": "MATCH (submission:`workshop_paper.submission`)\nWITH count(submission.College) AS count, submission.College AS College\nRETURN College,count",
        "db_id": "workshop_paper",
        "answers": [
            [
                "Notre Dame",
                1
            ],
            [
                "Florida",
                1
            ],
            [
                "Miami (OH)",
                1
            ],
            [
                "Georgia Tech",
                1
            ],
            [
                "West Texas State",
                1
            ],
            [
                "Tulsa",
                1
            ],
            [
                "Temple",
                1
            ],
            [
                "New Mexico",
                1
            ],
            [
                "Georgia",
                1
            ],
            [
                "Fisk",
                1
            ]
        ]
    },
    {
        "question": "List the authors who do not have submission to any workshop.",
        "query": "MATCH (submission:`workshop_paper.submission`)\nWHERE NOT (submission:`workshop_paper.submission`)-[:`workshop_paper.Acceptance`]-()\nRETURN submission.Author",
        "db_id": "workshop_paper",
        "answers": [
            [
                "Rick Engles"
            ],
            [
                "Don Bitterlich"
            ],
            [
                "Steve Myer"
            ],
            [
                "Randy Johnson"
            ],
            [
                "Andy Bolton"
            ]
        ]
    },
    {
        "question": "Which authors did not submit to any workshop?",
        "query": "MATCH (submission:`workshop_paper.submission`)\nWHERE NOT (submission:`workshop_paper.submission`)-[:`workshop_paper.Acceptance`]-()\nRETURN submission.Author",
        "db_id": "workshop_paper",
        "answers": [
            [
                "Rick Engles"
            ],
            [
                "Don Bitterlich"
            ],
            [
                "Steve Myer"
            ],
            [
                "Randy Johnson"
            ],
            [
                "Andy Bolton"
            ]
        ]
    },
    {
        "question": "Find the number of investors in total.",
        "query": "MATCH (investors:`tracking_share_transactions.Investors`)\nRETURN count(*)",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                20
            ]
        ]
    },
    {
        "question": "Show all investor details.",
        "query": "MATCH (investors:`tracking_share_transactions.Investors`)\nRETURN investors.Investor_details",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                "z"
            ],
            [
                "z"
            ],
            [
                "d"
            ],
            [
                "d"
            ],
            [
                "b"
            ],
            [
                "k"
            ],
            [
                "l"
            ],
            [
                "t"
            ],
            [
                "y"
            ],
            [
                "r"
            ],
            [
                "q"
            ],
            [
                "c"
            ],
            [
                "o"
            ],
            [
                "w"
            ],
            [
                "i"
            ],
            [
                "y"
            ],
            [
                "k"
            ],
            [
                "w"
            ],
            [
                "l"
            ],
            [
                "j"
            ]
        ]
    },
    {
        "question": "Show all distinct lot details.",
        "query": "MATCH (lots:`tracking_share_transactions.Lots`)\nRETURN DISTINCT lots.lot_details",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                "r"
            ],
            [
                "z"
            ],
            [
                "s"
            ],
            [
                "q"
            ],
            [
                "d"
            ],
            [
                "m"
            ],
            [
                "h"
            ],
            [
                "x"
            ]
        ]
    },
    {
        "question": "Show the maximum amount of transaction.",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nRETURN max(transactions.amount_of_transaction)",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                207484122.2796
            ]
        ]
    },
    {
        "question": "Show all date and share count of transactions.",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nRETURN transactions.date_of_transaction,transactions.share_count",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                "1988-09-16 19:02:51",
                "8718572"
            ],
            [
                "1982-06-06 17:19:00",
                "9"
            ],
            [
                "1979-04-27 06:03:59",
                "8580"
            ],
            [
                "2001-11-28 15:06:25",
                "8040"
            ],
            [
                "1977-08-17 13:13:30",
                "930"
            ],
            [
                "1985-10-08 13:13:39",
                "2751"
            ],
            [
                "1990-12-02 09:03:38",
                "1522"
            ],
            [
                "2004-01-18 20:37:50",
                "96178"
            ],
            [
                "1977-08-13 02:18:47",
                ""
            ],
            [
                "1981-01-28 08:07:03",
                "1654756"
            ],
            [
                "2000-04-03 20:55:43",
                "674529892"
            ],
            [
                "1983-11-01 17:57:27",
                "587"
            ],
            [
                "2002-04-07 20:28:37",
                ""
            ],
            [
                "2002-09-13 03:04:56",
                "630021"
            ],
            [
                "1997-12-30 05:05:40",
                "93191"
            ]
        ]
    },
    {
        "question": "Show all transaction ids with transaction code 'PUR'.",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nWHERE transactions.transaction_type_code = 'PUR'\nRETURN transactions.transaction_id",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                2
            ],
            [
                4
            ],
            [
                5
            ],
            [
                6
            ],
            [
                7
            ],
            [
                9
            ],
            [
                14
            ],
            [
                15
            ]
        ]
    },
    {
        "question": "Show all dates of transactions whose type code is \"SALE\".",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nWHERE transactions.transaction_type_code = 'SALE'\nRETURN transactions.date_of_transaction",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                "1988-09-16 19:02:51"
            ],
            [
                "1979-04-27 06:03:59"
            ],
            [
                "2004-01-18 20:37:50"
            ],
            [
                "1981-01-28 08:07:03"
            ],
            [
                "2000-04-03 20:55:43"
            ],
            [
                "1983-11-01 17:57:27"
            ],
            [
                "2002-04-07 20:28:37"
            ]
        ]
    },
    {
        "question": "Show the average amount of transactions with type code \"SALE\".",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nWHERE transactions.transaction_type_code = 'SALE'\nRETURN avg(transactions.amount_of_transaction)",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                11198167.237771427
            ]
        ]
    },
    {
        "question": "Show the description of transaction type with code \"PUR\".",
        "query": "MATCH (ref_transaction_types:`tracking_share_transactions.Ref_Transaction_Types`)\nWHERE ref_transaction_types.transaction_type_code = 'PUR'\nRETURN ref_transaction_types.transaction_type_description",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                "Purchase"
            ]
        ]
    },
    {
        "question": "Show the maximum share count of transactions where the amount is smaller than 10000",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nWHERE transactions.amount_of_transaction < 10000\nRETURN max(transactions.share_count)",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                "93191"
            ]
        ]
    },
    {
        "question": "Show the dates of transactions if the share count is bigger than 100 or the amount is bigger than 1000.",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nWHERE transactions.share_count > 100 OR transactions.amount_of_transaction > 1000\nRETURN transactions.date_of_transaction",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                "1988-09-16 19:02:51"
            ],
            [
                "1979-04-27 06:03:59"
            ],
            [
                "1985-10-08 13:13:39"
            ],
            [
                "2004-01-18 20:37:50"
            ],
            [
                "1977-08-13 02:18:47"
            ]
        ]
    },
    {
        "question": "Return the lot details and investor ids.",
        "query": "MATCH (lots:`tracking_share_transactions.Lots`)\nRETURN lots.lot_details,lots.investor_id",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                "r",
                13
            ],
            [
                "z",
                16
            ],
            [
                "s",
                10
            ],
            [
                "s",
                19
            ],
            [
                "q",
                6
            ],
            [
                "d",
                20
            ],
            [
                "m",
                7
            ],
            [
                "h",
                7
            ],
            [
                "z",
                20
            ],
            [
                "x",
                9
            ],
            [
                "d",
                1
            ],
            [
                "m",
                19
            ],
            [
                "z",
                7
            ],
            [
                "d",
                6
            ],
            [
                "h",
                1
            ]
        ]
    },
    {
        "question": "Return the lot details of lots that belong to investors with details \"l\"?",
        "query": "MATCH (T1:`tracking_share_transactions.Investors`)-[]-(T2:`tracking_share_transactions.Lots`)\nWHERE T1.Investor_details = 'l'\nRETURN T2.lot_details",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                "h"
            ],
            [
                "z"
            ],
            [
                "m"
            ],
            [
                "m"
            ],
            [
                "s"
            ]
        ]
    },
    {
        "question": "Show the number of transactions with transaction type code \"SALE\" for different investors if it is larger than 0.",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nWHERE transactions.transaction_type_code = 'SALE'\nWITH transactions.investor_id AS investor_id, count(transactions.investor_id) AS count\nRETURN investor_id,count",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                6,
                1
            ],
            [
                2,
                2
            ],
            [
                17,
                1
            ],
            [
                3,
                2
            ],
            [
                18,
                1
            ]
        ]
    },
    {
        "question": "Show the number of transactions for different investors.",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nWITH transactions.investor_id AS investor_id, count(transactions.investor_id) AS count\nRETURN investor_id,count",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                6,
                1
            ],
            [
                18,
                2
            ],
            [
                2,
                2
            ],
            [
                14,
                1
            ],
            [
                8,
                1
            ],
            [
                19,
                2
            ],
            [
                7,
                1
            ],
            [
                17,
                1
            ],
            [
                20,
                1
            ],
            [
                3,
                3
            ]
        ]
    },
    {
        "question": "Show the transaction type code that occurs the fewest times.",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nWITH count(transactions.transaction_type_code) AS count, transactions.transaction_type_code AS transaction_type_code\nRETURN transaction_type_code\nORDER BY count ASC\nLIMIT 1",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                "SALE"
            ]
        ]
    },
    {
        "question": "What are the dates of transactions with at least 100 share count or amount bigger than 100?",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nWHERE transactions.share_count >= 100 OR transactions.amount_of_transaction >= 100\nRETURN transactions.date_of_transaction",
        "db_id": "tracking_share_transactions",
        "answers": [
            [
                "1988-09-16 19:02:51"
            ],
            [
                "1979-04-27 06:03:59"
            ],
            [
                "1985-10-08 13:13:39"
            ],
            [
                "1990-12-02 09:03:38"
            ],
            [
                "2004-01-18 20:37:50"
            ],
            [
                "1977-08-13 02:18:47"
            ],
            [
                "2002-04-07 20:28:37"
            ]
        ]
    },
    {
        "question": "Find the total number of available hotels.",
        "query": "MATCH (hotels:`cre_Theme_park.Hotels`)\nRETURN count(*)",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                20
            ]
        ]
    },
    {
        "question": "Show all distinct location names.",
        "query": "MATCH (locations:`cre_Theme_park.Locations`)\nRETURN DISTINCT locations.Location_Name",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "Astro Orbiter"
            ],
            [
                "African Animals"
            ],
            [
                "American Adventure"
            ],
            [
                "The Barnstormer"
            ],
            [
                "African Adventure"
            ],
            [
                "UK Gallery"
            ],
            [
                "The Boneyard"
            ],
            [
                "Shark World"
            ],
            [
                "Space Spin"
            ],
            [
                "Butterflies"
            ],
            [
                "Soak Station"
            ],
            [
                "Castle"
            ],
            [
                "Coral Reefs"
            ],
            [
                "Film Festival"
            ],
            [
                "Fossil Fun Games"
            ]
        ]
    },
    {
        "question": "Show the names and details of all the staff members.",
        "query": "MATCH (staff:`cre_Theme_park.Staff`)\nRETURN staff.Name,staff.Other_Details",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "Whitney",
                null
            ],
            [
                "Kaela",
                null
            ],
            [
                "Eunice",
                null
            ],
            [
                "Kiarra",
                null
            ],
            [
                "Phoebe",
                null
            ],
            [
                "Vickie",
                null
            ],
            [
                "Jannie",
                null
            ],
            [
                "Lenore",
                null
            ],
            [
                "Asia",
                null
            ],
            [
                "Janet",
                null
            ],
            [
                "Elouise",
                null
            ],
            [
                "Gina",
                null
            ],
            [
                "Beth",
                null
            ],
            [
                "Ruthie",
                null
            ],
            [
                "Aurore",
                null
            ],
            [
                "Cortney",
                null
            ],
            [
                "Astrid",
                null
            ],
            [
                "Shemar",
                null
            ],
            [
                "Trinity",
                null
            ],
            [
                "Carmella",
                null
            ]
        ]
    },
    {
        "question": "Show details of all visitors.",
        "query": "MATCH (visitors:`cre_Theme_park.Visitors`)\nRETURN visitors.Tourist_Details",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "Toney"
            ],
            [
                "Graciela"
            ],
            [
                "Vincent"
            ],
            [
                "Vivian"
            ],
            [
                "Nettie"
            ],
            [
                "Laurence"
            ],
            [
                "Newell"
            ],
            [
                "Marisol"
            ],
            [
                "Jarrell"
            ],
            [
                "Edna"
            ],
            [
                "Maud"
            ],
            [
                "Alison"
            ],
            [
                "Rosalind"
            ],
            [
                "Tevin"
            ],
            [
                "Aleen"
            ],
            [
                "Marcelle"
            ],
            [
                "Lizzie"
            ],
            [
                "Wayne"
            ],
            [
                "Teresa"
            ],
            [
                "Elnora"
            ]
        ]
    },
    {
        "question": "What is the address of the location \"UK Gallery\"?",
        "query": "MATCH (locations:`cre_Theme_park.Locations`)\nWHERE locations.Location_Name = 'UK Gallery'\nRETURN locations.Address",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "4411 Sabrina Radial Suite 582"
            ]
        ]
    }
]