[
    {
        "db_id": "driving_school",
        "query": "MATCH (vehicles:`driving_school.Vehicles`)\nRETURN count(*)",
        "question": "How many vehicle in total?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (vehicles:`driving_school.Vehicles`)\nRETURN count(*)",
        "question": "How many vehicles exist?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (vehicles:`driving_school.Vehicles`)\nWHERE vehicles.vehicle_id = 1\nRETURN vehicles.vehicle_details",
        "question": "Show the detail of vehicle with id 1.",
        "answers": [
            [
                "Van"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (vehicles:`driving_school.Vehicles`)\nWHERE vehicles.vehicle_id = 1\nRETURN vehicles.vehicle_details",
        "question": "What are the details of the car with id 1?",
        "answers": [
            [
                "Van"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (staff:`driving_school.Staff`)\nRETURN staff.first_name,staff.middle_name,staff.last_name",
        "question": "List the first name middle name and last name of all staff.",
        "answers": [
            [
                "Janessa",
                "Amara",
                "Sawayn"
            ],
            [
                "Camylle",
                "Icie",
                "Weissnat"
            ],
            [
                "Kaitlin",
                "Stephania",
                "Mertz"
            ],
            [
                "Rebekah",
                "Sherwood",
                "Hermann"
            ],
            [
                "Jedidiah",
                "Dejon",
                "Herzog"
            ],
            [
                "Eulalia",
                "Tre",
                "Maggio"
            ],
            [
                "Queenie",
                "Madelyn",
                "Macejkovic"
            ],
            [
                "Titus",
                "Duane",
                "Durgan"
            ],
            [
                "Margie",
                "Caesar",
                "Doyle"
            ],
            [
                "Jaleel",
                "Maiya",
                "Rogahn"
            ],
            [
                "Winnifred",
                "Liam",
                "Jast"
            ],
            [
                "Lincoln",
                "Benny",
                "Carroll"
            ],
            [
                "Ernestina",
                "Clarabelle",
                "Mraz"
            ],
            [
                "Ludie",
                "Ulices",
                "Kuphal"
            ],
            [
                "Simeon",
                "Mayra",
                "Turner"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (staff:`driving_school.Staff`)\nRETURN staff.first_name,staff.middle_name,staff.last_name",
        "question": "What are the first, middle, and last names of all staff?",
        "answers": [
            [
                "Janessa",
                "Amara",
                "Sawayn"
            ],
            [
                "Camylle",
                "Icie",
                "Weissnat"
            ],
            [
                "Kaitlin",
                "Stephania",
                "Mertz"
            ],
            [
                "Rebekah",
                "Sherwood",
                "Hermann"
            ],
            [
                "Jedidiah",
                "Dejon",
                "Herzog"
            ],
            [
                "Eulalia",
                "Tre",
                "Maggio"
            ],
            [
                "Queenie",
                "Madelyn",
                "Macejkovic"
            ],
            [
                "Titus",
                "Duane",
                "Durgan"
            ],
            [
                "Margie",
                "Caesar",
                "Doyle"
            ],
            [
                "Jaleel",
                "Maiya",
                "Rogahn"
            ],
            [
                "Winnifred",
                "Liam",
                "Jast"
            ],
            [
                "Lincoln",
                "Benny",
                "Carroll"
            ],
            [
                "Ernestina",
                "Clarabelle",
                "Mraz"
            ],
            [
                "Ludie",
                "Ulices",
                "Kuphal"
            ],
            [
                "Simeon",
                "Mayra",
                "Turner"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (staff:`driving_school.Staff`)\nRETURN count(*)",
        "question": "How many staff in total?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (customers:`driving_school.Customers`)\nRETURN customers.first_name,customers.last_name",
        "question": "List the first name and last name of all customers.",
        "answers": [
            [
                "Carole",
                "Bernhard"
            ],
            [
                "Genevieve",
                "Terry"
            ],
            [
                "Clara",
                "Ortiz"
            ],
            [
                "Jordy",
                "Tromp"
            ],
            [
                "Millie",
                "Bruen"
            ],
            [
                "Amya",
                "Spinka"
            ],
            [
                "Marina",
                "Koelpin"
            ],
            [
                "Dianna",
                "Trantow"
            ],
            [
                "Leif",
                "Mertz"
            ],
            [
                "Rylan",
                "Goodwin"
            ],
            [
                "Ray",
                "Kohler"
            ],
            [
                "Omer",
                "Leuschke"
            ],
            [
                "Sigrid",
                "Schmeler"
            ],
            [
                "Estelle",
                "Grant"
            ],
            [
                "Dameon",
                "Sanford"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (customers:`driving_school.Customers`)\nRETURN customers.first_name,customers.last_name",
        "question": "What are the first and last names for all customers?",
        "answers": [
            [
                "Carole",
                "Bernhard"
            ],
            [
                "Genevieve",
                "Terry"
            ],
            [
                "Clara",
                "Ortiz"
            ],
            [
                "Jordy",
                "Tromp"
            ],
            [
                "Millie",
                "Bruen"
            ],
            [
                "Amya",
                "Spinka"
            ],
            [
                "Marina",
                "Koelpin"
            ],
            [
                "Dianna",
                "Trantow"
            ],
            [
                "Leif",
                "Mertz"
            ],
            [
                "Rylan",
                "Goodwin"
            ],
            [
                "Ray",
                "Kohler"
            ],
            [
                "Omer",
                "Leuschke"
            ],
            [
                "Sigrid",
                "Schmeler"
            ],
            [
                "Estelle",
                "Grant"
            ],
            [
                "Dameon",
                "Sanford"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE customers.amount_outstanding > 2000\nRETURN customers.phone_number,customers.email_address",
        "question": "List phone number and email address of customer with more than 2000 outstanding balance.",
        "answers": [
            [
                "+14(5)2351480248",
                "huel.jana@example.org"
            ],
            [
                "374-483-2758x85087",
                "hilario.sporer@example.org"
            ],
            [
                "218.550.1362",
                "afranecki@example.com"
            ],
            [
                "1-618-535-9750",
                "asha.kilback@example.org"
            ],
            [
                "1-673-962-8158x7646",
                "kozey.citlalli@example.org"
            ],
            [
                "(662)490-3108",
                "mayert.judy@example.com"
            ],
            [
                "206-054-0689x05861",
                "kroberts@example.org"
            ],
            [
                "753.921.0871",
                "mariela28@example.org"
            ],
            [
                "(297)122-0086",
                "karina.carroll@example.net"
            ],
            [
                "417.136.2900x672",
                "myrl.lind@example.net"
            ],
            [
                "192-395-2411",
                "wehner.harold@example.com"
            ],
            [
                "1-875-045-0806",
                "ehowell@example.com"
            ],
            [
                "(729)396-4354x3576",
                "kitty.hand@example.net"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE customers.amount_outstanding > 2000\nRETURN customers.phone_number,customers.email_address",
        "question": "What are the phone numbers and email addresses of all customers who have an outstanding balance of more than 2000?",
        "answers": [
            [
                "+14(5)2351480248",
                "huel.jana@example.org"
            ],
            [
                "374-483-2758x85087",
                "hilario.sporer@example.org"
            ],
            [
                "218.550.1362",
                "afranecki@example.com"
            ],
            [
                "1-618-535-9750",
                "asha.kilback@example.org"
            ],
            [
                "1-673-962-8158x7646",
                "kozey.citlalli@example.org"
            ],
            [
                "(662)490-3108",
                "mayert.judy@example.com"
            ],
            [
                "206-054-0689x05861",
                "kroberts@example.org"
            ],
            [
                "753.921.0871",
                "mariela28@example.org"
            ],
            [
                "(297)122-0086",
                "karina.carroll@example.net"
            ],
            [
                "417.136.2900x672",
                "myrl.lind@example.net"
            ],
            [
                "192-395-2411",
                "wehner.harold@example.com"
            ],
            [
                "1-875-045-0806",
                "ehowell@example.com"
            ],
            [
                "(729)396-4354x3576",
                "kitty.hand@example.net"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE customers.customer_status_code = 'Good Customer'\nRETURN customers.date_of_birth",
        "question": "When are the birthdays of customer who are classified as 'Good Customer' status?",
        "answers": [
            [
                "1994-06-21 01:34:56"
            ],
            [
                "1993-02-07 05:40:26"
            ],
            [
                "1993-03-08 08:48:42"
            ],
            [
                "1994-05-07 01:32:16"
            ],
            [
                "1988-09-19 14:45:56"
            ],
            [
                "1996-05-23 01:21:54"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE customers.customer_status_code = 'Good Customer'\nRETURN customers.date_of_birth",
        "question": "What is the date of birth of every customer whose status code is 'Good Customer'?",
        "answers": [
            [
                "1994-06-21 01:34:56"
            ],
            [
                "1993-02-07 05:40:26"
            ],
            [
                "1993-03-08 08:48:42"
            ],
            [
                "1994-05-07 01:32:16"
            ],
            [
                "1988-09-19 14:45:56"
            ],
            [
                "1996-05-23 01:21:54"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (customers:`driving_school.Customers`)\nRETURN count(*)",
        "question": "How many customers in total?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (customers:`driving_school.Customers`)\nRETURN customers.customer_status_code,count(*)",
        "question": "List all customer status codes and the number of customers having each status code.",
        "answers": [
            [
                "Bad Customer",
                9
            ],
            [
                "Good Customer",
                6
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (customers:`driving_school.Customers`)\nRETURN customers.customer_status_code,count(*)",
        "question": "For each customer status code, how many customers are classified that way?",
        "answers": [
            [
                "Bad Customer",
                9
            ],
            [
                "Good Customer",
                6
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE 1000<=customers.amount_outstanding<=3000\nRETURN customers.first_name,customers.last_name",
        "question": "List the first name and last name of customers have the amount of outstanding between 1000 and 3000.",
        "answers": [
            [
                "Rylan",
                "Goodwin"
            ],
            [
                "Omer",
                "Leuschke"
            ],
            [
                "Sigrid",
                "Schmeler"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE 1000<=customers.amount_outstanding<=3000\nRETURN customers.first_name,customers.last_name",
        "question": "What are the first and last names of all customers with between 1000 and 3000 dollars outstanding?",
        "answers": [
            [
                "Rylan",
                "Goodwin"
            ],
            [
                "Omer",
                "Leuschke"
            ],
            [
                "Sigrid",
                "Schmeler"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (T1:`driving_school.Customers`)-[]-(T2:`driving_school.Addresses`)\nWITH count(T2.city) AS cnt, T2\nRETURN T2.city\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Which city does has most number of customers?",
        "answers": [
            [
                "South Richieport"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (T1:`driving_school.Customers`)-[]-(T2:`driving_school.Addresses`)\nWITH count(T2.city) AS cnt, T2\nRETURN T2.city\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the city with the most customers?",
        "answers": [
            [
                "South Richieport"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (T1:`driving_school.Customer_Payments`)-[]-(T2:`driving_school.Customers`)\nWITH count(*) AS count, T2.first_name AS first_name, T2.last_name AS last_name\nWHERE count  > 2\nRETURN first_name,last_name",
        "question": "List first name and last name of customers that have more than 2 payments.",
        "answers": [
            [
                "Estelle",
                "Grant"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (T1:`driving_school.Customer_Payments`)-[]-(T2:`driving_school.Customers`)\nWITH count(*) AS count, T2.first_name AS first_name, T2.last_name AS last_name\nWHERE count  > 2\nRETURN first_name,last_name",
        "question": "What are the first and last names of all customers with more than 2 payments?",
        "answers": [
            [
                "Estelle",
                "Grant"
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (customer_payments:`driving_school.Customer_Payments`)\nRETURN customer_payments.payment_method_code,count(*)",
        "question": "List all payment methods and number of payments using each payment methods.",
        "answers": [
            [
                "Direct Debit",
                10
            ],
            [
                "Credit Card",
                5
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (customer_payments:`driving_school.Customer_Payments`)\nRETURN customer_payments.payment_method_code,count(*)",
        "question": "For each payment method, how many payments were made?",
        "answers": [
            [
                "Direct Debit",
                10
            ],
            [
                "Credit Card",
                5
            ]
        ]
    },
    {
        "db_id": "driving_school",
        "query": "MATCH (T1:`driving_school.Vehicles`)-[]-(T2:`driving_school.Lessons`)\nWITH T1, count(T1.vehicle_id) AS cnt\nRETURN T1.vehicle_id,T1.vehicle_details\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the id and detail of the vehicle used in lessons for most of the times?",
        "answers": [
            [
                2,
                "Truck"
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN count(*)",
        "question": "How many faculty do we have?",
        "answers": [
            [
                58
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN count(*)",
        "question": "What is the total number of faculty members?",
        "answers": [
            [
                58
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN DISTINCT faculty.Rank",
        "question": "What ranks do we have for faculty?",
        "answers": [
            [
                "Instructor"
            ],
            [
                "Professor"
            ],
            [
                "AssocProf"
            ],
            [
                "AsstProf"
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN DISTINCT faculty.Rank",
        "question": "Find the list of distinct ranks for faculty.",
        "answers": [
            [
                "Instructor"
            ],
            [
                "Professor"
            ],
            [
                "AssocProf"
            ],
            [
                "AsstProf"
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN DISTINCT faculty.Building",
        "question": "Show all the distinct buildings that have faculty rooms.",
        "answers": [
            [
                "NEB"
            ],
            [
                "Barton"
            ],
            [
                "Krieger"
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN DISTINCT faculty.Building",
        "question": "What buildings have faculty offices?",
        "answers": [
            [
                "NEB"
            ],
            [
                "Barton"
            ],
            [
                "Krieger"
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Sex = 'F'\nRETURN faculty.Fname,faculty.Lname,faculty.Phone",
        "question": "Show the first name, last name, and phone number for all female faculty members.",
        "answers": [
            [
                "Stacey",
                "Jones",
                3550
            ],
            [
                "Joanne",
                "Houlahan",
                1260
            ],
            [
                "Ellie",
                "Angelopoulou",
                2152
            ],
            [
                "Lenore",
                "Cowen",
                2870
            ],
            [
                "Brenda",
                "Rapp",
                2032
            ],
            [
                "Geraldine",
                "Legendre",
                8972
            ],
            [
                "Leslie",
                "Hall",
                7332
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Sex = 'F'\nRETURN faculty.Fname,faculty.Lname,faculty.Phone",
        "question": "What are the first name, last name, and phone number of all the female faculty members?",
        "answers": [
            [
                "Stacey",
                "Jones",
                3550
            ],
            [
                "Joanne",
                "Houlahan",
                1260
            ],
            [
                "Ellie",
                "Angelopoulou",
                2152
            ],
            [
                "Lenore",
                "Cowen",
                2870
            ],
            [
                "Brenda",
                "Rapp",
                2032
            ],
            [
                "Geraldine",
                "Legendre",
                8972
            ],
            [
                "Leslie",
                "Hall",
                7332
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Sex = 'M'\nRETURN faculty.FacID",
        "question": "Show ids for all the male faculty.",
        "answers": [
            [
                1082
            ],
            [
                1121
            ],
            [
                1148
            ],
            [
                1172
            ],
            [
                1177
            ],
            [
                1823
            ],
            [
                2028
            ],
            [
                2119
            ],
            [
                2192
            ],
            [
                2291
            ],
            [
                2311
            ],
            [
                2738
            ],
            [
                2881
            ],
            [
                3457
            ],
            [
                4432
            ],
            [
                5718
            ],
            [
                6112
            ],
            [
                6182
            ],
            [
                6191
            ],
            [
                6330
            ],
            [
                6541
            ],
            [
                6910
            ],
            [
                6925
            ],
            [
                7134
            ],
            [
                7231
            ],
            [
                7271
            ],
            [
                7506
            ],
            [
                7712
            ],
            [
                7723
            ],
            [
                7792
            ],
            [
                8102
            ],
            [
                8118
            ],
            [
                8122
            ],
            [
                8423
            ],
            [
                8721
            ],
            [
                8722
            ],
            [
                8723
            ],
            [
                8741
            ],
            [
                8791
            ],
            [
                8918
            ],
            [
                8989
            ],
            [
                9172
            ],
            [
                9191
            ],
            [
                9199
            ],
            [
                9210
            ],
            [
                9379
            ],
            [
                9514
            ],
            [
                9811
            ],
            [
                9823
            ],
            [
                9824
            ],
            [
                9826
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Sex = 'M'\nRETURN faculty.FacID",
        "question": "What are the faculty ids of all the male faculty members?",
        "answers": [
            [
                1082
            ],
            [
                1121
            ],
            [
                1148
            ],
            [
                1172
            ],
            [
                1177
            ],
            [
                1823
            ],
            [
                2028
            ],
            [
                2119
            ],
            [
                2192
            ],
            [
                2291
            ],
            [
                2311
            ],
            [
                2738
            ],
            [
                2881
            ],
            [
                3457
            ],
            [
                4432
            ],
            [
                5718
            ],
            [
                6112
            ],
            [
                6182
            ],
            [
                6191
            ],
            [
                6330
            ],
            [
                6541
            ],
            [
                6910
            ],
            [
                6925
            ],
            [
                7134
            ],
            [
                7231
            ],
            [
                7271
            ],
            [
                7506
            ],
            [
                7712
            ],
            [
                7723
            ],
            [
                7792
            ],
            [
                8102
            ],
            [
                8118
            ],
            [
                8122
            ],
            [
                8423
            ],
            [
                8721
            ],
            [
                8722
            ],
            [
                8723
            ],
            [
                8741
            ],
            [
                8791
            ],
            [
                8918
            ],
            [
                8989
            ],
            [
                9172
            ],
            [
                9191
            ],
            [
                9199
            ],
            [
                9210
            ],
            [
                9379
            ],
            [
                9514
            ],
            [
                9811
            ],
            [
                9823
            ],
            [
                9824
            ],
            [
                9826
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN faculty.Building,count(*)",
        "question": "Show all the buildings along with the number of faculty members the buildings have.",
        "answers": [
            [
                "NEB",
                18
            ],
            [
                "Barton",
                20
            ],
            [
                "Krieger",
                20
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN faculty.Building,count(*)",
        "question": "How many faculty members does each building have? List the result with the name of the building.",
        "answers": [
            [
                "NEB",
                18
            ],
            [
                "Barton",
                20
            ],
            [
                "Krieger",
                20
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN faculty.Rank,count(*)",
        "question": "For each faculty rank, show the number of faculty members who have it.",
        "answers": [
            [
                "Instructor",
                8
            ],
            [
                "Professor",
                27
            ],
            [
                "AssocProf",
                8
            ],
            [
                "AsstProf",
                15
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN faculty.Rank,count(*)",
        "question": "How many faculty members do we have for each faculty rank?",
        "answers": [
            [
                "Instructor",
                8
            ],
            [
                "Professor",
                27
            ],
            [
                "AssocProf",
                8
            ],
            [
                "AsstProf",
                15
            ]
        ]
    },
    {
        "db_id": "activity_1",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN faculty.Rank,faculty.Sex,count(*)",
        "question": "Show all the ranks and the number of male and female faculty for each rank.",
        "answers": [
            [
                "Instructor",
                "M",
                5
            ],
            [
                "Professor",
                "M",
                27
            ],
            [
                "AssocProf",
                "M",
                7
            ],
            [
                "Instructor",
                "F",
                3
            ],
            [
                "AsstProf",
                "M",
                12
            ],
            [
                "AsstProf",
                "F",
                3
            ],
            [
                "AssocProf",
                "F",
                1
            ]
        ]
    }
]