[
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN captain.Name,captain.Class,captain.Rank",
        "question": "What are the names, classes, and ranks of all captains?",
        "answers": [
            [
                "Captain Sir Henry Langford",
                "Third-rate ship of the line",
                "Midshipman"
            ],
            [
                "Captain Beves Conway",
                "Third-rate ship of the line",
                "Midshipman"
            ],
            [
                "Lieutenant Hugh Bolitho",
                "Cutter",
                "Midshipman"
            ],
            [
                "Lieutenant Montagu Verling",
                "Armed schooner",
                "Midshipman"
            ],
            [
                "Captain Henry Dumaresq",
                "Frigate",
                "Lieutenant"
            ],
            [
                "Captain Gilbert Pears",
                "Third-rate ship of the line",
                "Lieutenant"
            ],
            [
                "Commander Richard Bolitho",
                "Sloop-of-war",
                "Commander, junior captain"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN captain.Rank\nORDER BY captain.Rank DESC\nLIMIT 1",
        "question": "Which rank is the most common among captains?",
        "answers": [
            [
                "Midshipman"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN captain.Rank\nORDER BY captain.Rank DESC\nLIMIT 1",
        "question": "Return the rank for which there are the fewest captains.",
        "answers": [
            [
                "Midshipman"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nWITH captain.Class AS Class, count(*) AS count\nWHERE count  > 2\nRETURN Class",
        "question": "Which classes have more than two captains?",
        "answers": [
            [
                "Third-rate ship of the line"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nWITH captain.Class AS Class, count(*) AS count\nWHERE count  > 2\nRETURN Class",
        "question": "Give the classes that have more than two captains.",
        "answers": [
            [
                "Third-rate ship of the line"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nWHERE captain.Rank = 'Midshipman' OR captain.Rank = 'Lieutenant'\nRETURN captain.Name",
        "question": "Find the name of captains whose rank are either Midshipman or Lieutenant.",
        "answers": [
            [
                "Captain Sir Henry Langford"
            ],
            [
                "Captain Beves Conway"
            ],
            [
                "Lieutenant Hugh Bolitho"
            ],
            [
                "Lieutenant Montagu Verling"
            ],
            [
                "Captain Henry Dumaresq"
            ],
            [
                "Captain Gilbert Pears"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nWHERE captain.Rank = 'Midshipman' OR captain.Rank = 'Lieutenant'\nRETURN captain.Name",
        "question": "What are the names of captains that have either the rank Midshipman or Lieutenant?",
        "answers": [
            [
                "Captain Sir Henry Langford"
            ],
            [
                "Captain Beves Conway"
            ],
            [
                "Lieutenant Hugh Bolitho"
            ],
            [
                "Lieutenant Montagu Verling"
            ],
            [
                "Captain Henry Dumaresq"
            ],
            [
                "Captain Gilbert Pears"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN captain.Name\nORDER BY captain.age\nLIMIT 1",
        "question": "What is the name of the youngest captain?",
        "answers": [
            [
                "Captain Henry Dumaresq"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN captain.Name\nORDER BY captain.age\nLIMIT 1",
        "question": "Return the name of the youngest captain.",
        "answers": [
            [
                "Captain Henry Dumaresq"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (ship:`ship_1.Ship`)\nRETURN count(*)",
        "question": "Count the number of ships.",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (ship:`ship_1.Ship`)\nRETURN ship.Name,ship.Type,ship.Flag\nORDER BY ship.Built_Year DESC\nLIMIT 1",
        "question": "Find the name, type, and flag of the ship that is built in the most recent year.",
        "answers": [
            [
                "HMS Gorgon",
                "Panamax",
                "Panama"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (ship:`ship_1.Ship`)\nRETURN ship.Name,ship.Type,ship.Flag\nORDER BY ship.Built_Year DESC\nLIMIT 1",
        "question": "What is the name, type, and flag of the ship that was built in the most recent year?",
        "answers": [
            [
                "HMS Gorgon",
                "Panamax",
                "Panama"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (ship:`ship_1.Ship`)\nRETURN count(*),ship.Flag",
        "question": "Group by ships by flag, and return number of ships that have each flag.",
        "answers": [
            [
                8,
                "Panama"
            ],
            [
                1,
                "Malta"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (ship:`ship_1.Ship`)\nRETURN count(*),ship.Flag",
        "question": "What are the different ship flags, and how many ships have each?",
        "answers": [
            [
                8,
                "Panama"
            ],
            [
                1,
                "Malta"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (ship:`ship_1.Ship`)\nRETURN ship.Flag\nORDER BY ship.Flag DESC\nLIMIT 1",
        "question": "Which flag is most widely used among all ships?",
        "answers": [
            [
                "Panama"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (ship:`ship_1.Ship`)\nRETURN ship.Flag\nORDER BY ship.Flag DESC\nLIMIT 1",
        "question": "Return the flag that is most common among all ships.",
        "answers": [
            [
                "Panama"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (ship:`ship_1.Ship`)\nRETURN ship.Name\nORDER BY ship.Built_Year,ship.Class",
        "question": "List all ship names in the order of built year and class.",
        "answers": [
            [
                "HMS Manxman"
            ],
            [
                "HM Cutter Avenger"
            ],
            [
                "HMS Trojan"
            ],
            [
                "HM Sloop Sparrow"
            ],
            [
                "HMS Phalarope"
            ],
            [
                "HMS Undine"
            ],
            [
                "HMS Gorgon"
            ],
            [
                "HM Schooner Hotspur"
            ],
            [
                "HMS Destiny"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (ship:`ship_1.Ship`)\nRETURN ship.Name\nORDER BY ship.Built_Year,ship.Class",
        "question": "What are the names of ships, ordered by year they were built and their class?",
        "answers": [
            [
                "HMS Manxman"
            ],
            [
                "HM Cutter Avenger"
            ],
            [
                "HMS Trojan"
            ],
            [
                "HM Sloop Sparrow"
            ],
            [
                "HMS Phalarope"
            ],
            [
                "HMS Undine"
            ],
            [
                "HMS Gorgon"
            ],
            [
                "HM Schooner Hotspur"
            ],
            [
                "HMS Destiny"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (t1:`ship_1.Ship`)-[]-(t2:`ship_1.captain`)\nWITH count(*) AS count, t1.Name AS Name\nWHERE count  > 1\nRETURN Name",
        "question": "Find the name of the ships that have more than one captain.",
        "answers": [
            [
                "HMS Gorgon"
            ],
            [
                "HM Cutter Avenger"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (t1:`ship_1.Ship`)-[]-(t2:`ship_1.captain`)\nWITH count(*) AS count, t1.Name AS Name\nWHERE count  > 1\nRETURN Name",
        "question": "What are the names of ships that have more than one captain?",
        "answers": [
            [
                "HMS Gorgon"
            ],
            [
                "HM Cutter Avenger"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (t1:`ship_1.Ship`)-[]-(t2:`ship_1.captain`)\nRETURN t1.Name\nORDER BY t2.age\nLIMIT 1",
        "question": "Find the name of the ship that is steered by the youngest captain.",
        "answers": [
            [
                "HMS Destiny"
            ]
        ]
    },
    {
        "db_id": "ship_1",
        "query": "MATCH (t1:`ship_1.Ship`)-[]-(t2:`ship_1.captain`)\nRETURN t1.Name\nORDER BY t2.age\nLIMIT 1",
        "question": "What is the name of the ship that is commanded by the youngest captain?",
        "answers": [
            [
                "HMS Destiny"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (match:`city_record.match`)\nWHERE match.Competition = '1994 FIFA World Cup qualification'\nRETURN match.Match_ID",
        "question": "Find the match ids of the cities that hosted competition \"1994 FIFA World Cup qualification\"?",
        "answers": [
            [
                2
            ],
            [
                3
            ],
            [
                4
            ],
            [
                5
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (match:`city_record.match`)\nWHERE match.Competition = '1994 FIFA World Cup qualification'\nRETURN match.Match_ID",
        "question": "What is the match id of the competition called \"1994 FIFA World Cup qualification\"?",
        "answers": [
            [
                2
            ],
            [
                3
            ],
            [
                4
            ],
            [
                5
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.hosting_city`)\nWHERE T2.Year > 2010\nRETURN T1.City",
        "question": "Find the cities which were once a host city after 2010?",
        "answers": [
            [
                "Wuxi ( Jiangsu )"
            ],
            [
                "Taizhou ( Zhejiang )"
            ],
            [
                "Jiaxing ( Zhejiang )"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.hosting_city`)\nWHERE T2.Year > 2010\nRETURN T1.City",
        "question": "Which cities served as a host city after 2010?",
        "answers": [
            [
                "Wuxi ( Jiangsu )"
            ],
            [
                "Taizhou ( Zhejiang )"
            ],
            [
                "Jiaxing ( Zhejiang )"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.hosting_city`)-[]-(T3:`city_record.match`)\nWHERE T1.City = 'Nanjing ( Jiangsu )' AND T3.Competition = '1994 FIFA World Cup qualification'\nRETURN T3.Venue",
        "question": "What is the venue of the competition \"1994 FIFA World Cup qualification\" hosted by \"Nanjing ( Jiangsu )\"?",
        "answers": [
            [
                "Estadio Rigoberto L\u00f3pez , Managua , Nicaragua"
            ],
            [
                "Estadio Cuscatl\u00e1n , San Salvador , El Salvador"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.hosting_city`)-[]-(T3:`city_record.match`)\nWHERE T1.City = 'Nanjing ( Jiangsu )' AND T3.Competition = '1994 FIFA World Cup qualification'\nRETURN T3.Venue",
        "question": "Find the venue of the competition \"1994 FIFA World Cup qualification\" which was hosted by \"Nanjing ( Jiangsu )\".",
        "answers": [
            [
                "Estadio Rigoberto L\u00f3pez , Managua , Nicaragua"
            ],
            [
                "Estadio Cuscatl\u00e1n , San Salvador , El Salvador"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.temperature`)\nWHERE T1.City = 'Shanghai'\nRETURN T2.Jan",
        "question": "Give me the temperature of Shanghai in January.",
        "answers": [
            [
                17.8
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.temperature`)\nWHERE T1.City = 'Shanghai'\nRETURN T2.Jan",
        "question": "What is the temperature of \"Shanghai\" city in January?",
        "answers": [
            [
                17.8
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.hosting_city`)\nWHERE T1.City = 'Taizhou ( Zhejiang )'\nRETURN T2.Year",
        "question": "What is the host year of city \"Taizhou ( Zhejiang )\"?",
        "answers": [
            [
                2012
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.hosting_city`)\nWHERE T1.City = 'Taizhou ( Zhejiang )'\nRETURN T2.Year",
        "question": "IN which year did city \"Taizhou ( Zhejiang )\" serve as a host city?",
        "answers": [
            [
                2012
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (city:`city_record.city`)\nRETURN city.City\nORDER BY city.Regional_Population DESC\nLIMIT 3",
        "question": "Which three cities have the largest regional population?",
        "answers": [
            [
                "Shanghai"
            ],
            [
                "Suzhou ( Jiangsu )"
            ],
            [
                "Hangzhou ( Zhejiang )"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (city:`city_record.city`)\nRETURN city.City\nORDER BY city.Regional_Population DESC\nLIMIT 3",
        "question": "What are the three largest cities in terms of regional population?",
        "answers": [
            [
                "Shanghai"
            ],
            [
                "Suzhou ( Jiangsu )"
            ],
            [
                "Hangzhou ( Zhejiang )"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (city:`city_record.city`)\nRETURN city.City,city.GDP\nORDER BY city.GDP\nLIMIT 1",
        "question": "Which city has the lowest GDP? Please list the city name and its GDP.",
        "answers": [
            [
                "Jinhua ( Zhejiang )",
                244.77
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (city:`city_record.city`)\nRETURN city.City,city.GDP\nORDER BY city.GDP\nLIMIT 1",
        "question": "What is the city with the smallest GDP? Return the city and its GDP.",
        "answers": [
            [
                "Jinhua ( Zhejiang )",
                244.77
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.temperature`)\nRETURN T1.City\nORDER BY T2.Feb DESC\nLIMIT 1",
        "question": "Which city has the highest temperature in February?",
        "answers": [
            [
                "Suzhou ( Jiangsu )"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.temperature`)\nRETURN T1.City\nORDER BY T2.Feb DESC\nLIMIT 1",
        "question": "In February, which city marks the highest temperature?",
        "answers": [
            [
                "Suzhou ( Jiangsu )"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.temperature`)\nWHERE T2.Mar < T2.Jul OR T2.Mar > T2.Oct\nRETURN T1.City",
        "question": "Give me a list of cities whose temperature in March is lower than that in July or higher than that in Oct?",
        "answers": [
            [
                "Shanghai"
            ],
            [
                "Nanjing ( Jiangsu )"
            ],
            [
                "Hangzhou ( Zhejiang )"
            ],
            [
                "Suzhou ( Jiangsu )"
            ],
            [
                "Wuxi ( Jiangsu )"
            ],
            [
                "Jinhua ( Zhejiang )"
            ],
            [
                "Nantong ( Jiangsu )"
            ],
            [
                "Jiaxing ( Zhejiang )"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.temperature`)\nWHERE T2.Feb > T2.Jun\nRETURN T1.City  AS city \nUNION\nMATCH (T3:`city_record.city`)-[]-(T4:`city_record.hosting_city`)\nRETURN T3.City  AS city",
        "question": "Give me a list of cities whose temperature in Feb is higher than that in Jun or cities that were once host cities?",
        "answers": [
            [
                "Shanghai"
            ],
            [
                "Nanjing ( Jiangsu )"
            ],
            [
                "Wuxi ( Jiangsu )"
            ],
            [
                "Taizhou ( Zhejiang )"
            ],
            [
                "Jiaxing ( Zhejiang )"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.temperature`)\nWHERE T2.Feb > T2.Jun\nRETURN T1.City  AS city \nUNION\nMATCH (T3:`city_record.city`)-[]-(T4:`city_record.hosting_city`)\nRETURN T3.City  AS city",
        "question": "Which cities have higher temperature in Feb than in Jun or have once served as host cities?",
        "answers": [
            [
                "Shanghai"
            ],
            [
                "Nanjing ( Jiangsu )"
            ],
            [
                "Wuxi ( Jiangsu )"
            ],
            [
                "Taizhou ( Zhejiang )"
            ],
            [
                "Jiaxing ( Zhejiang )"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (city:`city_record.city`)\nWHERE city.Regional_Population > 10000000\nRETURN city.City",
        "question": "Please give me a list of cities whose regional population is over 10000000.",
        "answers": [
            [
                "Shanghai"
            ],
            [
                "Suzhou ( Jiangsu )"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (city:`city_record.city`)\nWHERE city.Regional_Population > 10000000\nRETURN city.City",
        "question": "Which cities have regional population above 10000000?",
        "answers": [
            [
                "Shanghai"
            ],
            [
                "Suzhou ( Jiangsu )"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (city:`city_record.city`)\nWHERE city.Regional_Population > 10000000\nRETURN city.City  AS city \nUNION\nMATCH (city:`city_record.city`)\nWHERE city.Regional_Population < 5000000\nRETURN city.City  AS city",
        "question": "Please give me a list of cities whose regional population is over 8000000 or under 5000000.",
        "answers": [
            [
                "Shanghai"
            ],
            [
                "Suzhou ( Jiangsu )"
            ],
            [
                "Shaoxing ( Zhejiang )"
            ],
            [
                "Changzhou ( Jiangsu )"
            ],
            [
                "Jinhua ( Zhejiang )"
            ],
            [
                "Jiaxing ( Zhejiang )"
            ],
            [
                "Yangzhou ( Jiangsu )"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (city:`city_record.city`)\nWHERE city.Regional_Population > 10000000\nRETURN city.City  AS city \nUNION\nMATCH (city:`city_record.city`)\nWHERE city.Regional_Population < 5000000\nRETURN city.City  AS city",
        "question": "Which cities have regional population above 8000000 or below 5000000?",
        "answers": [
            [
                "Shanghai"
            ],
            [
                "Suzhou ( Jiangsu )"
            ],
            [
                "Shaoxing ( Zhejiang )"
            ],
            [
                "Changzhou ( Jiangsu )"
            ],
            [
                "Jinhua ( Zhejiang )"
            ],
            [
                "Jiaxing ( Zhejiang )"
            ],
            [
                "Yangzhou ( Jiangsu )"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (match:`city_record.match`)\nRETURN count(*),match.Competition",
        "question": "Find the number of matches in different competitions.",
        "answers": [
            [
                1,
                "Friendly match"
            ],
            [
                4,
                "1994 FIFA World Cup qualification"
            ],
            [
                1,
                "2002 FIFA World Cup qualification"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (match:`city_record.match`)\nRETURN count(*),match.Competition",
        "question": "For each competition, count the number of matches.",
        "answers": [
            [
                1,
                "Friendly match"
            ],
            [
                4,
                "1994 FIFA World Cup qualification"
            ],
            [
                1,
                "2002 FIFA World Cup qualification"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (match:`city_record.match`)\nRETURN match.Venue\nORDER BY match.Date DESC",
        "question": "List venues of all matches in the order of their dates starting from the most recent one.",
        "answers": [
            [
                "Estadio Cuscatl\u00e1n , San Salvador , El Salvador"
            ],
            [
                "Estadio Cuscatl\u00e1n , San Salvador , El Salvador"
            ],
            [
                "Estadio Cuscatl\u00e1n , San Salvador , El Salvador"
            ],
            [
                "Estadio Cuscatl\u00e1n , San Salvador , El Salvador"
            ],
            [
                "Estadio Rigoberto L\u00f3pez , Managua , Nicaragua"
            ],
            [
                "Estadio Cuscatl\u00e1n , San Salvador , El Salvador"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (match:`city_record.match`)\nRETURN match.Venue\nORDER BY match.Date DESC",
        "question": "What are the venues of all the matches? Sort them in the descending order of match date.",
        "answers": [
            [
                "Estadio Cuscatl\u00e1n , San Salvador , El Salvador"
            ],
            [
                "Estadio Cuscatl\u00e1n , San Salvador , El Salvador"
            ],
            [
                "Estadio Cuscatl\u00e1n , San Salvador , El Salvador"
            ],
            [
                "Estadio Cuscatl\u00e1n , San Salvador , El Salvador"
            ],
            [
                "Estadio Rigoberto L\u00f3pez , Managua , Nicaragua"
            ],
            [
                "Estadio Cuscatl\u00e1n , San Salvador , El Salvador"
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (city:`city_record.city`)\nRETURN city.GDP\nORDER BY city.Regional_Population DESC\nLIMIT 1",
        "question": "what is the GDP of the city with the largest population.",
        "answers": [
            [
                1919.57
            ]
        ]
    },
    {
        "db_id": "city_record",
        "query": "MATCH (city:`city_record.city`)\nRETURN city.GDP\nORDER BY city.Regional_Population DESC\nLIMIT 1",
        "question": "Find the GDP of the city with the largest regional population.",
        "answers": [
            [
                1919.57
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (individuals:`e_government.Individuals`)\nRETURN individuals.individual_first_name,individuals.individual_middle_name,individuals.individual_last_name\nORDER BY individuals.individual_last_name",
        "question": "List every individual's first name, middle name and last name in alphabetical order by last name.",
        "answers": [
            [
                "Ressie",
                "Alysson",
                "Bradtke"
            ],
            [
                "Shany",
                "Colleen",
                "D'Amore"
            ],
            [
                "Katarina",
                "Lacey",
                "Dooley"
            ],
            [
                "Daron",
                "Howard",
                "Hand"
            ],
            [
                "Jeffery",
                "Alberto",
                "Jacobs"
            ],
            [
                "Geovanny",
                "Antonia",
                "Kerluke"
            ],
            [
                "Nella",
                "Tommie",
                "Kertzmann"
            ],
            [
                "Casper",
                "Mitchell",
                "Kutch"
            ],
            [
                "Oscar",
                "Hosea",
                "Maggio"
            ],
            [
                "Jaylen",
                "Jewell",
                "O'Conner"
            ],
            [
                "Lafayette",
                "Raoul",
                "Rau"
            ],
            [
                "Daniella",
                "Jamel",
                "Rogahn"
            ],
            [
                "Allene",
                "Erwin",
                "Rutherford"
            ],
            [
                "Matteo",
                "Rene",
                "Schuster"
            ],
            [
                "Guy",
                "Erick",
                "Wunsch"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (individuals:`e_government.Individuals`)\nRETURN individuals.individual_first_name,individuals.individual_middle_name,individuals.individual_last_name\nORDER BY individuals.individual_last_name",
        "question": "What are the first, middle, and last names of all individuals, ordered by last name?",
        "answers": [
            [
                "Ressie",
                "Alysson",
                "Bradtke"
            ],
            [
                "Shany",
                "Colleen",
                "D'Amore"
            ],
            [
                "Katarina",
                "Lacey",
                "Dooley"
            ],
            [
                "Daron",
                "Howard",
                "Hand"
            ],
            [
                "Jeffery",
                "Alberto",
                "Jacobs"
            ],
            [
                "Geovanny",
                "Antonia",
                "Kerluke"
            ],
            [
                "Nella",
                "Tommie",
                "Kertzmann"
            ],
            [
                "Casper",
                "Mitchell",
                "Kutch"
            ],
            [
                "Oscar",
                "Hosea",
                "Maggio"
            ],
            [
                "Jaylen",
                "Jewell",
                "O'Conner"
            ],
            [
                "Lafayette",
                "Raoul",
                "Rau"
            ],
            [
                "Daniella",
                "Jamel",
                "Rogahn"
            ],
            [
                "Allene",
                "Erwin",
                "Rutherford"
            ],
            [
                "Matteo",
                "Rene",
                "Schuster"
            ],
            [
                "Guy",
                "Erick",
                "Wunsch"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (forms:`e_government.Forms`)\nRETURN DISTINCT forms.form_type_code",
        "question": "List all the types of forms.",
        "answers": [
            [
                "Basic"
            ],
            [
                "Complex"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (forms:`e_government.Forms`)\nRETURN DISTINCT forms.form_type_code",
        "question": "What are the different types of forms?",
        "answers": [
            [
                "Basic"
            ],
            [
                "Complex"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (organizations:`e_government.Organizations`)\nRETURN organizations.organization_name\nORDER BY organizations.date_formed ASC",
        "question": "List all the name of organizations in order of the date formed.",
        "answers": [
            [
                "Green Party"
            ],
            [
                "Labour Party"
            ],
            [
                "Plaid Cymru"
            ],
            [
                "Conservative"
            ],
            [
                "Liberal Democrats"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (organizations:`e_government.Organizations`)\nRETURN organizations.organization_name\nORDER BY organizations.date_formed ASC",
        "question": "What are the names of organizations, ordered by the date they were formed, ascending?",
        "answers": [
            [
                "Green Party"
            ],
            [
                "Labour Party"
            ],
            [
                "Plaid Cymru"
            ],
            [
                "Conservative"
            ],
            [
                "Liberal Democrats"
            ]
        ]
    },
    {
        "db_id": "e_government",
        "query": "MATCH (organizations:`e_government.Organizations`)\nRETURN organizations.organization_name\nORDER BY organizations.date_formed DESC\nLIMIT 1",
        "question": "Find the name of the youngest organization.",
        "answers": [
            [
                "Liberal Democrats"
            ]
        ]
    }
]