[
    {
        "db_id": "hospital_1",
        "query": "MATCH (T1:`hospital_1.Nurse`)-[T2:`hospital_1.On_Call`]-()\nRETURN DISTINCT T1.Name",
        "question": "What are the distinct names of nurses on call?",
        "answers": [
            [
                "Carla Espinosa"
            ],
            [
                "Laverne Roberts"
            ],
            [
                "Paul Flowers"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN count(*)",
        "question": "How many ships are there?",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN count(*)",
        "question": "What is the number of ships?",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN ship.Name\nORDER BY ship.Tonnage ASC",
        "question": "List the name of ships in ascending order of tonnage.",
        "answers": [
            [
                "Ariadne"
            ],
            [
                "Farringford"
            ],
            [
                "Author"
            ],
            [
                "Trader"
            ],
            [
                "Dromonby"
            ],
            [
                "Corbridge"
            ],
            [
                "Clan McTavish"
            ],
            [
                "Appam"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN ship.Name\nORDER BY ship.Tonnage ASC",
        "question": "what are the names of the ships ordered by ascending tonnage?",
        "answers": [
            [
                "Ariadne"
            ],
            [
                "Farringford"
            ],
            [
                "Author"
            ],
            [
                "Trader"
            ],
            [
                "Dromonby"
            ],
            [
                "Corbridge"
            ],
            [
                "Clan McTavish"
            ],
            [
                "Appam"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN ship.Type,ship.Nationality",
        "question": "What are the type and nationality of ships?",
        "answers": [
            [
                "Cargo ship",
                "United Kingdom"
            ],
            [
                "Battle ship",
                "United States"
            ],
            [
                "Cargo ship",
                "United Kingdom"
            ],
            [
                "Cargo ship",
                "United Kingdom"
            ],
            [
                "Battle ship",
                "United Kingdom"
            ],
            [
                "Cargo ship",
                "United States"
            ],
            [
                "Battle ship",
                "United Kingdom"
            ],
            [
                "Cargo ship",
                "United States"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN ship.Type,ship.Nationality",
        "question": "What are the types and nationalities of every ship?",
        "answers": [
            [
                "Cargo ship",
                "United Kingdom"
            ],
            [
                "Battle ship",
                "United States"
            ],
            [
                "Cargo ship",
                "United Kingdom"
            ],
            [
                "Cargo ship",
                "United Kingdom"
            ],
            [
                "Battle ship",
                "United Kingdom"
            ],
            [
                "Cargo ship",
                "United States"
            ],
            [
                "Battle ship",
                "United Kingdom"
            ],
            [
                "Cargo ship",
                "United States"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nWHERE ship.Nationality <> 'United States'\nRETURN ship.Name",
        "question": "List the name of ships whose nationality is not \"United States\".",
        "answers": [
            [
                "Corbridge"
            ],
            [
                "Dromonby"
            ],
            [
                "Author"
            ],
            [
                "Trader"
            ],
            [
                "Appam"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nWHERE ship.Nationality <> 'United States'\nRETURN ship.Name",
        "question": "What are the names of the ships that are not from the United States?",
        "answers": [
            [
                "Corbridge"
            ],
            [
                "Dromonby"
            ],
            [
                "Author"
            ],
            [
                "Trader"
            ],
            [
                "Appam"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nWHERE ship.Nationality = 'United States' OR ship.Nationality = 'United Kingdom'\nRETURN ship.Name",
        "question": "Show the name of ships whose nationality is either United States or United Kingdom.",
        "answers": [
            [
                "Corbridge"
            ],
            [
                "Farringford"
            ],
            [
                "Dromonby"
            ],
            [
                "Author"
            ],
            [
                "Trader"
            ],
            [
                "Ariadne"
            ],
            [
                "Appam"
            ],
            [
                "Clan McTavish"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nWHERE ship.Nationality = 'United States' OR ship.Nationality = 'United Kingdom'\nRETURN ship.Name",
        "question": "What are the names of the ships  that are from either the US or the UK?",
        "answers": [
            [
                "Corbridge"
            ],
            [
                "Farringford"
            ],
            [
                "Dromonby"
            ],
            [
                "Author"
            ],
            [
                "Trader"
            ],
            [
                "Ariadne"
            ],
            [
                "Appam"
            ],
            [
                "Clan McTavish"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN ship.Name\nORDER BY ship.Tonnage DESC\nLIMIT 1",
        "question": "What is the name of the ship with the largest tonnage?",
        "answers": [
            [
                "Appam"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN ship.Name\nORDER BY ship.Tonnage DESC\nLIMIT 1",
        "question": "What is the ship with the largest amount of tonnage called?",
        "answers": [
            [
                "Appam"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN ship.Type,count(*)",
        "question": "Show different types of ships and the number of ships of each type.",
        "answers": [
            [
                "Cargo ship",
                5
            ],
            [
                "Battle ship",
                3
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN ship.Type,count(*)",
        "question": "For each type, how many ships are there?",
        "answers": [
            [
                "Cargo ship",
                5
            ],
            [
                "Battle ship",
                3
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN ship.Type\nORDER BY ship.Type DESC\nLIMIT 1",
        "question": "Please show the most common type of ships.",
        "answers": [
            [
                "Cargo ship"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN ship.Type\nORDER BY ship.Type DESC\nLIMIT 1",
        "question": "What is the most common type of ships?",
        "answers": [
            [
                "Cargo ship"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nWITH ship.Nationality AS Nationality, count(*) AS count\nWHERE count  > 2\nRETURN Nationality",
        "question": "List the nations that have more than two ships.",
        "answers": [
            [
                "United Kingdom"
            ],
            [
                "United States"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nWITH ship.Nationality AS Nationality, count(*) AS count\nWHERE count  > 2\nRETURN Nationality",
        "question": "What are the nations that have more than two ships?",
        "answers": [
            [
                "United Kingdom"
            ],
            [
                "United States"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN ship.Type,avg(ship.Tonnage)",
        "question": "Show different types of ships and the average tonnage of ships of each type.",
        "answers": [
            [
                "Cargo ship",
                3932.2
            ],
            [
                "Battle ship",
                4845.0
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nRETURN ship.Type,avg(ship.Tonnage)",
        "question": "For each type, what is the average tonnage?",
        "answers": [
            [
                "Cargo ship",
                3932.2
            ],
            [
                "Battle ship",
                4845.0
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (T1:`ship_mission.mission`)-[]-(T2:`ship_mission.ship`)\nRETURN T1.Code,T1.Fate,T2.Name",
        "question": "Show codes and fates of missions, and names of ships involved.",
        "answers": [
            [
                "VMV-1",
                "Decommissioned 1950",
                "Corbridge"
            ],
            [
                "VMV-2",
                "Decommissioned 1950",
                "Farringford"
            ],
            [
                "VMV-3",
                "Lost (burned) 1931",
                "Dromonby"
            ],
            [
                "VMV-4 Former: Sterling",
                "Retired 1939",
                "Trader"
            ],
            [
                "VMV-5",
                "Decommissioned 1959",
                "Ariadne"
            ],
            [
                "VMV-6",
                "Decommissioned 1960",
                "Appam"
            ],
            [
                "VMV-7",
                "Lost (burned and sunk) 1933",
                "Clan McTavish"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (T1:`ship_mission.mission`)-[]-(T2:`ship_mission.ship`)\nRETURN T1.Code,T1.Fate,T2.Name",
        "question": "What are the mission codes, fates, and names of the ships involved?",
        "answers": [
            [
                "VMV-1",
                "Decommissioned 1950",
                "Corbridge"
            ],
            [
                "VMV-2",
                "Decommissioned 1950",
                "Farringford"
            ],
            [
                "VMV-3",
                "Lost (burned) 1931",
                "Dromonby"
            ],
            [
                "VMV-4 Former: Sterling",
                "Retired 1939",
                "Trader"
            ],
            [
                "VMV-5",
                "Decommissioned 1959",
                "Ariadne"
            ],
            [
                "VMV-6",
                "Decommissioned 1960",
                "Appam"
            ],
            [
                "VMV-7",
                "Lost (burned and sunk) 1933",
                "Clan McTavish"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (T1:`ship_mission.mission`)-[]-(T2:`ship_mission.ship`)\nWHERE T1.Launched_Year > 1928\nRETURN T2.Name",
        "question": "Show names of ships involved in a mission launched after 1928.",
        "answers": [
            [
                "Corbridge"
            ],
            [
                "Farringford"
            ],
            [
                "Dromonby"
            ],
            [
                "Ariadne"
            ],
            [
                "Appam"
            ],
            [
                "Clan McTavish"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (T1:`ship_mission.mission`)-[]-(T2:`ship_mission.ship`)\nWHERE T1.Launched_Year > 1928\nRETURN T2.Name",
        "question": "What are the names of ships that were involved in a mission launched after 1928?",
        "answers": [
            [
                "Corbridge"
            ],
            [
                "Farringford"
            ],
            [
                "Dromonby"
            ],
            [
                "Ariadne"
            ],
            [
                "Appam"
            ],
            [
                "Clan McTavish"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (T1:`ship_mission.mission`)-[]-(T2:`ship_mission.ship`)\nWHERE T2.Nationality = 'United States'\nRETURN DISTINCT T1.Fate",
        "question": "Show the distinct fate of missions that involve ships with nationality \"United States\"",
        "answers": [
            [
                "Decommissioned 1950"
            ],
            [
                "Decommissioned 1959"
            ],
            [
                "Lost (burned and sunk) 1933"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (T1:`ship_mission.mission`)-[]-(T2:`ship_mission.ship`)\nWHERE T2.Nationality = 'United States'\nRETURN DISTINCT T1.Fate",
        "question": "What are the different fates of the mission that involved ships from the United States?",
        "answers": [
            [
                "Decommissioned 1950"
            ],
            [
                "Decommissioned 1959"
            ],
            [
                "Lost (burned and sunk) 1933"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nWHERE NOT (ship)-[]-(:`ship_mission.mission`)    \nRETURN ship.Name",
        "question": "List the name of ships that are not involved in any mission",
        "answers": [
            [
                "Author"
            ]
        ]
    },
    {
        "db_id": "ship_mission",
        "query": "MATCH (ship:`ship_mission.ship`)\nWHERE NOT (ship)-[]-(:`ship_mission.mission`)    \nRETURN ship.Name",
        "question": "What are the names of the ships that are not involved in any missions?",
        "answers": [
            [
                "Author"
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nRETURN count(*)",
        "question": "Find the number of students in total.",
        "answers": [
            [
                60
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Classroom = 111\nRETURN list.LastName",
        "question": "Find the last names of students studying in room 111.",
        "answers": [
            [
                "DANESE"
            ],
            [
                "GOODNOE"
            ],
            [
                "LEAPER"
            ],
            [
                "FULVIO"
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Classroom = 108\nRETURN list.FirstName",
        "question": "Find the first names of students studying in room 108.",
        "answers": [
            [
                " LYNNETTE"
            ],
            [
                " BRITT"
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Classroom = 107\nRETURN DISTINCT list.FirstName",
        "question": "List the first names of all the students in room 107.",
        "answers": [
            [
                " SHERWOOD"
            ],
            [
                " ROBBY"
            ],
            [
                " CRYSTA"
            ],
            [
                " VERTIE"
            ],
            [
                " CHRISSY"
            ],
            [
                " JORDON"
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nRETURN DISTINCT list.Classroom,list.Grade",
        "question": "For each classroom report the grade that is taught in it. Report just the classroom number and the grade number.",
        "answers": [
            [
                101,
                2
            ],
            [
                112,
                6
            ],
            [
                107,
                3
            ],
            [
                105,
                0
            ],
            [
                111,
                4
            ],
            [
                102,
                1
            ],
            [
                104,
                0
            ],
            [
                109,
                5
            ],
            [
                110,
                4
            ],
            [
                103,
                1
            ],
            [
                106,
                0
            ],
            [
                108,
                4
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Classroom = 103\nRETURN DISTINCT list.Grade",
        "question": "Find the grade taught in classroom 103.",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Classroom = 105\nRETURN DISTINCT list.Grade",
        "question": "Find the grade studying in room 105.",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Classroom = 105\nRETURN DISTINCT list.Grade",
        "question": "Which grade is studying in room 105?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Grade = 4\nRETURN DISTINCT list.Classroom",
        "question": "Find the classrooms in which grade 4 is studying.",
        "answers": [
            [
                111
            ],
            [
                110
            ],
            [
                108
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Grade = 5\nRETURN DISTINCT list.Classroom",
        "question": "Show me the classrooms grade 5 is using.",
        "answers": [
            [
                109
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (teachers:`student_1.teachers`)\nWHERE teachers.Classroom = 110\nRETURN teachers.FirstName",
        "question": "Find the first names of all the teachers that teach in classroom 110.",
        "answers": [
            [
                " GEORGETTA"
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (teachers:`student_1.teachers`)\nWHERE teachers.Classroom = 110\nRETURN teachers.FirstName",
        "question": "Which teachers teach in classroom 110? Give me their first names.",
        "answers": [
            [
                " GEORGETTA"
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (teachers:`student_1.teachers`)\nWHERE teachers.Classroom = 109\nRETURN teachers.LastName",
        "question": "Find the last names of teachers teaching in classroom 109.",
        "answers": [
            [
                "KAWA"
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (teachers:`student_1.teachers`)\nWHERE teachers.Classroom = 109\nRETURN teachers.LastName",
        "question": "Which teachers teach in classroom 109? Give me their last names.",
        "answers": [
            [
                "KAWA"
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (teachers:`student_1.teachers`)\nRETURN DISTINCT teachers.FirstName,teachers.LastName",
        "question": "Report the first name and last name of all the teachers.",
        "answers": [
            [
                " MIN",
                "MACROSTIE"
            ],
            [
                " JEROME",
                "COVIN"
            ],
            [
                " OTHA",
                "MOYER"
            ],
            [
                " JERLENE",
                "NIBLER"
            ],
            [
                " KIRK",
                "MARROTTE"
            ],
            [
                " LEIA",
                "TARRING"
            ],
            [
                " CHARMAINE",
                "URSERY"
            ],
            [
                " LORIA",
                "ONDERSMA"
            ],
            [
                " GORDON",
                "KAWA"
            ],
            [
                " GEORGETTA",
                "SUMPTION"
            ],
            [
                " BILLIE",
                "KRIENER"
            ],
            [
                " ALFREDA",
                "SUGAI"
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T2.FirstName = 'OTHA' AND T2.LastName = 'MOYER'\nRETURN T1.FirstName,T1.LastName",
        "question": "Find all students taught by OTHA MOYER. Output the first and last names of the students.",
        "answers": []
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T2.FirstName = 'OTHA' AND T2.LastName = 'MOYER'\nRETURN T1.FirstName,T1.LastName",
        "question": "Which students study under the teacher named OTHA MOYER? Give me the first and last names of the students.",
        "answers": []
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T2.FirstName = 'MARROTTE' AND T2.LastName = 'KIRK'\nRETURN T1.FirstName,T1.LastName",
        "question": "Find all students taught by MARROTTE KIRK. Output first and last names of students.",
        "answers": []
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T2.FirstName = 'MARROTTE' AND T2.LastName = 'KIRK'\nRETURN T1.FirstName,T1.LastName",
        "question": "Which are the first and last names of the students taught by MARROTTE KIRK?",
        "answers": []
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T1.FirstName = 'EVELINA' AND T1.LastName = 'BROMLEY'\nRETURN T2.FirstName,T2.LastName",
        "question": "Find the first and last name of all the teachers that teach EVELINA BROMLEY.",
        "answers": []
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T1.FirstName = 'EVELINA' AND T1.LastName = 'BROMLEY'\nRETURN T2.FirstName,T2.LastName",
        "question": "Which teachers teach the student named EVELINA BROMLEY? Give me the first and last name  of the teachers.",
        "answers": []
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T1.FirstName = 'GELL' AND T1.LastName = 'TAMI'\nRETURN T2.LastName",
        "question": "Find the last names of all the teachers that teach GELL TAMI.",
        "answers": []
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T1.FirstName = 'GELL' AND T1.LastName = 'TAMI'\nRETURN T2.LastName",
        "question": "What are the last names of the teachers who teach the student called GELL TAMI?",
        "answers": []
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T2.FirstName = 'LORIA' AND T2.LastName = 'ONDERSMA'\nRETURN count(*)",
        "question": "How many students does LORIA ONDERSMA teaches?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T2.FirstName = 'LORIA' AND T2.LastName = 'ONDERSMA'\nRETURN count(*)",
        "question": "Count the number of students the teacher LORIA ONDERSMA teaches.",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T2.FirstName = 'KAWA' AND T2.LastName = 'GORDON'\nRETURN count(*)",
        "question": "How many students does KAWA GORDON teaches?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T2.FirstName = 'KAWA' AND T2.LastName = 'GORDON'\nRETURN count(*)",
        "question": "Find the number of students taught by the teacher KAWA GORDON.",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T2.FirstName = 'TARRING' AND T2.LastName = 'LEIA'\nRETURN count(*)",
        "question": "Find the number of students taught by TARRING LEIA.",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T2.FirstName = 'TARRING' AND T2.LastName = 'LEIA'\nRETURN count(*)",
        "question": "How many students are taught by teacher TARRING LEIA?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T1.FirstName = 'CHRISSY' AND T1.LastName = 'NABOZNY'\nRETURN count(*)",
        "question": "How many teachers does the student named CHRISSY NABOZNY have?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T1.FirstName = 'CHRISSY' AND T1.LastName = 'NABOZNY'\nRETURN count(*)",
        "question": "Find the number of teachers who teach the student called CHRISSY NABOZNY.",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T1.FirstName = 'MADLOCK' AND T1.LastName = 'RAY'\nRETURN count(*)",
        "question": "How many teachers does the student named MADLOCK RAY have?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (T1:`student_1.list`)-[]-(T2:`student_1.teachers`)\nWHERE T1.FirstName = 'MADLOCK' AND T1.LastName = 'RAY'\nRETURN count(*)",
        "question": "Find the number of teachers who teach the student called MADLOCK RAY.",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nRETURN list.Grade,count(DISTINCT list.Classroom),count(*)",
        "question": "For each grade, report the grade, the number of classrooms in which it is taught and the total number of students in the grade.",
        "answers": [
            [
                2,
                1,
                3
            ],
            [
                6,
                1,
                3
            ],
            [
                3,
                1,
                6
            ],
            [
                0,
                3,
                16
            ],
            [
                4,
                3,
                12
            ],
            [
                1,
                2,
                12
            ],
            [
                5,
                1,
                8
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nRETURN list.Grade,count(DISTINCT list.Classroom),count(*)",
        "question": "For each grade, return the grade number, the number of classrooms used for the grade, and the total number of students enrolled in the grade.",
        "answers": [
            [
                2,
                1,
                3
            ],
            [
                6,
                1,
                3
            ],
            [
                3,
                1,
                6
            ],
            [
                0,
                3,
                16
            ],
            [
                4,
                3,
                12
            ],
            [
                1,
                2,
                12
            ],
            [
                5,
                1,
                8
            ]
        ]
    }
]