[
    {
        "db_id": "workshop_paper",
        "query": "MATCH (workshop:`workshop_paper.workshop`)\nRETURN workshop.Date,workshop.Venue\nORDER BY workshop.Venue",
        "question": "Show the date and venue of each workshop in ascending alphabetical order of the venue.",
        "answers": [
            [
                "July 5, 2011",
                "Istanbul Turkey"
            ],
            [
                "August 18, 2007",
                "London UK"
            ],
            [
                "August 21, 2007",
                "London UK"
            ],
            [
                "August 25, 2007",
                "New Jersey USA"
            ],
            [
                "October 8, 2007",
                "New York USA"
            ],
            [
                "January 14, 2008",
                "New York USA"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (workshop:`workshop_paper.workshop`)\nRETURN workshop.Date,workshop.Venue\nORDER BY workshop.Venue",
        "question": "Sort the each workshop in alphabetical order of the venue. Return the date and venue of each workshop.",
        "answers": [
            [
                "July 5, 2011",
                "Istanbul Turkey"
            ],
            [
                "August 18, 2007",
                "London UK"
            ],
            [
                "August 21, 2007",
                "London UK"
            ],
            [
                "August 25, 2007",
                "New Jersey USA"
            ],
            [
                "October 8, 2007",
                "New York USA"
            ],
            [
                "January 14, 2008",
                "New York USA"
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (investors:`tracking_share_transactions.Investors`)\nRETURN count(*)",
        "question": "Find the number of investors in total.",
        "answers": [
            [
                20
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (investors:`tracking_share_transactions.Investors`)\nRETURN investors.Investor_details",
        "question": "Show all investor details.",
        "answers": [
            [
                "z"
            ],
            [
                "z"
            ],
            [
                "d"
            ],
            [
                "d"
            ],
            [
                "b"
            ],
            [
                "k"
            ],
            [
                "l"
            ],
            [
                "t"
            ],
            [
                "y"
            ],
            [
                "r"
            ],
            [
                "q"
            ],
            [
                "c"
            ],
            [
                "o"
            ],
            [
                "w"
            ],
            [
                "i"
            ],
            [
                "y"
            ],
            [
                "k"
            ],
            [
                "w"
            ],
            [
                "l"
            ],
            [
                "j"
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (lots:`tracking_share_transactions.Lots`)\nRETURN DISTINCT lots.lot_details",
        "question": "Show all distinct lot details.",
        "answers": [
            [
                "r"
            ],
            [
                "z"
            ],
            [
                "s"
            ],
            [
                "q"
            ],
            [
                "d"
            ],
            [
                "m"
            ],
            [
                "h"
            ],
            [
                "x"
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nRETURN max(transactions.amount_of_transaction)",
        "question": "Show the maximum amount of transaction.",
        "answers": [
            [
                207484122.2796
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nRETURN transactions.date_of_transaction,transactions.share_count",
        "question": "Show all date and share count of transactions.",
        "answers": [
            [
                "1988-09-16 19:02:51",
                "8718572"
            ],
            [
                "1982-06-06 17:19:00",
                "9"
            ],
            [
                "1979-04-27 06:03:59",
                "8580"
            ],
            [
                "2001-11-28 15:06:25",
                "8040"
            ],
            [
                "1977-08-17 13:13:30",
                "930"
            ],
            [
                "1985-10-08 13:13:39",
                "2751"
            ],
            [
                "1990-12-02 09:03:38",
                "1522"
            ],
            [
                "2004-01-18 20:37:50",
                "96178"
            ],
            [
                "1977-08-13 02:18:47",
                ""
            ],
            [
                "1981-01-28 08:07:03",
                "1654756"
            ],
            [
                "2000-04-03 20:55:43",
                "674529892"
            ],
            [
                "1983-11-01 17:57:27",
                "587"
            ],
            [
                "2002-04-07 20:28:37",
                ""
            ],
            [
                "2002-09-13 03:04:56",
                "630021"
            ],
            [
                "1997-12-30 05:05:40",
                "93191"
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nWHERE transactions.transaction_type_code = 'PUR'\nRETURN transactions.transaction_id",
        "question": "Show all transaction ids with transaction code 'PUR'.",
        "answers": [
            [
                2
            ],
            [
                4
            ],
            [
                5
            ],
            [
                6
            ],
            [
                7
            ],
            [
                9
            ],
            [
                14
            ],
            [
                15
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nWHERE transactions.amount_of_transaction < 10000\nRETURN max(transactions.share_count)",
        "question": "Show the maximum share count of transactions where the amount is smaller than 10000",
        "answers": [
            [
                "93191"
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nRETURN count(DISTINCT transactions.transaction_type_code)",
        "question": "How many distinct transaction types are used in the transactions?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (lots:`tracking_share_transactions.Lots`)\nRETURN lots.lot_details,lots.investor_id",
        "question": "Return the lot details and investor ids.",
        "answers": [
            [
                "r",
                13
            ],
            [
                "z",
                16
            ],
            [
                "s",
                10
            ],
            [
                "s",
                19
            ],
            [
                "q",
                6
            ],
            [
                "d",
                20
            ],
            [
                "m",
                7
            ],
            [
                "h",
                7
            ],
            [
                "z",
                20
            ],
            [
                "x",
                9
            ],
            [
                "d",
                1
            ],
            [
                "m",
                19
            ],
            [
                "z",
                7
            ],
            [
                "d",
                6
            ],
            [
                "h",
                1
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (T1:`tracking_share_transactions.Purchases`)-[]-(T2:`tracking_share_transactions.Transactions`)\nWHERE T2.amount_of_transaction > 10000\nRETURN T1.purchase_details",
        "question": "What are the purchase details of transactions with amount bigger than 10000?",
        "answers": [
            [
                "c"
            ],
            [
                "i"
            ],
            [
                "a"
            ],
            [
                "a"
            ],
            [
                "r"
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (T1:`tracking_share_transactions.Sales`)-[]-(T2:`tracking_share_transactions.Transactions`)\nWHERE T2.amount_of_transaction < 3000\nRETURN T1.sales_details,T2.date_of_transaction",
        "question": "What are the sale details and dates of transactions with amount smaller than 3000?",
        "answers": [
            [
                "o",
                "1982-06-06 17:19:00"
            ],
            [
                "f",
                "2001-11-28 15:06:25"
            ],
            [
                "y",
                "1977-08-17 13:13:30"
            ],
            [
                "p",
                "1990-12-02 09:03:38"
            ],
            [
                "s",
                "1981-01-28 08:07:03"
            ],
            [
                "s",
                "2000-04-03 20:55:43"
            ],
            [
                "t",
                "1983-11-01 17:57:27"
            ],
            [
                "p",
                "2002-04-07 20:28:37"
            ],
            [
                "n",
                "2002-09-13 03:04:56"
            ],
            [
                "e",
                "1997-12-30 05:05:40"
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nRETURN transactions.transaction_type_code,max(transactions.share_count),min(transactions.share_count)",
        "question": "Show the maximum and minimum share count of different transaction types.",
        "answers": [
            [
                "SALE",
                "96178",
                ""
            ],
            [
                "PUR",
                "93191",
                ""
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nRETURN transactions.investor_id,avg(transactions.amount_of_transaction)",
        "question": "Show the average amount of transactions for different investors.",
        "answers": [
            [
                6,
                302507.6996
            ],
            [
                18,
                14.1285
            ],
            [
                2,
                24403.6612
            ],
            [
                14,
                4.5263
            ],
            [
                8,
                0.0
            ],
            [
                19,
                103742065.5898
            ],
            [
                7,
                822.803
            ],
            [
                17,
                78035671.4424
            ],
            [
                20,
                82057.207
            ],
            [
                3,
                61.06666666666666
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (transactions:`tracking_share_transactions.Transactions`)\nRETURN transactions.investor_id,count(*)",
        "question": "Show the number of transactions for different investors.",
        "answers": [
            [
                6,
                1
            ],
            [
                18,
                2
            ],
            [
                2,
                2
            ],
            [
                14,
                1
            ],
            [
                8,
                1
            ],
            [
                19,
                2
            ],
            [
                7,
                1
            ],
            [
                17,
                1
            ],
            [
                20,
                1
            ],
            [
                3,
                3
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (T1:`tracking_share_transactions.Ref_Transaction_Types`)-[]-(T2:`tracking_share_transactions.Transactions`)\nWITH count(T1.transaction_type_code) AS cnt, T1\nRETURN T1.transaction_type_description\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Show the description of the transaction type that occurs most frequently.",
        "answers": [
            [
                "Purchase"
            ]
        ]
    },
    {
        "db_id": "tracking_share_transactions",
        "query": "MATCH (T1:`tracking_share_transactions.Investors`)-[]-(T2:`tracking_share_transactions.Transactions`)\nWITH T2.investor_id AS investor_id, count(*) AS count\nWHERE count  >= 2\nRETURN investor_id",
        "question": "Show the ids of the investors who have at least two transactions.",
        "answers": [
            [
                2
            ],
            [
                3
            ],
            [
                18
            ],
            [
                19
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (hotels:`cre_Theme_park.Hotels`)\nRETURN count(*)",
        "question": "How many available hotels are there in total?",
        "answers": [
            [
                20
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (hotels:`cre_Theme_park.Hotels`)\nRETURN count(*)",
        "question": "Find the total number of available hotels.",
        "answers": [
            [
                20
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (hotels:`cre_Theme_park.Hotels`)\nRETURN hotels.price_range",
        "question": "What are the price ranges of hotels?",
        "answers": [
            [
                2914989.571
            ],
            [
                ""
            ],
            [
                17012.682586009
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                48525.4530675
            ],
            [
                766712918.96763
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                250548014.90329
            ],
            [
                ""
            ],
            [
                38014975.47848
            ],
            [
                9393.86291219
            ],
            [
                5526556.6412
            ],
            [
                245.067720121
            ],
            [
                43.729525
            ],
            [
                289775.7331715
            ],
            [
                2374.7971074
            ],
            [
                1381255.81865
            ],
            [
                5390.432113
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (hotels:`cre_Theme_park.Hotels`)\nRETURN hotels.price_range",
        "question": "Tell me the price ranges for all the hotels.",
        "answers": [
            [
                2914989.571
            ],
            [
                ""
            ],
            [
                17012.682586009
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                48525.4530675
            ],
            [
                766712918.96763
            ],
            [
                ""
            ],
            [
                ""
            ],
            [
                250548014.90329
            ],
            [
                ""
            ],
            [
                38014975.47848
            ],
            [
                9393.86291219
            ],
            [
                5526556.6412
            ],
            [
                245.067720121
            ],
            [
                43.729525
            ],
            [
                289775.7331715
            ],
            [
                2374.7971074
            ],
            [
                1381255.81865
            ],
            [
                5390.432113
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (locations:`cre_Theme_park.Locations`)\nRETURN DISTINCT locations.Location_Name",
        "question": "Show all distinct location names.",
        "answers": [
            [
                "Astro Orbiter"
            ],
            [
                "African Animals"
            ],
            [
                "American Adventure"
            ],
            [
                "The Barnstormer"
            ],
            [
                "African Adventure"
            ],
            [
                "UK Gallery"
            ],
            [
                "The Boneyard"
            ],
            [
                "Shark World"
            ],
            [
                "Space Spin"
            ],
            [
                "Butterflies"
            ],
            [
                "Soak Station"
            ],
            [
                "Castle"
            ],
            [
                "Coral Reefs"
            ],
            [
                "Film Festival"
            ],
            [
                "Fossil Fun Games"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (locations:`cre_Theme_park.Locations`)\nRETURN DISTINCT locations.Location_Name",
        "question": "What are the distinct location names?",
        "answers": [
            [
                "Astro Orbiter"
            ],
            [
                "African Animals"
            ],
            [
                "American Adventure"
            ],
            [
                "The Barnstormer"
            ],
            [
                "African Adventure"
            ],
            [
                "UK Gallery"
            ],
            [
                "The Boneyard"
            ],
            [
                "Shark World"
            ],
            [
                "Space Spin"
            ],
            [
                "Butterflies"
            ],
            [
                "Soak Station"
            ],
            [
                "Castle"
            ],
            [
                "Coral Reefs"
            ],
            [
                "Film Festival"
            ],
            [
                "Fossil Fun Games"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (staff:`cre_Theme_park.Staff`)\nRETURN staff.Name,staff.Other_Details",
        "question": "Show the names and details of all the staff members.",
        "answers": [
            [
                "Whitney",
                null
            ],
            [
                "Kaela",
                null
            ],
            [
                "Eunice",
                null
            ],
            [
                "Kiarra",
                null
            ],
            [
                "Phoebe",
                null
            ],
            [
                "Vickie",
                null
            ],
            [
                "Jannie",
                null
            ],
            [
                "Lenore",
                null
            ],
            [
                "Asia",
                null
            ],
            [
                "Janet",
                null
            ],
            [
                "Elouise",
                null
            ],
            [
                "Gina",
                null
            ],
            [
                "Beth",
                null
            ],
            [
                "Ruthie",
                null
            ],
            [
                "Aurore",
                null
            ],
            [
                "Cortney",
                null
            ],
            [
                "Astrid",
                null
            ],
            [
                "Shemar",
                null
            ],
            [
                "Trinity",
                null
            ],
            [
                "Carmella",
                null
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (staff:`cre_Theme_park.Staff`)\nRETURN staff.Name,staff.Other_Details",
        "question": "What is the name and detail of each staff member?",
        "answers": [
            [
                "Whitney",
                null
            ],
            [
                "Kaela",
                null
            ],
            [
                "Eunice",
                null
            ],
            [
                "Kiarra",
                null
            ],
            [
                "Phoebe",
                null
            ],
            [
                "Vickie",
                null
            ],
            [
                "Jannie",
                null
            ],
            [
                "Lenore",
                null
            ],
            [
                "Asia",
                null
            ],
            [
                "Janet",
                null
            ],
            [
                "Elouise",
                null
            ],
            [
                "Gina",
                null
            ],
            [
                "Beth",
                null
            ],
            [
                "Ruthie",
                null
            ],
            [
                "Aurore",
                null
            ],
            [
                "Cortney",
                null
            ],
            [
                "Astrid",
                null
            ],
            [
                "Shemar",
                null
            ],
            [
                "Trinity",
                null
            ],
            [
                "Carmella",
                null
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (visitors:`cre_Theme_park.Visitors`)\nRETURN visitors.Tourist_Details",
        "question": "Show details of all visitors.",
        "answers": [
            [
                "Toney"
            ],
            [
                "Graciela"
            ],
            [
                "Vincent"
            ],
            [
                "Vivian"
            ],
            [
                "Nettie"
            ],
            [
                "Laurence"
            ],
            [
                "Newell"
            ],
            [
                "Marisol"
            ],
            [
                "Jarrell"
            ],
            [
                "Edna"
            ],
            [
                "Maud"
            ],
            [
                "Alison"
            ],
            [
                "Rosalind"
            ],
            [
                "Tevin"
            ],
            [
                "Aleen"
            ],
            [
                "Marcelle"
            ],
            [
                "Lizzie"
            ],
            [
                "Wayne"
            ],
            [
                "Teresa"
            ],
            [
                "Elnora"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (visitors:`cre_Theme_park.Visitors`)\nRETURN visitors.Tourist_Details",
        "question": "What is the detail of each visitor?",
        "answers": [
            [
                "Toney"
            ],
            [
                "Graciela"
            ],
            [
                "Vincent"
            ],
            [
                "Vivian"
            ],
            [
                "Nettie"
            ],
            [
                "Laurence"
            ],
            [
                "Newell"
            ],
            [
                "Marisol"
            ],
            [
                "Jarrell"
            ],
            [
                "Edna"
            ],
            [
                "Maud"
            ],
            [
                "Alison"
            ],
            [
                "Rosalind"
            ],
            [
                "Tevin"
            ],
            [
                "Aleen"
            ],
            [
                "Marcelle"
            ],
            [
                "Lizzie"
            ],
            [
                "Wayne"
            ],
            [
                "Teresa"
            ],
            [
                "Elnora"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (locations:`cre_Theme_park.Locations`)\nWHERE locations.Location_Name = \"UK Gallery\"\nRETURN locations.Address",
        "question": "What is the address of the location \"UK Gallery\"?",
        "answers": [
            [
                "4411 Sabrina Radial Suite 582"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (locations:`cre_Theme_park.Locations`)\nWHERE locations.Location_Name = \"UK Gallery\"\nRETURN locations.Address",
        "question": "Find the address of the location named \"UK Gallery\".",
        "answers": [
            [
                "4411 Sabrina Radial Suite 582"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (locations:`cre_Theme_park.Locations`)\nWHERE locations.Location_Name = \"UK Gallery\"\nRETURN locations.Other_Details",
        "question": "What is the detail of the location UK Gallery?",
        "answers": [
            [
                null
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (locations:`cre_Theme_park.Locations`)\nWHERE locations.Location_Name = \"UK Gallery\"\nRETURN locations.Other_Details",
        "question": "Return the detail of the location named \"UK Gallery\".",
        "answers": [
            [
                null
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (photos:`cre_Theme_park.Photos`)\nRETURN count(DISTINCT photos.Name)",
        "question": "How many distinct names are associated with all the photos?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (photos:`cre_Theme_park.Photos`)\nRETURN count(DISTINCT photos.Name)",
        "question": "Count the number of distinct names associated with the photos.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (visits:`cre_Theme_park.Visits`)\nRETURN DISTINCT visits.Visit_Date",
        "question": "What are the distinct visit dates?",
        "answers": [
            [
                "2004-08-21 03:06:14"
            ],
            [
                "2013-08-06 05:35:51"
            ],
            [
                "2013-10-27 09:56:08"
            ],
            [
                "1990-08-15 14:24:10"
            ],
            [
                "1980-11-26 02:08:00"
            ],
            [
                "2017-03-19 08:48:19"
            ],
            [
                "2008-11-09 01:28:01"
            ],
            [
                "1989-08-24 20:26:37"
            ],
            [
                "1993-02-01 15:27:20"
            ],
            [
                "2007-09-17 10:12:45"
            ],
            [
                "1998-05-12 00:50:20"
            ],
            [
                "2010-10-04 01:34:12"
            ],
            [
                "2018-01-09 20:39:52"
            ],
            [
                "1971-12-16 06:41:26"
            ],
            [
                "1998-12-10 02:46:43"
            ],
            [
                "1996-01-08 13:23:41"
            ],
            [
                "2007-09-03 04:30:01"
            ],
            [
                "1974-12-31 23:18:24"
            ],
            [
                "2001-11-13 10:08:28"
            ],
            [
                "1990-11-12 00:54:50"
            ]
        ]
    },
    {
        "db_id": "cre_Theme_park",
        "query": "MATCH (visits:`cre_Theme_park.Visits`)\nRETURN DISTINCT visits.Visit_Date",
        "question": "Find all the distinct visit dates.",
        "answers": [
            [
                "2004-08-21 03:06:14"
            ],
            [
                "2013-08-06 05:35:51"
            ],
            [
                "2013-10-27 09:56:08"
            ],
            [
                "1990-08-15 14:24:10"
            ],
            [
                "1980-11-26 02:08:00"
            ],
            [
                "2017-03-19 08:48:19"
            ],
            [
                "2008-11-09 01:28:01"
            ],
            [
                "1989-08-24 20:26:37"
            ],
            [
                "1993-02-01 15:27:20"
            ],
            [
                "2007-09-17 10:12:45"
            ],
            [
                "1998-05-12 00:50:20"
            ],
            [
                "2010-10-04 01:34:12"
            ],
            [
                "2018-01-09 20:39:52"
            ],
            [
                "1971-12-16 06:41:26"
            ],
            [
                "1998-12-10 02:46:43"
            ],
            [
                "1996-01-08 13:23:41"
            ],
            [
                "2007-09-03 04:30:01"
            ],
            [
                "1974-12-31 23:18:24"
            ],
            [
                "2001-11-13 10:08:28"
            ],
            [
                "1990-11-12 00:54:50"
            ]
        ]
    }
]