[
    {
        "question": "Find the names of songs whose genre is modern or language is English.",
        "query": "MATCH (song:`music_1.song`)\nWHERE song.genre_is = 'modern' OR song.languages = 'english'\nRETURN song.song_name",
        "db_id": "music_1",
        "answers": [
            [
                "My love"
            ],
            [
                "Just beat it"
            ],
            [
                "Aj ei akash"
            ]
        ]
    },
    {
        "question": "What are the names of the songs that are modern or sung in English?",
        "query": "MATCH (song:`music_1.song`)\nWHERE song.genre_is = 'modern' OR song.languages = 'english'\nRETURN song.song_name",
        "db_id": "music_1",
        "answers": [
            [
                "My love"
            ],
            [
                "Just beat it"
            ],
            [
                "Aj ei akash"
            ]
        ]
    },
    {
        "question": "What are the average rating and resolution of songs that are in Bangla?",
        "query": "MATCH (song:`music_1.song`)\nWHERE song.languages = 'bangla'\nRETURN avg(song.rating),avg(song.resolution)",
        "db_id": "music_1",
        "answers": [
            [
                7.5,
                558.0
            ]
        ]
    },
    {
        "question": "What is the average rating and resolution of all bangla songs?",
        "query": "MATCH (song:`music_1.song`)\nWHERE song.languages = 'bangla'\nRETURN avg(song.rating),avg(song.resolution)",
        "db_id": "music_1",
        "answers": [
            [
                7.5,
                558.0
            ]
        ]
    },
    {
        "question": "Find the names and number of works of all artists who have at least one English songs.",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWHERE T2.languages = 'english'\nWITH count(*) AS count, T1.artist_name AS artist_name\nWHERE count  >= 1\nRETURN artist_name,count",
        "db_id": "music_1",
        "answers": [
            [
                "Enrique",
                1
            ],
            [
                "Michel",
                1
            ]
        ]
    },
    {
        "question": "What are the names and number of works for all artists who have sung at least one song in English?",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWHERE T2.languages = 'english'\nWITH count(*) AS count, T1.artist_name AS artist_name\nWHERE count  >= 1\nRETURN artist_name,count",
        "db_id": "music_1",
        "answers": [
            [
                "Enrique",
                1
            ],
            [
                "Michel",
                1
            ]
        ]
    },
    {
        "question": "Find the name and country of origin for all artists who have release at least one song of resolution above 900.",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWHERE T2.resolution > 900\nWITH count(*) AS count, T1.artist_name AS artist_name, T1.country AS country\nWHERE count  >= 1\nRETURN artist_name,country",
        "db_id": "music_1",
        "answers": [
            [
                "Shrikanta",
                "India"
            ],
            [
                "Enrique",
                "USA"
            ]
        ]
    },
    {
        "question": "Find the country of origin for the artist who made the least number of songs?",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWITH count(T2.artist_name) AS count, T1.country AS country\nRETURN country\nORDER BY count\nLIMIT 1",
        "db_id": "music_1",
        "answers": [
            [
                "USA"
            ]
        ]
    },
    {
        "question": "What country is the artist who made the fewest songs from?",
        "query": "MATCH (T1:`music_1.artist`)-[]-(T2:`music_1.song`)\nWITH count(T2.artist_name) AS count, T1.country AS country\nRETURN country\nORDER BY count\nLIMIT 1",
        "db_id": "music_1",
        "answers": [
            [
                "USA"
            ]
        ]
    },
    {
        "question": "List the id, genre and artist name of English songs ordered by rating.",
        "query": "MATCH (song:`music_1.song`)\nWHERE song.languages = 'english'\nRETURN song.f_id,song.genre_is,song.artist_name\nORDER BY song.rating",
        "db_id": "music_1",
        "answers": [
            [
                4,
                "blues",
                "Enrique"
            ],
            [
                5,
                "pop",
                "Michel"
            ]
        ]
    },
    {
        "question": "What is the id, genre, and name of the artist for every English song ordered by ascending rating?",
        "query": "MATCH (song:`music_1.song`)\nWHERE song.languages = 'english'\nRETURN song.f_id,song.genre_is,song.artist_name\nORDER BY song.rating",
        "db_id": "music_1",
        "answers": [
            [
                4,
                "blues",
                "Enrique"
            ],
            [
                5,
                "pop",
                "Michel"
            ]
        ]
    },
    {
        "question": "List the duration, file size and format of songs whose genre is pop, ordered by title?",
        "query": "MATCH (T1:`music_1.files`)-[]-(T2:`music_1.song`)\nWHERE T2.genre_is = 'pop'\nRETURN T1.duration,T1.file_size,T1.formats\nORDER BY T2.song_name",
        "db_id": "music_1",
        "answers": [
            [
                "4:34",
                "5.10 MB",
                "mp3"
            ]
        ]
    },
    {
        "question": "What is the duration, file size, and song format for every pop song, ordered by title alphabetically?",
        "query": "MATCH (T1:`music_1.files`)-[]-(T2:`music_1.song`)\nWHERE T2.genre_is = 'pop'\nRETURN T1.duration,T1.file_size,T1.formats\nORDER BY T2.song_name",
        "db_id": "music_1",
        "answers": [
            [
                "4:34",
                "5.10 MB",
                "mp3"
            ]
        ]
    },
    {
        "question": "Find the brand and name for each camera lens, and sort in descending order of maximum aperture.",
        "query": "MATCH (camera_lens:`mountain_photos.camera_lens`)\nRETURN camera_lens.brand,camera_lens.name\nORDER BY camera_lens.max_aperture DESC",
        "db_id": "mountain_photos",
        "answers": [
            [
                "Olympus",
                "Olympus 15mm f/8.0 Body Cap"
            ],
            [
                "Panasonic",
                "Panasonic Lumix G 150mm f /2.8"
            ],
            [
                "Sigma",
                "Sigma 19mm f2.8 DN"
            ],
            [
                "Sigma",
                "Sigma 19mm f2.8 EX DN"
            ],
            [
                "Sigma",
                "Sigma 30mm f2.8 DN"
            ],
            [
                "Schneider Kreuznach",
                "Schneider Kreuznach Super Angulon 14mm f /2.0"
            ],
            [
                "Olympus",
                "Olympus M.Zuiko Digital ED 45mm f/1.8"
            ],
            [
                "Olympus",
                "Olympus M.Zuiko Digital ED 75mm f/1.8"
            ],
            [
                "Panasonic",
                "Panasonic Leica DG Summilux 25mm f /1.4 Asph."
            ],
            [
                "Schneider Kreuznach",
                "Schneider Kreuznach Xenon 30mm f /1.4"
            ],
            [
                "Panasonic",
                "Panasonic Leica DG Nocticron 42.5mm f /1.2"
            ]
        ]
    },
    {
        "question": "List the id, color scheme, and name for all the photos.",
        "query": "MATCH (photos:`mountain_photos.photos`)\nRETURN photos.id,photos.color,photos.name",
        "db_id": "mountain_photos",
        "answers": [
            [
                1,
                "RBG",
                "monkey"
            ],
            [
                2,
                "RBG",
                "rabbits"
            ],
            [
                3,
                "Black/White",
                "deers"
            ],
            [
                4,
                "RBG",
                "grass"
            ],
            [
                5,
                "RBG",
                "cloud"
            ],
            [
                6,
                "RBG",
                "sunset"
            ],
            [
                7,
                "RBG",
                "river"
            ],
            [
                8,
                "Black/White",
                "wolfs"
            ],
            [
                9,
                "RBG",
                "the mountain"
            ],
            [
                10,
                "RBG",
                "life"
            ]
        ]
    },
    {
        "question": "Find the names of channels that are not owned by CCTV.",
        "query": "MATCH (channel:`program_share.channel`)\nWHERE channel.Owner <> 'CCTV'\nRETURN channel.Name",
        "db_id": "program_share",
        "answers": [
            [
                "Hunan Satellite TV"
            ],
            [
                "Anhui Satellite TV"
            ],
            [
                "Shandong Satellite TV"
            ]
        ]
    },
    {
        "question": "List all channel names ordered by their rating in percent from big to small.",
        "query": "MATCH (channel:`program_share.channel`)\nRETURN channel.Name\nORDER BY channel.Rating_in_percent DESC",
        "db_id": "program_share",
        "answers": [
            [
                "CCTV-1"
            ],
            [
                "Hunan Satellite TV"
            ],
            [
                "CCTV-8"
            ],
            [
                "CCTV-13"
            ],
            [
                "CCTV-3"
            ],
            [
                "CCTV-6"
            ],
            [
                "CCTV-14"
            ],
            [
                "CCTV-4"
            ],
            [
                "Anhui Satellite TV"
            ],
            [
                "Shandong Satellite TV"
            ]
        ]
    },
    {
        "question": "Show me the owner of the channel with the highest rating.",
        "query": "MATCH (channel:`program_share.channel`)\nRETURN channel.Owner\nORDER BY channel.Rating_in_percent DESC\nLIMIT 1",
        "db_id": "program_share",
        "answers": [
            [
                "CCTV"
            ]
        ]
    },
    {
        "question": "Count the number of programs.",
        "query": "MATCH (program:`program_share.program`)\nRETURN count(*)",
        "db_id": "program_share",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "list all the names of programs, ordering by launch time.",
        "query": "MATCH (program:`program_share.program`)\nRETURN program.Name\nORDER BY program.Launch",
        "db_id": "program_share",
        "answers": [
            [
                "Kaku"
            ],
            [
                "Aniworld"
            ],
            [
                "Toonmax"
            ],
            [
                "Jiajia"
            ],
            [
                "Youman"
            ]
        ]
    },
    {
        "question": "List the name, origin and owner of each program.",
        "query": "MATCH (program:`program_share.program`)\nRETURN program.Name,program.Origin,program.Owner",
        "db_id": "program_share",
        "answers": [
            [
                "Aniworld",
                "Hunan",
                "Hunan Broadcasting System (HBS)"
            ],
            [
                "Kaku",
                "Beijing",
                "Beijing Television (BTV)"
            ],
            [
                "Toonmax",
                "Shanghai",
                "Shanghai Media Group (SMG)"
            ],
            [
                "Jiajia",
                "Guangdong",
                "Southern Media Corporation (SMC)"
            ],
            [
                "Youman",
                "Jiangsu",
                "Jiangsu Broadcasting Corporation (JSBC)"
            ]
        ]
    },
    {
        "question": "find the name of the program that was launched most recently.",
        "query": "MATCH (program:`program_share.program`)\nRETURN program.Name\nORDER BY program.Launch DESC\nLIMIT 1",
        "db_id": "program_share",
        "answers": [
            [
                "Youman"
            ]
        ]
    },
    {
        "question": "List all program origins in the alphabetical order.",
        "query": "MATCH (program:`program_share.program`)\nRETURN program.Origin\nORDER BY program.Origin",
        "db_id": "program_share",
        "answers": [
            [
                "Beijing"
            ],
            [
                "Guangdong"
            ],
            [
                "Hunan"
            ],
            [
                "Jiangsu"
            ],
            [
                "Shanghai"
            ]
        ]
    },
    {
        "question": "Count the number of distinct channel owners.",
        "query": "MATCH (channel:`program_share.channel`)\nRETURN count(DISTINCT channel.Owner)",
        "db_id": "program_share",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "question": "find the names of programs whose origin is not in Beijing.",
        "query": "MATCH (program:`program_share.program`)\nWHERE program.Origin <> 'Beijing'\nRETURN program.Name",
        "db_id": "program_share",
        "answers": [
            [
                "Aniworld"
            ],
            [
                "Toonmax"
            ],
            [
                "Jiajia"
            ],
            [
                "Youman"
            ]
        ]
    },
    {
        "question": "List the names of all the channels owned by either CCTV or HBS",
        "query": "MATCH (channel:`program_share.channel`)\nWHERE channel.Owner = 'CCTV' OR channel.Owner = 'HBS'\nRETURN channel.Name",
        "db_id": "program_share",
        "answers": [
            [
                "CCTV-1"
            ],
            [
                "Hunan Satellite TV"
            ],
            [
                "CCTV-8"
            ],
            [
                "CCTV-13"
            ],
            [
                "CCTV-3"
            ],
            [
                "CCTV-6"
            ],
            [
                "CCTV-14"
            ],
            [
                "CCTV-4"
            ]
        ]
    },
    {
        "question": "Find the total number of courses offered.",
        "query": "MATCH (courses:`e_learning.Courses`)\nRETURN count(*)",
        "db_id": "e_learning",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "What are the descriptions of the courses with name \"database\"?",
        "query": "MATCH (courses:`e_learning.Courses`)\nWHERE courses.course_name = 'database'\nRETURN courses.course_description",
        "db_id": "e_learning",
        "answers": [
            [
                "database"
            ]
        ]
    },
    {
        "question": "What are the addresses of the course authors or tutors with personal name \"Cathrine\"",
        "query": "MATCH (course_authors_and_tutors:`e_learning.Course_Authors_and_Tutors`)\nWHERE course_authors_and_tutors.personal_name = 'Cathrine'\nRETURN course_authors_and_tutors.address_line_1",
        "db_id": "e_learning",
        "answers": [
            [
                "756 Monahan Mews\nSpinkashire, NJ 64230-5098"
            ]
        ]
    },
    {
        "question": "List the addresses of all the course authors or tutors.",
        "query": "MATCH (course_authors_and_tutors:`e_learning.Course_Authors_and_Tutors`)\nRETURN course_authors_and_tutors.address_line_1",
        "db_id": "e_learning",
        "answers": [
            [
                "756 Monahan Mews\nSpinkashire, NJ 64230-5098"
            ],
            [
                "98623 Huels Manor\nJasttown, DE 31611"
            ],
            [
                "99296 Keeling Courts\nNorth Audreanne, IL 28272"
            ],
            [
                "644 Montana Hill Suite 489\nDaijamouth, CA 19587-4254"
            ],
            [
                "5284 Champlin Roads\nCassinport, WY 54636"
            ],
            [
                "92220 Hellen Skyway Apt. 635\nRennerview, MS 81036"
            ],
            [
                "67541 Osborne Creek Suite 532\nBernhardview, WV 30288-1050"
            ],
            [
                "0256 Walter Meadows Suite 523\nNorbertoborough, AZ 49193"
            ],
            [
                "445 Quigley Fall\nPort Antonette, IN 81992-1255"
            ],
            [
                "22575 Effertz Neck Apt. 046\nPort Scotty, NY 67108-9197"
            ],
            [
                "425 White Brooks\nEmmaleefort, IN 97850-2510"
            ],
            [
                "513 Collins Plain Apt. 829\nClementinaville, VT 59908-2793"
            ],
            [
                "139 O'Conner Circles\nVirginieland, KS 23365"
            ],
            [
                "3602 Boehm Forest\nZulaufton, DC 35229-0366"
            ],
            [
                "8928 Kunze Valley Apt. 747\nSouth Jedidiahmouth, DE 28167"
            ]
        ]
    },
    {
        "question": "List all the login names and family names of course author and tutors.",
        "query": "MATCH (course_authors_and_tutors:`e_learning.Course_Authors_and_Tutors`)\nRETURN course_authors_and_tutors.login_name,course_authors_and_tutors.family_name",
        "db_id": "e_learning",
        "answers": [
            [
                "jmckenzie",
                "Grant"
            ],
            [
                "heidenreich.ara",
                "Armstrong"
            ],
            [
                "clementina29",
                "Reichel"
            ],
            [
                "wlehner",
                "Nader"
            ],
            [
                "nyundt",
                "Barrows"
            ],
            [
                "al75",
                "Rohan"
            ],
            [
                "marty.bergnaum",
                "Treutel"
            ],
            [
                "medhurst.alvah",
                "Rowe"
            ],
            [
                "antonetta19",
                "Zboncak"
            ],
            [
                "adam.rippin",
                "Champlin"
            ],
            [
                "dschaefer",
                "Greenholt"
            ],
            [
                "nellie.mosciski",
                "Kreiger"
            ],
            [
                "qking",
                "Effertz"
            ],
            [
                "fiona77",
                "Crist"
            ],
            [
                "ekshlerin",
                "Haley"
            ]
        ]
    },
    {
        "question": "List all the dates of enrollment and completion of students.",
        "query": "MATCH (student_course_enrolment:`e_learning.Student_Course_Enrolment`)\nRETURN student_course_enrolment.date_of_enrolment,student_course_enrolment.date_of_completion",
        "db_id": "e_learning",
        "answers": [
            [
                "2017-10-09 07:09:02",
                "2018-02-26 07:48:52"
            ],
            [
                "2017-11-13 12:49:33",
                "2018-03-04 01:24:56"
            ],
            [
                "2017-10-17 13:50:40",
                "2018-03-22 02:53:01"
            ],
            [
                "2017-09-06 06:27:15",
                "2018-03-07 09:45:48"
            ],
            [
                "2017-08-20 01:07:18",
                "2018-03-06 00:27:09"
            ],
            [
                "2017-09-24 15:17:26",
                "2018-03-01 00:08:30"
            ],
            [
                "2017-09-21 07:05:01",
                "2018-03-04 22:34:37"
            ],
            [
                "2017-12-07 02:21:13",
                "2018-02-27 20:06:06"
            ],
            [
                "2017-08-02 17:21:44",
                "2018-03-07 00:39:37"
            ],
            [
                "2017-10-10 10:05:03",
                "2018-03-19 07:34:05"
            ],
            [
                "2017-08-17 00:16:46",
                "2018-03-16 09:00:44"
            ],
            [
                "2017-11-30 11:40:56",
                "2018-03-02 14:38:49"
            ],
            [
                "2017-10-26 20:42:34",
                "2018-03-10 16:38:28"
            ],
            [
                "2017-07-15 12:48:43",
                "2018-03-18 03:23:54"
            ],
            [
                "2017-12-09 20:49:23",
                "2018-02-28 09:34:51"
            ],
            [
                "2017-12-16 15:53:06",
                "2018-03-22 18:04:54"
            ],
            [
                "2017-10-29 15:39:31",
                "2018-03-01 07:12:39"
            ],
            [
                "2017-11-22 18:29:18",
                "2018-03-09 17:56:18"
            ],
            [
                "2017-10-23 08:23:22",
                "2018-02-26 23:46:25"
            ],
            [
                "2017-12-04 12:16:10",
                "2018-03-14 23:33:47"
            ]
        ]
    },
    {
        "question": "Find the number of distinct students enrolled in courses.",
        "query": "MATCH (student_course_enrolment:`e_learning.Student_Course_Enrolment`)\nRETURN count(DISTINCT student_course_enrolment.student_id)",
        "db_id": "e_learning",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "question": "Find the number of distinct courses that have enrolled students.",
        "query": "MATCH (student_course_enrolment:`e_learning.Student_Course_Enrolment`)\nRETURN count(student_course_enrolment.course_id)",
        "db_id": "e_learning",
        "answers": [
            [
                20
            ]
        ]
    },
    {
        "question": "Find the dates of the tests taken with result \"Pass\".",
        "query": "MATCH (student_tests_taken:`e_learning.Student_Tests_Taken`)\nWHERE student_tests_taken.test_result = 'Pass'\nRETURN student_tests_taken.date_test_taken",
        "db_id": "e_learning",
        "answers": [
            [
                "2018-03-25 21:50:22"
            ],
            [
                "2018-03-21 00:32:25"
            ],
            [
                "2018-03-25 00:44:50"
            ],
            [
                "2018-03-25 15:06:12"
            ],
            [
                "2018-03-24 13:22:17"
            ],
            [
                "2018-03-19 02:04:26"
            ],
            [
                "2018-03-23 23:47:42"
            ],
            [
                "2018-03-19 14:48:12"
            ]
        ]
    },
    {
        "question": "How many tests have result \"Fail\"?",
        "query": "MATCH (student_tests_taken:`e_learning.Student_Tests_Taken`)\nWHERE student_tests_taken.test_result = 'Fail'\nRETURN count(*)",
        "db_id": "e_learning",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "What are the login names of the students with family name \"Ward\"?",
        "query": "MATCH (students:`e_learning.Students`)\nWHERE students.family_name = 'Ward'\nRETURN students.login_name",
        "db_id": "e_learning",
        "answers": [
            [
                "annamae.hoppe"
            ]
        ]
    },
    {
        "question": "What are the dates of the latest logon of the students with family name \"Jaskolski\" or \"Langosh\"?",
        "query": "MATCH (students:`e_learning.Students`)\nWHERE students.family_name = 'Jaskolski' OR students.family_name = 'Langosh'\nRETURN students.date_of_latest_logon",
        "db_id": "e_learning",
        "answers": [
            [
                "2017-06-24 22:16:27"
            ],
            [
                "2018-02-24 23:15:41"
            ]
        ]
    },
    {
        "question": "List all the subject names.",
        "query": "MATCH (subjects:`e_learning.Subjects`)\nRETURN subjects.subject_name",
        "db_id": "e_learning",
        "answers": [
            [
                "Computer Science"
            ],
            [
                "Arts"
            ],
            [
                "Language"
            ]
        ]
    },
    {
        "question": "List the personal names and family names of all the students in alphabetical order of family name.",
        "query": "MATCH (students:`e_learning.Students`)\nRETURN students.personal_name,students.family_name\nORDER BY students.family_name",
        "db_id": "e_learning",
        "answers": [
            [
                "Alicia",
                "Carroll"
            ],
            [
                "Else",
                "Hartmann"
            ],
            [
                "Jewel",
                "Hodkiewicz"
            ],
            [
                "Karson",
                "Jaskolski"
            ],
            [
                "Marshall",
                "Johns"
            ],
            [
                "Krystel",
                "Langosh"
            ],
            [
                "Eliza",
                "Leannon"
            ],
            [
                "Mariela",
                "Legros"
            ],
            [
                "Claudia",
                "Mitchell"
            ],
            [
                "Cary",
                "O'Reilly"
            ],
            [
                "Autumn",
                "Schumm"
            ],
            [
                "Wilson",
                "Ward"
            ],
            [
                "Clotilde",
                "Windler"
            ],
            [
                "Prince",
                "Ziemann"
            ],
            [
                "Bernie",
                "Zieme"
            ]
        ]
    },
    {
        "question": "List each test result and its count in descending order of count.",
        "query": "MATCH (student_tests_taken:`e_learning.Student_Tests_Taken`)\nWITH count(student_tests_taken.test_result) AS count, student_tests_taken.test_result AS test_result\nRETURN test_result,count\nORDER BY count DESC",
        "db_id": "e_learning",
        "answers": [
            [
                "Pass",
                8
            ],
            [
                "Fail",
                7
            ]
        ]
    },
    {
        "question": "What are the enrollment dates of all the tests that have result \"Pass\"?",
        "query": "MATCH (T1:`e_learning.Student_Course_Enrolment`)-[]-(T2:`e_learning.Student_Tests_Taken`)\nWHERE T2.test_result = 'Pass'\nRETURN T1.date_of_enrolment",
        "db_id": "e_learning",
        "answers": [
            [
                "2017-10-10 10:05:03"
            ],
            [
                "2017-09-21 07:05:01"
            ],
            [
                "2017-09-21 07:05:01"
            ],
            [
                "2017-09-06 06:27:15"
            ],
            [
                "2017-10-23 08:23:22"
            ],
            [
                "2017-08-02 17:21:44"
            ],
            [
                "2017-10-29 15:39:31"
            ],
            [
                "2017-11-13 12:49:33"
            ]
        ]
    },
    {
        "question": "What are the completion dates of all the tests that have result \"Fail\"?",
        "query": "MATCH (T1:`e_learning.Student_Course_Enrolment`)-[]-(T2:`e_learning.Student_Tests_Taken`)\nWHERE T2.test_result = 'Fail'\nRETURN T1.date_of_completion",
        "db_id": "e_learning",
        "answers": [
            [
                "2018-03-02 14:38:49"
            ],
            [
                "2018-03-22 18:04:54"
            ],
            [
                "2018-03-22 18:04:54"
            ],
            [
                "2018-02-26 23:46:25"
            ],
            [
                "2018-03-07 09:45:48"
            ],
            [
                "2018-03-06 00:27:09"
            ],
            [
                "2018-03-04 01:24:56"
            ]
        ]
    },
    {
        "question": "List the method, date and amount of all the payments, in ascending order of date.",
        "query": "MATCH (payments:`insurance_policies.Payments`)\nRETURN payments.Payment_Method_Code,payments.Date_Payment_Made,payments.Amount_Payment\nORDER BY payments.Date_Payment_Made ASC",
        "db_id": "insurance_policies",
        "answers": [
            [
                "Visa",
                "2017-05-03",
                172309
            ],
            [
                "Discover Card",
                "2017-05-04",
                123255
            ],
            [
                "MasterCard",
                "2017-05-28",
                448613
            ],
            [
                "Visa",
                "2017-05-28",
                155654
            ],
            [
                "MasterCard",
                "2017-06-24",
                456098
            ],
            [
                "MasterCard",
                "2017-07-31",
                423154
            ],
            [
                "Discover Card",
                "2017-08-06",
                38324
            ],
            [
                "Discover Card",
                "2017-10-07",
                71246
            ],
            [
                "Visa",
                "2017-12-16",
                459407
            ],
            [
                "MasterCard",
                "2018-01-10",
                407235
            ],
            [
                "American Express",
                "2018-01-19",
                177130
            ],
            [
                "MasterCard",
                "2018-01-28",
                319142
            ],
            [
                "MasterCard",
                "2018-02-16",
                241730
            ],
            [
                "MasterCard",
                "2018-02-18",
                235893
            ],
            [
                "Visa",
                "2018-02-24",
                7343
            ]
        ]
    },
    {
        "question": "Among all the claims, what is the settlement amount of the claim with the largest claim amount? List both the settlement amount and claim amount.",
        "query": "MATCH (claims:`insurance_policies.Claims`)\nRETURN claims.Amount_Settled,claims.Amount_Claimed\nORDER BY claims.Amount_Claimed DESC\nLIMIT 1",
        "db_id": "insurance_policies",
        "answers": [
            [
                1528,
                89632
            ]
        ]
    },
    {
        "question": "Among all the claims, what is the amount claimed in the claim with the least amount settled? List both the settlement amount and claim amount.",
        "query": "MATCH (claims:`insurance_policies.Claims`)\nRETURN claims.Amount_Settled,claims.Amount_Claimed\nORDER BY claims.Amount_Settled ASC\nLIMIT 1",
        "db_id": "insurance_policies",
        "answers": [
            [
                930,
                49743
            ]
        ]
    }
]