[
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.COURSE`)-[]-(T2:`college_1.DEPARTMENT`)\nWHERE T1.CRS_DESCRIPTION =~'.*[S|s]tatistics.*'\nRETURN T2.DEPT_NAME",
        "question": "Find the name of department that offers the class whose description has the word \"Statistics\".",
        "answers": [
            [
                "Computer Info. Systems"
            ]
        ]
    },
    {
        "db_id": "college_1",
        "query": "MATCH (T1:`college_1.COURSE`)-[]-(T2:`college_1.DEPARTMENT`)\nWHERE T1.CRS_DESCRIPTION =~'.*[S|s]tatistics.*'\nRETURN T2.DEPT_NAME",
        "question": "What is the name of the department that offers a course that has a description including the word \"Statistics\"?",
        "answers": [
            [
                "Computer Info. Systems"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club:`sports_competition.club`)\nRETURN count(*)",
        "question": "What is the total number of clubs?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club:`sports_competition.club`)\nRETURN DISTINCT club.Region\nORDER BY club.Region ASC",
        "question": "List the distinct region of clubs in ascending alphabetical order.",
        "answers": [
            [
                "Brazil"
            ],
            [
                "China"
            ],
            [
                "England"
            ],
            [
                "Japan"
            ],
            [
                "UK"
            ],
            [
                "USA"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club:`sports_competition.club`)\nRETURN DISTINCT club.Region\nORDER BY club.Region ASC",
        "question": "What are the different regions of clubs in ascending alphabetical order?",
        "answers": [
            [
                "Brazil"
            ],
            [
                "China"
            ],
            [
                "England"
            ],
            [
                "Japan"
            ],
            [
                "UK"
            ],
            [
                "USA"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club_rank:`sports_competition.club_rank`)\nRETURN avg(club_rank.Gold)",
        "question": "What is the average number of gold medals for clubs?",
        "answers": [
            [
                5.833333333333333
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club_rank:`sports_competition.club_rank`)\nRETURN avg(club_rank.Gold)",
        "question": "What is the average number of gold medals for a club?",
        "answers": [
            [
                5.833333333333333
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (competition:`sports_competition.competition`)\nRETURN competition.Competition_type,competition.Country",
        "question": "What are the types and countries of competitions?",
        "answers": [
            [
                "Friendly",
                "Italy"
            ],
            [
                "Friendly",
                "Spain"
            ],
            [
                "Friendly",
                "Australia"
            ],
            [
                "Friendly",
                "Russia"
            ],
            [
                "Friendly",
                "Russia"
            ],
            [
                "Friendly",
                "Australia"
            ],
            [
                "Tournament",
                "Russia"
            ],
            [
                "Tournament",
                "Slovenia"
            ],
            [
                "Tournament",
                "Slovenia"
            ],
            [
                "Friendly",
                "Italy"
            ],
            [
                "Friendly",
                "Ireland"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (competition:`sports_competition.competition`)\nRETURN competition.Competition_type,competition.Country",
        "question": "What are the types of every competition and in which countries are they located?",
        "answers": [
            [
                "Friendly",
                "Italy"
            ],
            [
                "Friendly",
                "Spain"
            ],
            [
                "Friendly",
                "Australia"
            ],
            [
                "Friendly",
                "Russia"
            ],
            [
                "Friendly",
                "Russia"
            ],
            [
                "Friendly",
                "Australia"
            ],
            [
                "Tournament",
                "Russia"
            ],
            [
                "Tournament",
                "Slovenia"
            ],
            [
                "Tournament",
                "Slovenia"
            ],
            [
                "Friendly",
                "Italy"
            ],
            [
                "Friendly",
                "Ireland"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (competition:`sports_competition.competition`)\nWHERE competition.Competition_type <> 'Tournament'\nRETURN DISTINCT competition.Year",
        "question": "What are the distinct years in which the competitions type is not \"Tournament\"?",
        "answers": [
            [
                2006.0
            ],
            [
                2007.0
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (competition:`sports_competition.competition`)\nWHERE competition.Competition_type <> 'Tournament'\nRETURN DISTINCT competition.Year",
        "question": "What are the different years for all competitions that are not of type equal to tournament?",
        "answers": [
            [
                2006.0
            ],
            [
                2007.0
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club_rank:`sports_competition.club_rank`)\nRETURN max(club_rank.Silver),min(club_rank.Silver)",
        "question": "What are the maximum and minimum number of silver medals for clubs.",
        "answers": [
            [
                11.0,
                1.0
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club_rank:`sports_competition.club_rank`)\nRETURN max(club_rank.Silver),min(club_rank.Silver)",
        "question": "What are the maximum and minimum number of silver medals for all the clubs?",
        "answers": [
            [
                11.0,
                1.0
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club_rank:`sports_competition.club_rank`)\nWHERE club_rank.Total < 10\nRETURN count(*)",
        "question": "How many clubs have total medals less than 10?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club_rank:`sports_competition.club_rank`)\nWHERE club_rank.Total < 10\nRETURN count(*)",
        "question": "What is the total number of clubs that have less than 10 medals in total?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club:`sports_competition.club`)\nRETURN club.name\nORDER BY club.Start_year ASC",
        "question": "List all club names in ascending order of start year.",
        "answers": [
            [
                "BK Slide"
            ],
            [
                "HGS2"
            ],
            [
                "ASC"
            ],
            [
                "IFG"
            ],
            [
                "AIB"
            ],
            [
                "HSBIF"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club:`sports_competition.club`)\nRETURN club.name\nORDER BY club.Start_year ASC",
        "question": "What are the names of all the clubs starting with the oldest?",
        "answers": [
            [
                "BK Slide"
            ],
            [
                "HGS2"
            ],
            [
                "ASC"
            ],
            [
                "IFG"
            ],
            [
                "AIB"
            ],
            [
                "HSBIF"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club:`sports_competition.club`)\nRETURN club.name\nORDER BY club.name DESC",
        "question": "List all club names in descending alphabetical order.",
        "answers": [
            [
                "IFG"
            ],
            [
                "HSBIF"
            ],
            [
                "HGS2"
            ],
            [
                "BK Slide"
            ],
            [
                "ASC"
            ],
            [
                "AIB"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club:`sports_competition.club`)\nRETURN club.name\nORDER BY club.name DESC",
        "question": "What are the names of all the clubs ordered in descending alphabetical order?",
        "answers": [
            [
                "IFG"
            ],
            [
                "HSBIF"
            ],
            [
                "HGS2"
            ],
            [
                "BK Slide"
            ],
            [
                "ASC"
            ],
            [
                "AIB"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (T1:`sports_competition.club`)-[]-(T2:`sports_competition.player`)\nRETURN T1.name,T2.Player_ID",
        "question": "Please show the names and the players of clubs.",
        "answers": [
            [
                "AIB",
                1
            ],
            [
                "BK Slide",
                2
            ],
            [
                "AIB",
                3
            ],
            [
                "BK Slide",
                4
            ],
            [
                "ASC",
                5
            ],
            [
                "ASC",
                6
            ],
            [
                "HGS2",
                7
            ],
            [
                "HGS2",
                8
            ],
            [
                "BK Slide",
                9
            ],
            [
                "BK Slide",
                10
            ],
            [
                "BK Slide",
                11
            ],
            [
                "BK Slide",
                12
            ],
            [
                "IFG",
                13
            ],
            [
                "ASC",
                14
            ],
            [
                "ASC",
                15
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (T1:`sports_competition.club`)-[]-(T2:`sports_competition.player`)\nRETURN T1.name,T2.Player_ID",
        "question": "What are the names and players of all the clubs?",
        "answers": [
            [
                "AIB",
                1
            ],
            [
                "BK Slide",
                2
            ],
            [
                "AIB",
                3
            ],
            [
                "BK Slide",
                4
            ],
            [
                "ASC",
                5
            ],
            [
                "ASC",
                6
            ],
            [
                "HGS2",
                7
            ],
            [
                "HGS2",
                8
            ],
            [
                "BK Slide",
                9
            ],
            [
                "BK Slide",
                10
            ],
            [
                "BK Slide",
                11
            ],
            [
                "BK Slide",
                12
            ],
            [
                "IFG",
                13
            ],
            [
                "ASC",
                14
            ],
            [
                "ASC",
                15
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (T1:`sports_competition.club`)-[]-(T2:`sports_competition.player`)\nWHERE T2.Position = 'Right Wing'\nRETURN T1.name",
        "question": "Show the names of clubs that have players with position \"Right Wing\".",
        "answers": [
            [
                "BK Slide"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (T1:`sports_competition.club`)-[]-(T2:`sports_competition.player`)\nWHERE T2.Position = 'Right Wing'\nRETURN T1.name",
        "question": "What are the names of the clubs that have players in the position of \"Right Wing\"?",
        "answers": [
            [
                "BK Slide"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (player:`sports_competition.player`)\nRETURN player.Position,avg(player.Points)",
        "question": "List the position of players and the average number of points of players of each position.",
        "answers": [
            [
                "Full Back",
                20.0
            ],
            [
                "Right Wing",
                36.0
            ],
            [
                "Right Centre",
                36.0
            ],
            [
                "Left Wing",
                12.0
            ],
            [
                "Stand Off",
                110.0
            ],
            [
                "Scrum Half",
                188.0
            ],
            [
                "Prop",
                9.333333333333334
            ],
            [
                "Hooker",
                36.0
            ],
            [
                "Second Row",
                20.0
            ],
            [
                "Loose Forward",
                20.0
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (player:`sports_competition.player`)\nRETURN player.Position,avg(player.Points)",
        "question": "For each position, what is the average number of points for players in that position?",
        "answers": [
            [
                "Full Back",
                20.0
            ],
            [
                "Right Wing",
                36.0
            ],
            [
                "Right Centre",
                36.0
            ],
            [
                "Left Wing",
                12.0
            ],
            [
                "Stand Off",
                110.0
            ],
            [
                "Scrum Half",
                188.0
            ],
            [
                "Prop",
                9.333333333333334
            ],
            [
                "Hooker",
                36.0
            ],
            [
                "Second Row",
                20.0
            ],
            [
                "Loose Forward",
                20.0
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (competition:`sports_competition.competition`)\nRETURN competition.Competition_type,count(*)",
        "question": "List the types of competition and the number of competitions of each type.",
        "answers": [
            [
                "Friendly",
                8
            ],
            [
                "Tournament",
                3
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (competition:`sports_competition.competition`)\nRETURN competition.Competition_type,count(*)",
        "question": "What are the types of competition and number of competitions for that type?",
        "answers": [
            [
                "Friendly",
                8
            ],
            [
                "Tournament",
                3
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (competition:`sports_competition.competition`)\nWITH count(*) AS count, competition.Competition_type AS Competition_type\nWHERE count  <= 5\nRETURN Competition_type",
        "question": "List the types of competition that have at most five competitions of that type.",
        "answers": [
            [
                "Tournament"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (competition:`sports_competition.competition`)\nWITH count(*) AS count, competition.Competition_type AS Competition_type\nWHERE count  <= 5\nRETURN Competition_type",
        "question": "What are the types of competition that have most 5 competitions for that type?",
        "answers": [
            [
                "Tournament"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club:`sports_competition.club`)\nWHERE NOT (club)-[]-(:`sports_competition.player`)    \nRETURN club.name",
        "question": "List the names of clubs that do not have any players.",
        "answers": [
            [
                "HSBIF"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (club:`sports_competition.club`)\nWHERE NOT (club)-[]-(:`sports_competition.player`)    \nRETURN club.name",
        "question": "What are the names of all clubs that do not have any players?",
        "answers": [
            [
                "HSBIF"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (player:`sports_competition.player`)\nRETURN count(DISTINCT player.Position)",
        "question": "how many different positions are there?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (player:`sports_competition.player`)\nRETURN count(DISTINCT player.Position)",
        "question": "How many different position for players are listed?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (player:`sports_competition.player`)\nWITH avg(player.Points) AS points\nMATCH (player:`sports_competition.player`)\nWHERE  player.Points >  points \nRETURN player.name",
        "question": "what are the name of players who get more than the average points.",
        "answers": [
            [
                "Iestyn Harris"
            ],
            [
                "Paul Deacon (c)"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (player:`sports_competition.player`)\nWITH avg(player.Points) AS points\nMATCH (player:`sports_competition.player`)\nWHERE  player.Points >  points \nRETURN player.name",
        "question": "What are the names of all players that got more than the average number of points?",
        "answers": [
            [
                "Iestyn Harris"
            ],
            [
                "Paul Deacon (c)"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (player:`sports_competition.player`)\nWHERE player.Points < 30\nRETURN count(*),player.Position",
        "question": "find the number of players whose points are lower than 30 in each position.",
        "answers": [
            [
                1,
                "Full Back"
            ],
            [
                1,
                "Left Wing"
            ],
            [
                3,
                "Prop"
            ],
            [
                3,
                "Second Row"
            ],
            [
                1,
                "Loose Forward"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (player:`sports_competition.player`)\nWHERE player.Points < 30\nRETURN count(*),player.Position",
        "question": "What is the number of players who have points less than 30 for each position?",
        "answers": [
            [
                1,
                "Full Back"
            ],
            [
                1,
                "Left Wing"
            ],
            [
                3,
                "Prop"
            ],
            [
                3,
                "Second Row"
            ],
            [
                1,
                "Loose Forward"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (competition:`sports_competition.competition`)\nWHERE competition.Competition_type = 'Tournament'\nRETURN competition.Country\nORDER BY competition.Country DESC\nLIMIT 1",
        "question": "which country did participated in the most number of Tournament competitions?",
        "answers": [
            [
                "Slovenia"
            ]
        ]
    },
    {
        "db_id": "sports_competition",
        "query": "MATCH (competition:`sports_competition.competition`)\nWHERE competition.Competition_type = 'Tournament'\nRETURN competition.Country\nORDER BY competition.Country DESC\nLIMIT 1",
        "question": "what is the name of the country that participated in the most tournament competitions?",
        "answers": [
            [
                "Slovenia"
            ]
        ]
    },
    {
        "db_id": "manufacturer",
        "query": "MATCH (furniture:`manufacturer.furniture`)\nRETURN furniture.Name,furniture.Furniture_ID\nORDER BY furniture.Market_Rate DESC\nLIMIT 1",
        "question": "Return the name and id of the furniture with the highest market rate.",
        "answers": [
            [
                "Billiard table",
                1
            ]
        ]
    },
    {
        "db_id": "manufacturer",
        "query": "MATCH (furniture:`manufacturer.furniture`)\nWHERE furniture.Num_of_Component > 10\nRETURN furniture.Num_of_Component,furniture.Name",
        "question": "Find the component amounts and names of all furnitures that have more than 10 components.",
        "answers": [
            [
                14,
                "Billiard table"
            ],
            [
                12,
                "Dining set"
            ]
        ]
    },
    {
        "db_id": "manufacturer",
        "query": "MATCH (furniture:`manufacturer.furniture`)\nRETURN furniture.Name,furniture.Num_of_Component\nORDER BY furniture.Market_Rate\nLIMIT 1",
        "question": "Find the name and component amount of the least popular furniture.",
        "answers": [
            [
                "Hatstand",
                5
            ]
        ]
    },
    {
        "db_id": "manufacturer",
        "query": "MATCH (manufacturer:`manufacturer.manufacturer`)\nRETURN manufacturer.Open_Year,manufacturer.Name\nORDER BY manufacturer.Num_of_Shops DESC\nLIMIT 1",
        "question": "Which manufacturer has the most number of shops? List its name and year of opening.",
        "answers": [
            [
                1992.0,
                "Jiaju"
            ]
        ]
    },
    {
        "db_id": "manufacturer",
        "query": "MATCH (manufacturer:`manufacturer.manufacturer`)\nWHERE manufacturer.Num_of_Shops > 20\nRETURN avg(manufacturer.Num_of_Factories)",
        "question": "Find the average number of factories for the manufacturers that have more than 20 shops.",
        "answers": [
            [
                19.5
            ]
        ]
    },
    {
        "db_id": "manufacturer",
        "query": "MATCH (manufacturer:`manufacturer.manufacturer`)\nRETURN manufacturer.Name,manufacturer.Manufacturer_ID\nORDER BY manufacturer.Open_Year",
        "question": "List all manufacturer names and ids ordered by their opening year.",
        "answers": [
            [
                "Chevrolet House",
                1
            ],
            [
                "IKEA",
                2
            ],
            [
                "Ford Make",
                3
            ],
            [
                "Jiaju",
                4
            ],
            [
                "Chevrolet",
                5
            ],
            [
                "Dodge",
                6
            ],
            [
                "Tomorrow",
                7
            ]
        ]
    },
    {
        "db_id": "manufacturer",
        "query": "MATCH (manufacturer:`manufacturer.manufacturer`)\nWHERE manufacturer.Num_of_Shops > 10 OR manufacturer.Num_of_Factories < 10\nRETURN manufacturer.Name,manufacturer.Open_Year",
        "question": "Give me the name and year of opening of the manufacturers that have either less than 10 factories or more than 10 shops.",
        "answers": [
            [
                "IKEA",
                1990.0
            ],
            [
                "Jiaju",
                1992.0
            ],
            [
                "Chevrolet",
                2000.0
            ],
            [
                "Dodge",
                2001.0
            ]
        ]
    },
    {
        "db_id": "manufacturer",
        "query": "MATCH (manufacturer:`manufacturer.manufacturer`)\nWHERE manufacturer.Open_Year < 1990\nRETURN max(manufacturer.Num_of_Shops),avg(manufacturer.Num_of_Factories)",
        "question": "what is the average number of factories and maximum number of shops for manufacturers that opened before 1990.",
        "answers": [
            [
                8,
                36.0
            ]
        ]
    },
    {
        "db_id": "manufacturer",
        "query": "MATCH (t1:`manufacturer.manufacturer`)-[t2:`manufacturer.furniture_manufacte`]-()\nRETURN t1.Manufacturer_ID,t1.Num_of_Shops\nORDER BY t2.Price_in_Dollar DESC\nLIMIT 1",
        "question": "Find the id and number of shops for the company that produces the most expensive furniture.",
        "answers": [
            [
                7,
                4
            ]
        ]
    },
    {
        "db_id": "manufacturer",
        "query": "MATCH (t1:`manufacturer.manufacturer`)-[t2:`manufacturer.furniture_manufacte`]-()\nRETURN count(*),t1.Name",
        "question": "Find the number of funiture types produced by each manufacturer as well as the company names.",
        "answers": [
            [
                1,
                "Chevrolet House"
            ],
            [
                1,
                "Jiaju"
            ],
            [
                1,
                "Chevrolet"
            ],
            [
                2,
                "Tomorrow"
            ]
        ]
    },
    {
        "db_id": "manufacturer",
        "query": "MATCH (t1:`manufacturer.furniture`)-[t2:`manufacturer.furniture_manufacte`]-()\nRETURN t1.Name,t2.Price_in_Dollar",
        "question": "Give me the names and prices of furnitures which some companies are manufacturing.",
        "answers": [
            [
                "Billiard table",
                443.0
            ],
            [
                "Chabudai",
                450.0
            ],
            [
                "Bookcase",
                239.0
            ],
            [
                "Hatstand",
                1234.0
            ],
            [
                "Dining set",
                2124.0
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWHERE employees.LAST_NAME = 'McEwen'\nRETURN employees.FIRST_NAME,employees.DEPARTMENT_ID",
        "question": "Display the first name, and department number for all employees whose last name is \"McEwen\".",
        "answers": [
            [
                "Allan",
                80
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWHERE employees.LAST_NAME = 'McEwen'\nRETURN employees.FIRST_NAME,employees.DEPARTMENT_ID",
        "question": "What are the first names and department numbers for employees with last name McEwen?",
        "answers": [
            [
                "Allan",
                80
            ]
        ]
    },
    {
        "db_id": "hr_1",
        "query": "MATCH (employees:`hr_1.employees`)\nWHERE 8000<=employees.SALARY<=12000\nRETURN employees.PHONE_NUMBER",
        "question": "what is the phone number of employees whose salary is in the range of 8000 and 12000?",
        "answers": [
            [
                "590.423.4567"
            ],
            [
                "515.124.4569"
            ],
            [
                "515.124.4169"
            ],
            [
                "515.124.4269"
            ],
            [
                "515.127.4561"
            ],
            [
                "650.123.1234"
            ],
            [
                "650.123.2234"
            ],
            [
                "011.44.1344.429278"
            ],
            [
                "011.44.1344.619268"
            ],
            [
                "011.44.1344.429018"
            ],
            [
                "011.44.1344.129268"
            ],
            [
                "011.44.1344.345268"
            ],
            [
                "011.44.1344.478968"
            ],
            [
                "011.44.1344.498718"
            ],
            [
                "011.44.1345.429268"
            ],
            [
                "011.44.1345.929268"
            ],
            [
                "011.44.1345.829268"
            ],
            [
                "011.44.1345.729268"
            ],
            [
                "011.44.1346.129268"
            ],
            [
                "011.44.1346.229268"
            ],
            [
                "011.44.1343.929268"
            ],
            [
                "011.44.1343.829268"
            ],
            [
                "011.44.1343.729268"
            ],
            [
                "011.44.1644.429267"
            ],
            [
                "011.44.1644.429266"
            ],
            [
                "011.44.1644.429265"
            ],
            [
                "011.44.1644.429264"
            ],
            [
                "515.123.8888"
            ],
            [
                "515.123.8080"
            ],
            [
                "515.123.8181"
            ]
        ]
    }
]