[
    {
        "db_id": "match_season",
        "query": "MATCH (country:`match_season.country`)\nRETURN country.Country_name,country.Capital",
        "question": "Show the country name and capital of all countries.",
        "answers": [
            [
                "Indonesia",
                "Jakarta"
            ],
            [
                "Iran",
                "Tehran"
            ],
            [
                "Iraq",
                "Baghdad"
            ],
            [
                "Ireland",
                "Dublin"
            ],
            [
                "Isle of Man",
                "Douglas"
            ],
            [
                "United States",
                "Washington"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (country:`match_season.country`)\nRETURN country.Country_name,country.Capital",
        "question": "What are the names and capitals of each country?",
        "answers": [
            [
                "Indonesia",
                "Jakarta"
            ],
            [
                "Iran",
                "Tehran"
            ],
            [
                "Iraq",
                "Baghdad"
            ],
            [
                "Ireland",
                "Dublin"
            ],
            [
                "Isle of Man",
                "Douglas"
            ],
            [
                "United States",
                "Washington"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nRETURN DISTINCT match_season.Position",
        "question": "Show all distinct positions of matches.",
        "answers": [
            [
                "Midfielder"
            ],
            [
                "Defender"
            ],
            [
                "Forward"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nRETURN DISTINCT match_season.Position",
        "question": "What are the different positions for match season?",
        "answers": [
            [
                "Midfielder"
            ],
            [
                "Defender"
            ],
            [
                "Forward"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nWHERE match_season.College = 'UCLA'\nRETURN match_season.Player",
        "question": "Show the players from college UCLA.",
        "answers": [
            [
                "Carlos Bocanegra Category:Articles with hCards"
            ],
            [
                "Jonathan Bornstein Category:Articles with hCards"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nWHERE match_season.College = 'UCLA'\nRETURN match_season.Player",
        "question": "Who are the players from UCLA?",
        "answers": [
            [
                "Carlos Bocanegra Category:Articles with hCards"
            ],
            [
                "Jonathan Bornstein Category:Articles with hCards"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nWHERE match_season.College = 'UCLA' OR match_season.College = 'Duke'\nRETURN DISTINCT match_season.Position",
        "question": "Show the distinct position of players from college UCLA or Duke.",
        "answers": [
            [
                "Defender"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nWHERE match_season.College = 'UCLA' OR match_season.College = 'Duke'\nRETURN DISTINCT match_season.Position",
        "question": "What are the different positions of players from UCLA or Duke colleges?",
        "answers": [
            [
                "Defender"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nWHERE match_season.Position = 'Defender'\nRETURN match_season.Draft_Pick_Number,match_season.Draft_Class",
        "question": "Show the draft pick numbers and draft classes of players whose positions are defenders.",
        "answers": [
            [
                87,
                "1996 MLS Inaugural Player Draft"
            ],
            [
                5,
                "1999 MLS College Draft"
            ],
            [
                4,
                "2000 MLS SuperDraft"
            ],
            [
                9,
                "2005 MLS SuperDraft"
            ],
            [
                37,
                "2006 MLS SuperDraft"
            ],
            [
                4,
                "2008 MLS SuperDraft"
            ],
            [
                3,
                "2009 MLS SuperDraft"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nWHERE match_season.Position = 'Defender'\nRETURN match_season.Draft_Pick_Number,match_season.Draft_Class",
        "question": "What are the draft pick numbers and draft classes for players who play the Defender position?",
        "answers": [
            [
                87,
                "1996 MLS Inaugural Player Draft"
            ],
            [
                5,
                "1999 MLS College Draft"
            ],
            [
                4,
                "2000 MLS SuperDraft"
            ],
            [
                9,
                "2005 MLS SuperDraft"
            ],
            [
                37,
                "2006 MLS SuperDraft"
            ],
            [
                4,
                "2008 MLS SuperDraft"
            ],
            [
                3,
                "2009 MLS SuperDraft"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nRETURN count(DISTINCT match_season.Team)",
        "question": "How many distinct teams are involved in match seasons?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nRETURN count(DISTINCT match_season.Team)",
        "question": "Count the number of different teams involved in match season.",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (player:`match_season.player`)\nRETURN player.Player,player.Years_Played",
        "question": "Show the players and the years played.",
        "answers": [
            [
                "Cho Soong-Jae (630)",
                "1 (2011)"
            ],
            [
                "Chung Hong (717)",
                "1 (2011)"
            ],
            [
                "Im Kyu-tae (492)",
                "8 (2003\u20132005, 2007\u20132011)"
            ],
            [
                "Jeong Suk-Young (793)",
                "2 (2010\u20132011)"
            ],
            [
                "Kim Hyun-Joon (908)",
                "2 (2010\u20132011)"
            ],
            [
                "Kim Young-Jun (474)",
                "4 (2003\u20132004, 2010\u20132011)"
            ],
            [
                "Lim Yong-Kyu (288)",
                "3 (2009\u20132011)"
            ],
            [
                "Seol Jae-Min (none)",
                "2 (2010-2011)"
            ],
            [
                "An Jae-Sung",
                "3 (2005, 2007\u20132008)"
            ],
            [
                "Bae Nam-Ju",
                "2 (1988, 1990)"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (player:`match_season.player`)\nRETURN player.Player,player.Years_Played",
        "question": "Who are the different players and how many years has each played?",
        "answers": [
            [
                "Cho Soong-Jae (630)",
                "1 (2011)"
            ],
            [
                "Chung Hong (717)",
                "1 (2011)"
            ],
            [
                "Im Kyu-tae (492)",
                "8 (2003\u20132005, 2007\u20132011)"
            ],
            [
                "Jeong Suk-Young (793)",
                "2 (2010\u20132011)"
            ],
            [
                "Kim Hyun-Joon (908)",
                "2 (2010\u20132011)"
            ],
            [
                "Kim Young-Jun (474)",
                "4 (2003\u20132004, 2010\u20132011)"
            ],
            [
                "Lim Yong-Kyu (288)",
                "3 (2009\u20132011)"
            ],
            [
                "Seol Jae-Min (none)",
                "2 (2010-2011)"
            ],
            [
                "An Jae-Sung",
                "3 (2005, 2007\u20132008)"
            ],
            [
                "Bae Nam-Ju",
                "2 (1988, 1990)"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (team:`match_season.team`)\nRETURN team.Name",
        "question": "Show all team names.",
        "answers": [
            [
                "Columbus Crew"
            ],
            [
                "Evalyn Feil"
            ],
            [
                "Anais VonRueden"
            ],
            [
                "Miami Fusion"
            ],
            [
                "Enrique Osinski"
            ],
            [
                "Brown Erdman"
            ],
            [
                "Los Angeles Galaxy"
            ],
            [
                "Berneice Hand"
            ],
            [
                "Ryley Goldner"
            ],
            [
                "D.C. United"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (team:`match_season.team`)\nRETURN team.Name",
        "question": "What are the names of all teams?",
        "answers": [
            [
                "Columbus Crew"
            ],
            [
                "Evalyn Feil"
            ],
            [
                "Anais VonRueden"
            ],
            [
                "Miami Fusion"
            ],
            [
                "Enrique Osinski"
            ],
            [
                "Brown Erdman"
            ],
            [
                "Los Angeles Galaxy"
            ],
            [
                "Berneice Hand"
            ],
            [
                "Ryley Goldner"
            ],
            [
                "D.C. United"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.country`)-[]-(T2:`match_season.match_season`)\nRETURN T2.Season,T2.Player,T1.Country_name",
        "question": "Show the season, the player, and the name of the country that player belongs to.",
        "answers": [
            [
                2003.0,
                "Damani Ralph Category:Articles with hCards",
                "Indonesia"
            ],
            [
                2010.0,
                "Andy Najar Category:Articles with hCards",
                "Ireland"
            ],
            [
                1998.0,
                "Ben Olsen Category:Articles with hCards",
                "Ireland"
            ],
            [
                2001.0,
                "Rodrigo Faria Category:Articles with hCards",
                "Ireland"
            ],
            [
                2007.0,
                "Maurice Edu Category:Articles with hCards",
                "Ireland"
            ],
            [
                1999.0,
                "Jay Heaps Category:Articles with hCards",
                "Isle of Man"
            ],
            [
                2000.0,
                "Carlos Bocanegra Category:Articles with hCards",
                "Isle of Man"
            ],
            [
                1997.0,
                "Mike Duhaney Category:Articles with hCards",
                "United States"
            ],
            [
                2011.0,
                "C. J. Sapong Category:Articles with hCards",
                "United States"
            ],
            [
                1996.0,
                "Steve Ralston Category:Articles with hCards",
                "United States"
            ],
            [
                2008.0,
                "Sean Franklin Category:Articles with hCards",
                "United States"
            ],
            [
                2009.0,
                "Omar Gonzalez Category:Articles with hCards",
                "United States"
            ],
            [
                2005.0,
                "Michael Parkhurst Category:Articles with hCards",
                "United States"
            ],
            [
                2002.0,
                "Kyle Martino Category:Articles with hCards",
                "United States"
            ],
            [
                2004.0,
                "Clint Dempsey Category:Articles with hCards",
                "United States"
            ],
            [
                2006.0,
                "Jonathan Bornstein Category:Articles with hCards",
                "United States"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.country`)-[]-(T2:`match_season.match_season`)\nRETURN T2.Season,T2.Player,T1.Country_name",
        "question": "For each player, what are their name, season, and country that they belong to?",
        "answers": [
            [
                2003.0,
                "Damani Ralph Category:Articles with hCards",
                "Indonesia"
            ],
            [
                2010.0,
                "Andy Najar Category:Articles with hCards",
                "Ireland"
            ],
            [
                1998.0,
                "Ben Olsen Category:Articles with hCards",
                "Ireland"
            ],
            [
                2001.0,
                "Rodrigo Faria Category:Articles with hCards",
                "Ireland"
            ],
            [
                2007.0,
                "Maurice Edu Category:Articles with hCards",
                "Ireland"
            ],
            [
                1999.0,
                "Jay Heaps Category:Articles with hCards",
                "Isle of Man"
            ],
            [
                2000.0,
                "Carlos Bocanegra Category:Articles with hCards",
                "Isle of Man"
            ],
            [
                1997.0,
                "Mike Duhaney Category:Articles with hCards",
                "United States"
            ],
            [
                2011.0,
                "C. J. Sapong Category:Articles with hCards",
                "United States"
            ],
            [
                1996.0,
                "Steve Ralston Category:Articles with hCards",
                "United States"
            ],
            [
                2008.0,
                "Sean Franklin Category:Articles with hCards",
                "United States"
            ],
            [
                2009.0,
                "Omar Gonzalez Category:Articles with hCards",
                "United States"
            ],
            [
                2005.0,
                "Michael Parkhurst Category:Articles with hCards",
                "United States"
            ],
            [
                2002.0,
                "Kyle Martino Category:Articles with hCards",
                "United States"
            ],
            [
                2004.0,
                "Clint Dempsey Category:Articles with hCards",
                "United States"
            ],
            [
                2006.0,
                "Jonathan Bornstein Category:Articles with hCards",
                "United States"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.country`)-[]-(T2:`match_season.match_season`)\nWHERE T1.Country_name = 'Indonesia'\nRETURN T2.Player",
        "question": "Which players are from Indonesia?",
        "answers": [
            [
                "Damani Ralph Category:Articles with hCards"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.country`)-[]-(T2:`match_season.match_season`)\nWHERE T1.Country_name = 'Indonesia'\nRETURN T2.Player",
        "question": "Who are the players from Indonesia?",
        "answers": [
            [
                "Damani Ralph Category:Articles with hCards"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.country`)-[]-(T2:`match_season.match_season`)\nWHERE T1.Capital = 'Dublin'\nRETURN DISTINCT T2.Position",
        "question": "What are the distinct positions of the players from a country whose capital is Dublin?",
        "answers": [
            [
                "Midfielder"
            ],
            [
                "Forward"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.country`)-[]-(T2:`match_season.match_season`)\nWHERE T1.Capital = 'Dublin'\nRETURN DISTINCT T2.Position",
        "question": "Give the different positions of players who play for the country with the capital Dublin.",
        "answers": [
            [
                "Midfielder"
            ],
            [
                "Forward"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.country`)-[]-(T2:`match_season.match_season`)\nWHERE T2.College = 'Maryland' OR T2.College = 'Duke'\nRETURN T1.Official_native_language",
        "question": "What are the official languages of the countries of players from Maryland or Duke college?",
        "answers": [
            [
                "English Manx"
            ],
            [
                "Irish English"
            ],
            [
                "English"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.country`)-[]-(T2:`match_season.match_season`)\nWHERE T2.College = 'Maryland' OR T2.College = 'Duke'\nRETURN T1.Official_native_language",
        "question": "Return the official native languages of countries who have players from Maryland or Duke colleges.",
        "answers": [
            [
                "English Manx"
            ],
            [
                "Irish English"
            ],
            [
                "English"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.country`)-[]-(T2:`match_season.match_season`)\nWHERE T2.Position = 'Defender'\nRETURN count(DISTINCT T1.Official_native_language)",
        "question": "How many distinct official languages are there among countries of players whose positions are defenders.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.country`)-[]-(T2:`match_season.match_season`)\nWHERE T2.Position = 'Defender'\nRETURN count(DISTINCT T1.Official_native_language)",
        "question": "Count the number of different official languages corresponding to countries that players who play Defender are from.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.match_season`)-[]-(T2:`match_season.team`)\nRETURN T1.Season,T1.Player,T2.Name",
        "question": "Show the season, the player, and the name of the team that players belong to.",
        "answers": [
            [
                1996.0,
                "Steve Ralston Category:Articles with hCards",
                "Columbus Crew"
            ],
            [
                1997.0,
                "Mike Duhaney Category:Articles with hCards",
                "Evalyn Feil"
            ],
            [
                2003.0,
                "Damani Ralph Category:Articles with hCards",
                "Evalyn Feil"
            ],
            [
                2002.0,
                "Kyle Martino Category:Articles with hCards",
                "Anais VonRueden"
            ],
            [
                1998.0,
                "Ben Olsen Category:Articles with hCards",
                "Anais VonRueden"
            ],
            [
                2004.0,
                "Clint Dempsey Category:Articles with hCards",
                "Anais VonRueden"
            ],
            [
                2011.0,
                "C. J. Sapong Category:Articles with hCards",
                "Anais VonRueden"
            ],
            [
                1999.0,
                "Jay Heaps Category:Articles with hCards",
                "Miami Fusion"
            ],
            [
                2005.0,
                "Michael Parkhurst Category:Articles with hCards",
                "Miami Fusion"
            ],
            [
                2008.0,
                "Sean Franklin Category:Articles with hCards",
                "Enrique Osinski"
            ],
            [
                2010.0,
                "Andy Najar Category:Articles with hCards",
                "Enrique Osinski"
            ],
            [
                2009.0,
                "Omar Gonzalez Category:Articles with hCards",
                "Enrique Osinski"
            ],
            [
                2000.0,
                "Carlos Bocanegra Category:Articles with hCards",
                "Enrique Osinski"
            ],
            [
                2001.0,
                "Rodrigo Faria Category:Articles with hCards",
                "Enrique Osinski"
            ],
            [
                2007.0,
                "Maurice Edu Category:Articles with hCards",
                "Ryley Goldner"
            ],
            [
                2006.0,
                "Jonathan Bornstein Category:Articles with hCards",
                "D.C. United"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.match_season`)-[]-(T2:`match_season.team`)\nRETURN T1.Season,T1.Player,T2.Name",
        "question": "Who are the different players, what season do they play in, and what is the name of the team they are on?",
        "answers": [
            [
                1996.0,
                "Steve Ralston Category:Articles with hCards",
                "Columbus Crew"
            ],
            [
                1997.0,
                "Mike Duhaney Category:Articles with hCards",
                "Evalyn Feil"
            ],
            [
                2003.0,
                "Damani Ralph Category:Articles with hCards",
                "Evalyn Feil"
            ],
            [
                2002.0,
                "Kyle Martino Category:Articles with hCards",
                "Anais VonRueden"
            ],
            [
                1998.0,
                "Ben Olsen Category:Articles with hCards",
                "Anais VonRueden"
            ],
            [
                2004.0,
                "Clint Dempsey Category:Articles with hCards",
                "Anais VonRueden"
            ],
            [
                2011.0,
                "C. J. Sapong Category:Articles with hCards",
                "Anais VonRueden"
            ],
            [
                1999.0,
                "Jay Heaps Category:Articles with hCards",
                "Miami Fusion"
            ],
            [
                2005.0,
                "Michael Parkhurst Category:Articles with hCards",
                "Miami Fusion"
            ],
            [
                2008.0,
                "Sean Franklin Category:Articles with hCards",
                "Enrique Osinski"
            ],
            [
                2010.0,
                "Andy Najar Category:Articles with hCards",
                "Enrique Osinski"
            ],
            [
                2009.0,
                "Omar Gonzalez Category:Articles with hCards",
                "Enrique Osinski"
            ],
            [
                2000.0,
                "Carlos Bocanegra Category:Articles with hCards",
                "Enrique Osinski"
            ],
            [
                2001.0,
                "Rodrigo Faria Category:Articles with hCards",
                "Enrique Osinski"
            ],
            [
                2007.0,
                "Maurice Edu Category:Articles with hCards",
                "Ryley Goldner"
            ],
            [
                2006.0,
                "Jonathan Bornstein Category:Articles with hCards",
                "D.C. United"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.match_season`)-[]-(T2:`match_season.team`)\nWHERE T2.Name = 'Ryley Goldner'\nRETURN T1.Position",
        "question": "Show the positions of the players from the team with name \"Ryley Goldner\".",
        "answers": [
            [
                "Midfielder"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.match_season`)-[]-(T2:`match_season.team`)\nWHERE T2.Name = 'Ryley Goldner'\nRETURN T1.Position",
        "question": "Return the positions of players on the team Ryley Goldner.",
        "answers": [
            [
                "Midfielder"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.match_season`)-[]-(T2:`match_season.team`)\nWHERE T2.Name = 'Columbus Crew'\nRETURN count(DISTINCT T1.College)",
        "question": "How many distinct colleges are associated with players from the team with name \"Columbus Crew\".",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.match_season`)-[]-(T2:`match_season.team`)\nWHERE T2.Name = 'Columbus Crew'\nRETURN count(DISTINCT T1.College)",
        "question": "Count the number of different colleges that players who play for Columbus Crew are from.",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.player`)-[]-(T2:`match_season.team`)\nWHERE T2.Name = 'Columbus Crew'\nRETURN T1.Player,T1.Years_Played",
        "question": "Show the players and years played for players from team \"Columbus Crew\".",
        "answers": [
            [
                "Im Kyu-tae (492)",
                "8 (2003\u20132005, 2007\u20132011)"
            ],
            [
                "Jeong Suk-Young (793)",
                "2 (2010\u20132011)"
            ],
            [
                "Seol Jae-Min (none)",
                "2 (2010-2011)"
            ],
            [
                "An Jae-Sung",
                "3 (2005, 2007\u20132008)"
            ],
            [
                "Cho Soong-Jae (630)",
                "1 (2011)"
            ],
            [
                "Chung Hong (717)",
                "1 (2011)"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (T1:`match_season.player`)-[]-(T2:`match_season.team`)\nWHERE T2.Name = 'Columbus Crew'\nRETURN T1.Player,T1.Years_Played",
        "question": "What are the players who played for Columbus Crew, and how many years did each play for?",
        "answers": [
            [
                "Im Kyu-tae (492)",
                "8 (2003\u20132005, 2007\u20132011)"
            ],
            [
                "Jeong Suk-Young (793)",
                "2 (2010\u20132011)"
            ],
            [
                "Seol Jae-Min (none)",
                "2 (2010-2011)"
            ],
            [
                "An Jae-Sung",
                "3 (2005, 2007\u20132008)"
            ],
            [
                "Cho Soong-Jae (630)",
                "1 (2011)"
            ],
            [
                "Chung Hong (717)",
                "1 (2011)"
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nRETURN match_season.Position,count(*)",
        "question": "Show the position of players and the corresponding number of players.",
        "answers": [
            [
                "Midfielder",
                6
            ],
            [
                "Defender",
                7
            ],
            [
                "Forward",
                3
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nRETURN match_season.Position,count(*)",
        "question": "How many players played each position?",
        "answers": [
            [
                "Midfielder",
                6
            ],
            [
                "Defender",
                7
            ],
            [
                "Forward",
                3
            ]
        ]
    },
    {
        "db_id": "match_season",
        "query": "MATCH (match_season:`match_season.match_season`)\nRETURN match_season.Player\nORDER BY match_season.College ASC",
        "question": "Return all players sorted by college in ascending alphabetical order.",
        "answers": [
            [
                "Sean Franklin Category:Articles with hCards"
            ],
            [
                "Rodrigo Faria Category:Articles with hCards"
            ],
            [
                "Damani Ralph Category:Articles with hCards"
            ],
            [
                "Jay Heaps Category:Articles with hCards"
            ],
            [
                "Steve Ralston Category:Articles with hCards"
            ],
            [
                "Clint Dempsey Category:Articles with hCards"
            ],
            [
                "C. J. Sapong Category:Articles with hCards"
            ],
            [
                "Maurice Edu Category:Articles with hCards"
            ],
            [
                "Omar Gonzalez Category:Articles with hCards"
            ],
            [
                "Carlos Bocanegra Category:Articles with hCards"
            ],
            [
                "Jonathan Bornstein Category:Articles with hCards"
            ],
            [
                "Mike Duhaney Category:Articles with hCards"
            ],
            [
                "Ben Olsen Category:Articles with hCards"
            ],
            [
                "Kyle Martino Category:Articles with hCards"
            ],
            [
                "Michael Parkhurst Category:Articles with hCards"
            ],
            [
                "Andy Najar Category:Articles with hCards"
            ]
        ]
    }
]