[
    {
        "question": "What is the number of departments in Division \"AS\"?",
        "query": "MATCH (department:`college_3.Department`)\nWHERE department.Division = 'AS'\nRETURN count(*)",
        "db_id": "college_3",
        "answers": [
            [
                19
            ]
        ]
    },
    {
        "question": "Find the number of students that have at least one grade \"B\".",
        "query": "MATCH (enrolled_in:`college_3.Enrolled_in`)\nWHERE enrolled_in.Grade = 'B'\nRETURN count(DISTINCT enrolled_in.StuID)",
        "db_id": "college_3",
        "answers": [
            [
                24
            ]
        ]
    },
    {
        "question": "Find the max and min grade point for all letter grade.",
        "query": "MATCH (gradeconversion:`college_3.Gradeconversion`)\nRETURN max(gradeconversion.gradepoint),min(gradeconversion.gradepoint)",
        "db_id": "college_3",
        "answers": [
            [
                4.0,
                0.0
            ]
        ]
    },
    {
        "question": "Find the first names of students whose first names contain letter \"a\".",
        "query": "MATCH (student:`college_3.Student`)\nWHERE student.Fname =~'.*[A|a].*'\nRETURN DISTINCT student.Fname",
        "db_id": "college_3",
        "answers": [
            [
                "Linda"
            ],
            [
                "Tracy"
            ],
            [
                "Shiela"
            ],
            [
                "Paul"
            ],
            [
                "Andy"
            ],
            [
                "Lisa"
            ],
            [
                "Jandy"
            ],
            [
                "David"
            ],
            [
                "Charles"
            ],
            [
                "Susan"
            ],
            [
                "Mark"
            ],
            [
                "Michael"
            ],
            [
                "Arthur"
            ],
            [
                "Ian"
            ],
            [
                "Stacy"
            ],
            [
                "Sarah"
            ],
            [
                "William"
            ]
        ]
    },
    {
        "question": "Find the first names and last names of male (sex is M) faculties who live in building NEB.",
        "query": "MATCH (faculty:`college_3.Faculty`)\nWHERE faculty.Sex = 'M' AND faculty.Building = 'NEB'\nRETURN faculty.Fname,faculty.Lname",
        "db_id": "college_3",
        "answers": [
            [
                "Mark",
                "Giuliano"
            ],
            [
                "Michael",
                "Goodrich"
            ],
            [
                "Gerald",
                "Masson"
            ],
            [
                "David",
                "Yarowsky"
            ],
            [
                "Scott",
                "Smith"
            ],
            [
                "Louis",
                "Beach"
            ],
            [
                "Baruch",
                "Awerbuch"
            ],
            [
                "Russell",
                "Taylor"
            ],
            [
                "Eric",
                "Brill"
            ],
            [
                "Subodh",
                "Kumar"
            ],
            [
                "Lawrence",
                "Wolff"
            ],
            [
                "Steven",
                "Salzberg"
            ],
            [
                "Yair",
                "Amir"
            ],
            [
                "Rao",
                "Kosaraju"
            ],
            [
                "Arthur",
                "Delcher"
            ]
        ]
    },
    {
        "question": "Find the rooms of faculties with rank professor who live in building NEB.",
        "query": "MATCH (faculty:`college_3.Faculty`)\nWHERE faculty.Rank = 'Professor' AND faculty.Building = 'NEB'\nRETURN faculty.Room",
        "db_id": "college_3",
        "answers": [
            [
                "219"
            ],
            [
                "224B"
            ],
            [
                "220"
            ],
            [
                "317"
            ],
            [
                "319"
            ]
        ]
    },
    {
        "question": "Find the department name that is in Building \"Mergenthaler\".",
        "query": "MATCH (department:`college_3.Department`)\nWHERE department.Building = 'Mergenthaler'\nRETURN department.DName",
        "db_id": "college_3",
        "answers": [
            [
                "History of Art"
            ],
            [
                "Economics"
            ],
            [
                "Political Science"
            ]
        ]
    },
    {
        "question": "Find the first name of students in the descending order of age.",
        "query": "MATCH (student:`college_3.Student`)\nRETURN student.Fname\nORDER BY student.Age DESC",
        "db_id": "college_3",
        "answers": [
            [
                "Bruce"
            ],
            [
                "Paul"
            ],
            [
                "Sarah"
            ],
            [
                "David"
            ],
            [
                "Ian"
            ],
            [
                "Shiela"
            ],
            [
                "Lisa"
            ],
            [
                "Dinesh"
            ],
            [
                "Jandy"
            ],
            [
                "Steven"
            ],
            [
                "Michael"
            ],
            [
                "David"
            ],
            [
                "Eric"
            ],
            [
                "Sarah"
            ],
            [
                "Eric"
            ],
            [
                "Tracy"
            ],
            [
                "Eric"
            ],
            [
                "George"
            ],
            [
                "Eric"
            ],
            [
                "Linda"
            ],
            [
                "Andy"
            ],
            [
                "Lisa"
            ],
            [
                "Charles"
            ],
            [
                "Arthur"
            ],
            [
                "Stacy"
            ],
            [
                "Mark"
            ],
            [
                "Paul"
            ],
            [
                "William"
            ],
            [
                "Eric"
            ],
            [
                "Derek"
            ],
            [
                "Mark"
            ],
            [
                "Michael"
            ],
            [
                "Jun"
            ],
            [
                "Susan"
            ]
        ]
    },
    {
        "question": "Find the last name of female (sex is F) students in the descending order of age.",
        "query": "MATCH (student:`college_3.Student`)\nWHERE student.Sex = 'F'\nRETURN student.LName\nORDER BY student.Age DESC",
        "db_id": "college_3",
        "answers": [
            [
                "Schmidt"
            ],
            [
                "Jones"
            ],
            [
                "Cheng"
            ],
            [
                "Nelson"
            ],
            [
                "Smith"
            ],
            [
                "Kim"
            ],
            [
                "Smith"
            ],
            [
                "Apap"
            ],
            [
                "Prater"
            ],
            [
                "Lee"
            ]
        ]
    },
    {
        "question": "Find the last names of faculties in building Barton in alphabetic order.",
        "query": "MATCH (faculty:`college_3.Faculty`)\nWHERE faculty.Building = 'Barton'\nRETURN faculty.Lname\nORDER BY faculty.Lname",
        "db_id": "college_3",
        "answers": [
            [
                "Andreou"
            ],
            [
                "Brody"
            ],
            [
                "Byrne"
            ],
            [
                "Cauwenberghs"
            ],
            [
                "Collins"
            ],
            [
                "Davidson"
            ],
            [
                "Glaser"
            ],
            [
                "Goutsias"
            ],
            [
                "Hughes"
            ],
            [
                "Iglesias"
            ],
            [
                "Jelinek"
            ],
            [
                "Joseph"
            ],
            [
                "Kaplan"
            ],
            [
                "Khurgin"
            ],
            [
                "Meyer"
            ],
            [
                "Prince"
            ],
            [
                "Rugh"
            ],
            [
                "Runolfsson"
            ],
            [
                "Weinert"
            ],
            [
                "Westgate"
            ]
        ]
    },
    {
        "question": "Find the first names of faculties of rank Professor in alphabetic order.",
        "query": "MATCH (faculty:`college_3.Faculty`)\nWHERE faculty.Rank = 'Professor'\nRETURN faculty.Fname\nORDER BY faculty.Fname",
        "db_id": "college_3",
        "answers": [
            [
                "Alan"
            ],
            [
                "Alexander"
            ],
            [
                "Andreas"
            ],
            [
                "Baruch"
            ],
            [
                "Charles"
            ],
            [
                "Daniel"
            ],
            [
                "Edward"
            ],
            [
                "Frederic"
            ],
            [
                "Frederick"
            ],
            [
                "Gerald"
            ],
            [
                "Gerard"
            ],
            [
                "Howard"
            ],
            [
                "Jacob"
            ],
            [
                "James"
            ],
            [
                "John"
            ],
            [
                "John"
            ],
            [
                "Jong-Shi"
            ],
            [
                "Luigi"
            ],
            [
                "Michael"
            ],
            [
                "Michael"
            ],
            [
                "Paul"
            ],
            [
                "Rao"
            ],
            [
                "Richard"
            ],
            [
                "Russell"
            ],
            [
                "Shih-Ping"
            ],
            [
                "William"
            ],
            [
                "Wilson"
            ]
        ]
    },
    {
        "question": "Give the names of the courses with at least five enrollments.",
        "query": "MATCH (T1:`college_3.Course`)-[]-(T2:`college_3.Enrolled_in`)\nWITH count(*) AS count, T1.CName AS CName\nWHERE count  >= 5\nRETURN CName",
        "db_id": "college_3",
        "answers": [
            [
                "INTRO TO PROGRAMMING IN JAVA"
            ],
            [
                "EXPLORING THE INTERNET"
            ],
            [
                "DATA STRUCTURES in JAVA"
            ],
            [
                "MULTIMEDIA COMPUTING"
            ],
            [
                "SUPERCOMPUTING"
            ],
            [
                "DATABASE SYSTEMS"
            ],
            [
                "COMPUTER SYSTEM FUNDAMENTALS"
            ],
            [
                "DISTRIBUTED SYSTEMS"
            ],
            [
                "QUANTITATIVE MEDICAL COMPUTING"
            ],
            [
                "COMPUTER VISION"
            ],
            [
                "ALGORITHMS I"
            ],
            [
                "INTRO TO NATURAL LANGUAGE PROCESSING"
            ],
            [
                "APPLIED STATISTICS AND DATA ANALYSIS"
            ],
            [
                "INTRODUCTION TO PROBABILITY"
            ],
            [
                "COMBINATORIAL ANALYSIS"
            ],
            [
                "CIRCUITS"
            ]
        ]
    },
    {
        "question": "Find the names of courses that have either 3 credits or 1 credit but 4 hours.",
        "query": "MATCH (course:`college_3.Course`)\nWHERE course.Credits = 3\nRETURN course.CName  AS cname \nUNION\nMATCH (course:`college_3.Course`)\nWHERE course.Credits = 1 AND course.Hours = 4\nRETURN course.CName  AS cname",
        "db_id": "college_3",
        "answers": [
            [
                "COMPUTER LITERACY"
            ],
            [
                "INTRO TO PROGRAMMING IN JAVA"
            ],
            [
                "INTRO TO PROGRAMMING IN C/C++"
            ],
            [
                "EXPLORING THE INTERNET"
            ],
            [
                "JAVA PROGRAMMING"
            ],
            [
                "UNIX SYSTEMS PROGRAMMING"
            ],
            [
                "DATA STRUCTURES in JAVA"
            ],
            [
                "MULTIMEDIA COMPUTING"
            ],
            [
                "COMPUTATIONAL MODELS"
            ],
            [
                "DATABASE SYSTEMS"
            ],
            [
                "COMPUTER SYSTEM FUNDAMENTALS"
            ],
            [
                "DISTRIBUTED SYSTEMS"
            ],
            [
                "INTRODUCTION TO ALGORITHMS"
            ],
            [
                "COMPUTER SYSTEMS"
            ],
            [
                "QUANTITATIVE MEDICAL COMPUTING"
            ],
            [
                "COMPUTER VISION"
            ],
            [
                "ALGORITHMS I"
            ],
            [
                "INTRO TO NATURAL LANGUAGE PROCESSING"
            ],
            [
                "COMPUTER SCIENCE INTERNSHIP"
            ],
            [
                "HIGH PERFORMANCE GRAPHICS AND MODELING"
            ],
            [
                "SEMINAR ON COMPUTATIONAL GEOMETRY"
            ],
            [
                "ACCOUNTING I"
            ],
            [
                "ACCOUNTING II"
            ],
            [
                "BUSINESS LAW I"
            ],
            [
                "BUSINESS LAW II"
            ],
            [
                "PROBABILITY THEORY I"
            ],
            [
                "STOCHASTIC PROCESSES II"
            ],
            [
                "STATISTICAL INFERENCE"
            ],
            [
                "FOUNDATIONS OF OPTIMIZATION"
            ],
            [
                "COMBINATORIAL ANALYSIS"
            ],
            [
                "NUMERICAL ANALYSIS"
            ],
            [
                "PERCOLATION THEORY"
            ],
            [
                "TOPICS IN OPERATIONS RESEARCH"
            ],
            [
                "INTRODUCTION TO ECE"
            ],
            [
                "FIELDS, MATTER AND WAVES"
            ],
            [
                "INTEGRATED ELECTRONICS"
            ],
            [
                "ECE LABORATORY"
            ],
            [
                "MICROPROCESSOR LAB I"
            ],
            [
                "CONTROL SYSTEMS"
            ],
            [
                "BASIC COMMUNICATIONS"
            ],
            [
                "FIBER OPTICS AND PHOTONICS"
            ],
            [
                "ITERATIVE ALGORITHMS"
            ],
            [
                "INTRODUCTION TO NON-LINEAR SYSTEMS"
            ],
            [
                "TOPICS IN MEDICAL IMAGING SYSTEMS"
            ],
            [
                "PROCESSING AND RECOGNITION OF SPEECH"
            ],
            [
                "ANALOG AND DIGITAL VLSI SYSTEMS"
            ],
            [
                "SOLID STATE PHYSICS"
            ],
            [
                "NONLINEAR TECHNICAL IMAGE PROCESSING"
            ],
            [
                "RANDOM SIGNAL ANALYSIS"
            ],
            [
                "LANGUAGE AND MIND"
            ],
            [
                "MIND, BRAIN, COMPUTERS"
            ],
            [
                "SOUND STRUCTURES IN NATURAL LANGUAGE"
            ],
            [
                "FORMAL METHODS IN COGNITIVE SCIENCE"
            ],
            [
                "LANGUAGE DEVELOPMENT"
            ],
            [
                "THE HISTORY OF ROMANCE LANGUAGES"
            ],
            [
                "COMP. MODELS OF SENTENCE PROCESSING"
            ]
        ]
    },
    {
        "question": "What are the names of courses that give either 3 credits, or 1 credit and 4 hours?",
        "query": "MATCH (course:`college_3.Course`)\nWHERE course.Credits = 3\nRETURN course.CName  AS cname \nUNION\nMATCH (course:`college_3.Course`)\nWHERE course.Credits = 1 AND course.Hours = 4\nRETURN course.CName  AS cname",
        "db_id": "college_3",
        "answers": [
            [
                "COMPUTER LITERACY"
            ],
            [
                "INTRO TO PROGRAMMING IN JAVA"
            ],
            [
                "INTRO TO PROGRAMMING IN C/C++"
            ],
            [
                "EXPLORING THE INTERNET"
            ],
            [
                "JAVA PROGRAMMING"
            ],
            [
                "UNIX SYSTEMS PROGRAMMING"
            ],
            [
                "DATA STRUCTURES in JAVA"
            ],
            [
                "MULTIMEDIA COMPUTING"
            ],
            [
                "COMPUTATIONAL MODELS"
            ],
            [
                "DATABASE SYSTEMS"
            ],
            [
                "COMPUTER SYSTEM FUNDAMENTALS"
            ],
            [
                "DISTRIBUTED SYSTEMS"
            ],
            [
                "INTRODUCTION TO ALGORITHMS"
            ],
            [
                "COMPUTER SYSTEMS"
            ],
            [
                "QUANTITATIVE MEDICAL COMPUTING"
            ],
            [
                "COMPUTER VISION"
            ],
            [
                "ALGORITHMS I"
            ],
            [
                "INTRO TO NATURAL LANGUAGE PROCESSING"
            ],
            [
                "COMPUTER SCIENCE INTERNSHIP"
            ],
            [
                "HIGH PERFORMANCE GRAPHICS AND MODELING"
            ],
            [
                "SEMINAR ON COMPUTATIONAL GEOMETRY"
            ],
            [
                "ACCOUNTING I"
            ],
            [
                "ACCOUNTING II"
            ],
            [
                "BUSINESS LAW I"
            ],
            [
                "BUSINESS LAW II"
            ],
            [
                "PROBABILITY THEORY I"
            ],
            [
                "STOCHASTIC PROCESSES II"
            ],
            [
                "STATISTICAL INFERENCE"
            ],
            [
                "FOUNDATIONS OF OPTIMIZATION"
            ],
            [
                "COMBINATORIAL ANALYSIS"
            ],
            [
                "NUMERICAL ANALYSIS"
            ],
            [
                "PERCOLATION THEORY"
            ],
            [
                "TOPICS IN OPERATIONS RESEARCH"
            ],
            [
                "INTRODUCTION TO ECE"
            ],
            [
                "FIELDS, MATTER AND WAVES"
            ],
            [
                "INTEGRATED ELECTRONICS"
            ],
            [
                "ECE LABORATORY"
            ],
            [
                "MICROPROCESSOR LAB I"
            ],
            [
                "CONTROL SYSTEMS"
            ],
            [
                "BASIC COMMUNICATIONS"
            ],
            [
                "FIBER OPTICS AND PHOTONICS"
            ],
            [
                "ITERATIVE ALGORITHMS"
            ],
            [
                "INTRODUCTION TO NON-LINEAR SYSTEMS"
            ],
            [
                "TOPICS IN MEDICAL IMAGING SYSTEMS"
            ],
            [
                "PROCESSING AND RECOGNITION OF SPEECH"
            ],
            [
                "ANALOG AND DIGITAL VLSI SYSTEMS"
            ],
            [
                "SOLID STATE PHYSICS"
            ],
            [
                "NONLINEAR TECHNICAL IMAGE PROCESSING"
            ],
            [
                "RANDOM SIGNAL ANALYSIS"
            ],
            [
                "LANGUAGE AND MIND"
            ],
            [
                "MIND, BRAIN, COMPUTERS"
            ],
            [
                "SOUND STRUCTURES IN NATURAL LANGUAGE"
            ],
            [
                "FORMAL METHODS IN COGNITIVE SCIENCE"
            ],
            [
                "LANGUAGE DEVELOPMENT"
            ],
            [
                "THE HISTORY OF ROMANCE LANGUAGES"
            ],
            [
                "COMP. MODELS OF SENTENCE PROCESSING"
            ]
        ]
    },
    {
        "question": "Find the names of departments that are either in division AS or in division EN and in Building NEB.",
        "query": "MATCH (department:`college_3.Department`)\nWHERE department.Division = 'AS'\nRETURN department.DName  AS dname \nUNION\nMATCH (department:`college_3.Department`)\nWHERE department.Division = 'EN' AND department.Building = 'NEB'\nRETURN department.DName  AS dname",
        "db_id": "college_3",
        "answers": [
            [
                "History of Art"
            ],
            [
                "Biology"
            ],
            [
                "Chemistry"
            ],
            [
                "Classics"
            ],
            [
                "Cognitive Science"
            ],
            [
                "English"
            ],
            [
                "Anthropology"
            ],
            [
                "German"
            ],
            [
                "History"
            ],
            [
                "Mathematics"
            ],
            [
                "Near Eastern Studies"
            ],
            [
                "History of Science"
            ],
            [
                "Philosophy"
            ],
            [
                "Physics and Astronomy"
            ],
            [
                "Economics"
            ],
            [
                "Political Science"
            ],
            [
                "Psychology"
            ],
            [
                "French"
            ],
            [
                "Hispanic/Italian Studies"
            ],
            [
                "Chemical Engineering"
            ],
            [
                "Biomedical Engineering"
            ],
            [
                "Computer Science"
            ]
        ]
    },
    {
        "question": "Give the id and product type of the product with the lowest price.",
        "query": "MATCH (products:`department_store.Products`)\nRETURN products.product_id,products.product_type_code\nORDER BY products.product_price\nLIMIT 1",
        "db_id": "department_store",
        "answers": [
            [
                6,
                "Clothes"
            ]
        ]
    },
    {
        "question": "Find the number of different product types.",
        "query": "MATCH (products:`department_store.Products`)\nRETURN count(DISTINCT products.product_type_code)",
        "db_id": "department_store",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "Return the staff ids and genders for any staff with the title Department Manager.",
        "query": "MATCH (T1:`department_store.Staff`)-[T2:`department_store.Staff_Department_Assignments`]-()\nWHERE T2.job_title_code = 'Department Manager'\nRETURN T1.staff_id,T1.staff_gender",
        "db_id": "department_store",
        "answers": [
            [
                5,
                "0"
            ],
            [
                6,
                "1"
            ],
            [
                15,
                "1"
            ]
        ]
    },
    {
        "question": "For each payment method, return how many customers use it.",
        "query": "MATCH (customers:`department_store.Customers`)\nWITH count(customers.payment_method_code) AS count, customers.payment_method_code AS payment_method_code\nRETURN payment_method_code,count",
        "db_id": "department_store",
        "answers": [
            [
                "Credit Card",
                10
            ],
            [
                "Direct Debit",
                5
            ]
        ]
    },
    {
        "question": "What is the id of the product that was ordered the most often?",
        "query": "MATCH (order_items:`department_store.Order_Items`)\nWITH order_items.product_id AS product_id, count(order_items.product_id) AS count\nRETURN product_id\nORDER BY count DESC\nLIMIT 1",
        "db_id": "department_store",
        "answers": [
            [
                13
            ]
        ]
    },
    {
        "question": "Return the name, phone number and email address for the customer with the most orders.",
        "query": "MATCH (T1:`department_store.Customers`)-[]-(T2:`department_store.Customer_Orders`)\nWITH count(T2.customer_id) AS count, T1.customer_email AS customer_email, T1.customer_name AS customer_name, T1.customer_phone AS customer_phone\nRETURN customer_name,customer_phone,customer_email\nORDER BY count DESC\nLIMIT 1",
        "db_id": "department_store",
        "answers": [
            [
                "Lexus",
                "+08(3)8056580281",
                "gbrekke@example.com"
            ]
        ]
    },
    {
        "question": "How many department stores does the store chain South have?",
        "query": "MATCH (T1:`department_store.Department_Stores`)-[]-(T2:`department_store.Department_Store_Chain`)\nWHERE T2.dept_store_chain_name = 'South'\nRETURN count(*)",
        "db_id": "department_store",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "What are the ids of the two department store chains with the largest number of department stores?",
        "query": "MATCH (department_stores:`department_store.Department_Stores`)\nWITH department_stores.dept_store_chain_id AS dept_store_chain_id, count(department_stores.dept_store_chain_id) AS count\nRETURN dept_store_chain_id\nORDER BY count DESC\nLIMIT 2",
        "db_id": "department_store",
        "answers": [
            [
                4
            ],
            [
                3
            ]
        ]
    },
    {
        "question": "Return the names and ids of all products whose price is between 600 and 700.",
        "query": "MATCH (products:`department_store.Products`)\nWHERE 600<=products.product_price<=700\nRETURN products.product_name,products.product_id",
        "db_id": "department_store",
        "answers": [
            [
                "yellow jeans",
                2
            ],
            [
                "black jeans",
                3
            ],
            [
                "blue topping",
                9
            ],
            [
                "keyboard",
                13
            ],
            [
                "speaker",
                14
            ]
        ]
    },
    {
        "question": "List the name of staff who has been assigned multiple jobs.",
        "query": "MATCH (T1:`department_store.Staff`)-[T2:`department_store.Staff_Department_Assignments`]-()\nWITH count(*) AS count, T1.staff_name AS staff_name\nWHERE count  > 1\nRETURN staff_name",
        "db_id": "department_store",
        "answers": [
            [
                "Malika"
            ],
            [
                "Tyson"
            ],
            [
                "Vito"
            ]
        ]
    },
    {
        "question": "List the name and phone number of all suppliers in the alphabetical order of their addresses.",
        "query": "MATCH (T1:`department_store.Suppliers`)-[T2:`department_store.Supplier_Addresses`]-(T3:`department_store.Addresses`)\nRETURN T1.supplier_name,T1.supplier_phone\nORDER BY T3.address_details",
        "db_id": "department_store",
        "answers": [
            [
                "AB Store",
                "1-483-283-4742"
            ],
            [
                "Tesco",
                "287-071-1153x254"
            ],
            [
                "Audi",
                "1-432-960-2402x1734"
            ],
            [
                "Tesco",
                "287-071-1153x254"
            ]
        ]
    },
    {
        "question": "Give the ids and names of products with price lower than 600 or higher than 900.",
        "query": "MATCH (products:`department_store.Products`)\nWHERE products.product_price < 600 OR products.product_price > 900\nRETURN products.product_id,products.product_name",
        "db_id": "department_store",
        "answers": [
            [
                4,
                "blue jeans"
            ],
            [
                5,
                "red jeans"
            ],
            [
                6,
                "red topping"
            ],
            [
                7,
                "black topping"
            ],
            [
                8,
                "yellow topping"
            ],
            [
                12,
                "drive"
            ],
            [
                15,
                "mic"
            ]
        ]
    },
    {
        "question": "Return the maximum and minimum customer codes.",
        "query": "MATCH (customers:`department_store.Customers`)\nRETURN max(customers.customer_code),min(customers.customer_code)",
        "db_id": "department_store",
        "answers": [
            [
                "980",
                "172"
            ]
        ]
    },
    {
        "question": "List the names and phone numbers of all the distinct suppliers who supply red jeans.",
        "query": "MATCH (T1:`department_store.Suppliers`)-[T2:`department_store.Product_Suppliers`]-(T3:`department_store.Products`)\nWHERE T3.product_name = 'red jeans'\nRETURN DISTINCT T1.supplier_name,T1.supplier_phone",
        "db_id": "department_store",
        "answers": [
            [
                "AB Store",
                "1-483-283-4742"
            ]
        ]
    },
    {
        "question": "List the order id, customer id for orders in Cancelled status, ordered by their order dates.",
        "query": "MATCH (customer_orders:`department_store.Customer_Orders`)\nWHERE customer_orders.order_status_code = 'Cancelled'\nRETURN customer_orders.order_id,customer_orders.customer_id\nORDER BY customer_orders.order_date",
        "db_id": "department_store",
        "answers": [
            [
                7,
                1
            ],
            [
                11,
                8
            ],
            [
                10,
                11
            ]
        ]
    },
    {
        "question": "What are the order ids and customer ids for orders that have been Cancelled, sorted by their order dates?",
        "query": "MATCH (customer_orders:`department_store.Customer_Orders`)\nWHERE customer_orders.order_status_code = 'Cancelled'\nRETURN customer_orders.order_id,customer_orders.customer_id\nORDER BY customer_orders.order_date",
        "db_id": "department_store",
        "answers": [
            [
                7,
                1
            ],
            [
                11,
                8
            ],
            [
                10,
                11
            ]
        ]
    }
]