[
    {
        "db_id": "school_player",
        "query": "MATCH (T1:`school_player.player`)-[]-(T2:`school_player.school`)\nWITH T2.Location AS Location, count(*) AS count\nWHERE count  > 1\nRETURN Location",
        "question": "Which schools have more than 1 player? Give me the school locations.",
        "answers": [
            [
                "Milsons Point"
            ],
            [
                "Hornsby"
            ],
            [
                "Wahroonga"
            ],
            [
                "Summer Hill"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (T1:`school_player.player`)-[]-(T2:`school_player.school`)\nWITH count(T1.School_ID) AS cnt, T2\nRETURN T2.Denomination\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Show the denomination of the school that has the most players.",
        "answers": [
            [
                "Catholic"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (T1:`school_player.player`)-[]-(T2:`school_player.school`)\nWITH count(T1.School_ID) AS cnt, T2\nRETURN T2.Denomination\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the denomination of the school the most players belong to?",
        "answers": [
            [
                "Catholic"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (T1:`school_player.school`)-[]-(T2:`school_player.school_details`)\nRETURN T1.Location,T2.Nickname",
        "question": "Show locations and nicknames of schools.",
        "answers": [
            [
                "Milsons Point",
                "Tigers"
            ],
            [
                "Hornsby",
                "Auks"
            ],
            [
                "Bellevue Hill",
                "Buccaneers"
            ],
            [
                "Wahroonga",
                "Raiders"
            ],
            [
                "Summer Hill",
                "Seahawks"
            ],
            [
                "Waverley",
                "Silver Eagles"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (T1:`school_player.school`)-[]-(T2:`school_player.school_details`)\nRETURN T1.Location,T2.Nickname",
        "question": "What are the location and nickname of each school?",
        "answers": [
            [
                "Milsons Point",
                "Tigers"
            ],
            [
                "Hornsby",
                "Auks"
            ],
            [
                "Bellevue Hill",
                "Buccaneers"
            ],
            [
                "Wahroonga",
                "Raiders"
            ],
            [
                "Summer Hill",
                "Seahawks"
            ],
            [
                "Waverley",
                "Silver Eagles"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nRETURN school.Denomination,count(*)",
        "question": "Please show different denominations and the corresponding number of schools.",
        "answers": [
            [
                "Catholic",
                2
            ],
            [
                "Anglican",
                3
            ],
            [
                "Uniting Church",
                1
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nRETURN school.Denomination,count(*)",
        "question": "For each denomination, return the denomination and the count of schools with that denomination.",
        "answers": [
            [
                "Catholic",
                2
            ],
            [
                "Anglican",
                3
            ],
            [
                "Uniting Church",
                1
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nRETURN school.Denomination,count(*)\nORDER BY school.Denomination DESC",
        "question": "Please show different denominations and the corresponding number of schools in descending order.",
        "answers": [
            [
                "Uniting Church",
                1
            ],
            [
                "Catholic",
                2
            ],
            [
                "Anglican",
                3
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nRETURN school.Denomination,count(*)\nORDER BY school.Denomination DESC",
        "question": "Order denominations in descending order of the count of schools with the denomination. Return each denomination with the count of schools.",
        "answers": [
            [
                "Uniting Church",
                1
            ],
            [
                "Catholic",
                2
            ],
            [
                "Anglican",
                3
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nRETURN school.School_Colors\nORDER BY school.Enrollment DESC\nLIMIT 1",
        "question": "List the school color of the school that has the largest enrollment.",
        "answers": [
            [
                "Red & Blue"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nRETURN school.School_Colors\nORDER BY school.Enrollment DESC\nLIMIT 1",
        "question": "What is the school color of the school with the largest enrollment?",
        "answers": [
            [
                "Red & Blue"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nWHERE NOT (school)-[]-(:`school_player.player`)    \nRETURN school.Location",
        "question": "List the locations of schools that do not have any player.",
        "answers": []
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nWHERE NOT (school)-[]-(:`school_player.player`)    \nRETURN school.Location",
        "question": "Which schools do not have any player? Give me the school locations.",
        "answers": []
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school_details:`school_player.school_details`)\nWHERE school_details.Division <> 'Division 1'\nRETURN school_details.Nickname",
        "question": "Show the nicknames of schools that are not in division 1.",
        "answers": [
            [
                "Auks"
            ],
            [
                "Raiders"
            ],
            [
                "Seahawks"
            ],
            [
                "Silver Eagles"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school_details:`school_player.school_details`)\nWHERE school_details.Division <> 'Division 1'\nRETURN school_details.Nickname",
        "question": "What are the nicknames of schools whose division is not 1?",
        "answers": [
            [
                "Auks"
            ],
            [
                "Raiders"
            ],
            [
                "Seahawks"
            ],
            [
                "Silver Eagles"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nWITH school.Denomination AS Denomination, count(*) AS count\nWHERE count  > 1\nRETURN Denomination",
        "question": "Show the denomination shared by more than one school.",
        "answers": [
            [
                "Catholic"
            ],
            [
                "Anglican"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nWITH school.Denomination AS Denomination, count(*) AS count\nWHERE count  > 1\nRETURN Denomination",
        "question": "What are the denomination more than one school have?",
        "answers": [
            [
                "Catholic"
            ],
            [
                "Anglican"
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (product:`store_product.product`)\nWITH count(*) AS count, product.max_page_size AS max_page_size\nWHERE count  > 3\nRETURN max_page_size",
        "question": "Find the list of page size which have more than 3 product listed",
        "answers": [
            [
                "A4"
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (district:`store_product.district`)\nWHERE 200000<=district.City_Population<=2000000\nRETURN district.District_name,district.City_Population",
        "question": "Find the name and population of district with population between 200000 and 2000000",
        "answers": [
            [
                "Bahawalpur District",
                530438.0
            ],
            [
                "Chiniot District",
                219254.0
            ],
            [
                "Dera Ghazi Khan District",
                464742.0
            ],
            [
                "Gujranwala District",
                1526168.0
            ],
            [
                "Gujrat District",
                328512.0
            ],
            [
                "Jhang District",
                365198.0
            ],
            [
                "Kasur District",
                314617.0
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (district:`store_product.district`)\nWHERE district.City_Area > 10 OR district.City_Population > 100000\nRETURN district.District_name",
        "question": "Find the name all districts with city area greater than 10 or population larger than 100000",
        "answers": [
            [
                "Attock District"
            ],
            [
                "Bahawalnagar District"
            ],
            [
                "Bahawalpur District"
            ],
            [
                "Bhakkar District"
            ],
            [
                "Chakwal District"
            ],
            [
                "Chiniot District"
            ],
            [
                "Dera Ghazi Khan District"
            ],
            [
                "Faisalabad District"
            ],
            [
                "Gujranwala District"
            ],
            [
                "Gujrat District"
            ],
            [
                "Hafizabad District"
            ],
            [
                "Jhang District"
            ],
            [
                "Jhelum District"
            ],
            [
                "Kasur District"
            ],
            [
                "Khanewal District"
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (store:`store_product.store`)\nRETURN store.Type,count(*)",
        "question": "Find all types of store and number of them.",
        "answers": [
            [
                "City Mall",
                2
            ],
            [
                "Village Store",
                3
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (t1:`store_product.store`)-[]-(t2:`store_product.store_district`)-[]-(t3:`store_product.district`)\nWHERE t3.District_name = 'Khanewal District'\nRETURN t1.Store_Name",
        "question": "Find the names of all stores in Khanewal District.",
        "answers": [
            [
                "Neguac"
            ],
            [
                "Miramichi"
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (t1:`store_product.store`)-[]-(t2:`store_product.store_district`)-[]-(t3:`store_product.district`)\nWHERE t3.District_name = 'Khanewal District'\nRETURN t1.Store_Name",
        "question": "What are the names of all the stores located in Khanewal District?",
        "answers": [
            [
                "Neguac"
            ],
            [
                "Miramichi"
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (t1:`store_product.store`)-[]-(t2:`store_product.store_district`)-[]-(t3:`store_product.district`)\nWHERE t1.Store_Name = 'Blackville'\nRETURN t3.Headquartered_City",
        "question": "Which city is the headquarter of the store named \"Blackville\" in?",
        "answers": [
            [
                "Bhakkar City"
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (t1:`store_product.store`)-[]-(t2:`store_product.store_district`)-[]-(t3:`store_product.district`)\nWHERE t1.Store_Name = 'Blackville'\nRETURN t3.Headquartered_City",
        "question": "What city is the headquarter of the store Blackville?",
        "answers": [
            [
                "Bhakkar City"
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (t1:`store_product.store`)-[]-(t2:`store_product.store_district`)-[]-(t3:`store_product.district`)\nRETURN t3.Headquartered_City,count(*)",
        "question": "Find the number of stores in each city.",
        "answers": [
            [
                "Khanewal City",
                2
            ],
            [
                "Hafizabad City",
                1
            ],
            [
                "Bhakkar City",
                1
            ],
            [
                "Bahawalpur City",
                1
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (t1:`store_product.store`)-[]-(t2:`store_product.store_district`)-[]-(t3:`store_product.district`)\nRETURN t3.Headquartered_City,count(*)",
        "question": "How many stores are headquarted in each city?",
        "answers": [
            [
                "Khanewal City",
                2
            ],
            [
                "Hafizabad City",
                1
            ],
            [
                "Bhakkar City",
                1
            ],
            [
                "Bahawalpur City",
                1
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (t1:`store_product.store`)-[]-(t2:`store_product.store_district`)-[]-(t3:`store_product.district`)\nWITH count(t3.Headquartered_City) AS cnt, t3\nRETURN t3.Headquartered_City\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Find the city with the most number of stores.",
        "answers": [
            [
                "Khanewal City"
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (t1:`store_product.store`)-[]-(t2:`store_product.store_district`)-[]-(t3:`store_product.district`)\nWITH count(t3.Headquartered_City) AS cnt, t3\nRETURN t3.Headquartered_City\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the city with the most number of flagship stores?",
        "answers": [
            [
                "Khanewal City"
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (t1:`store_product.product`)-[t2:`store_product.store_product`]-(t3:`store_product.store`)\nWHERE t3.Store_Name = 'Miramichi'\nRETURN t1.product",
        "question": "What products are available at store named \"Miramichi\"?",
        "answers": [
            [
                "Fujitsu fi-6130 A4 Series Scanner"
            ],
            [
                "Canon DR-2080C"
            ],
            [
                "Xerox Travel Scanner 100"
            ],
            [
                "Plustek MobileOffice D28 Corporate"
            ],
            [
                "ScanShell 3000DN"
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (t1:`store_product.product`)-[t2:`store_product.store_product`]-(t3:`store_product.store`)\nWHERE t3.Store_Name = 'Miramichi'\nRETURN t1.product",
        "question": "What products are sold at the store named Miramichi?",
        "answers": [
            [
                "Fujitsu fi-6130 A4 Series Scanner"
            ],
            [
                "Canon DR-2080C"
            ],
            [
                "Xerox Travel Scanner 100"
            ],
            [
                "Plustek MobileOffice D28 Corporate"
            ],
            [
                "ScanShell 3000DN"
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (product:`store_product.product`)\nWHERE product.max_page_size = 'A4' AND product.pages_per_minute_color < 5\nRETURN product.product",
        "question": "Find products with max page size as \"A4\" and pages per minute color smaller than 5.",
        "answers": [
            [
                "Xerox Travel Scanner 100"
            ],
            [
                "ScanShell 3000DN"
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (product:`store_product.product`)\nWHERE product.max_page_size = 'A4' OR product.pages_per_minute_color < 5\nRETURN product.product",
        "question": "Find products with max page size as \"A4\" or pages per minute color smaller than 5.",
        "answers": [
            [
                "Fujitsu fi-6130 A4 Series Scanner"
            ],
            [
                "Plustek MobileOffice D28 Corporate"
            ],
            [
                "Xerox Travel Scanner 100"
            ],
            [
                "ScanShell 3000DN"
            ]
        ]
    },
    {
        "db_id": "store_product",
        "query": "MATCH (product:`store_product.product`)\nRETURN product.max_page_size\nORDER BY product.max_page_size DESC\nLIMIT 1",
        "question": "Find the most prominent max page size among all the products.",
        "answers": [
            [
                "A4"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nRETURN avg(college.enr)",
        "question": "What is the average enrollment number?",
        "answers": [
            [
                17750.0
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nRETURN avg(college.enr)",
        "question": "How many students, on average, does each college have enrolled?",
        "answers": [
            [
                17750.0
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nRETURN count(*)",
        "question": "How many colleges in total?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nRETURN count(*)",
        "question": "How many different colleges are there?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nWHERE player.HS > 1000\nRETURN count(*)",
        "question": "How many players have more than 1000 hours of training?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nWHERE player.HS > 1000\nRETURN count(*)",
        "question": "How many different players trained for more than 1000 hours?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nWHERE college.enr > 15000\nRETURN count(*)",
        "question": "How many colleges has more than 15000 students?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nWHERE college.enr > 15000\nRETURN count(*)",
        "question": "What is the number of colleges with a student population greater than 15000?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nRETURN avg(player.HS)",
        "question": "What is the average training hours of all players?",
        "answers": [
            [
                1150.0
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nRETURN avg(player.HS)",
        "question": "How many hours do the players train on average?",
        "answers": [
            [
                1150.0
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nWHERE player.HS < 1500\nRETURN player.pName,player.HS",
        "question": "Find the name and training hours of players whose hours are below 1500.",
        "answers": [
            [
                "Andrew",
                1200
            ],
            [
                "Charles",
                300
            ],
            [
                "Eddie",
                600
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nWHERE player.HS < 1500\nRETURN player.pName,player.HS",
        "question": "What are the names and number of hours spent training for each player who trains for less than 1500 hours?",
        "answers": [
            [
                "Andrew",
                1200
            ],
            [
                "Charles",
                300
            ],
            [
                "Eddie",
                600
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH ()-[tryout:`soccer_2.Tryout`]-()\nRETURN count(DISTINCT tryout.cName)",
        "question": "How many different colleges do attend the tryout test?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH ()-[tryout:`soccer_2.Tryout`]-()\nRETURN count(DISTINCT tryout.cName)",
        "question": "How many different colleges were represented at tryouts?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH ()-[tryout:`soccer_2.Tryout`]-()\nRETURN count(DISTINCT tryout.pPos)",
        "question": "What are the unique types of player positions in the tryout?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH ()-[tryout:`soccer_2.Tryout`]-()\nRETURN count(DISTINCT tryout.pPos)",
        "question": "What are the different types of player positions?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nRETURN avg(player.HS),max(player.HS),min(player.HS)",
        "question": "Find the max, average and min training hours of all players.",
        "answers": [
            [
                1150.0,
                1600,
                300
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nRETURN avg(player.HS),max(player.HS),min(player.HS)",
        "question": "What is the average, maximum, and minimum for the number of hours spent training?",
        "answers": [
            [
                1150.0,
                1600,
                300
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nWHERE college.state = 'FL'\nRETURN avg(college.enr)",
        "question": "What is average enrollment of colleges in the state FL?",
        "answers": [
            [
                19000.0
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nWHERE college.state = 'FL'\nRETURN avg(college.enr)",
        "question": "What is average number of students enrolled in Florida colleges?",
        "answers": [
            [
                19000.0
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nWHERE 500<=player.HS<=1500\nRETURN player.pName",
        "question": "What are the names of players whose training hours is between 500 and 1500?",
        "answers": [
            [
                "Andrew"
            ],
            [
                "Eddie"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nWHERE 500<=player.HS<=1500\nRETURN player.pName",
        "question": "What are the names of players who train between 500 and 1500 hours?",
        "answers": [
            [
                "Andrew"
            ],
            [
                "Eddie"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nWHERE player.pName =~'.*[A|a].*'\nRETURN DISTINCT player.pName",
        "question": "Find the players whose names contain letter 'a'.",
        "answers": [
            [
                "Andrew"
            ],
            [
                "Blake"
            ],
            [
                "Charles"
            ],
            [
                "David"
            ],
            [
                "Drago"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nWHERE player.pName =~'.*[A|a].*'\nRETURN DISTINCT player.pName",
        "question": "Who are the players that have names containing the letter a?",
        "answers": [
            [
                "Andrew"
            ],
            [
                "Blake"
            ],
            [
                "Charles"
            ],
            [
                "David"
            ],
            [
                "Drago"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nWHERE college.enr > 18000\nRETURN college.cName\nORDER BY college.cName",
        "question": "List the name of the colleges whose enrollment is greater 18000 sorted by the college's name.",
        "answers": [
            [
                "FSU"
            ],
            [
                "OU"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nWHERE college.enr > 18000\nRETURN college.cName\nORDER BY college.cName",
        "question": "What is the name of every college in alphabetical order that has more than 18000 students enrolled?",
        "answers": [
            [
                "FSU"
            ],
            [
                "OU"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nWHERE player.yCard = 'yes'\nRETURN player.pName\nORDER BY player.HS DESC",
        "question": "Find the name of players whose card is yes in the descending order of training hours.",
        "answers": [
            [
                "David"
            ],
            [
                "Drago"
            ],
            [
                "Eddie"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (player:`soccer_2.Player`)\nWHERE player.yCard = 'yes'\nRETURN player.pName\nORDER BY player.HS DESC",
        "question": "What are the name of the players who received a card in descending order of the hours of training?",
        "answers": [
            [
                "David"
            ],
            [
                "Drago"
            ],
            [
                "Eddie"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH ()-[tryout:`soccer_2.Tryout`]-()\nRETURN DISTINCT tryout.cName\nORDER BY tryout.cName",
        "question": "What are the different names of the colleges involved in the tryout in alphabetical order?",
        "answers": [
            [
                "ASU"
            ],
            [
                "FSU"
            ],
            [
                "LSU"
            ],
            [
                "OU"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nRETURN college.cName\nORDER BY college.enr DESC\nLIMIT 3",
        "question": "What are the names of schools with the top 3 largest size?",
        "answers": [
            [
                "OU"
            ],
            [
                "FSU"
            ],
            [
                "LSU"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nRETURN college.cName\nORDER BY college.enr DESC\nLIMIT 3",
        "question": "What are the names of the schools with the top 3 largest class sizes?",
        "answers": [
            [
                "OU"
            ],
            [
                "FSU"
            ],
            [
                "LSU"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nRETURN college.cName,college.state,min(college.enr)",
        "question": "What is the name of school that has the smallest enrollment in each state?",
        "answers": [
            [
                "LSU",
                "LA",
                18000
            ],
            [
                "ASU",
                "AZ",
                12000
            ],
            [
                "OU",
                "OK",
                22000
            ],
            [
                "FSU",
                "FL",
                19000
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nRETURN college.cName,college.state,min(college.enr)",
        "question": "What is the name of the school with smallest enrollment size per state?",
        "answers": [
            [
                "LSU",
                "LA",
                18000
            ],
            [
                "ASU",
                "AZ",
                12000
            ],
            [
                "OU",
                "OK",
                22000
            ],
            [
                "FSU",
                "FL",
                19000
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes'\nRETURN DISTINCT T1.state",
        "question": "Find the states where have some college students in tryout and their decisions are yes.",
        "answers": [
            [
                "AZ"
            ],
            [
                "FL"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes'\nRETURN DISTINCT T1.state",
        "question": "What are the different states that had students successfully try out?",
        "answers": [
            [
                "AZ"
            ],
            [
                "FL"
            ]
        ]
    }
]