[
    {
        "question": "Return the dates of ceremony and the results of all music festivals",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nRETURN music_festival.Date_of_ceremony,music_festival.Result",
        "db_id": "music_4",
        "answers": [
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Awarded"
            ],
            [
                "18 February 2011",
                "Awarded"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Nominated"
            ],
            [
                "18 February 2011",
                "Awarded"
            ]
        ]
    },
    {
        "question": "What are the category of music festivals with result \"Awarded\"?",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nWHERE music_festival.Result = 'Awarded'\nRETURN music_festival.Category",
        "db_id": "music_4",
        "answers": [
            [
                "Best Song"
            ],
            [
                "Best Song"
            ],
            [
                "Best Sound Song"
            ]
        ]
    },
    {
        "question": "Give the maximum and minimum weeks on top across all volumes.",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN max(volume.Weeks_on_Top),min(volume.Weeks_on_Top)",
        "db_id": "music_4",
        "answers": [
            [
                3.0,
                1.0
            ]
        ]
    },
    {
        "question": "Give the songs included in volumes that have more than 1 week on top.",
        "query": "MATCH (volume:`music_4.volume`)\nWHERE volume.Weeks_on_Top > 1\nRETURN volume.Song",
        "db_id": "music_4",
        "answers": [
            [
                " The Way"
            ],
            [
                " Touch Me (I Want Your Body) "
            ],
            [
                " (I Just) Died in Your Arms "
            ],
            [
                " Always "
            ]
        ]
    },
    {
        "question": "Please list all songs in volumes in ascending alphabetical order.",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN volume.Song\nORDER BY volume.Song",
        "db_id": "music_4",
        "answers": [
            [
                " (I Just) Died in Your Arms "
            ],
            [
                " Always "
            ],
            [
                " Everybody Have Fun Tonight "
            ],
            [
                " La Isla Bonita "
            ],
            [
                " The Way"
            ],
            [
                " Touch Me (I Want Your Body) "
            ],
            [
                " Walk Like an Egyptian "
            ],
            [
                " With or Without You "
            ],
            [
                "Head to Toe "
            ],
            [
                "Looking for a New Love"
            ]
        ]
    },
    {
        "question": "Count the number of distinct artists who have volumes.",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN count(DISTINCT volume.Artist_ID)",
        "db_id": "music_4",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "Please show the date of ceremony of the volumes that last more than 2 weeks on top.",
        "query": "MATCH (T1:`music_4.music_festival`)-[]-(T2:`music_4.volume`)\nWHERE T2.Weeks_on_Top > 2\nRETURN T1.Date_of_ceremony",
        "db_id": "music_4",
        "answers": [
            [
                "18 February 2011"
            ],
            [
                "18 February 2011"
            ]
        ]
    },
    {
        "question": "Please show the songs that have result \"nominated\" at music festivals.",
        "query": "MATCH (T1:`music_4.music_festival`)-[]-(T2:`music_4.volume`)\nWHERE T1.Result = 'Nominated'\nRETURN T2.Song",
        "db_id": "music_4",
        "answers": [
            [
                " The Way"
            ],
            [
                " Everybody Have Fun Tonight "
            ],
            [
                " With or Without You "
            ],
            [
                " (I Just) Died in Your Arms "
            ],
            [
                " La Isla Bonita "
            ],
            [
                "Looking for a New Love"
            ]
        ]
    },
    {
        "question": "What are the issue dates of volumes associated with the artist \"Gorgoroth\"?",
        "query": "MATCH (T1:`music_4.artist`)-[]-(T2:`music_4.volume`)\nWHERE T1.Artist = 'Gorgoroth'\nRETURN T2.Issue_Date",
        "db_id": "music_4",
        "answers": [
            [
                "27 December 1986 - 10 January"
            ],
            [
                "24 January"
            ],
            [
                "9 May"
            ],
            [
                "16 May - 30 May"
            ]
        ]
    },
    {
        "question": "Return names of songs in volumes that are by artists that are at least 32 years old.",
        "query": "MATCH (T1:`music_4.artist`)-[]-(T2:`music_4.volume`)\nWHERE T1.Age >= 32\nRETURN T2.Song",
        "db_id": "music_4",
        "answers": [
            [
                " The Way"
            ],
            [
                " Walk Like an Egyptian "
            ],
            [
                " With or Without You "
            ],
            [
                " (I Just) Died in Your Arms "
            ],
            [
                " Everybody Have Fun Tonight "
            ],
            [
                " Touch Me (I Want Your Body) "
            ],
            [
                "Head to Toe "
            ],
            [
                "Looking for a New Love"
            ]
        ]
    },
    {
        "question": "What is the average weeks on top of volumes associated with the artist aged 25 or younger?",
        "query": "MATCH (T1:`music_4.artist`)-[]-(T2:`music_4.volume`)\nWHERE T1.Age <= 25\nRETURN avg(T2.Weeks_on_Top)",
        "db_id": "music_4",
        "answers": [
            [
                1.0
            ]
        ]
    },
    {
        "question": "Return the famous titles for artists that have volumes that lasted more than 2 weeks on top.",
        "query": "MATCH (T1:`music_4.artist`)-[]-(T2:`music_4.volume`)\nWHERE T2.Weeks_on_Top > 2\nRETURN T1.Famous_Title",
        "db_id": "music_4",
        "answers": [
            [
                "Bergen 1996"
            ],
            [
                "Bergen 1996"
            ]
        ]
    },
    {
        "question": "Please list the age and famous title of artists in descending order of age.",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN artist.Famous_Title,artist.Age\nORDER BY artist.Age DESC",
        "db_id": "music_4",
        "answers": [
            [
                "Antithesis of All Flesh",
                49
            ],
            [
                "Transmutation",
                35
            ],
            [
                "Unholy Metal Way (re-release)",
                35
            ],
            [
                "Bergen 1996",
                34
            ],
            [
                "Those Who Unleashed (re-release)",
                27
            ],
            [
                "Antievangelistical Process (re-release)",
                22
            ],
            [
                "Imperivm",
                18
            ]
        ]
    },
    {
        "question": "Return the famous release date for the oldest artist.",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN artist.Famous_Release_date\nORDER BY artist.Age DESC\nLIMIT 1",
        "db_id": "music_4",
        "answers": [
            [
                "June 15, 2009"
            ]
        ]
    },
    {
        "question": "Please show the categories of the music festivals and the count.",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nWITH music_festival.Category AS Category, count(music_festival.Category) AS count\nRETURN Category,count",
        "db_id": "music_4",
        "answers": [
            [
                "Best Song",
                5
            ],
            [
                "Best Lyrics",
                3
            ],
            [
                "Best Sound Song",
                1
            ]
        ]
    },
    {
        "question": "Return the result that is most frequent at music festivals.",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nWITH count(music_festival.Result) AS count, music_festival.Result AS Result\nRETURN Result\nORDER BY count DESC\nLIMIT 1",
        "db_id": "music_4",
        "answers": [
            [
                "Nominated"
            ]
        ]
    },
    {
        "question": "Please show the categories of the music festivals with count more than 1.",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nWITH count(*) AS count, music_festival.Category AS Category\nWHERE count  > 1\nRETURN Category",
        "db_id": "music_4",
        "answers": [
            [
                "Best Song"
            ],
            [
                "Best Lyrics"
            ]
        ]
    },
    {
        "question": "Find the famous titles of artists that do not have any volume.",
        "query": "MATCH (artist:`music_4.artist`)\nWHERE NOT (artist:`music_4.artist`)-[]-(:`music_4.volume`)\nRETURN artist.Famous_Title",
        "db_id": "music_4",
        "answers": [
            [
                "Antievangelistical Process (re-release)"
            ],
            [
                "Antithesis of All Flesh"
            ]
        ]
    },
    {
        "question": "What are the date of ceremony of music festivals with category \"Best Song\" and result \"Awarded\"?",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nWHERE music_festival.Category = 'Best Song' AND music_festival.Result = 'Awarded'\nRETURN music_festival.Date_of_ceremony",
        "db_id": "music_4",
        "answers": [
            [
                "18 February 2011"
            ],
            [
                "18 February 2011"
            ]
        ]
    },
    {
        "question": "Return the issue date of the volume that has spent the fewest weeks on top.",
        "query": "MATCH (volume:`music_4.volume`)\nRETURN volume.Issue_Date\nORDER BY volume.Weeks_on_Top ASC\nLIMIT 1",
        "db_id": "music_4",
        "answers": [
            [
                "17 January"
            ]
        ]
    },
    {
        "question": "Please show the results of music festivals and the number of music festivals that have had each, ordered by this count.",
        "query": "MATCH (music_festival:`music_4.music_festival`)\nWITH count(music_festival.Result) AS count, music_festival.Result AS Result\nRETURN Result,count\nORDER BY count DESC",
        "db_id": "music_4",
        "answers": [
            [
                "Nominated",
                6
            ],
            [
                "Awarded",
                3
            ]
        ]
    },
    {
        "question": "What are the issue dates of volumes associated with the artist aged 23 or younger?",
        "query": "MATCH (T1:`music_4.artist`)-[]-(T2:`music_4.volume`)\nWHERE T1.Age <= 23\nRETURN T2.Issue_Date",
        "db_id": "music_4",
        "answers": [
            [
                "6 June"
            ]
        ]
    },
    {
        "question": "Return the issue dates of volumes by artists who are at most 23 years old?",
        "query": "MATCH (T1:`music_4.artist`)-[]-(T2:`music_4.volume`)\nWHERE T1.Age <= 23\nRETURN T2.Issue_Date",
        "db_id": "music_4",
        "answers": [
            [
                "6 June"
            ]
        ]
    },
    {
        "question": "List the names of roller coasters by ascending order of length.",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nRETURN roller_coaster.Name\nORDER BY roller_coaster.Length ASC",
        "db_id": "roller_coaster",
        "answers": [
            [
                "Twister"
            ],
            [
                "Ravine Flyer II"
            ],
            [
                "Boardwalk Bullet"
            ],
            [
                "Dauling Dragon"
            ],
            [
                "Hades 360"
            ],
            [
                "The Voyage"
            ]
        ]
    },
    {
        "question": "List the names of countries whose language is not \"German\".",
        "query": "MATCH (country:`roller_coaster.country`)\nWHERE country.Languages <> 'German'\nRETURN country.Name",
        "db_id": "roller_coaster",
        "answers": [
            [
                "Finland"
            ],
            [
                "Sweden"
            ]
        ]
    },
    {
        "question": "Show the statuses of roller coasters longer than 3300 or higher than 100.",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nWHERE roller_coaster.Length > 3300 OR roller_coaster.Height > 100\nRETURN roller_coaster.Status",
        "db_id": "roller_coaster",
        "answers": [
            [
                "Operating"
            ],
            [
                "Operating"
            ],
            [
                "Operating"
            ],
            [
                "Operating"
            ]
        ]
    },
    {
        "question": "Show the different statuses and the numbers of roller coasters for each status.",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nWITH count(roller_coaster.Status) AS count, roller_coaster.Status AS Status\nRETURN Status,count",
        "db_id": "roller_coaster",
        "answers": [
            [
                "Operating",
                6
            ]
        ]
    },
    {
        "question": "Please show the most common status of roller coasters.",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nWITH count(roller_coaster.Status) AS count, roller_coaster.Status AS Status\nRETURN Status\nORDER BY count DESC\nLIMIT 1",
        "db_id": "roller_coaster",
        "answers": [
            [
                "Operating"
            ]
        ]
    },
    {
        "question": "List the status shared by more than two roller coaster.",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nWITH count(*) AS count, roller_coaster.Status AS Status\nWHERE count  > 2\nRETURN Status",
        "db_id": "roller_coaster",
        "answers": [
            [
                "Operating"
            ]
        ]
    },
    {
        "question": "Show the park of the roller coaster with the highest speed.",
        "query": "MATCH (roller_coaster:`roller_coaster.roller_coaster`)\nRETURN roller_coaster.Park\nORDER BY roller_coaster.Speed DESC\nLIMIT 1",
        "db_id": "roller_coaster",
        "answers": [
            [
                "Mt. Olympus"
            ]
        ]
    },
    {
        "question": "Show the names of roller coasters and names of country they are in.",
        "query": "MATCH (T1:`roller_coaster.country`)-[]-(T2:`roller_coaster.roller_coaster`)\nRETURN T2.Name,T1.Name",
        "db_id": "roller_coaster",
        "answers": [
            [
                "Hades 360",
                "Austria"
            ],
            [
                "Boardwalk Bullet",
                "Austria"
            ],
            [
                "Dauling Dragon",
                "Austria"
            ],
            [
                "Ravine Flyer II",
                "Finland"
            ],
            [
                "Twister",
                "Finland"
            ],
            [
                "The Voyage",
                "Sweden"
            ]
        ]
    },
    {
        "question": "Show the names of countries that have more than one roller coaster.",
        "query": "MATCH (T1:`roller_coaster.country`)-[]-(T2:`roller_coaster.roller_coaster`)\nWITH T1.Name AS Name, count(*) AS count\nWHERE count  > 1\nRETURN Name",
        "db_id": "roller_coaster",
        "answers": [
            [
                "Austria"
            ],
            [
                "Finland"
            ]
        ]
    },
    {
        "question": "Show the name and population of the country that has the highest roller coaster.",
        "query": "MATCH (T1:`roller_coaster.country`)-[]-(T2:`roller_coaster.roller_coaster`)\nRETURN T1.Name,T1.Population\nORDER BY T2.Height DESC\nLIMIT 1",
        "db_id": "roller_coaster",
        "answers": [
            [
                "Sweden",
                9047752
            ]
        ]
    },
    {
        "question": "Count the number of different ranks of captain.",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN count(DISTINCT captain.Rank)",
        "db_id": "ship_1",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "Count the number of captains that have each rank.",
        "query": "MATCH (captain:`ship_1.captain`)\nWITH count(captain.Rank) AS count, captain.Rank AS Rank\nRETURN count,Rank",
        "db_id": "ship_1",
        "answers": [
            [
                4,
                "Midshipman"
            ],
            [
                2,
                "Lieutenant"
            ],
            [
                1,
                "Commander, junior captain"
            ]
        ]
    },
    {
        "question": "Sort all captain names by their ages from old to young.",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN captain.Name\nORDER BY captain.age DESC",
        "db_id": "ship_1",
        "answers": [
            [
                "Captain Gilbert Pears"
            ],
            [
                "Captain Beves Conway"
            ],
            [
                "Lieutenant Montagu Verling"
            ],
            [
                "Lieutenant Hugh Bolitho"
            ],
            [
                "Captain Sir Henry Langford"
            ],
            [
                "Captain Henry Dumaresq"
            ],
            [
                "Commander Richard Bolitho"
            ]
        ]
    },
    {
        "question": "Find the name, class and rank of all captains.",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN captain.Name,captain.Class,captain.Rank",
        "db_id": "ship_1",
        "answers": [
            [
                "Captain Sir Henry Langford",
                "Third-rate ship of the line",
                "Midshipman"
            ],
            [
                "Captain Beves Conway",
                "Third-rate ship of the line",
                "Midshipman"
            ],
            [
                "Lieutenant Hugh Bolitho",
                "Cutter",
                "Midshipman"
            ],
            [
                "Lieutenant Montagu Verling",
                "Armed schooner",
                "Midshipman"
            ],
            [
                "Captain Henry Dumaresq",
                "Frigate",
                "Lieutenant"
            ],
            [
                "Captain Gilbert Pears",
                "Third-rate ship of the line",
                "Lieutenant"
            ],
            [
                "Commander Richard Bolitho",
                "Sloop-of-war",
                "Commander, junior captain"
            ]
        ]
    },
    {
        "question": "Return the rank for which there are the fewest captains.",
        "query": "MATCH (captain:`ship_1.captain`)\nWITH count(captain.Rank) AS count, captain.Rank AS Rank\nRETURN Rank\nORDER BY count DESC\nLIMIT 1",
        "db_id": "ship_1",
        "answers": [
            [
                "Midshipman"
            ]
        ]
    },
    {
        "question": "Give the classes that have more than two captains.",
        "query": "MATCH (captain:`ship_1.captain`)\nWITH count(*) AS count, captain.Class AS Class\nWHERE count  > 2\nRETURN Class",
        "db_id": "ship_1",
        "answers": [
            [
                "Third-rate ship of the line"
            ]
        ]
    },
    {
        "question": "Find the name of captains whose rank are either Midshipman or Lieutenant.",
        "query": "MATCH (captain:`ship_1.captain`)\nWHERE captain.Rank = 'Midshipman' OR captain.Rank = 'Lieutenant'\nRETURN captain.Name",
        "db_id": "ship_1",
        "answers": [
            [
                "Captain Sir Henry Langford"
            ],
            [
                "Captain Beves Conway"
            ],
            [
                "Lieutenant Hugh Bolitho"
            ],
            [
                "Lieutenant Montagu Verling"
            ],
            [
                "Captain Henry Dumaresq"
            ],
            [
                "Captain Gilbert Pears"
            ]
        ]
    },
    {
        "question": "Return the name of the youngest captain.",
        "query": "MATCH (captain:`ship_1.captain`)\nRETURN captain.Name\nORDER BY captain.age\nLIMIT 1",
        "db_id": "ship_1",
        "answers": [
            [
                "Captain Henry Dumaresq"
            ]
        ]
    },
    {
        "question": "Count the number of ships.",
        "query": "MATCH (ship:`ship_1.Ship`)\nRETURN count(*)",
        "db_id": "ship_1",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "question": "Find the name, type, and flag of the ship that is built in the most recent year.",
        "query": "MATCH (ship:`ship_1.Ship`)\nRETURN ship.Name,ship.Type,ship.Flag\nORDER BY ship.Built_Year DESC\nLIMIT 1",
        "db_id": "ship_1",
        "answers": [
            [
                "HMS Gorgon",
                "Panamax",
                "Panama"
            ]
        ]
    },
    {
        "question": "Group by ships by flag, and return number of ships that have each flag.",
        "query": "MATCH (ship:`ship_1.Ship`)\nWITH ship.Flag AS Flag, count(ship.Flag) AS count\nRETURN count,Flag",
        "db_id": "ship_1",
        "answers": [
            [
                8,
                "Panama"
            ],
            [
                1,
                "Malta"
            ]
        ]
    },
    {
        "question": "Return the flag that is most common among all ships.",
        "query": "MATCH (ship:`ship_1.Ship`)\nWITH ship.Flag AS Flag, count(ship.Flag) AS count\nRETURN Flag\nORDER BY count DESC\nLIMIT 1",
        "db_id": "ship_1",
        "answers": [
            [
                "Panama"
            ]
        ]
    },
    {
        "question": "List all ship names in the order of built year and class.",
        "query": "MATCH (ship:`ship_1.Ship`)\nRETURN ship.Name\nORDER BY ship.Built_Year,ship.Class",
        "db_id": "ship_1",
        "answers": [
            [
                "HMS Manxman"
            ],
            [
                "HM Cutter Avenger"
            ],
            [
                "HMS Trojan"
            ],
            [
                "HM Sloop Sparrow"
            ],
            [
                "HMS Phalarope"
            ],
            [
                "HMS Undine"
            ],
            [
                "HMS Gorgon"
            ],
            [
                "HM Schooner Hotspur"
            ],
            [
                "HMS Destiny"
            ]
        ]
    },
    {
        "question": "In which year were most of ships built?",
        "query": "MATCH (ship:`ship_1.Ship`)\nWITH count(ship.Built_Year) AS count, ship.Built_Year AS Built_Year\nRETURN Built_Year\nORDER BY count DESC\nLIMIT 1",
        "db_id": "ship_1",
        "answers": [
            [
                1997.0
            ]
        ]
    },
    {
        "question": "What is the year in which most ships were built?",
        "query": "MATCH (ship:`ship_1.Ship`)\nWITH count(ship.Built_Year) AS count, ship.Built_Year AS Built_Year\nRETURN Built_Year\nORDER BY count DESC\nLIMIT 1",
        "db_id": "ship_1",
        "answers": [
            [
                1997.0
            ]
        ]
    },
    {
        "question": "what are the names and classes of the ships that do not have any captain yet?",
        "query": "MATCH (ship:`ship_1.Ship`)\nWHERE NOT (ship:`ship_1.Ship`)-[]-(:`ship_1.captain`)\nRETURN ship.Name,ship.Class",
        "db_id": "ship_1",
        "answers": [
            [
                "HMS Trojan",
                "KR"
            ],
            [
                "HM Sloop Sparrow",
                "KR"
            ],
            [
                "HMS Phalarope",
                "KR"
            ],
            [
                "HMS Undine",
                "GL"
            ]
        ]
    },
    {
        "question": "Return the names and classes of ships that do not have a captain?",
        "query": "MATCH (ship:`ship_1.Ship`)\nWHERE NOT (ship:`ship_1.Ship`)-[]-(:`ship_1.captain`)\nRETURN ship.Name,ship.Class",
        "db_id": "ship_1",
        "answers": [
            [
                "HMS Trojan",
                "KR"
            ],
            [
                "HM Sloop Sparrow",
                "KR"
            ],
            [
                "HMS Phalarope",
                "KR"
            ],
            [
                "HMS Undine",
                "GL"
            ]
        ]
    },
    {
        "question": "What is id of the city that hosted events in the most recent year?",
        "query": "MATCH (hosting_city:`city_record.hosting_city`)\nRETURN hosting_city.Host_City\nORDER BY hosting_city.Year DESC\nLIMIT 1",
        "db_id": "city_record",
        "answers": [
            [
                "11"
            ]
        ]
    },
    {
        "question": "Find the city that hosted some events in the most recent year. What is the id of this city?",
        "query": "MATCH (hosting_city:`city_record.hosting_city`)\nRETURN hosting_city.Host_City\nORDER BY hosting_city.Year DESC\nLIMIT 1",
        "db_id": "city_record",
        "answers": [
            [
                "11"
            ]
        ]
    },
    {
        "question": "Find the match ids of the cities that hosted competition \"1994 FIFA World Cup qualification\"?",
        "query": "MATCH (match:`city_record.match`)\nWHERE match.Competition = '1994 FIFA World Cup qualification'\nRETURN match.Match_ID",
        "db_id": "city_record",
        "answers": [
            [
                2
            ],
            [
                3
            ],
            [
                4
            ],
            [
                5
            ]
        ]
    },
    {
        "question": "Give me the temperature of Shanghai in January.",
        "query": "MATCH (T1:`city_record.city`)-[]-(T2:`city_record.temperature`)\nWHERE T1.City = 'Shanghai'\nRETURN T2.Jan",
        "db_id": "city_record",
        "answers": [
            [
                17.8
            ]
        ]
    },
    {
        "question": "Which city has the lowest GDP? Please list the city name and its GDP.",
        "query": "MATCH (city:`city_record.city`)\nRETURN city.City,city.GDP\nORDER BY city.GDP\nLIMIT 1",
        "db_id": "city_record",
        "answers": [
            [
                "Jinhua ( Zhejiang )",
                244.77
            ]
        ]
    },
    {
        "question": "Please give me a list of cities whose regional population is over 10000000.",
        "query": "MATCH (city:`city_record.city`)\nWHERE city.Regional_Population > 10000000\nRETURN city.City",
        "db_id": "city_record",
        "answers": [
            [
                "Shanghai"
            ],
            [
                "Suzhou ( Jiangsu )"
            ]
        ]
    },
    {
        "question": "Please give me a list of cities whose regional population is over 8000000 or under 5000000.",
        "query": "MATCH (city:`city_record.city`)\nWHERE city.Regional_Population > 10000000\nRETURN city.City  AS city \nUNION\nMATCH (city:`city_record.city`)\nWHERE city.Regional_Population < 5000000\nRETURN city.City  AS city",
        "db_id": "city_record",
        "answers": [
            [
                "Shanghai"
            ],
            [
                "Suzhou ( Jiangsu )"
            ],
            [
                "Shaoxing ( Zhejiang )"
            ],
            [
                "Changzhou ( Jiangsu )"
            ],
            [
                "Jinhua ( Zhejiang )"
            ],
            [
                "Jiaxing ( Zhejiang )"
            ],
            [
                "Yangzhou ( Jiangsu )"
            ]
        ]
    },
    {
        "question": "Find the number of matches in different competitions.",
        "query": "MATCH (match:`city_record.match`)\nWITH count(match.Competition) AS count, match.Competition AS Competition\nRETURN count,Competition",
        "db_id": "city_record",
        "answers": [
            [
                1,
                "Friendly match"
            ],
            [
                4,
                "1994 FIFA World Cup qualification"
            ],
            [
                1,
                "2002 FIFA World Cup qualification"
            ]
        ]
    },
    {
        "question": "what is the GDP of the city with the largest population.",
        "query": "MATCH (city:`city_record.city`)\nRETURN city.GDP\nORDER BY city.Regional_Population DESC\nLIMIT 1",
        "db_id": "city_record",
        "answers": [
            [
                1919.57
            ]
        ]
    },
    {
        "question": "List all the types of forms.",
        "query": "MATCH (forms:`e_government.Forms`)\nRETURN DISTINCT forms.form_type_code",
        "db_id": "e_government",
        "answers": [
            [
                "Basic"
            ],
            [
                "Complex"
            ]
        ]
    },
    {
        "question": "List all the name of organizations in order of the date formed.",
        "query": "MATCH (organizations:`e_government.Organizations`)\nRETURN organizations.organization_name\nORDER BY organizations.date_formed ASC",
        "db_id": "e_government",
        "answers": [
            [
                "Green Party"
            ],
            [
                "Labour Party"
            ],
            [
                "Plaid Cymru"
            ],
            [
                "Conservative"
            ],
            [
                "Liberal Democrats"
            ]
        ]
    },
    {
        "question": "Find the name of the youngest organization.",
        "query": "MATCH (organizations:`e_government.Organizations`)\nRETURN organizations.organization_name\nORDER BY organizations.date_formed DESC\nLIMIT 1",
        "db_id": "e_government",
        "answers": [
            [
                "Liberal Democrats"
            ]
        ]
    },
    {
        "question": "Count the number of services.",
        "query": "MATCH (services:`e_government.Services`)\nRETURN count(*)",
        "db_id": "e_government",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "How many cities are there in state \"Colorado\"?",
        "query": "MATCH (addresses:`e_government.Addresses`)\nWHERE addresses.state_province_county = 'Colorado'\nRETURN count(*)",
        "db_id": "e_government",
        "answers": [
            [
                1
            ]
        ]
    }
]