[
    {
        "db_id": "book_2",
        "query": "MATCH (publication:`book_2.publication`)\nWHERE publication.Publisher = 'Person' OR publication.Publisher = 'Wiley'\nRETURN publication.Price",
        "question": "Show the prices of publications whose publisher is either \"Person\" or \"Wiley\"",
        "answers": [
            [
                4100000.0
            ],
            [
                3000000.0
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (actor:`musical.actor`)\nRETURN count(*)",
        "question": "Count the number of actors.",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (actor:`musical.actor`)\nRETURN actor.Name\nORDER BY actor.Name ASC",
        "question": "List the name of actors in ascending alphabetical order.",
        "answers": [
            [
                "Alan Fletcher"
            ],
            [
                "Ian Smith"
            ],
            [
                "Jackie Woodburne"
            ],
            [
                "Kate Ritchie"
            ],
            [
                "Lynne McGranger"
            ],
            [
                "Ray Meagher"
            ],
            [
                "Ryan Moloney"
            ],
            [
                "Stefan Dennis"
            ],
            [
                "Tom Oliver"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (actor:`musical.actor`)\nRETURN actor.Character,actor.Duration",
        "question": "Return the characters and durations for each actor.",
        "answers": [
            [
                "Alf Stewart",
                "1988\u2014"
            ],
            [
                "Lou Carpenter",
                "1988, 1992\u2014"
            ],
            [
                "Irene Roberts",
                "1993\u2014"
            ],
            [
                "Sally Fletcher",
                "1988\u20132008, 2013"
            ],
            [
                "Karl Kennedy",
                "1994\u2014"
            ],
            [
                "Susan Kennedy",
                "1994\u2014"
            ],
            [
                "Toadfish Rebecchi",
                "1995, 1996\u2014"
            ],
            [
                "Harold Bishop",
                "1987\u20131991, 1996\u20132009, 2011"
            ],
            [
                "Paul Robinson",
                "1985\u20131992, 1993, 2004\u2014"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (actor:`musical.actor`)\nWHERE actor.age <> 20\nRETURN actor.Name",
        "question": "List the name of actors whose age is not 20.",
        "answers": [
            [
                "Ray Meagher"
            ],
            [
                "Tom Oliver"
            ],
            [
                "Lynne McGranger"
            ],
            [
                "Ryan Moloney"
            ],
            [
                "Ian Smith"
            ],
            [
                "Stefan Dennis"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (actor:`musical.actor`)\nRETURN actor.Character\nORDER BY actor.age DESC",
        "question": "Return the characters for actors, ordered by age descending.",
        "answers": [
            [
                "Alf Stewart"
            ],
            [
                "Lou Carpenter"
            ],
            [
                "Irene Roberts"
            ],
            [
                "Sally Fletcher"
            ],
            [
                "Karl Kennedy"
            ],
            [
                "Susan Kennedy"
            ],
            [
                "Toadfish Rebecchi"
            ],
            [
                "Harold Bishop"
            ],
            [
                "Paul Robinson"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (actor:`musical.actor`)\nRETURN actor.Duration\nORDER BY actor.age DESC\nLIMIT 1",
        "question": "Return the duration of the actor with the greatest age.",
        "answers": [
            [
                "1988\u2014"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (musical:`musical.musical`)\nWHERE musical.Nominee = 'Bob Fosse'\nRETURN musical.Name",
        "question": "What are the names of musicals with nominee \"Bob Fosse\"?",
        "answers": [
            [
                "The Phantom of the Opera"
            ],
            [
                "Wicked"
            ],
            [
                "West Side Story"
            ],
            [
                "The Book of Mormon"
            ],
            [
                "Chicago"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (musical:`musical.musical`)\nWHERE musical.Nominee = 'Bob Fosse'\nRETURN musical.Name",
        "question": "Return the names of musicals who have the nominee Bob Fosse.",
        "answers": [
            [
                "The Phantom of the Opera"
            ],
            [
                "Wicked"
            ],
            [
                "West Side Story"
            ],
            [
                "The Book of Mormon"
            ],
            [
                "Chicago"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (musical:`musical.musical`)\nWHERE musical.Award <> 'Tony Award'\nRETURN DISTINCT musical.Nominee",
        "question": "What are the distinct nominees of the musicals with the award that is not \"Tony Award\"?",
        "answers": [
            [
                "Cleavant Derricks"
            ],
            [
                "Bob Fosse"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (musical:`musical.musical`)\nWHERE musical.Award <> 'Tony Award'\nRETURN DISTINCT musical.Nominee",
        "question": "Return the different nominees of musicals that have an award that is not the Tony Award.",
        "answers": [
            [
                "Cleavant Derricks"
            ],
            [
                "Bob Fosse"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nRETURN T1.Name,T2.Name",
        "question": "Show names of actors and names of musicals they are in.",
        "answers": [
            [
                "Ray Meagher",
                "The Phantom of the Opera"
            ],
            [
                "Tom Oliver",
                "The Phantom of the Opera"
            ],
            [
                "Lynne McGranger",
                "Les Mis\u00e9rables"
            ],
            [
                "Kate Ritchie",
                "Les Mis\u00e9rables"
            ],
            [
                "Alan Fletcher",
                "West Side Story"
            ],
            [
                "Jackie Woodburne",
                "The Book of Mormon"
            ],
            [
                "Ryan Moloney",
                "The Book of Mormon"
            ],
            [
                "Ian Smith",
                "The Book of Mormon"
            ],
            [
                "Stefan Dennis",
                "The Book of Mormon"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nRETURN T1.Name,T2.Name",
        "question": "What are the names of actors and the musicals that they are in?",
        "answers": [
            [
                "Ray Meagher",
                "The Phantom of the Opera"
            ],
            [
                "Tom Oliver",
                "The Phantom of the Opera"
            ],
            [
                "Lynne McGranger",
                "Les Mis\u00e9rables"
            ],
            [
                "Kate Ritchie",
                "Les Mis\u00e9rables"
            ],
            [
                "Alan Fletcher",
                "West Side Story"
            ],
            [
                "Jackie Woodburne",
                "The Book of Mormon"
            ],
            [
                "Ryan Moloney",
                "The Book of Mormon"
            ],
            [
                "Ian Smith",
                "The Book of Mormon"
            ],
            [
                "Stefan Dennis",
                "The Book of Mormon"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nWHERE T2.Name = 'The Phantom of the Opera'\nRETURN T1.Name",
        "question": "Show names of actors that have appeared in musical with name \"The Phantom of the Opera\".",
        "answers": [
            [
                "Ray Meagher"
            ],
            [
                "Tom Oliver"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nWHERE T2.Name = 'The Phantom of the Opera'\nRETURN T1.Name",
        "question": "What are the names of actors who have been in the musical titled The Phantom of the Opera?",
        "answers": [
            [
                "Ray Meagher"
            ],
            [
                "Tom Oliver"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nRETURN T1.Name\nORDER BY T2.Year DESC",
        "question": "Show names of actors in descending order of the year their musical is awarded.",
        "answers": [
            [
                "Ray Meagher"
            ],
            [
                "Tom Oliver"
            ],
            [
                "Lynne McGranger"
            ],
            [
                "Kate Ritchie"
            ],
            [
                "Alan Fletcher"
            ],
            [
                "Jackie Woodburne"
            ],
            [
                "Ryan Moloney"
            ],
            [
                "Ian Smith"
            ],
            [
                "Stefan Dennis"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nRETURN T1.Name\nORDER BY T2.Year DESC",
        "question": "What are the names of actors ordered descending by the year in which their musical was awarded?",
        "answers": [
            [
                "Ray Meagher"
            ],
            [
                "Tom Oliver"
            ],
            [
                "Lynne McGranger"
            ],
            [
                "Kate Ritchie"
            ],
            [
                "Alan Fletcher"
            ],
            [
                "Jackie Woodburne"
            ],
            [
                "Ryan Moloney"
            ],
            [
                "Ian Smith"
            ],
            [
                "Stefan Dennis"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nRETURN T2.Name,count(*)",
        "question": "Show names of musicals and the number of actors who have appeared in the musicals.",
        "answers": [
            [
                "The Phantom of the Opera",
                2
            ],
            [
                "Les Mis\u00e9rables",
                2
            ],
            [
                "West Side Story",
                1
            ],
            [
                "The Book of Mormon",
                4
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nRETURN T2.Name,count(*)",
        "question": "How many actors have appeared in each musical?",
        "answers": [
            [
                "The Phantom of the Opera",
                2
            ],
            [
                "Les Mis\u00e9rables",
                2
            ],
            [
                "West Side Story",
                1
            ],
            [
                "The Book of Mormon",
                4
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nWITH T2.Name AS Name, count(*) AS count\nWHERE count  >= 3\nRETURN Name",
        "question": "Show names of musicals which have at least three actors.",
        "answers": [
            [
                "The Book of Mormon"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nWITH T2.Name AS Name, count(*) AS count\nWHERE count  >= 3\nRETURN Name",
        "question": "What are the names of musicals who have at 3 or more actors?",
        "answers": [
            [
                "The Book of Mormon"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (musical:`musical.musical`)\nRETURN musical.Nominee,count(*)",
        "question": "Show different nominees and the number of musicals they have been nominated.",
        "answers": [
            [
                "Bob Fosse",
                5
            ],
            [
                "Cleavant Derricks",
                2
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (musical:`musical.musical`)\nWITH count(*) AS count, musical.Nominee AS Nominee\nWHERE count  > 2\nRETURN Nominee",
        "question": "List the nominees that have been nominated more than two musicals.",
        "answers": [
            [
                "Bob Fosse"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (musical:`musical.musical`)\nWHERE NOT (musical)-[]-(:`musical.actor`)    \nRETURN musical.Name",
        "question": "List the name of musicals that do not have actors.",
        "answers": [
            [
                "Wicked"
            ],
            [
                "Rent"
            ],
            [
                "Chicago"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (musical:`musical.musical`)\nWHERE NOT (musical)-[]-(:`musical.actor`)    \nRETURN musical.Name",
        "question": "What are the names of musicals who have no actors?",
        "answers": [
            [
                "Wicked"
            ],
            [
                "Rent"
            ],
            [
                "Chicago"
            ]
        ]
    },
    {
        "db_id": "musical",
        "query": "MATCH (musical:`musical.musical`)\nWHERE musical.Award = 'Tony Award' OR musical.Award = 'Cleavant Derricks'\nRETURN musical.Nominee",
        "question": "Show the musical nominee with award \"Bob Fosse\" or \"Cleavant Derricks\".",
        "answers": [
            [
                "Bob Fosse"
            ],
            [
                "Cleavant Derricks"
            ],
            [
                "Bob Fosse"
            ],
            [
                "Bob Fosse"
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nWHERE user_profiles.name = 'Mary'\nRETURN user_profiles.email",
        "question": "Find the emails of the user named \"Mary\".",
        "answers": [
            [
                "Mary@yale.edu"
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nWHERE user_profiles.name = 'Iron Man'\nRETURN user_profiles.partitionid",
        "question": "What is the partition id of the user named \"Iron Man\".",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nRETURN count(*)",
        "question": "How many users are there?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (tweets:`twitter_1.tweets`)\nRETURN count(*)",
        "question": "Find the number of tweets in record.",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (tweets:`twitter_1.tweets`)\nRETURN count(DISTINCT tweets.uid)",
        "question": "Find the number of users who posted some tweets.",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nWHERE user_profiles.name =~'.*[S|s]wift.*'\nRETURN user_profiles.name,user_profiles.email",
        "question": "Find the name and email of the user whose name contains the word \u2018Swift\u2019.",
        "answers": [
            [
                "Tyler Swift",
                "ts@superstar.com\n"
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (tweets:`twitter_1.tweets`)\nWHERE tweets.text =~'.*[I|i]ntern.*'\nRETURN tweets.text",
        "question": "Return the text of tweets about the topic 'intern'.",
        "answers": [
            [
                "My company is hiring interns."
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nWHERE user_profiles.followers > 1000\nRETURN user_profiles.name,user_profiles.email",
        "question": "Find the name and email of the users who have more than 1000 followers.",
        "answers": [
            [
                "Iron Man",
                "ts@richest.com"
            ],
            [
                "Black Widow\n",
                "bw@superhero.com"
            ],
            [
                "Tyler Swift",
                "ts@superstar.com\n"
            ],
            [
                "Celine Dion",
                "cd@superstar.com"
            ],
            [
                "Natalie Portman",
                "np@superstar.com"
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (T1:`twitter_1.user_profiles`)-[]-(T2:`twitter_1.tweets`)\nWITH T1.name AS name, count(*) AS count\nWHERE count  > 1\nRETURN name",
        "question": "Find the names of users who have more than one tweet.",
        "answers": [
            [
                "Iron Man"
            ],
            [
                "Susan"
            ],
            [
                "Celine Dion"
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nRETURN user_profiles.name\nORDER BY user_profiles.followers DESC\nLIMIT 1",
        "question": "Find the name of the user who has the largest number of followers.",
        "answers": [
            [
                "Tyler Swift"
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nRETURN user_profiles.name,user_profiles.email\nORDER BY user_profiles.followers\nLIMIT 1",
        "question": "Find the name and email of the user followed by the least number of people.",
        "answers": [
            [
                "Susan",
                "susan@gmail.com\n"
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nRETURN user_profiles.name,user_profiles.followers\nORDER BY user_profiles.followers DESC",
        "question": "List the name and number of followers for each user, and sort the results by the number of followers in descending order.",
        "answers": [
            [
                "Tyler Swift",
                99999998
            ],
            [
                "Natalie Portman",
                94375428
            ],
            [
                "Black Widow\n",
                35425845
            ],
            [
                "Celine Dion",
                23927492
            ],
            [
                "Iron Man",
                6662425
            ],
            [
                "Mary",
                890
            ],
            [
                "Susan",
                100
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nRETURN user_profiles.name\nORDER BY user_profiles.followers DESC\nLIMIT 5",
        "question": "List the names of 5 users followed by the largest number of other users.",
        "answers": [
            [
                "Tyler Swift"
            ],
            [
                "Natalie Portman"
            ],
            [
                "Black Widow\n"
            ],
            [
                "Celine Dion"
            ],
            [
                "Iron Man"
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (tweets:`twitter_1.tweets`)\nRETURN tweets.text\nORDER BY tweets.createdate",
        "question": "List the text of all tweets in the order of date.",
        "answers": [
            [
                "Hello I'm Tony Stark."
            ],
            [
                "Today I have went shopping at Laffayette."
            ],
            [
                "My company is hiring interns."
            ],
            [
                "Oh, I only have a few fans."
            ],
            [
                "Let\u2019s celebrate women, fight for equality and support each other,  not just today, but everyday!"
            ],
            [
                "I love my new boyfriend."
            ],
            [
                "I feel tired and don't want to write SQLs."
            ],
            [
                "I had a pretty rough time during the last couple of weeks"
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (T1:`twitter_1.user_profiles`)-[]-(T2:`twitter_1.tweets`)\nRETURN T1.name,count(*)",
        "question": "Find the name of each user and number of tweets tweeted by each of them.",
        "answers": [
            [
                "Iron Man",
                2
            ],
            [
                "Black Widow\n",
                1
            ],
            [
                "Susan",
                2
            ],
            [
                "Celine Dion",
                2
            ],
            [
                "Tyler Swift",
                1
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (T1:`twitter_1.user_profiles`)-[]-(T2:`twitter_1.tweets`)\nWITH T1.name AS name, count(*) AS count, T1.partitionid AS partitionid\nWHERE count  < 2\nRETURN name,partitionid",
        "question": "Find the name and partition id for users who tweeted less than twice.",
        "answers": [
            [
                "Black Widow\n",
                23
            ],
            [
                "Tyler Swift",
                10
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (T1:`twitter_1.user_profiles`)-[]-(T2:`twitter_1.tweets`)\nWITH T1.name AS name, count(*) AS count\nWHERE count  > 1\nRETURN name,count",
        "question": "Find the name of the user who tweeted more than once, and number of tweets tweeted by them.",
        "answers": [
            [
                "Iron Man",
                2
            ],
            [
                "Susan",
                2
            ],
            [
                "Celine Dion",
                2
            ]
        ]
    },
    {
        "db_id": "twitter_1",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nWHERE NOT (user_profiles)-[]-(:`twitter_1.tweets`)    \nRETURN avg(user_profiles.followers)",
        "question": "Find the average number of followers for the users who do not have any tweet.",
        "answers": [
            [
                47188159.0
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nRETURN DISTINCT catalog_contents.catalog_entry_name",
        "question": "Find the names of all the catalog entries.",
        "answers": [
            [
                "Cola"
            ],
            [
                "Root beer"
            ],
            [
                "Cream Soda"
            ],
            [
                "Carbonated Water"
            ],
            [
                "Ginger Beer"
            ],
            [
                "Tizer"
            ],
            [
                "Vimto"
            ],
            [
                "Ramune"
            ],
            [
                "Sprite Lemo"
            ],
            [
                "Dr Pepper"
            ],
            [
                "Diet Pepsi"
            ],
            [
                "Diet Mountain Dew"
            ],
            [
                "Mountain Dew"
            ],
            [
                "Fenta Orange"
            ],
            [
                "Wanglaoji"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (attribute_definitions:`product_catalog.Attribute_Definitions`)\nWITH attribute_definitions.attribute_data_type AS attribute_data_type, count(*) AS count\nWHERE count  > 3\nRETURN attribute_data_type",
        "question": "Find the list of attribute data types possessed by more than 3 attribute definitions.",
        "answers": [
            [
                "Bool"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalog_structure:`product_catalog.Catalog_Structure`)\nWHERE 5<=catalog_structure.catalog_level_number<=10\nRETURN catalog_structure.catalog_level_name,catalog_structure.catalog_level_number",
        "question": "Find the name and level of catalog structure with level between 5 and 10.",
        "answers": [
            [
                "Sub-Category",
                8
            ],
            [
                "Product",
                9
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalogs:`product_catalog.Catalogs`)\nRETURN catalogs.catalog_publisher\nORDER BY catalogs.catalog_publisher DESC\nLIMIT 1",
        "question": "Which catalog publisher has published the most catalogs?",
        "answers": [
            [
                "Russel-Gislason Lemon shop"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalogs:`product_catalog.Catalogs`)\nRETURN catalogs.catalog_publisher\nORDER BY catalogs.catalog_publisher DESC\nLIMIT 1",
        "question": "Find the catalog publisher that has the most catalogs.",
        "answers": [
            [
                "Russel-Gislason Lemon shop"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (t1:`product_catalog.Catalogs`)-[]-(t2:`product_catalog.Catalog_Structure`)\nWHERE t2.catalog_level_number > 5\nRETURN t1.catalog_name,t1.date_of_publication",
        "question": "Find the names and publication dates of all catalogs that have catalog level number greater than 5.",
        "answers": [
            [
                "Coffee Bean",
                "2012-04-13 06:37:09"
            ],
            [
                "Jam",
                "2011-07-22 04:57:19"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (t1:`product_catalog.Catalogs`)-[]-(t2:`product_catalog.Catalog_Structure`)\nWHERE t2.catalog_level_number > 5\nRETURN t1.catalog_name,t1.date_of_publication",
        "question": "What are the name and publication date of the catalogs with catalog level number above 5?",
        "answers": [
            [
                "Coffee Bean",
                "2012-04-13 06:37:09"
            ],
            [
                "Jam",
                "2011-07-22 04:57:19"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nRETURN catalog_contents.catalog_entry_name\nORDER BY catalog_contents.price_in_dollars DESC\nLIMIT 1",
        "question": "Find the entry name of the catalog with the highest price (in USD).",
        "answers": [
            [
                "Sprite Lemo"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (t1:`product_catalog.Catalog_Contents`)-[]-(t2:`product_catalog.Catalog_Structure`)\nRETURN t2.catalog_level_name\nORDER BY t1.price_in_dollars\nLIMIT 1",
        "question": "Find the level name of the catalog with the lowest price (in USD).",
        "answers": [
            [
                "Category"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nRETURN catalog_contents.catalog_entry_name\nORDER BY catalog_contents.height DESC\nLIMIT 1",
        "question": "What is the product with the highest height? Give me the catalog entry name.",
        "answers": [
            [
                "Cola"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nRETURN catalog_contents.catalog_entry_name\nORDER BY catalog_contents.height DESC\nLIMIT 1",
        "question": "Which catalog content has the highest height? Give me the catalog entry name.",
        "answers": [
            [
                "Cola"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nRETURN catalog_contents.catalog_entry_name\nORDER BY catalog_contents.capacity ASC\nLIMIT 1",
        "question": "Find the name of the product that has the smallest capacity.",
        "answers": [
            [
                "Cola"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (catalog_contents:`product_catalog.Catalog_Contents`)\nRETURN catalog_contents.catalog_entry_name\nORDER BY catalog_contents.capacity ASC\nLIMIT 1",
        "question": "Which catalog content has the smallest capacity? Return the catalog entry name.",
        "answers": [
            [
                "Cola"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (t1:`product_catalog.Catalog_Contents`)-[t2:`product_catalog.Catalog_Contents_Additional_Attributes`]-()\nWHERE t2.catalog_level_number = 8\nRETURN t1.catalog_entry_name",
        "question": "Find the names of catalog entries with level number 8.",
        "answers": [
            [
                "Cola"
            ],
            [
                "Root beer"
            ],
            [
                "Carbonated Water"
            ],
            [
                "Ginger Beer"
            ]
        ]
    },
    {
        "db_id": "product_catalog",
        "query": "MATCH (t1:`product_catalog.Catalog_Contents`)-[t2:`product_catalog.Catalog_Contents_Additional_Attributes`]-()\nWHERE t2.catalog_level_number = 8\nRETURN t1.catalog_entry_name",
        "question": "What are the names of catalog entries with level number 8?",
        "answers": [
            [
                "Cola"
            ],
            [
                "Root beer"
            ],
            [
                "Carbonated Water"
            ],
            [
                "Ginger Beer"
            ]
        ]
    }
]