[
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN student.Fname,student.LName",
        "question": "What are the full names of all students",
        "answers": [
            [
                "Linda",
                "Smith"
            ],
            [
                "Tracy",
                "Kim"
            ],
            [
                "Shiela",
                "Jones"
            ],
            [
                "Dinesh",
                "Kumar"
            ],
            [
                "Paul",
                "Gompers"
            ],
            [
                "Andy",
                "Schultz"
            ],
            [
                "Lisa",
                "Apap"
            ],
            [
                "Jandy",
                "Nelson"
            ],
            [
                "Eric",
                "Tai"
            ],
            [
                "Derek",
                "Lee"
            ],
            [
                "David",
                "Adams"
            ],
            [
                "Steven",
                "Davis"
            ],
            [
                "Charles",
                "Norris"
            ],
            [
                "Susan",
                "Lee"
            ],
            [
                "Mark",
                "Schwartz"
            ],
            [
                "Bruce",
                "Wilson"
            ],
            [
                "Michael",
                "Leighton"
            ],
            [
                "Arthur",
                "Pang"
            ],
            [
                "Ian",
                "Thornton"
            ],
            [
                "George",
                "Andreou"
            ],
            [
                "Michael",
                "Woods"
            ],
            [
                "David",
                "Shieber"
            ],
            [
                "Stacy",
                "Prater"
            ],
            [
                "Mark",
                "Goldman"
            ],
            [
                "Eric",
                "Pang"
            ],
            [
                "Paul",
                "Brody"
            ],
            [
                "Eric",
                "Rugh"
            ],
            [
                "Jun",
                "Han"
            ],
            [
                "Lisa",
                "Cheng"
            ],
            [
                "Sarah",
                "Smith"
            ],
            [
                "Eric",
                "Brown"
            ],
            [
                "William",
                "Simms"
            ],
            [
                "Eric",
                "Epp"
            ],
            [
                "Sarah",
                "Schmidt"
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN count(DISTINCT student.Advisor)",
        "question": "How many different advisors are listed?",
        "answers": [
            [
                18
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN count(DISTINCT student.Advisor)",
        "question": "How many advisors are there?",
        "answers": [
            [
                18
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN DISTINCT student.Major",
        "question": "Show all majors.",
        "answers": [
            [
                600
            ],
            [
                520
            ],
            [
                540
            ],
            [
                550
            ],
            [
                100
            ],
            [
                50
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN DISTINCT student.Major",
        "question": "What are the different majors?",
        "answers": [
            [
                600
            ],
            [
                520
            ],
            [
                540
            ],
            [
                550
            ],
            [
                100
            ],
            [
                50
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN DISTINCT student.city_code",
        "question": "Show all cities where students live.",
        "answers": [
            [
                "BAL"
            ],
            [
                "HKG"
            ],
            [
                "WAS"
            ],
            [
                "CHI"
            ],
            [
                "YYZ"
            ],
            [
                "PIT"
            ],
            [
                "HOU"
            ],
            [
                "PHL"
            ],
            [
                "DAL"
            ],
            [
                "DET"
            ],
            [
                "LON"
            ],
            [
                "NYC"
            ],
            [
                "LOS"
            ],
            [
                "ROC"
            ],
            [
                "PEK"
            ],
            [
                "SFO"
            ],
            [
                "ATL"
            ],
            [
                "NAR"
            ],
            [
                "BOS"
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN DISTINCT student.city_code",
        "question": "What cities do students live in?",
        "answers": [
            [
                "BAL"
            ],
            [
                "HKG"
            ],
            [
                "WAS"
            ],
            [
                "CHI"
            ],
            [
                "YYZ"
            ],
            [
                "PIT"
            ],
            [
                "HOU"
            ],
            [
                "PHL"
            ],
            [
                "DAL"
            ],
            [
                "DET"
            ],
            [
                "LON"
            ],
            [
                "NYC"
            ],
            [
                "LOS"
            ],
            [
                "ROC"
            ],
            [
                "PEK"
            ],
            [
                "SFO"
            ],
            [
                "ATL"
            ],
            [
                "NAR"
            ],
            [
                "BOS"
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.Sex = 'F'\nRETURN student.Fname,student.LName,student.Age",
        "question": "Show first name, last name, age for all female students. Their sex is F.",
        "answers": [
            [
                "Linda",
                "Smith",
                18
            ],
            [
                "Tracy",
                "Kim",
                19
            ],
            [
                "Shiela",
                "Jones",
                21
            ],
            [
                "Lisa",
                "Apap",
                18
            ],
            [
                "Jandy",
                "Nelson",
                20
            ],
            [
                "Susan",
                "Lee",
                16
            ],
            [
                "Stacy",
                "Prater",
                18
            ],
            [
                "Lisa",
                "Cheng",
                21
            ],
            [
                "Sarah",
                "Smith",
                20
            ],
            [
                "Sarah",
                "Schmidt",
                26
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.Sex = 'F'\nRETURN student.Fname,student.LName,student.Age",
        "question": "What are the full names and ages for all female students whose sex is F?",
        "answers": [
            [
                "Linda",
                "Smith",
                18
            ],
            [
                "Tracy",
                "Kim",
                19
            ],
            [
                "Shiela",
                "Jones",
                21
            ],
            [
                "Lisa",
                "Apap",
                18
            ],
            [
                "Jandy",
                "Nelson",
                20
            ],
            [
                "Susan",
                "Lee",
                16
            ],
            [
                "Stacy",
                "Prater",
                18
            ],
            [
                "Lisa",
                "Cheng",
                21
            ],
            [
                "Sarah",
                "Smith",
                20
            ],
            [
                "Sarah",
                "Schmidt",
                26
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.Sex = 'M'\nRETURN student.StuID",
        "question": "Show student ids for all male students.",
        "answers": [
            [
                1004
            ],
            [
                1005
            ],
            [
                1006
            ],
            [
                1009
            ],
            [
                1010
            ],
            [
                1011
            ],
            [
                1012
            ],
            [
                1014
            ],
            [
                1016
            ],
            [
                1017
            ],
            [
                1018
            ],
            [
                1019
            ],
            [
                1020
            ],
            [
                1021
            ],
            [
                1022
            ],
            [
                1023
            ],
            [
                1025
            ],
            [
                1026
            ],
            [
                1027
            ],
            [
                1028
            ],
            [
                1029
            ],
            [
                1032
            ],
            [
                1033
            ],
            [
                1034
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.Sex = 'M'\nRETURN student.StuID",
        "question": "What are the student ids for all male students?",
        "answers": [
            [
                1004
            ],
            [
                1005
            ],
            [
                1006
            ],
            [
                1009
            ],
            [
                1010
            ],
            [
                1011
            ],
            [
                1012
            ],
            [
                1014
            ],
            [
                1016
            ],
            [
                1017
            ],
            [
                1018
            ],
            [
                1019
            ],
            [
                1020
            ],
            [
                1021
            ],
            [
                1022
            ],
            [
                1023
            ],
            [
                1025
            ],
            [
                1026
            ],
            [
                1027
            ],
            [
                1028
            ],
            [
                1029
            ],
            [
                1032
            ],
            [
                1033
            ],
            [
                1034
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.Age = 18\nRETURN count(*)",
        "question": "How many students are age 18?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.Age = 18\nRETURN count(*)",
        "question": "How many students are 18 years old?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.Age > 20\nRETURN student.StuID",
        "question": "Show all student ids who are older than 20.",
        "answers": [
            [
                1003
            ],
            [
                1005
            ],
            [
                1011
            ],
            [
                1017
            ],
            [
                1020
            ],
            [
                1030
            ],
            [
                1035
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.Age > 20\nRETURN student.StuID",
        "question": "What are the student ids for students over 20 years old?",
        "answers": [
            [
                1003
            ],
            [
                1005
            ],
            [
                1011
            ],
            [
                1017
            ],
            [
                1020
            ],
            [
                1030
            ],
            [
                1035
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.StuID = 1004\nRETURN student.Advisor",
        "question": "Who is the advisor of student with ID 1004?",
        "answers": [
            [
                8423
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.StuID = 1004\nRETURN student.Advisor",
        "question": "Who advises student 1004?",
        "answers": [
            [
                8423
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWITH min(student.Age) AS age\nMATCH (student:`allergy_1.Student`)\nWHERE  student.Age =  age \nRETURN student.LName",
        "question": "What is the last name of the youngest student?",
        "answers": [
            [
                "Lee"
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWITH min(student.Age) AS age\nMATCH (student:`allergy_1.Student`)\nWHERE  student.Age =  age \nRETURN student.LName",
        "question": "Provide the last name of the youngest student.",
        "answers": [
            [
                "Lee"
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWITH max(student.Age) AS age\nMATCH (student:`allergy_1.Student`)\nWHERE  student.Age =  age \nRETURN student.StuID",
        "question": "Show the student id of the oldest student.",
        "answers": [
            [
                1017
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nWITH max(student.Age) AS age\nMATCH (student:`allergy_1.Student`)\nWHERE  student.Age =  age \nRETURN student.StuID",
        "question": "What student id corresponds to the oldest student?",
        "answers": [
            [
                1017
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN student.Major,count(*)",
        "question": "Show all majors and corresponding number of students.",
        "answers": [
            [
                600,
                18
            ],
            [
                520,
                6
            ],
            [
                540,
                2
            ],
            [
                550,
                5
            ],
            [
                100,
                1
            ],
            [
                50,
                2
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN student.Major,count(*)",
        "question": "How many students are there for each major?",
        "answers": [
            [
                600,
                18
            ],
            [
                520,
                6
            ],
            [
                540,
                2
            ],
            [
                550,
                5
            ],
            [
                100,
                1
            ],
            [
                50,
                2
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN student.Major\nORDER BY student.Major DESC\nLIMIT 1",
        "question": "Which major has most number of students?",
        "answers": [
            [
                600
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN student.Major\nORDER BY student.Major DESC\nLIMIT 1",
        "question": "What is the largest major?",
        "answers": [
            [
                600
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN student.Age,count(*)",
        "question": "Show all ages and corresponding number of students.",
        "answers": [
            [
                18,
                10
            ],
            [
                19,
                4
            ],
            [
                21,
                2
            ],
            [
                20,
                8
            ],
            [
                26,
                2
            ],
            [
                17,
                4
            ],
            [
                22,
                2
            ],
            [
                16,
                1
            ],
            [
                27,
                1
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN student.Age,count(*)",
        "question": "How old is each student and how many students are each age?",
        "answers": [
            [
                18,
                10
            ],
            [
                19,
                4
            ],
            [
                21,
                2
            ],
            [
                20,
                8
            ],
            [
                26,
                2
            ],
            [
                17,
                4
            ],
            [
                22,
                2
            ],
            [
                16,
                1
            ],
            [
                27,
                1
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN student.city_code,count(*)",
        "question": "Show all cities and corresponding number of students.",
        "answers": [
            [
                "BAL",
                4
            ],
            [
                "HKG",
                3
            ],
            [
                "WAS",
                3
            ],
            [
                "CHI",
                1
            ],
            [
                "YYZ",
                2
            ],
            [
                "PIT",
                4
            ],
            [
                "HOU",
                1
            ],
            [
                "PHL",
                3
            ],
            [
                "DAL",
                1
            ],
            [
                "DET",
                1
            ],
            [
                "LON",
                1
            ],
            [
                "NYC",
                3
            ],
            [
                "LOS",
                1
            ],
            [
                "ROC",
                1
            ],
            [
                "PEK",
                1
            ],
            [
                "SFO",
                1
            ],
            [
                "ATL",
                1
            ],
            [
                "NAR",
                1
            ],
            [
                "BOS",
                1
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN student.city_code,count(*)",
        "question": "How many students live in each city?",
        "answers": [
            [
                "BAL",
                4
            ],
            [
                "HKG",
                3
            ],
            [
                "WAS",
                3
            ],
            [
                "CHI",
                1
            ],
            [
                "YYZ",
                2
            ],
            [
                "PIT",
                4
            ],
            [
                "HOU",
                1
            ],
            [
                "PHL",
                3
            ],
            [
                "DAL",
                1
            ],
            [
                "DET",
                1
            ],
            [
                "LON",
                1
            ],
            [
                "NYC",
                3
            ],
            [
                "LOS",
                1
            ],
            [
                "ROC",
                1
            ],
            [
                "PEK",
                1
            ],
            [
                "SFO",
                1
            ],
            [
                "ATL",
                1
            ],
            [
                "NAR",
                1
            ],
            [
                "BOS",
                1
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN student.Advisor,count(*)",
        "question": "Show all advisors and corresponding number of students.",
        "answers": [
            [
                1121,
                3
            ],
            [
                7712,
                1
            ],
            [
                7792,
                1
            ],
            [
                8423,
                1
            ],
            [
                1148,
                3
            ],
            [
                8918,
                1
            ],
            [
                9172,
                1
            ],
            [
                2192,
                4
            ],
            [
                7723,
                1
            ],
            [
                8741,
                1
            ],
            [
                8721,
                1
            ],
            [
                7271,
                2
            ],
            [
                8722,
                3
            ],
            [
                7134,
                2
            ],
            [
                8723,
                1
            ],
            [
                2311,
                3
            ],
            [
                8772,
                3
            ],
            [
                5718,
                2
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN student.Advisor,count(*)",
        "question": "How many students does each advisor have?",
        "answers": [
            [
                1121,
                3
            ],
            [
                7712,
                1
            ],
            [
                7792,
                1
            ],
            [
                8423,
                1
            ],
            [
                1148,
                3
            ],
            [
                8918,
                1
            ],
            [
                9172,
                1
            ],
            [
                2192,
                4
            ],
            [
                7723,
                1
            ],
            [
                8741,
                1
            ],
            [
                8721,
                1
            ],
            [
                7271,
                2
            ],
            [
                8722,
                3
            ],
            [
                7134,
                2
            ],
            [
                8723,
                1
            ],
            [
                2311,
                3
            ],
            [
                8772,
                3
            ],
            [
                5718,
                2
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (T2:`allergy_1.Allergy_Type`)-[T1:`allergy_1.Has_Allergy`]-()\nWHERE T2.AllergyType = 'food'\nRETURN count(*)",
        "question": "How many students have a food allergy?",
        "answers": [
            [
                28
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (T2:`allergy_1.Allergy_Type`)-[T1:`allergy_1.Has_Allergy`]-()\nWHERE T2.AllergyType = 'food'\nRETURN count(*)",
        "question": "How many students are affected by food related allergies?",
        "answers": [
            [
                28
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH ()-[has_allergy:`allergy_1.Has_Allergy`]-()\nRETURN has_allergy.Allergy\nORDER BY has_allergy.Allergy DESC\nLIMIT 1",
        "question": "Which allergy has most number of students affected?",
        "answers": [
            [
                "Tree Pollen"
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH ()-[has_allergy:`allergy_1.Has_Allergy`]-()\nRETURN has_allergy.Allergy\nORDER BY has_allergy.Allergy DESC\nLIMIT 1",
        "question": "Which allergy is the most common?",
        "answers": [
            [
                "Tree Pollen"
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (T1:`allergy_1.Student`)-[T2:`allergy_1.Has_Allergy`]-()\nWHERE T2.Allergy = 'Milk' OR T2.Allergy = 'Cat'\nRETURN DISTINCT T1.Fname,T1.city_code",
        "question": "Find the different first names and cities of the students who have allergy to milk or cat.",
        "answers": [
            [
                "Linda",
                "BAL"
            ],
            [
                "Lisa",
                "PIT"
            ],
            [
                "Derek",
                "HOU"
            ],
            [
                "Mark",
                "DET"
            ],
            [
                "David",
                "NYC"
            ]
        ]
    },
    {
        "db_id": "allergy_1",
        "query": "MATCH (T1:`allergy_1.Student`)-[T2:`allergy_1.Has_Allergy`]-()\nWHERE T2.Allergy = 'Milk' OR T2.Allergy = 'Cat'\nRETURN DISTINCT T1.Fname,T1.city_code",
        "question": "What are the distinct first names and cities of the students who have allergy either to milk or to cat?",
        "answers": [
            [
                "Linda",
                "BAL"
            ],
            [
                "Lisa",
                "PIT"
            ],
            [
                "Derek",
                "HOU"
            ],
            [
                "Mark",
                "DET"
            ],
            [
                "David",
                "NYC"
            ]
        ]
    },
    {
        "db_id": "journal_committee",
        "query": "MATCH (editor:`journal_committee.editor`)\nRETURN editor.Name\nORDER BY editor.Age ASC",
        "question": "List the names of editors in ascending order of age.",
        "answers": [
            [
                "Szymon Wydra"
            ],
            [
                "Marek Siudym"
            ],
            [
                "W\u0142adys\u0142aw Grzywna"
            ],
            [
                "Mariusz Zalejski"
            ],
            [
                "Kamila Porczyk"
            ],
            [
                "Anna Powierza"
            ],
            [
                "Maria G\u00f3ralczyk"
            ],
            [
                "Piotr Pr\u0119gowski"
            ],
            [
                "Gra\u017cyna Wolszczak"
            ]
        ]
    },
    {
        "db_id": "journal_committee",
        "query": "MATCH (editor:`journal_committee.editor`)\nWHERE editor.Age > 25\nRETURN editor.Name",
        "question": "List the names of editors who are older than 25.",
        "answers": [
            [
                "Kamila Porczyk"
            ],
            [
                "Anna Powierza"
            ],
            [
                "Piotr Pr\u0119gowski"
            ],
            [
                "Gra\u017cyna Wolszczak"
            ],
            [
                "Maria G\u00f3ralczyk"
            ]
        ]
    },
    {
        "db_id": "journal_committee",
        "query": "MATCH (editor:`journal_committee.editor`)\nWHERE editor.Age = 24 OR editor.Age = 25\nRETURN editor.Name",
        "question": "Show the names of editors of age either 24 or 25.",
        "answers": [
            [
                "W\u0142adys\u0142aw Grzywna"
            ],
            [
                "Mariusz Zalejski"
            ]
        ]
    },
    {
        "db_id": "journal_committee",
        "query": "MATCH (editor:`journal_committee.editor`)\nRETURN editor.Age,count(*)",
        "question": "What are the different ages of editors? Show each age along with the number of editors of that age.",
        "answers": [
            [
                34.0,
                1
            ],
            [
                35.0,
                1
            ],
            [
                21.0,
                1
            ],
            [
                43.0,
                1
            ],
            [
                20.0,
                1
            ],
            [
                24.0,
                1
            ],
            [
                25.0,
                1
            ],
            [
                54.0,
                1
            ],
            [
                38.0,
                1
            ]
        ]
    },
    {
        "db_id": "journal_committee",
        "query": "MATCH (editor:`journal_committee.editor`)\nRETURN editor.Age\nORDER BY editor.Age DESC\nLIMIT 1",
        "question": "Please show the most common age of editors.",
        "answers": [
            [
                54.0
            ]
        ]
    }
]