[
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Dorm`)-[T2:`dorm_1.Has_amenity`]-(T3:`dorm_1.Dorm_amenity`)\nWHERE T1.dorm_name = 'Smith Hall'\nRETURN T3.amenity_name\nORDER BY T3.amenity_name",
        "question": "What amenities does Smith Hall have in alphabetical order?",
        "answers": [
            [
                "4 Walls"
            ],
            [
                "Carpeted Rooms"
            ],
            [
                "Heat"
            ],
            [
                "Roof"
            ],
            [
                "Study Room"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Dorm_amenity`)-[T2:`dorm_1.Has_amenity`]-()\nWITH count(T1.amenid) AS cnt, T1\nRETURN T1.amenity_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Find the name of amenity that is most common in all dorms.",
        "answers": [
            [
                "Roof"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Dorm_amenity`)-[T2:`dorm_1.Has_amenity`]-()\nWITH count(T1.amenid) AS cnt, T1\nRETURN T1.amenity_name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the most common amenity in the dorms?",
        "answers": [
            [
                "Roof"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Dorm`)-[T2:`dorm_1.Has_amenity`]-(T3:`dorm_1.Dorm_amenity`)\nWITH count(T1.dormid) AS cnt, T1\nRETURN T1.dorm_name,T1.student_capacity\nORDER BY cnt\nLIMIT 1",
        "question": "Find the name and capacity of the dorm with least number of amenities.",
        "answers": [
            [
                "University Hovels",
                40
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Dorm`)-[T2:`dorm_1.Has_amenity`]-(T3:`dorm_1.Dorm_amenity`)\nWITH count(T1.dormid) AS cnt, T1\nRETURN T1.dorm_name,T1.student_capacity\nORDER BY cnt\nLIMIT 1",
        "question": "What is the name and capacity of the dorm with the fewest amount of amenities?",
        "answers": [
            [
                "University Hovels",
                40
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (customers:`customer_complaints.Customers`)\nRETURN count(*)",
        "question": "Count the number of customers.",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (customers:`customer_complaints.Customers`)\nRETURN customers.email_address,customers.phone_number\nORDER BY customers.email_address,customers.phone_number",
        "question": "Find the emails and phone numbers of all the customers, ordered by email address and phone number.",
        "answers": [
            [
                "cayla.satterfield@example.net",
                "470-803-0244"
            ],
            [
                "hsteuber@example.org",
                "06963347450"
            ],
            [
                "lavonne.frami@example.com",
                "+38(3)9011433816"
            ],
            [
                "paige.hyatt@example.com",
                "1-369-302-7623x576"
            ],
            [
                "rzulauf@example.org",
                "578.019.7943x328"
            ],
            [
                "ubeier@example.org",
                "044-468-4549"
            ],
            [
                "vbogisich@example.org",
                "548.373.3603x59134"
            ],
            [
                "vida86@example.com",
                "997.698.4779x882"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (customers:`customer_complaints.Customers`)\nRETURN customers.email_address,customers.phone_number\nORDER BY customers.email_address,customers.phone_number",
        "question": "What are the emails and phone numbers of all customers, sorted by email address and phone number?",
        "answers": [
            [
                "cayla.satterfield@example.net",
                "470-803-0244"
            ],
            [
                "hsteuber@example.org",
                "06963347450"
            ],
            [
                "lavonne.frami@example.com",
                "+38(3)9011433816"
            ],
            [
                "paige.hyatt@example.com",
                "1-369-302-7623x576"
            ],
            [
                "rzulauf@example.org",
                "578.019.7943x328"
            ],
            [
                "ubeier@example.org",
                "044-468-4549"
            ],
            [
                "vbogisich@example.org",
                "548.373.3603x59134"
            ],
            [
                "vida86@example.com",
                "997.698.4779x882"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (customers:`customer_complaints.Customers`)\nWHERE customers.customer_type_code = 'Good Credit Rating'\nRETURN customers.town_city\nORDER BY customers.town_city\nLIMIT 1",
        "question": "Which city has the least number of customers whose type code is \"Good Credit Rating\"?",
        "answers": [
            [
                "Hansenbury"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (customers:`customer_complaints.Customers`)\nWHERE customers.customer_type_code = 'Good Credit Rating'\nRETURN customers.town_city\nORDER BY customers.town_city\nLIMIT 1",
        "question": "Return the city with the customer type code \"Good Credit Rating\" that had the fewest customers.",
        "answers": [
            [
                "Hansenbury"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (t1:`customer_complaints.Products`)-[]-(t2:`customer_complaints.Complaints`)\nRETURN t1.product_name,count(*)",
        "question": "List the name of all products along with the number of complaints that they have received.",
        "answers": [
            [
                "Chocolate",
                6
            ],
            [
                "The Great Gatsby",
                4
            ],
            [
                "Keyboard",
                1
            ],
            [
                "Mouse",
                1
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (t1:`customer_complaints.Products`)-[]-(t2:`customer_complaints.Complaints`)\nRETURN t1.product_name,count(*)",
        "question": "What are all the different product names, and how many complains has each received?",
        "answers": [
            [
                "Chocolate",
                6
            ],
            [
                "The Great Gatsby",
                4
            ],
            [
                "Keyboard",
                1
            ],
            [
                "Mouse",
                1
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (t1:`customer_complaints.Customers`)-[]-(t2:`customer_complaints.Complaints`)\nWITH t1, count(t1.customer_id) AS cnt\nRETURN t1.email_address\nORDER BY cnt\nLIMIT 1",
        "question": "Find the emails of customers who has filed a complaints of the product with the most complaints.",
        "answers": [
            [
                "hsteuber@example.org"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (t1:`customer_complaints.Customers`)-[]-(t2:`customer_complaints.Complaints`)\nWITH t1, count(t1.customer_id) AS cnt\nRETURN t1.email_address\nORDER BY cnt\nLIMIT 1",
        "question": "What are the emails of customers who have filed complaints on the product which has had the greatest number of complaints?",
        "answers": [
            [
                "hsteuber@example.org"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (t1:`customer_complaints.Customers`)-[]-(t2:`customer_complaints.Complaints`)\nRETURN t1.phone_number\nORDER BY t2.date_complaint_raised DESC\nLIMIT 1",
        "question": "What is the phone number of the customer who has filed the most recent complaint?",
        "answers": [
            [
                "+38(3)9011433816"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (t1:`customer_complaints.Customers`)-[]-(t2:`customer_complaints.Complaints`)\nRETURN t1.phone_number\nORDER BY t2.date_complaint_raised DESC\nLIMIT 1",
        "question": "Return the phone number of the customer who filed the complaint that was raised most recently.",
        "answers": [
            [
                "+38(3)9011433816"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (customers:`customer_complaints.Customers`)\nRETURN customers.phone_number  AS phone_number \nUNION\nMATCH (staff:`customer_complaints.Staff`)\nRETURN staff.phone_number  AS phone_number",
        "question": "Find the phone number of all the customers and staff.",
        "answers": [
            [
                "06963347450"
            ],
            [
                "470-803-0244"
            ],
            [
                "997.698.4779x882"
            ],
            [
                "548.373.3603x59134"
            ],
            [
                "044-468-4549"
            ],
            [
                "+38(3)9011433816"
            ],
            [
                "1-369-302-7623x576"
            ],
            [
                "578.019.7943x328"
            ],
            [
                "(379)551-0838x146"
            ],
            [
                "142-311-6503x206"
            ],
            [
                "345-656-5571"
            ],
            [
                "1-132-839-9409x288"
            ],
            [
                "(383)553-1035x20399"
            ],
            [
                "155-811-6153"
            ],
            [
                "751-262-8424x575"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (customers:`customer_complaints.Customers`)\nRETURN customers.phone_number  AS phone_number \nUNION\nMATCH (staff:`customer_complaints.Staff`)\nRETURN staff.phone_number  AS phone_number",
        "question": "What are the phone numbers of all customers and all staff members?",
        "answers": [
            [
                "06963347450"
            ],
            [
                "470-803-0244"
            ],
            [
                "997.698.4779x882"
            ],
            [
                "548.373.3603x59134"
            ],
            [
                "044-468-4549"
            ],
            [
                "+38(3)9011433816"
            ],
            [
                "1-369-302-7623x576"
            ],
            [
                "578.019.7943x328"
            ],
            [
                "(379)551-0838x146"
            ],
            [
                "142-311-6503x206"
            ],
            [
                "345-656-5571"
            ],
            [
                "1-132-839-9409x288"
            ],
            [
                "(383)553-1035x20399"
            ],
            [
                "155-811-6153"
            ],
            [
                "751-262-8424x575"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (products:`customer_complaints.Products`)\nRETURN products.product_name,products.product_category_code\nORDER BY products.product_price DESC\nLIMIT 1",
        "question": "Find the name and category of the most expensive product.",
        "answers": [
            [
                "Keyboard",
                "Hardware"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (products:`customer_complaints.Products`)\nRETURN products.product_name,products.product_category_code\nORDER BY products.product_price DESC\nLIMIT 1",
        "question": "What is the name and category code of the product with the highest price?",
        "answers": [
            [
                "Keyboard",
                "Hardware"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (products:`customer_complaints.Products`)\nRETURN avg(products.product_price),products.product_category_code",
        "question": "What is the average price of the products for each category?",
        "answers": [
            [
                2.88,
                "Food"
            ],
            [
                35.0,
                "Book"
            ],
            [
                66.67,
                "Hardware"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (products:`customer_complaints.Products`)\nRETURN avg(products.product_price),products.product_category_code",
        "question": "Return the average price of products that have each category code.",
        "answers": [
            [
                2.88,
                "Food"
            ],
            [
                35.0,
                "Book"
            ],
            [
                66.67,
                "Hardware"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (complaints:`customer_complaints.Complaints`)\nWITH complaints.complaint_status_code AS complaint_status_code, count(*) AS count\nWHERE count  > 3\nRETURN complaint_status_code",
        "question": "Which complaint status has more than 3 records on file?",
        "answers": [
            [
                "New"
            ],
            [
                "Open"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (complaints:`customer_complaints.Complaints`)\nWITH complaints.complaint_status_code AS complaint_status_code, count(*) AS count\nWHERE count  > 3\nRETURN complaint_status_code",
        "question": "Return complaint status codes have more than 3 corresponding complaints?",
        "answers": [
            [
                "New"
            ],
            [
                "Open"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (t1:`customer_complaints.Staff`)-[]-(t2:`customer_complaints.Complaints`)\nRETURN t1.last_name\nORDER BY t2.date_complaint_raised\nLIMIT 1",
        "question": "What is the last name of the staff who has handled the first ever complaint?",
        "answers": [
            [
                "Lynch"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (t1:`customer_complaints.Staff`)-[]-(t2:`customer_complaints.Complaints`)\nRETURN t1.last_name\nORDER BY t2.date_complaint_raised\nLIMIT 1",
        "question": "Return the last name of the staff member who handled the complaint with the earliest date raised.",
        "answers": [
            [
                "Lynch"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (complaints:`customer_complaints.Complaints`)\nRETURN count(DISTINCT complaints.complaint_type_code)",
        "question": "How many distinct complaint type codes are there in the database?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (complaints:`customer_complaints.Complaints`)\nRETURN count(DISTINCT complaints.complaint_type_code)",
        "question": "Count the number of different complaint type codes.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (complaints:`customer_complaints.Complaints`)\nWHERE complaints.complaint_type_code = 'Product Failure'\nRETURN complaints.complaint_status_code,count(*)",
        "question": "Find the number of complaints with Product Failure type for each complaint status.",
        "answers": [
            [
                "Closed",
                1
            ],
            [
                "Open",
                1
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (complaints:`customer_complaints.Complaints`)\nWHERE complaints.complaint_type_code = 'Product Failure'\nRETURN complaints.complaint_status_code,count(*)",
        "question": "Of complaints with the type code \"Product Failure\", how many had each different status code?",
        "answers": [
            [
                "Closed",
                1
            ],
            [
                "Open",
                1
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (t1:`customer_complaints.Staff`)-[]-(t2:`customer_complaints.Complaints`)\nWITH t1, count(t1.staff_id) AS cnt\nRETURN t1.first_name\nORDER BY cnt\nLIMIT 5",
        "question": "What is first names of the top 5 staff who have handled the greatest number of complaints?",
        "answers": [
            [
                "Austin"
            ],
            [
                "Dagmar"
            ],
            [
                "Bradly"
            ],
            [
                "Lucie"
            ],
            [
                "Mikel"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (t1:`customer_complaints.Staff`)-[]-(t2:`customer_complaints.Complaints`)\nWITH t1, count(t1.staff_id) AS cnt\nRETURN t1.first_name\nORDER BY cnt\nLIMIT 5",
        "question": "Return the first names of the 5 staff members who have handled the most complaints.",
        "answers": [
            [
                "Austin"
            ],
            [
                "Dagmar"
            ],
            [
                "Bradly"
            ],
            [
                "Lucie"
            ],
            [
                "Mikel"
            ]
        ]
    },
    {
        "db_id": "customer_complaints",
        "query": "MATCH (customers:`customer_complaints.Customers`)\nRETURN customers.state\nORDER BY customers.state\nLIMIT 1",
        "question": "Give the state that has the most customers.",
        "answers": [
            [
                "Colorado"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN count(*)",
        "question": "How many submissions are there?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN count(*)",
        "question": "Count the number of submissions.",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN submission.Author\nORDER BY submission.Scores ASC",
        "question": "List the authors of submissions in ascending order of scores.",
        "answers": [
            [
                "Steve Niehaus"
            ],
            [
                "Sherman Smith"
            ],
            [
                "Sammy Green"
            ],
            [
                "Steve Raible"
            ],
            [
                "Jeff Lloyd"
            ],
            [
                "Randy Johnson"
            ],
            [
                "Andy Bolton"
            ],
            [
                "Rick Engles"
            ],
            [
                "Don Bitterlich"
            ],
            [
                "Steve Myer"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN submission.Author\nORDER BY submission.Scores ASC",
        "question": "Find the author for each submission and list them in ascending order of submission score.",
        "answers": [
            [
                "Steve Niehaus"
            ],
            [
                "Sherman Smith"
            ],
            [
                "Sammy Green"
            ],
            [
                "Steve Raible"
            ],
            [
                "Jeff Lloyd"
            ],
            [
                "Randy Johnson"
            ],
            [
                "Andy Bolton"
            ],
            [
                "Rick Engles"
            ],
            [
                "Don Bitterlich"
            ],
            [
                "Steve Myer"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN submission.Author,submission.College",
        "question": "What are the authors of submissions and their colleges?",
        "answers": [
            [
                "Steve Niehaus",
                "Notre Dame"
            ],
            [
                "Sammy Green",
                "Florida"
            ],
            [
                "Sherman Smith",
                "Miami (OH)"
            ],
            [
                "Steve Raible",
                "Georgia Tech"
            ],
            [
                "Jeff Lloyd",
                "West Texas State"
            ],
            [
                "Rick Engles",
                "Tulsa"
            ],
            [
                "Don Bitterlich",
                "Temple"
            ],
            [
                "Steve Myer",
                "New Mexico"
            ],
            [
                "Randy Johnson",
                "Georgia"
            ],
            [
                "Andy Bolton",
                "Fisk"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN submission.Author,submission.College",
        "question": "For each submission, show the author and their affiliated college.",
        "answers": [
            [
                "Steve Niehaus",
                "Notre Dame"
            ],
            [
                "Sammy Green",
                "Florida"
            ],
            [
                "Sherman Smith",
                "Miami (OH)"
            ],
            [
                "Steve Raible",
                "Georgia Tech"
            ],
            [
                "Jeff Lloyd",
                "West Texas State"
            ],
            [
                "Rick Engles",
                "Tulsa"
            ],
            [
                "Don Bitterlich",
                "Temple"
            ],
            [
                "Steve Myer",
                "New Mexico"
            ],
            [
                "Randy Johnson",
                "Georgia"
            ],
            [
                "Andy Bolton",
                "Fisk"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nWHERE submission.College = 'Florida' OR submission.College = 'Temple'\nRETURN submission.Author",
        "question": "Show the names of authors from college \"Florida\" or \"Temple\"",
        "answers": [
            [
                "Sammy Green"
            ],
            [
                "Don Bitterlich"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nWHERE submission.College = 'Florida' OR submission.College = 'Temple'\nRETURN submission.Author",
        "question": "Which authors with submissions are from college \"Florida\" or \"Temple\"?",
        "answers": [
            [
                "Sammy Green"
            ],
            [
                "Don Bitterlich"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN submission.Author\nORDER BY submission.Scores DESC\nLIMIT 1",
        "question": "What is the author of the submission with the highest score?",
        "answers": [
            [
                "Steve Myer"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN submission.Author\nORDER BY submission.Scores DESC\nLIMIT 1",
        "question": "Find the author who achieved the highest score in a submission.",
        "answers": [
            [
                "Steve Myer"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN submission.College,count(*)",
        "question": "Show different colleges along with the number of authors of submission from each college.",
        "answers": [
            [
                "Notre Dame",
                1
            ],
            [
                "Florida",
                1
            ],
            [
                "Miami (OH)",
                1
            ],
            [
                "Georgia Tech",
                1
            ],
            [
                "West Texas State",
                1
            ],
            [
                "Tulsa",
                1
            ],
            [
                "Temple",
                1
            ],
            [
                "New Mexico",
                1
            ],
            [
                "Georgia",
                1
            ],
            [
                "Fisk",
                1
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN submission.College,count(*)",
        "question": "For each college, return the college name and the count of authors with submissions from that college.",
        "answers": [
            [
                "Notre Dame",
                1
            ],
            [
                "Florida",
                1
            ],
            [
                "Miami (OH)",
                1
            ],
            [
                "Georgia Tech",
                1
            ],
            [
                "West Texas State",
                1
            ],
            [
                "Tulsa",
                1
            ],
            [
                "Temple",
                1
            ],
            [
                "New Mexico",
                1
            ],
            [
                "Georgia",
                1
            ],
            [
                "Fisk",
                1
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN submission.College\nORDER BY submission.College DESC\nLIMIT 1",
        "question": "Show the most common college of authors of submissions.",
        "answers": [
            [
                "West Texas State"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (submission:`workshop_paper.submission`)\nRETURN submission.College\nORDER BY submission.College DESC\nLIMIT 1",
        "question": "Which college has the most authors with submissions?",
        "answers": [
            [
                "West Texas State"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (T2:`workshop_paper.submission`)-[T1:`workshop_paper.Acceptance`]-()\nRETURN T2.Author,T1.Result",
        "question": "Show the authors of submissions and the acceptance results of their submissions.",
        "answers": [
            [
                "Steve Niehaus",
                "Accepted"
            ],
            [
                "Sammy Green",
                "Rejected"
            ],
            [
                "Sammy Green",
                "Accepted"
            ],
            [
                "Sherman Smith",
                "Rejected"
            ],
            [
                "Steve Raible",
                "Rejected"
            ],
            [
                "Jeff Lloyd",
                "Rejected"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (T2:`workshop_paper.submission`)-[T1:`workshop_paper.Acceptance`]-()\nRETURN T2.Author,T1.Result",
        "question": "For each submission, find its author and acceptance result.",
        "answers": [
            [
                "Steve Niehaus",
                "Accepted"
            ],
            [
                "Sammy Green",
                "Rejected"
            ],
            [
                "Sammy Green",
                "Accepted"
            ],
            [
                "Sherman Smith",
                "Rejected"
            ],
            [
                "Steve Raible",
                "Rejected"
            ],
            [
                "Jeff Lloyd",
                "Rejected"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (T2:`workshop_paper.submission`)-[T1:`workshop_paper.Acceptance`]-()\nRETURN T1.Result\nORDER BY T2.Scores DESC\nLIMIT 1",
        "question": "Show the result of the submission with the highest score.",
        "answers": [
            [
                "Rejected"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (T2:`workshop_paper.submission`)-[T1:`workshop_paper.Acceptance`]-()\nRETURN T1.Result\nORDER BY T2.Scores DESC\nLIMIT 1",
        "question": "Which submission received the highest score in acceptance result. Show me the result.",
        "answers": [
            [
                "Rejected"
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (T2:`workshop_paper.submission`)-[T1:`workshop_paper.Acceptance`]-()\nRETURN T2.Author,count(DISTINCT T1.Workshop_ID)",
        "question": "Show each author and the number of workshops they submitted to.",
        "answers": [
            [
                "Steve Niehaus",
                1
            ],
            [
                "Sammy Green",
                2
            ],
            [
                "Sherman Smith",
                1
            ],
            [
                "Steve Raible",
                1
            ],
            [
                "Jeff Lloyd",
                1
            ]
        ]
    },
    {
        "db_id": "workshop_paper",
        "query": "MATCH (T2:`workshop_paper.submission`)-[T1:`workshop_paper.Acceptance`]-()\nRETURN T2.Author,count(DISTINCT T1.Workshop_ID)",
        "question": "How many workshops did each author submit to? Return the author name and the number of workshops.",
        "answers": [
            [
                "Steve Niehaus",
                1
            ],
            [
                "Sammy Green",
                2
            ],
            [
                "Sherman Smith",
                1
            ],
            [
                "Steve Raible",
                1
            ],
            [
                "Jeff Lloyd",
                1
            ]
        ]
    }
]