[
    {
        "db_id": "loan_1",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN bank.bname\nORDER BY bank.no_of_customers DESC\nLIMIT 1",
        "question": "What is the name of the bank branch with the greatest number of customers?",
        "answers": [
            [
                "broadway"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nRETURN customer.cust_name\nORDER BY customer.credit_score\nLIMIT 1",
        "question": "Find the name of customer who has the lowest credit score.",
        "answers": [
            [
                "Jack"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nRETURN customer.cust_name\nORDER BY customer.credit_score\nLIMIT 1",
        "question": "What is the name of the customer with the worst credit score?",
        "answers": [
            [
                "Jack"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nRETURN customer.cust_name,customer.acc_type,customer.acc_bal\nORDER BY customer.credit_score DESC\nLIMIT 1",
        "question": "Find the name, account type, and account balance of the customer who has the highest credit score.",
        "answers": [
            [
                "Owen",
                "saving",
                800000
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nRETURN customer.cust_name,customer.acc_type,customer.acc_bal\nORDER BY customer.credit_score DESC\nLIMIT 1",
        "question": "What is the name, account type, and account balance corresponding to the customer with the highest credit score?",
        "answers": [
            [
                "Owen",
                "saving",
                800000
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nWHERE customer.credit_score < 50\nRETURN avg(customer.acc_bal),customer.acc_type",
        "question": "For each account type, find the average account balance of customers with credit score lower than 50.",
        "answers": [
            [
                2000.0,
                "saving"
            ],
            [
                1000.0,
                "checking"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nWHERE customer.credit_score < 50\nRETURN avg(customer.acc_bal),customer.acc_type",
        "question": "What is the average account balance of customers with credit score below 50 for the different account types?",
        "answers": [
            [
                2000.0,
                "saving"
            ],
            [
                1000.0,
                "checking"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (T1:`loan_1.customer`)-[]-(T2:`loan_1.loan`)\nWITH count(*) AS count, T1.cust_name AS cust_name\nWHERE count  > 1\nRETURN cust_name",
        "question": "Find the name of customers who have more than one loan.",
        "answers": [
            [
                "Mary"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (T1:`loan_1.customer`)-[]-(T2:`loan_1.loan`)\nWITH count(*) AS count, T1.cust_name AS cust_name\nWHERE count  > 1\nRETURN cust_name",
        "question": "What are the names of customers who have taken out more than one loan?",
        "answers": [
            [
                "Mary"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (T1:`loan_1.bank`)-[]-(T2:`loan_1.loan`)\nRETURN DISTINCT T1.bname",
        "question": "Find the name of bank branches that provided some loans.",
        "answers": [
            [
                "morningside"
            ],
            [
                "downtown"
            ],
            [
                "broadway"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (T1:`loan_1.bank`)-[]-(T2:`loan_1.loan`)\nRETURN DISTINCT T1.bname",
        "question": "What are the names of the different banks that have provided loans?",
        "answers": [
            [
                "morningside"
            ],
            [
                "downtown"
            ],
            [
                "broadway"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (T1:`loan_1.customer`)-[]-(T2:`loan_1.loan`)\nRETURN DISTINCT T1.cust_name,T1.credit_score",
        "question": "Find the name and credit score of the customers who have some loans.",
        "answers": [
            [
                "Mary",
                30
            ],
            [
                "Owen",
                210
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (T1:`loan_1.customer`)-[]-(T2:`loan_1.loan`)\nRETURN DISTINCT T1.cust_name,T1.credit_score",
        "question": "What are the different names and credit scores of customers who have taken a loan?",
        "answers": [
            [
                "Mary",
                30
            ],
            [
                "Owen",
                210
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (T1:`loan_1.customer`)-[]-(T2:`loan_1.loan`)\nWHERE T2.amount > 3000\nRETURN T1.cust_name",
        "question": "Find the the name of the customers who have a loan with amount more than 3000.",
        "answers": [
            [
                "Owen"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (T1:`loan_1.customer`)-[]-(T2:`loan_1.loan`)\nWHERE T2.amount > 3000\nRETURN T1.cust_name",
        "question": "What are the names of customers who have a loan of more than 3000 in amount?",
        "answers": [
            [
                "Owen"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (T1:`loan_1.bank`)-[]-(T2:`loan_1.loan`)\nWHERE T2.loan_type = 'Business'\nRETURN T1.bname,T1.city",
        "question": "Find the city and name of bank branches that provide business loans.",
        "answers": [
            [
                "broadway",
                "New York City"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (T1:`loan_1.bank`)-[]-(T2:`loan_1.loan`)\nWHERE T2.loan_type = 'Business'\nRETURN T1.bname,T1.city",
        "question": "What are the names and cities of bank branches that offer loans for business?",
        "answers": [
            [
                "broadway",
                "New York City"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (T1:`loan_1.loan`)-[]-(T2:`loan_1.bank`)-[]-(T3:`loan_1.customer`)\nWHERE T3.credit_score < 100\nRETURN T2.bname",
        "question": "Find the names of bank branches that have provided a loan to any customer whose credit score is below 100.",
        "answers": [
            [
                "downtown"
            ],
            [
                "morningside"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (T1:`loan_1.loan`)-[]-(T2:`loan_1.bank`)-[]-(T3:`loan_1.customer`)\nWHERE T3.credit_score < 100\nRETURN T2.bname",
        "question": "What are the names of banks that have loaned money to customers with credit scores below 100?",
        "answers": [
            [
                "downtown"
            ],
            [
                "morningside"
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nWHERE NOT (customer)-[]-(:`loan_1.loan`)    \nRETURN avg(customer.credit_score)",
        "question": "Find the average credit score of the customers who do not have any loan.",
        "answers": [
            [
                20.0
            ]
        ]
    },
    {
        "db_id": "loan_1",
        "query": "MATCH (customer:`loan_1.customer`)\nWHERE NOT (customer)-[]-(:`loan_1.loan`)    \nRETURN avg(customer.credit_score)",
        "question": "What is the average credit score for customers who have never taken a loan?",
        "answers": [
            [
                20.0
            ]
        ]
    },
    {
        "db_id": "behavior_monitoring",
        "query": "MATCH (detention:`behavior_monitoring.Detention`)\nRETURN DISTINCT detention.detention_type_code",
        "question": "Return all distinct detention type codes.",
        "answers": [
            [
                "AFTER"
            ],
            [
                "BREAK "
            ],
            [
                "LUNCH"
            ]
        ]
    },
    {
        "db_id": "behavior_monitoring",
        "query": "MATCH (detention:`behavior_monitoring.Detention`)\nRETURN detention.detention_summary",
        "question": "Return all detention summaries.",
        "answers": [
            [
                null
            ],
            [
                null
            ],
            [
                null
            ],
            [
                null
            ],
            [
                null
            ],
            [
                null
            ],
            [
                null
            ],
            [
                null
            ],
            [
                null
            ],
            [
                null
            ],
            [
                null
            ],
            [
                null
            ],
            [
                null
            ],
            [
                null
            ],
            [
                null
            ]
        ]
    },
    {
        "db_id": "behavior_monitoring",
        "query": "MATCH (students:`behavior_monitoring.Students`)\nRETURN students.cell_mobile_number,students.email_address",
        "question": "Return the cell phone number and email address for all students.",
        "answers": [
            [
                "235.899.9744",
                "derrick.jenkins@example.com"
            ],
            [
                "1-247-673-8446",
                "rohan.clarabelle@example.org"
            ],
            [
                "1-751-162-9676x115",
                "kkirlin@example.org"
            ],
            [
                "1-895-196-9979",
                "eolson@example.com"
            ],
            [
                "1-036-062-5465",
                "dicki.kathryne@example.org"
            ],
            [
                "(874)070-9495",
                "norwood.howell@example.org"
            ],
            [
                "763.072.5520x5907",
                "lisette.brekke@example.net"
            ],
            [
                "319.497.4575x2214",
                "jasmin.schuppe@example.com"
            ],
            [
                "(568)451-0917x3945",
                "dora.zboncak@example.org"
            ],
            [
                "08605192839",
                "frederique.mante@example.org"
            ],
            [
                "+60(5)3280072514",
                "qharvey@example.com"
            ],
            [
                "(921)011-7909x3518",
                "mitchel55@example.net"
            ],
            [
                "(062)892-7033",
                "gbeatty@example.com"
            ],
            [
                "(820)260-5721",
                "foster.zemlak@example.com"
            ],
            [
                "1-498-138-8088",
                "kertzmann.devon@example.net"
            ]
        ]
    },
    {
        "db_id": "behavior_monitoring",
        "query": "MATCH (students_in_detention:`behavior_monitoring.Students_in_Detention`)\nRETURN count(DISTINCT students_in_detention.student_id)",
        "question": "How many distinct students have been in detention?",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "behavior_monitoring",
        "query": "MATCH (teachers:`behavior_monitoring.Teachers`)\nWHERE teachers.email_address =~'.*[M|m]an.*'\nRETURN teachers.first_name",
        "question": "Find the first names of teachers whose email address contains the word \"man\".",
        "answers": [
            [
                "Woodrow"
            ]
        ]
    },
    {
        "db_id": "behavior_monitoring",
        "query": "MATCH (addresses:`behavior_monitoring.Addresses`)\nRETURN addresses.city\nORDER BY addresses.city",
        "question": "List all cities of addresses in alphabetical order.",
        "answers": [
            [
                "Beierview"
            ],
            [
                "Caitlynstad"
            ],
            [
                "Corkeryborough"
            ],
            [
                "Edmundton"
            ],
            [
                "Elinoreport"
            ],
            [
                "Gleasonshire"
            ],
            [
                "Hegmannborough"
            ],
            [
                "Hintzport"
            ],
            [
                "Lake Ahmadland"
            ],
            [
                "Larkinport"
            ],
            [
                "Meganeland"
            ],
            [
                "New Annabellefort"
            ],
            [
                "North Fletcherside"
            ],
            [
                "North Jayceton"
            ],
            [
                "North Loyceville"
            ],
            [
                "North Orlobury"
            ],
            [
                "Tressamouth"
            ],
            [
                "Unachester"
            ],
            [
                "West Lianafurt"
            ],
            [
                "West Sean"
            ]
        ]
    },
    {
        "db_id": "behavior_monitoring",
        "query": "MATCH (teachers:`behavior_monitoring.Teachers`)\nRETURN teachers.first_name,teachers.last_name\nORDER BY teachers.last_name",
        "question": "Find the first names and last names of teachers in alphabetical order of last name.",
        "answers": [
            [
                "Aniya",
                "Becker"
            ],
            [
                "Hobart",
                "Bergnaum"
            ],
            [
                "Sid",
                "Brakus"
            ],
            [
                "Woodrow",
                "Goldner"
            ],
            [
                "Evelyn",
                "Hansen"
            ],
            [
                "Gregory",
                "Heller"
            ],
            [
                "Donnie",
                "Kuhic"
            ],
            [
                "Citlalli",
                "Kuhic"
            ],
            [
                "Edmond",
                "Lang"
            ],
            [
                "Lyla",
                "Medhurst"
            ],
            [
                "Camren",
                "Moore"
            ],
            [
                "Stephanie",
                "Price"
            ],
            [
                "Alvis",
                "Schultz"
            ],
            [
                "Trystan",
                "Schuster"
            ],
            [
                "Cecilia",
                "Ward"
            ]
        ]
    },
    {
        "db_id": "behavior_monitoring",
        "query": "MATCH (T1:`behavior_monitoring.Addresses`)-[T2:`behavior_monitoring.Student_Addresses`]-()\nRETURN T2.address_id,T1.zip_postcode\nORDER BY T2.monthly_rental DESC\nLIMIT 1",
        "question": "What are the id and zip code of the address with the highest monthly rental?",
        "answers": [
            [
                16,
                "637"
            ]
        ]
    },
    {
        "db_id": "behavior_monitoring",
        "query": "MATCH (T2:`behavior_monitoring.Students`)-[T1:`behavior_monitoring.Student_Addresses`]-()\nRETURN T2.cell_mobile_number\nORDER BY T1.monthly_rental ASC\nLIMIT 1",
        "question": "What is the cell phone number of the student whose address has the lowest monthly rental?",
        "answers": [
            [
                "08605192839"
            ]
        ]
    },
    {
        "db_id": "behavior_monitoring",
        "query": "MATCH (T1:`behavior_monitoring.Addresses`)-[]-(T2:`behavior_monitoring.Teachers`)\nWHERE T1.zip_postcode = '918'\nRETURN T2.email_address",
        "question": "What are the email addresses of teachers whose address has zip code \"918\"?",
        "answers": [
            [
                "everardo.lynch@example.net"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (T1:`assets_maintenance.Maintenance_Contracts`)-[]-(T2:`assets_maintenance.Assets`)\nRETURN count(*),T1.maintenance_contract_id",
        "question": "How many assets does each maintenance contract contain? List the number and the contract id.",
        "answers": [
            [
                2,
                2
            ],
            [
                2,
                6
            ],
            [
                2,
                7
            ],
            [
                2,
                8
            ],
            [
                1,
                10
            ],
            [
                2,
                11
            ],
            [
                1,
                12
            ],
            [
                1,
                13
            ],
            [
                1,
                14
            ],
            [
                1,
                15
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (T1:`assets_maintenance.Third_Party_Companies`)-[]-(T2:`assets_maintenance.Assets`)\nRETURN count(*),T1.company_id",
        "question": "How many assets does each third party company supply? List the count and the company id.",
        "answers": [
            [
                1,
                1
            ],
            [
                3,
                2
            ],
            [
                2,
                5
            ],
            [
                3,
                6
            ],
            [
                1,
                7
            ],
            [
                1,
                8
            ],
            [
                1,
                11
            ],
            [
                1,
                12
            ],
            [
                1,
                13
            ],
            [
                1,
                14
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (T1:`assets_maintenance.Third_Party_Companies`)-[]-(T2:`assets_maintenance.Maintenance_Engineers`)\nWITH T1.company_name AS company_name, T1.company_id AS company_id, count(*) AS count\nWHERE count  >= 2\nRETURN company_id,company_name \nUNION\nMATCH (T3:`assets_maintenance.Third_Party_Companies`)-[]-(T4:`assets_maintenance.Maintenance_Contracts`)\nWITH count(*) AS count, T3.company_name AS company_name, T3.company_id AS company_id\nWHERE count  >= 2\nRETURN company_id,company_name",
        "question": "Which third party companies have at least 2 maintenance engineers or have at least 2 maintenance contracts? List the company id and name.",
        "answers": [
            [
                2,
                "McDermott Group"
            ],
            [
                3,
                "Schuppe-Carroll"
            ],
            [
                4,
                "Dooley-Langosh"
            ],
            [
                11,
                "Kuvalis, Boehm and Hettinger"
            ],
            [
                15,
                "Rau, Ullrich and King"
            ],
            [
                13,
                "Greenholt-D'Amore"
            ],
            [
                6,
                "Grimes, Mosciski and Renner"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (T1:`assets_maintenance.Parts`)-[]-(T2:`assets_maintenance.Part_Faults`)\nWITH T1.part_id AS part_id, count(*) AS count, T1.part_name AS part_name\nWHERE count  > 2\nRETURN part_name,part_id",
        "question": "Which parts have more than 2 faults? Show the part name and id.",
        "answers": [
            [
                "top",
                1
            ],
            [
                "package",
                3
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (T1:`assets_maintenance.Maintenance_Engineers`)-[T2:`assets_maintenance.Engineer_Skills`]-(T3:`assets_maintenance.Skills`)\nRETURN T1.first_name,T1.last_name,T1.other_details,T3.skill_description",
        "question": "List all every engineer's first name, last name, details and coresponding skill description.",
        "answers": [
            [
                "Samanta",
                "Hauck",
                null,
                "Electrical"
            ],
            [
                "Manley",
                "Grady",
                null,
                "Electrical"
            ],
            [
                "Lorine",
                "Morar",
                null,
                "Electrical"
            ],
            [
                "Weston",
                "Hahn",
                null,
                "Electrical"
            ],
            [
                "Courtney",
                "Adams",
                null,
                "Electrical"
            ],
            [
                "Archibald",
                "Streich",
                null,
                "Electrical"
            ],
            [
                "Naomi",
                "Price",
                null,
                "Electrical"
            ],
            [
                "Nellie",
                "Hirthe",
                null,
                "Electrical"
            ],
            [
                "Alexys",
                "Simonis",
                null,
                "Mechanical"
            ],
            [
                "Manley",
                "Grady",
                null,
                "Mechanical"
            ],
            [
                "Clemens",
                "Orn",
                null,
                "Mechanical"
            ],
            [
                "Naomi",
                "Price",
                null,
                "Mechanical"
            ],
            [
                "Cullen",
                "Kunde",
                null,
                "Mechanical"
            ],
            [
                "Weston",
                "Hahn",
                null,
                "Mechanical"
            ],
            [
                "Archibald",
                "Streich",
                null,
                "TV, Video"
            ],
            [
                "Josie",
                "Harvey",
                "Skilled",
                "TV, Video"
            ],
            [
                "Nellie",
                "Hirthe",
                null,
                "TV, Video"
            ],
            [
                "Brian",
                "Stamm",
                null,
                "TV, Video"
            ],
            [
                "Courtney",
                "Adams",
                null,
                "TV, Video"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (T1:`assets_maintenance.Part_Faults`)-[T2:`assets_maintenance.Skills_Required_To_Fix`]-(T3:`assets_maintenance.Skills`)\nRETURN T1.fault_short_name,T3.skill_description",
        "question": "For all the faults of different parts, what are all the decriptions of the skills required to fix them? List the name of the faults and the skill description.",
        "answers": [
            [
                "PW",
                "Electrical"
            ],
            [
                "PW",
                "Electrical"
            ],
            [
                "PW",
                "Electrical"
            ],
            [
                "TW",
                "Mechanical"
            ],
            [
                "MW",
                "Mechanical"
            ],
            [
                "TW",
                "Mechanical"
            ],
            [
                "PW",
                "Mechanical"
            ],
            [
                "PW",
                "Mechanical"
            ],
            [
                "TW",
                "TV, Video"
            ],
            [
                "MW",
                "TV, Video"
            ],
            [
                "PW",
                "TV, Video"
            ],
            [
                "MW",
                "TV, Video"
            ],
            [
                "MW",
                "TV, Video"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (T1:`assets_maintenance.Fault_Log`)-[T2:`assets_maintenance.Fault_Log_Parts`]-()\nRETURN T1.fault_description,T2.fault_status",
        "question": "What are all the fault descriptions and the fault status of all the faults recoreded in the logs?",
        "answers": [
            [
                "system error",
                "Fixed"
            ],
            [
                "system error",
                "Fixed"
            ],
            [
                "system error",
                "Return"
            ],
            [
                "system error",
                "Fixed"
            ],
            [
                "system error",
                "Return"
            ],
            [
                "failed parts",
                "Reported"
            ],
            [
                "failed parts",
                "Waiting"
            ],
            [
                "failed parts",
                "Waiting"
            ],
            [
                "system error",
                "Reported"
            ],
            [
                "failed parts",
                "Reported"
            ],
            [
                "failed parts",
                "Reported"
            ],
            [
                "system error",
                "Reported"
            ],
            [
                "system error",
                "Fixed"
            ],
            [
                "system error",
                "Fixed"
            ],
            [
                "failed parts",
                "Waiting"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (maintenance_engineers:`assets_maintenance.Maintenance_Engineers`)\nRETURN DISTINCT maintenance_engineers.last_name",
        "question": "What are all the distinct last names of all the engineers?",
        "answers": [
            [
                "Reinger"
            ],
            [
                "Orn"
            ],
            [
                "Hauck"
            ],
            [
                "Morar"
            ],
            [
                "Grady"
            ],
            [
                "Adams"
            ],
            [
                "Harvey"
            ],
            [
                "Hirthe"
            ],
            [
                "Stamm"
            ],
            [
                "Price"
            ],
            [
                "Kunde"
            ],
            [
                "Simonis"
            ],
            [
                "Hahn"
            ],
            [
                "Goldner"
            ],
            [
                "Streich"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH ()-[fault_log_parts:`assets_maintenance.Fault_Log_Parts`]-()\nRETURN DISTINCT fault_log_parts.fault_status",
        "question": "How many fault status codes are recorded in the fault log parts table?",
        "answers": [
            [
                "Reported"
            ],
            [
                "Return"
            ],
            [
                "Fixed"
            ],
            [
                "Waiting"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (assets:`assets_maintenance.Assets`)\nRETURN assets.asset_id,assets.asset_details,assets.asset_make,assets.asset_model",
        "question": "List the asset id, details, make and model for every asset.",
        "answers": [
            [
                1,
                "dell laptop1",
                "PT",
                "58 ub"
            ],
            [
                2,
                "dell laptop2",
                "IN",
                "35 xt"
            ],
            [
                3,
                "dell laptop3",
                "IT",
                "63 ok"
            ],
            [
                4,
                "dell laptop4",
                "RU",
                "69 uv"
            ],
            [
                5,
                "dell laptop5",
                "DE",
                "90 oq"
            ],
            [
                6,
                "monitor1",
                "CN",
                "91 ub"
            ],
            [
                7,
                "monitor2",
                "CN",
                "27 du"
            ],
            [
                8,
                "monitor3",
                "GB",
                "94 kg"
            ],
            [
                9,
                "machine1",
                "RU",
                "07 yt"
            ],
            [
                10,
                "machine2",
                "FR",
                "20 tl"
            ],
            [
                11,
                "machine3",
                "FR",
                "11 wi"
            ],
            [
                12,
                "machine4",
                "RU",
                "95 vn"
            ],
            [
                13,
                "system1",
                "DE",
                "08 yy"
            ],
            [
                14,
                "system2",
                "IN",
                "66 xm"
            ],
            [
                15,
                "system3",
                "IE",
                "24 ak"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (assets:`assets_maintenance.Assets`)\nRETURN assets.asset_acquired_date\nORDER BY assets.asset_acquired_date ASC\nLIMIT 1",
        "question": "When was the first asset acquired?",
        "answers": [
            [
                "2017-04-16 12:19:25"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "query": "MATCH (T1:`assets_maintenance.Parts`)-[]-(T2:`assets_maintenance.Part_Faults`)\nWITH count(T1.part_name) AS cnt, T1\nRETURN T1.part_name\nORDER BY cnt ASC\nLIMIT 1",
        "question": "Which kind of part has the least number of faults? List the part name.",
        "answers": [
            [
                "middle"
            ]
        ]
    }
]