[
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm_amenity:`dorm_1.Dorm_amenity`)\nRETURN dorm_amenity.amenity_name\nORDER BY dorm_amenity.amenity_name",
        "question": "List in alphabetic order all different amenities.",
        "answers": [
            [
                "4 Walls"
            ],
            [
                "Air Conditioning"
            ],
            [
                "Allows Pets"
            ],
            [
                "Carpeted Rooms"
            ],
            [
                "Ethernet Ports"
            ],
            [
                "Heat"
            ],
            [
                "Kitchen in Every Room"
            ],
            [
                "Pub in Basement"
            ],
            [
                "Roof"
            ],
            [
                "Study Room"
            ],
            [
                "TV Lounge"
            ],
            [
                "Working Fireplaces"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm_amenity:`dorm_1.Dorm_amenity`)\nRETURN dorm_amenity.amenity_name\nORDER BY dorm_amenity.amenity_name",
        "question": "What are the different dorm amenity names in alphabetical order?",
        "answers": [
            [
                "4 Walls"
            ],
            [
                "Air Conditioning"
            ],
            [
                "Allows Pets"
            ],
            [
                "Carpeted Rooms"
            ],
            [
                "Ethernet Ports"
            ],
            [
                "Heat"
            ],
            [
                "Kitchen in Every Room"
            ],
            [
                "Pub in Basement"
            ],
            [
                "Roof"
            ],
            [
                "Study Room"
            ],
            [
                "TV Lounge"
            ],
            [
                "Working Fireplaces"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWITH avg(student.Age) AS age\nMATCH (student:`dorm_1.Student`)\nWHERE  student.Age <  age \nRETURN student.Fname,student.LName",
        "question": "Find the first and last name of students whose age is younger than the average age.",
        "answers": [
            [
                "Linda",
                "Smith"
            ],
            [
                "Tracy",
                "Kim"
            ],
            [
                "Andy",
                "Schultz"
            ],
            [
                "Lisa",
                "Apap"
            ],
            [
                "Eric",
                "Tai"
            ],
            [
                "Derek",
                "Lee"
            ],
            [
                "Charles",
                "Norris"
            ],
            [
                "Susan",
                "Lee"
            ],
            [
                "Mark",
                "Schwartz"
            ],
            [
                "Arthur",
                "Pang"
            ],
            [
                "George",
                "Andreou"
            ],
            [
                "Michael",
                "Woods"
            ],
            [
                "Stacy",
                "Prater"
            ],
            [
                "Mark",
                "Goldman"
            ],
            [
                "Eric",
                "Pang"
            ],
            [
                "Paul",
                "Brody"
            ],
            [
                "Jun",
                "Han"
            ],
            [
                "William",
                "Simms"
            ],
            [
                "Eric",
                "Epp"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWITH avg(student.Age) AS age\nMATCH (student:`dorm_1.Student`)\nWHERE  student.Age <  age \nRETURN student.Fname,student.LName",
        "question": "What is the first and last name of all students who are younger than average?",
        "answers": [
            [
                "Linda",
                "Smith"
            ],
            [
                "Tracy",
                "Kim"
            ],
            [
                "Andy",
                "Schultz"
            ],
            [
                "Lisa",
                "Apap"
            ],
            [
                "Eric",
                "Tai"
            ],
            [
                "Derek",
                "Lee"
            ],
            [
                "Charles",
                "Norris"
            ],
            [
                "Susan",
                "Lee"
            ],
            [
                "Mark",
                "Schwartz"
            ],
            [
                "Arthur",
                "Pang"
            ],
            [
                "George",
                "Andreou"
            ],
            [
                "Michael",
                "Woods"
            ],
            [
                "Stacy",
                "Prater"
            ],
            [
                "Mark",
                "Goldman"
            ],
            [
                "Eric",
                "Pang"
            ],
            [
                "Paul",
                "Brody"
            ],
            [
                "Jun",
                "Han"
            ],
            [
                "William",
                "Simms"
            ],
            [
                "Eric",
                "Epp"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWHERE student.city_code <> 'HKG'\nRETURN student.Fname,student.LName\nORDER BY student.Age",
        "question": "List the first and last name of students who are not living in the city with code HKG, and sorted the results by their ages.",
        "answers": [
            [
                "Derek",
                "Lee"
            ],
            [
                "Mark",
                "Schwartz"
            ],
            [
                "Michael",
                "Woods"
            ],
            [
                "Jun",
                "Han"
            ],
            [
                "Linda",
                "Smith"
            ],
            [
                "Andy",
                "Schultz"
            ],
            [
                "Lisa",
                "Apap"
            ],
            [
                "Charles",
                "Norris"
            ],
            [
                "Arthur",
                "Pang"
            ],
            [
                "Stacy",
                "Prater"
            ],
            [
                "Mark",
                "Goldman"
            ],
            [
                "Paul",
                "Brody"
            ],
            [
                "William",
                "Simms"
            ],
            [
                "Eric",
                "Epp"
            ],
            [
                "Eric",
                "Tai"
            ],
            [
                "George",
                "Andreou"
            ],
            [
                "Dinesh",
                "Kumar"
            ],
            [
                "Jandy",
                "Nelson"
            ],
            [
                "Steven",
                "Davis"
            ],
            [
                "Michael",
                "Leighton"
            ],
            [
                "David",
                "Shieber"
            ],
            [
                "Eric",
                "Rugh"
            ],
            [
                "Sarah",
                "Smith"
            ],
            [
                "Eric",
                "Brown"
            ],
            [
                "Shiela",
                "Jones"
            ],
            [
                "Lisa",
                "Cheng"
            ],
            [
                "David",
                "Adams"
            ],
            [
                "Ian",
                "Thornton"
            ],
            [
                "Paul",
                "Gompers"
            ],
            [
                "Sarah",
                "Schmidt"
            ],
            [
                "Bruce",
                "Wilson"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWHERE student.city_code <> 'HKG'\nRETURN student.Fname,student.LName\nORDER BY student.Age",
        "question": "What are the first and last names of all students who are not living in the city HKG and order the results by age?",
        "answers": [
            [
                "Derek",
                "Lee"
            ],
            [
                "Mark",
                "Schwartz"
            ],
            [
                "Michael",
                "Woods"
            ],
            [
                "Jun",
                "Han"
            ],
            [
                "Linda",
                "Smith"
            ],
            [
                "Andy",
                "Schultz"
            ],
            [
                "Lisa",
                "Apap"
            ],
            [
                "Charles",
                "Norris"
            ],
            [
                "Arthur",
                "Pang"
            ],
            [
                "Stacy",
                "Prater"
            ],
            [
                "Mark",
                "Goldman"
            ],
            [
                "Paul",
                "Brody"
            ],
            [
                "William",
                "Simms"
            ],
            [
                "Eric",
                "Epp"
            ],
            [
                "Eric",
                "Tai"
            ],
            [
                "George",
                "Andreou"
            ],
            [
                "Dinesh",
                "Kumar"
            ],
            [
                "Jandy",
                "Nelson"
            ],
            [
                "Steven",
                "Davis"
            ],
            [
                "Michael",
                "Leighton"
            ],
            [
                "David",
                "Shieber"
            ],
            [
                "Eric",
                "Rugh"
            ],
            [
                "Sarah",
                "Smith"
            ],
            [
                "Eric",
                "Brown"
            ],
            [
                "Shiela",
                "Jones"
            ],
            [
                "Lisa",
                "Cheng"
            ],
            [
                "David",
                "Adams"
            ],
            [
                "Ian",
                "Thornton"
            ],
            [
                "Paul",
                "Gompers"
            ],
            [
                "Sarah",
                "Schmidt"
            ],
            [
                "Bruce",
                "Wilson"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Dorm_amenity`)-[T2:`dorm_1.Has_amenity`]-(T3:`dorm_1.Dorm`)\nWHERE T3.dorm_name = 'Anonymous Donor Hall'\nRETURN T1.amenity_name\nORDER BY T1.amenity_name",
        "question": "List name of all amenities which Anonymous Donor Hall has, and sort the results in alphabetic order.",
        "answers": [
            [
                "4 Walls"
            ],
            [
                "Air Conditioning"
            ],
            [
                "Carpeted Rooms"
            ],
            [
                "Ethernet Ports"
            ],
            [
                "Heat"
            ],
            [
                "Roof"
            ],
            [
                "Study Room"
            ],
            [
                "TV Lounge"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Dorm_amenity`)-[T2:`dorm_1.Has_amenity`]-(T3:`dorm_1.Dorm`)\nWHERE T3.dorm_name = 'Anonymous Donor Hall'\nRETURN T1.amenity_name\nORDER BY T1.amenity_name",
        "question": "What are the amenities in alphabetical order that Anonymous Donor Hall has?",
        "answers": [
            [
                "4 Walls"
            ],
            [
                "Air Conditioning"
            ],
            [
                "Carpeted Rooms"
            ],
            [
                "Ethernet Ports"
            ],
            [
                "Heat"
            ],
            [
                "Roof"
            ],
            [
                "Study Room"
            ],
            [
                "TV Lounge"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nRETURN count(*),student.Major",
        "question": "Find the number of students in each major.",
        "answers": [
            [
                18,
                600
            ],
            [
                6,
                520
            ],
            [
                2,
                540
            ],
            [
                5,
                550
            ],
            [
                1,
                100
            ],
            [
                2,
                50
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nRETURN count(*),student.Major",
        "question": "How many students are there in each major?",
        "answers": [
            [
                18,
                600
            ],
            [
                6,
                520
            ],
            [
                2,
                540
            ],
            [
                5,
                550
            ],
            [
                1,
                100
            ],
            [
                2,
                50
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nRETURN count(*),avg(student.Age),student.city_code",
        "question": "Find the number and average age of students living in each city.",
        "answers": [
            [
                4,
                18.5,
                "BAL"
            ],
            [
                3,
                18.0,
                "HKG"
            ],
            [
                3,
                21.666666666666668,
                "WAS"
            ],
            [
                1,
                20.0,
                "CHI"
            ],
            [
                2,
                22.5,
                "YYZ"
            ],
            [
                4,
                19.0,
                "PIT"
            ],
            [
                1,
                17.0,
                "HOU"
            ],
            [
                3,
                19.666666666666668,
                "PHL"
            ],
            [
                1,
                18.0,
                "DAL"
            ],
            [
                1,
                17.0,
                "DET"
            ],
            [
                1,
                27.0,
                "LON"
            ],
            [
                3,
                20.333333333333332,
                "NYC"
            ],
            [
                1,
                18.0,
                "LOS"
            ],
            [
                1,
                20.0,
                "ROC"
            ],
            [
                1,
                17.0,
                "PEK"
            ],
            [
                1,
                21.0,
                "SFO"
            ],
            [
                1,
                20.0,
                "ATL"
            ],
            [
                1,
                18.0,
                "NAR"
            ],
            [
                1,
                18.0,
                "BOS"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nRETURN count(*),avg(student.Age),student.city_code",
        "question": "How many students live in each city and what are their average ages?",
        "answers": [
            [
                4,
                18.5,
                "BAL"
            ],
            [
                3,
                18.0,
                "HKG"
            ],
            [
                3,
                21.666666666666668,
                "WAS"
            ],
            [
                1,
                20.0,
                "CHI"
            ],
            [
                2,
                22.5,
                "YYZ"
            ],
            [
                4,
                19.0,
                "PIT"
            ],
            [
                1,
                17.0,
                "HOU"
            ],
            [
                3,
                19.666666666666668,
                "PHL"
            ],
            [
                1,
                18.0,
                "DAL"
            ],
            [
                1,
                17.0,
                "DET"
            ],
            [
                1,
                27.0,
                "LON"
            ],
            [
                3,
                20.333333333333332,
                "NYC"
            ],
            [
                1,
                18.0,
                "LOS"
            ],
            [
                1,
                20.0,
                "ROC"
            ],
            [
                1,
                17.0,
                "PEK"
            ],
            [
                1,
                21.0,
                "SFO"
            ],
            [
                1,
                20.0,
                "ATL"
            ],
            [
                1,
                18.0,
                "NAR"
            ],
            [
                1,
                18.0,
                "BOS"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWHERE student.Sex = 'M'\nRETURN count(*),avg(student.Age),student.city_code",
        "question": "Find the average age and number of male students (with sex M) from each city.",
        "answers": [
            [
                1,
                20.0,
                "CHI"
            ],
            [
                2,
                22.5,
                "YYZ"
            ],
            [
                1,
                18.0,
                "BAL"
            ],
            [
                1,
                17.0,
                "HOU"
            ],
            [
                2,
                19.5,
                "PHL"
            ],
            [
                3,
                19.333333333333332,
                "PIT"
            ],
            [
                1,
                18.0,
                "DAL"
            ],
            [
                1,
                17.0,
                "DET"
            ],
            [
                1,
                27.0,
                "LON"
            ],
            [
                1,
                18.0,
                "WAS"
            ],
            [
                3,
                20.333333333333332,
                "NYC"
            ],
            [
                1,
                19.0,
                "HKG"
            ],
            [
                1,
                18.0,
                "LOS"
            ],
            [
                1,
                20.0,
                "ROC"
            ],
            [
                1,
                17.0,
                "PEK"
            ],
            [
                1,
                20.0,
                "ATL"
            ],
            [
                1,
                18.0,
                "NAR"
            ],
            [
                1,
                18.0,
                "BOS"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWHERE student.Sex = 'M'\nRETURN count(*),avg(student.Age),student.city_code",
        "question": "What is the average age and how many male students are there in each city?",
        "answers": [
            [
                1,
                20.0,
                "CHI"
            ],
            [
                2,
                22.5,
                "YYZ"
            ],
            [
                1,
                18.0,
                "BAL"
            ],
            [
                1,
                17.0,
                "HOU"
            ],
            [
                2,
                19.5,
                "PHL"
            ],
            [
                3,
                19.333333333333332,
                "PIT"
            ],
            [
                1,
                18.0,
                "DAL"
            ],
            [
                1,
                17.0,
                "DET"
            ],
            [
                1,
                27.0,
                "LON"
            ],
            [
                1,
                18.0,
                "WAS"
            ],
            [
                3,
                20.333333333333332,
                "NYC"
            ],
            [
                1,
                19.0,
                "HKG"
            ],
            [
                1,
                18.0,
                "LOS"
            ],
            [
                1,
                20.0,
                "ROC"
            ],
            [
                1,
                17.0,
                "PEK"
            ],
            [
                1,
                20.0,
                "ATL"
            ],
            [
                1,
                18.0,
                "NAR"
            ],
            [
                1,
                18.0,
                "BOS"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWITH count(*) AS count, student.city_code AS city_code\nWHERE count  > 1\nRETURN count,city_code",
        "question": "Find the number of students for the cities where have more than one student.",
        "answers": [
            [
                4,
                "BAL"
            ],
            [
                3,
                "HKG"
            ],
            [
                3,
                "WAS"
            ],
            [
                2,
                "YYZ"
            ],
            [
                4,
                "PIT"
            ],
            [
                3,
                "PHL"
            ],
            [
                3,
                "NYC"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWITH count(*) AS count, student.city_code AS city_code\nWHERE count  > 1\nRETURN count,city_code",
        "question": "How many students are from each city, and which cities have more than one cities?",
        "answers": [
            [
                4,
                "BAL"
            ],
            [
                3,
                "HKG"
            ],
            [
                3,
                "WAS"
            ],
            [
                2,
                "YYZ"
            ],
            [
                4,
                "PIT"
            ],
            [
                3,
                "PHL"
            ],
            [
                3,
                "NYC"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWITH avg(student.Age) AS age\nMATCH (student:`dorm_1.Student`)\nWHERE  student.Age >  age \nRETURN count(*),student.Sex",
        "question": "Find the number of students whose age is older than the average age for each gender.",
        "answers": [
            [
                5,
                "F"
            ],
            [
                10,
                "M"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWITH avg(student.Age) AS age\nMATCH (student:`dorm_1.Student`)\nWHERE  student.Age >  age \nRETURN count(*),student.Sex",
        "question": "How many students are older than average for each gender?",
        "answers": [
            [
                5,
                "F"
            ],
            [
                10,
                "M"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Dorm`)-[T2:`dorm_1.Has_amenity`]-()\nWHERE T1.student_capacity > 100\nRETURN count(*),T1.dormid",
        "question": "Find the number of amenities for each of the dorms that can accommodate more than 100 students.",
        "answers": [
            [
                5,
                110
            ],
            [
                6,
                140
            ],
            [
                12,
                160
            ],
            [
                8,
                109
            ],
            [
                3,
                104
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Dorm`)-[T2:`dorm_1.Has_amenity`]-()\nWHERE T1.student_capacity > 100\nRETURN count(*),T1.dormid",
        "question": "For each dorm, how many amenities does it have?",
        "answers": [
            [
                5,
                110
            ],
            [
                6,
                140
            ],
            [
                12,
                160
            ],
            [
                8,
                109
            ],
            [
                3,
                104
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Student`)-[T2:`dorm_1.Lives_in`]-(T3:`dorm_1.Dorm`)\nWHERE T1.Age > 20\nRETURN count(*),T3.dorm_name",
        "question": "Find the number of students who is older than 20 in each dorm.",
        "answers": [
            [
                2,
                "Smith Hall"
            ],
            [
                2,
                "Fawlty Towers"
            ],
            [
                2,
                "Dorm-plex 2000"
            ],
            [
                1,
                "Anonymous Donor Hall"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Student`)-[T2:`dorm_1.Lives_in`]-(T3:`dorm_1.Dorm`)\nWHERE T1.Age > 20\nRETURN count(*),T3.dorm_name",
        "question": "How many students are older than 20 in each dorm?",
        "answers": [
            [
                2,
                "Smith Hall"
            ],
            [
                2,
                "Fawlty Towers"
            ],
            [
                2,
                "Dorm-plex 2000"
            ],
            [
                1,
                "Anonymous Donor Hall"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Student`)-[T2:`dorm_1.Lives_in`]-(T3:`dorm_1.Dorm`)\nWHERE T3.dorm_name = 'Smith Hall'\nRETURN T1.Fname",
        "question": "Find the first name of students who are living in the Smith Hall.",
        "answers": [
            [
                "Stacy"
            ],
            [
                "Sarah"
            ],
            [
                "Michael"
            ],
            [
                "Sarah"
            ],
            [
                "Shiela"
            ],
            [
                "Tracy"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Student`)-[T2:`dorm_1.Lives_in`]-(T3:`dorm_1.Dorm`)\nWHERE T3.dorm_name = 'Smith Hall'\nRETURN T1.Fname",
        "question": "What are the first names of all students in Smith Hall?",
        "answers": [
            [
                "Stacy"
            ],
            [
                "Sarah"
            ],
            [
                "Michael"
            ],
            [
                "Sarah"
            ],
            [
                "Shiela"
            ],
            [
                "Tracy"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Student`)-[T2:`dorm_1.Lives_in`]-(T3:`dorm_1.Dorm`)\nWHERE T3.gender = 'M'\nRETURN count(*)",
        "question": "Find the total number of students living in the male dorm (with gender M).",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Student`)-[T2:`dorm_1.Lives_in`]-(T3:`dorm_1.Dorm`)\nWHERE T3.gender = 'M'\nRETURN count(*)",
        "question": "What are the total number of students who are living in a male dorm?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Student`)-[T2:`dorm_1.Lives_in`]-(T3:`dorm_1.Dorm`)\nWHERE T3.dorm_name = 'Smith Hall' AND T1.Sex = 'F'\nRETURN count(*)",
        "question": "Find the number of female students (with F sex) living in Smith Hall",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Student`)-[T2:`dorm_1.Lives_in`]-(T3:`dorm_1.Dorm`)\nWHERE T3.dorm_name = 'Smith Hall' AND T1.Sex = 'F'\nRETURN count(*)",
        "question": "How many female students live in Smith Hall?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Dorm`)-[T2:`dorm_1.Has_amenity`]-(T3:`dorm_1.Dorm_amenity`)\nWHERE T1.dorm_name = 'Smith Hall'\nRETURN T3.amenity_name",
        "question": "Find the name of amenities Smith Hall dorm have.",
        "answers": [
            [
                "4 Walls"
            ],
            [
                "Roof"
            ],
            [
                "Heat"
            ],
            [
                "Study Room"
            ],
            [
                "Carpeted Rooms"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Dorm`)-[T2:`dorm_1.Has_amenity`]-(T3:`dorm_1.Dorm_amenity`)\nWHERE T1.dorm_name = 'Smith Hall'\nRETURN T3.amenity_name",
        "question": "What are the names of the amenities that Smith Hall has?",
        "answers": [
            [
                "4 Walls"
            ],
            [
                "Roof"
            ],
            [
                "Heat"
            ],
            [
                "Study Room"
            ],
            [
                "Carpeted Rooms"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (T1:`dorm_1.Dorm`)-[T2:`dorm_1.Has_amenity`]-(T3:`dorm_1.Dorm_amenity`)\nWHERE T1.dorm_name = 'Smith Hall'\nRETURN T3.amenity_name\nORDER BY T3.amenity_name",
        "question": "Find the name of amenities Smith Hall dorm have. ordered the results by amenity names.",
        "answers": [
            [
                "4 Walls"
            ],
            [
                "Carpeted Rooms"
            ],
            [
                "Heat"
            ],
            [
                "Roof"
            ],
            [
                "Study Room"
            ]
        ]
    }
]