[
    {
        "question": "Show all allergies and their types.",
        "query": "MATCH (allergy_type:`allergy_1.Allergy_Type`)\nRETURN allergy_type.Allergy,allergy_type.AllergyType",
        "db_id": "allergy_1",
        "answers": [
            [
                "Eggs",
                "food"
            ],
            [
                "Nuts",
                "food"
            ],
            [
                "Milk",
                "food"
            ],
            [
                "Shellfish",
                "food"
            ],
            [
                "Anchovies",
                "food"
            ],
            [
                "Wheat",
                "food"
            ],
            [
                "Soy",
                "food"
            ],
            [
                "Ragweed",
                "environmental"
            ],
            [
                "Tree Pollen",
                "environmental"
            ],
            [
                "Grass Pollen",
                "environmental"
            ],
            [
                "Cat",
                "animal"
            ],
            [
                "Dog",
                "animal"
            ],
            [
                "Rodent",
                "animal"
            ],
            [
                "Bee Stings",
                "animal"
            ]
        ]
    },
    {
        "question": "Show all allergies with type food.",
        "query": "MATCH (allergy_type:`allergy_1.Allergy_Type`)\nWHERE allergy_type.AllergyType = 'food'\nRETURN DISTINCT allergy_type.Allergy",
        "db_id": "allergy_1",
        "answers": [
            [
                "Eggs"
            ],
            [
                "Nuts"
            ],
            [
                "Milk"
            ],
            [
                "Shellfish"
            ],
            [
                "Anchovies"
            ],
            [
                "Wheat"
            ],
            [
                "Soy"
            ]
        ]
    },
    {
        "question": "Show all allergy types and the number of allergies in each type.",
        "query": "MATCH (allergy_type:`allergy_1.Allergy_Type`)\nWITH allergy_type.AllergyType AS AllergyType, count(allergy_type.AllergyType) AS count\nRETURN AllergyType,count",
        "db_id": "allergy_1",
        "answers": [
            [
                "food",
                7
            ],
            [
                "environmental",
                3
            ],
            [
                "animal",
                4
            ]
        ]
    },
    {
        "question": "Which allergy type has least number of allergies?",
        "query": "MATCH (allergy_type:`allergy_1.Allergy_Type`)\nWITH allergy_type.AllergyType AS AllergyType, count(allergy_type.AllergyType) AS count\nRETURN AllergyType\nORDER BY count ASC\nLIMIT 1",
        "db_id": "allergy_1",
        "answers": [
            [
                "environmental"
            ]
        ]
    },
    {
        "question": "Which allergy type is the least common?",
        "query": "MATCH (allergy_type:`allergy_1.Allergy_Type`)\nWITH allergy_type.AllergyType AS AllergyType, count(allergy_type.AllergyType) AS count\nRETURN AllergyType\nORDER BY count ASC\nLIMIT 1",
        "db_id": "allergy_1",
        "answers": [
            [
                "environmental"
            ]
        ]
    },
    {
        "question": "Show first name and last name for all students.",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN student.Fname,student.LName",
        "db_id": "allergy_1",
        "answers": [
            [
                "Linda",
                "Smith"
            ],
            [
                "Tracy",
                "Kim"
            ],
            [
                "Shiela",
                "Jones"
            ],
            [
                "Dinesh",
                "Kumar"
            ],
            [
                "Paul",
                "Gompers"
            ],
            [
                "Andy",
                "Schultz"
            ],
            [
                "Lisa",
                "Apap"
            ],
            [
                "Jandy",
                "Nelson"
            ],
            [
                "Eric",
                "Tai"
            ],
            [
                "Derek",
                "Lee"
            ],
            [
                "David",
                "Adams"
            ],
            [
                "Steven",
                "Davis"
            ],
            [
                "Charles",
                "Norris"
            ],
            [
                "Susan",
                "Lee"
            ],
            [
                "Mark",
                "Schwartz"
            ],
            [
                "Bruce",
                "Wilson"
            ],
            [
                "Michael",
                "Leighton"
            ],
            [
                "Arthur",
                "Pang"
            ],
            [
                "Ian",
                "Thornton"
            ],
            [
                "George",
                "Andreou"
            ],
            [
                "Michael",
                "Woods"
            ],
            [
                "David",
                "Shieber"
            ],
            [
                "Stacy",
                "Prater"
            ],
            [
                "Mark",
                "Goldman"
            ],
            [
                "Eric",
                "Pang"
            ],
            [
                "Paul",
                "Brody"
            ],
            [
                "Eric",
                "Rugh"
            ],
            [
                "Jun",
                "Han"
            ],
            [
                "Lisa",
                "Cheng"
            ],
            [
                "Sarah",
                "Smith"
            ],
            [
                "Eric",
                "Brown"
            ],
            [
                "William",
                "Simms"
            ],
            [
                "Eric",
                "Epp"
            ],
            [
                "Sarah",
                "Schmidt"
            ]
        ]
    },
    {
        "question": "Show all majors.",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN DISTINCT student.Major",
        "db_id": "allergy_1",
        "answers": [
            [
                600
            ],
            [
                520
            ],
            [
                540
            ],
            [
                550
            ],
            [
                100
            ],
            [
                50
            ]
        ]
    },
    {
        "question": "Show all cities where students live.",
        "query": "MATCH (student:`allergy_1.Student`)\nRETURN DISTINCT student.city_code",
        "db_id": "allergy_1",
        "answers": [
            [
                "BAL"
            ],
            [
                "HKG"
            ],
            [
                "WAS"
            ],
            [
                "CHI"
            ],
            [
                "YYZ"
            ],
            [
                "PIT"
            ],
            [
                "HOU"
            ],
            [
                "PHL"
            ],
            [
                "DAL"
            ],
            [
                "DET"
            ],
            [
                "LON"
            ],
            [
                "NYC"
            ],
            [
                "LOS"
            ],
            [
                "ROC"
            ],
            [
                "PEK"
            ],
            [
                "SFO"
            ],
            [
                "ATL"
            ],
            [
                "NAR"
            ],
            [
                "BOS"
            ]
        ]
    },
    {
        "question": "Show first name, last name, age for all female students. Their sex is F.",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.Sex = 'F'\nRETURN student.Fname,student.LName,student.Age",
        "db_id": "allergy_1",
        "answers": [
            [
                "Linda",
                "Smith",
                18
            ],
            [
                "Tracy",
                "Kim",
                19
            ],
            [
                "Shiela",
                "Jones",
                21
            ],
            [
                "Lisa",
                "Apap",
                18
            ],
            [
                "Jandy",
                "Nelson",
                20
            ],
            [
                "Susan",
                "Lee",
                16
            ],
            [
                "Stacy",
                "Prater",
                18
            ],
            [
                "Lisa",
                "Cheng",
                21
            ],
            [
                "Sarah",
                "Smith",
                20
            ],
            [
                "Sarah",
                "Schmidt",
                26
            ]
        ]
    },
    {
        "question": "Show student ids for all male students.",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.Sex = 'M'\nRETURN student.StuID",
        "db_id": "allergy_1",
        "answers": [
            [
                1004
            ],
            [
                1005
            ],
            [
                1006
            ],
            [
                1009
            ],
            [
                1010
            ],
            [
                1011
            ],
            [
                1012
            ],
            [
                1014
            ],
            [
                1016
            ],
            [
                1017
            ],
            [
                1018
            ],
            [
                1019
            ],
            [
                1020
            ],
            [
                1021
            ],
            [
                1022
            ],
            [
                1023
            ],
            [
                1025
            ],
            [
                1026
            ],
            [
                1027
            ],
            [
                1028
            ],
            [
                1029
            ],
            [
                1032
            ],
            [
                1033
            ],
            [
                1034
            ]
        ]
    },
    {
        "question": "Show all student ids who are older than 20.",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.Age > 20\nRETURN student.StuID",
        "db_id": "allergy_1",
        "answers": [
            [
                1003
            ],
            [
                1005
            ],
            [
                1011
            ],
            [
                1017
            ],
            [
                1020
            ],
            [
                1030
            ],
            [
                1035
            ]
        ]
    },
    {
        "question": "Which city does the student whose last name is \"Kim\" live in?",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.LName = 'Kim'\nRETURN student.city_code",
        "db_id": "allergy_1",
        "answers": [
            [
                "HKG"
            ]
        ]
    },
    {
        "question": "How many students live in HKG or CHI?",
        "query": "MATCH (student:`allergy_1.Student`)\nWHERE student.city_code = 'HKG' OR student.city_code = 'CHI'\nRETURN count(*)",
        "db_id": "allergy_1",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "question": "Show all majors and corresponding number of students.",
        "query": "MATCH (student:`allergy_1.Student`)\nWITH student.Major AS Major, count(student.Major) AS count\nRETURN Major,count",
        "db_id": "allergy_1",
        "answers": [
            [
                600,
                18
            ],
            [
                520,
                6
            ],
            [
                540,
                2
            ],
            [
                550,
                5
            ],
            [
                100,
                1
            ],
            [
                50,
                2
            ]
        ]
    },
    {
        "question": "Show all ages and corresponding number of students.",
        "query": "MATCH (student:`allergy_1.Student`)\nWITH student.Age AS Age, count(student.Age) AS count\nRETURN Age,count",
        "db_id": "allergy_1",
        "answers": [
            [
                18,
                10
            ],
            [
                19,
                4
            ],
            [
                21,
                2
            ],
            [
                20,
                8
            ],
            [
                26,
                2
            ],
            [
                17,
                4
            ],
            [
                22,
                2
            ],
            [
                16,
                1
            ],
            [
                27,
                1
            ]
        ]
    },
    {
        "question": "Show all cities and corresponding number of students.",
        "query": "MATCH (student:`allergy_1.Student`)\nWITH student.city_code AS city_code, count(student.city_code) AS count\nRETURN city_code,count",
        "db_id": "allergy_1",
        "answers": [
            [
                "BAL",
                4
            ],
            [
                "HKG",
                3
            ],
            [
                "WAS",
                3
            ],
            [
                "CHI",
                1
            ],
            [
                "YYZ",
                2
            ],
            [
                "PIT",
                4
            ],
            [
                "HOU",
                1
            ],
            [
                "PHL",
                3
            ],
            [
                "DAL",
                1
            ],
            [
                "DET",
                1
            ],
            [
                "LON",
                1
            ],
            [
                "NYC",
                3
            ],
            [
                "LOS",
                1
            ],
            [
                "ROC",
                1
            ],
            [
                "PEK",
                1
            ],
            [
                "SFO",
                1
            ],
            [
                "ATL",
                1
            ],
            [
                "NAR",
                1
            ],
            [
                "BOS",
                1
            ]
        ]
    },
    {
        "question": "Show all advisors and corresponding number of students.",
        "query": "MATCH (student:`allergy_1.Student`)\nWITH count(student.Advisor) AS count, student.Advisor AS Advisor\nRETURN Advisor,count",
        "db_id": "allergy_1",
        "answers": [
            [
                1121,
                3
            ],
            [
                7712,
                1
            ],
            [
                7792,
                1
            ],
            [
                8423,
                1
            ],
            [
                1148,
                3
            ],
            [
                8918,
                1
            ],
            [
                9172,
                1
            ],
            [
                2192,
                4
            ],
            [
                7723,
                1
            ],
            [
                8741,
                1
            ],
            [
                8721,
                1
            ],
            [
                7271,
                2
            ],
            [
                8722,
                3
            ],
            [
                7134,
                2
            ],
            [
                8723,
                1
            ],
            [
                2311,
                3
            ],
            [
                8772,
                3
            ],
            [
                5718,
                2
            ]
        ]
    },
    {
        "question": "Which advisor has most number of students?",
        "query": "MATCH (student:`allergy_1.Student`)\nWITH count(student.Advisor) AS count, student.Advisor AS Advisor\nRETURN Advisor\nORDER BY count DESC\nLIMIT 1",
        "db_id": "allergy_1",
        "answers": [
            [
                2192
            ]
        ]
    },
    {
        "question": "List the names of editors in ascending order of age.",
        "query": "MATCH (editor:`journal_committee.editor`)\nRETURN editor.Name\nORDER BY editor.Age ASC",
        "db_id": "journal_committee",
        "answers": [
            [
                "Szymon Wydra"
            ],
            [
                "Marek Siudym"
            ],
            [
                "W\u0142adys\u0142aw Grzywna"
            ],
            [
                "Mariusz Zalejski"
            ],
            [
                "Kamila Porczyk"
            ],
            [
                "Anna Powierza"
            ],
            [
                "Maria G\u00f3ralczyk"
            ],
            [
                "Piotr Pr\u0119gowski"
            ],
            [
                "Gra\u017cyna Wolszczak"
            ]
        ]
    },
    {
        "question": "List the names of editors who are older than 25.",
        "query": "MATCH (editor:`journal_committee.editor`)\nWHERE editor.Age > 25\nRETURN editor.Name",
        "db_id": "journal_committee",
        "answers": [
            [
                "Kamila Porczyk"
            ],
            [
                "Anna Powierza"
            ],
            [
                "Piotr Pr\u0119gowski"
            ],
            [
                "Gra\u017cyna Wolszczak"
            ],
            [
                "Maria G\u00f3ralczyk"
            ]
        ]
    },
    {
        "question": "Show the names of editors of age either 24 or 25.",
        "query": "MATCH (editor:`journal_committee.editor`)\nWHERE editor.Age = 24 OR editor.Age = 25\nRETURN editor.Name",
        "db_id": "journal_committee",
        "answers": [
            [
                "W\u0142adys\u0142aw Grzywna"
            ],
            [
                "Mariusz Zalejski"
            ]
        ]
    },
    {
        "question": "What are the different ages of editors? Show each age along with the number of editors of that age.",
        "query": "MATCH (editor:`journal_committee.editor`)\nWITH count(editor.Age) AS count, editor.Age AS Age\nRETURN Age,count",
        "db_id": "journal_committee",
        "answers": [
            [
                34.0,
                1
            ],
            [
                35.0,
                1
            ],
            [
                21.0,
                1
            ],
            [
                43.0,
                1
            ],
            [
                20.0,
                1
            ],
            [
                24.0,
                1
            ],
            [
                25.0,
                1
            ],
            [
                54.0,
                1
            ],
            [
                38.0,
                1
            ]
        ]
    },
    {
        "question": "Show the distinct themes of journals.",
        "query": "MATCH (journal:`journal_committee.journal`)\nRETURN DISTINCT journal.Theme",
        "db_id": "journal_committee",
        "answers": [
            [
                "Miami Dolphins"
            ],
            [
                "at Jacksonville Jaguars"
            ],
            [
                "at Baltimore Ravens"
            ],
            [
                "Tampa Bay Buccaneers"
            ],
            [
                "at Detroit Lions"
            ],
            [
                "at Pittsburgh Steelers"
            ],
            [
                "Jacksonville Jaguars"
            ],
            [
                "Baltimore Ravens"
            ],
            [
                "at Cincinnati Bengals"
            ],
            [
                "Pittsburgh Steelers"
            ],
            [
                "at Cleveland Browns"
            ],
            [
                "at Minnesota Vikings"
            ],
            [
                "Green Bay Packers"
            ],
            [
                "at Oakland Raiders"
            ],
            [
                "Cleveland Browns"
            ],
            [
                "Cincinnati Bengals"
            ]
        ]
    },
    {
        "question": "Show the id, name of each editor and the number of journal committees they are on.",
        "query": "MATCH (T1:`journal_committee.editor`)-[T2:`journal_committee.journal_committee`]-()\nWITH T1.Name AS Name, count(T1.Editor_ID) AS count, T1.Editor_ID AS Editor_ID\nRETURN Editor_ID,Name,count",
        "db_id": "journal_committee",
        "answers": [
            [
                1,
                "Kamila Porczyk",
                1
            ],
            [
                3,
                "Marek Siudym",
                1
            ],
            [
                4,
                "Piotr Pr\u0119gowski",
                1
            ],
            [
                6,
                "W\u0142adys\u0142aw Grzywna",
                1
            ],
            [
                8,
                "Gra\u017cyna Wolszczak",
                2
            ],
            [
                9,
                "Maria G\u00f3ralczyk",
                1
            ]
        ]
    },
    {
        "question": "Show the names of editors that are on at least two journal committees.",
        "query": "MATCH (T1:`journal_committee.editor`)-[T2:`journal_committee.journal_committee`]-()\nWITH T1.Name AS Name, count(*) AS count\nWHERE count  >= 2\nRETURN Name",
        "db_id": "journal_committee",
        "answers": [
            [
                "Gra\u017cyna Wolszczak"
            ]
        ]
    },
    {
        "question": "List the names of editors that are not on any journal committee.",
        "query": "MATCH (editor:`journal_committee.editor`)\nWHERE NOT (editor:`journal_committee.editor`)-[:`journal_committee.journal_committee`]-()\nRETURN editor.Name",
        "db_id": "journal_committee",
        "answers": [
            [
                "Anna Powierza"
            ],
            [
                "Szymon Wydra"
            ],
            [
                "Mariusz Zalejski"
            ]
        ]
    },
    {
        "question": "What is the average sales of the journals that have an editor whose work type is 'Photo'?",
        "query": "MATCH (T1:`journal_committee.journal`)-[T2:`journal_committee.journal_committee`]-()\nWHERE T2.Work_Type = 'Photo'\nRETURN avg(T1.Sales)",
        "db_id": "journal_committee",
        "answers": [
            [
                4660.25
            ]
        ]
    },
    {
        "question": "Count the number of accounts.",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nRETURN count(*)",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Show ids, customer ids, names for all accounts.",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nRETURN accounts.account_id,accounts.customer_id,accounts.account_name",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                1,
                6,
                "338"
            ],
            [
                2,
                14,
                "562"
            ],
            [
                3,
                9,
                "162"
            ],
            [
                4,
                12,
                "038"
            ],
            [
                5,
                13,
                "858"
            ],
            [
                6,
                12,
                "262"
            ],
            [
                7,
                9,
                "621"
            ],
            [
                8,
                8,
                "381"
            ],
            [
                9,
                9,
                "546"
            ],
            [
                10,
                4,
                "767"
            ],
            [
                11,
                4,
                "022"
            ],
            [
                12,
                2,
                "866"
            ],
            [
                13,
                10,
                "234"
            ],
            [
                14,
                9,
                "557"
            ],
            [
                15,
                4,
                "725"
            ]
        ]
    },
    {
        "question": "Show other account details for account with name 338.",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nWHERE accounts.account_name = '338'\nRETURN accounts.other_account_details",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                "Regular"
            ]
        ]
    },
    {
        "question": "What are the other account details for the account with the name 338?",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nWHERE accounts.account_name = '338'\nRETURN accounts.other_account_details",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                "Regular"
            ]
        ]
    },
    {
        "question": "Show all customer ids and the number of accounts for each customer.",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nWITH count(accounts.customer_id) AS count, accounts.customer_id AS customer_id\nRETURN customer_id,count",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                6,
                1
            ],
            [
                14,
                1
            ],
            [
                9,
                4
            ],
            [
                12,
                2
            ],
            [
                13,
                1
            ],
            [
                8,
                1
            ],
            [
                4,
                3
            ],
            [
                2,
                1
            ],
            [
                10,
                1
            ]
        ]
    },
    {
        "question": "Show the customer id and number of accounts with most accounts.",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nWITH count(accounts.customer_id) AS count, accounts.customer_id AS customer_id\nRETURN customer_id,count\nORDER BY count DESC\nLIMIT 1",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                9,
                4
            ]
        ]
    },
    {
        "question": "What is the customer id of the customer with the most accounts, and how many accounts does this person have?",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nWITH count(accounts.customer_id) AS count, accounts.customer_id AS customer_id\nRETURN customer_id,count\nORDER BY count DESC\nLIMIT 1",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                9,
                4
            ]
        ]
    },
    {
        "question": "Count the number of customers who hold an account.",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nRETURN count(DISTINCT accounts.customer_id)",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "question": "Count the number of customers.",
        "query": "MATCH (customers:`customers_card_transactions.Customers`)\nRETURN count(*)",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Show ids, first names, last names, and phones for all customers.",
        "query": "MATCH (customers:`customers_card_transactions.Customers`)\nRETURN customers.customer_id,customers.customer_first_name,customers.customer_last_name,customers.customer_phone",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                1,
                "Aniyah",
                "Feest",
                "(673)872-5338"
            ],
            [
                2,
                "Susie",
                "Wiza",
                "679-845-8645x94312"
            ],
            [
                3,
                "Marcel",
                "Brekke",
                "1-511-656-6664"
            ],
            [
                4,
                "Art",
                "Turcotte",
                "941-213-6716x675"
            ],
            [
                5,
                "Armani",
                "Farrell",
                "224-123-1012"
            ],
            [
                6,
                "Kiel",
                "Schinner",
                "1-564-044-3909"
            ],
            [
                7,
                "Izabella",
                "Erdman",
                "751.049.9948"
            ],
            [
                8,
                "Elyssa",
                "Lind",
                "+12(6)9024410984"
            ],
            [
                9,
                "Faustino",
                "Langworth",
                "284.749.0453"
            ],
            [
                10,
                "Axel",
                "Effertz",
                "+90(8)1290735932"
            ],
            [
                11,
                "Frederic",
                "Swift",
                "1-207-977-5182"
            ],
            [
                12,
                "Bryce",
                "Rath",
                "(415)237-0701x3115"
            ],
            [
                13,
                "Serenity",
                "Effertz",
                "1-894-567-2283"
            ],
            [
                14,
                "Blanche",
                "Huels",
                "(703)950-4708x8972"
            ],
            [
                15,
                "Nat",
                "Davis",
                "246-469-4472x359"
            ]
        ]
    },
    {
        "question": "Show the number of customer cards.",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN count(*)",
        "db_id": "customers_card_transactions",
        "answers": [
            [
                15
            ]
        ]
    }
]