[
    {
        "db_id": "department_management",
        "query": "MATCH (head:`department_management.head`)\nRETURN head.name,head.born_state,head.age\nORDER BY head.age",
        "question": "List the name, born state and age of the heads of departments ordered by age.",
        "answers": [
            [
                "P\u00e1draig Harrington",
                "Connecticut",
                43.0
            ],
            [
                "Stewart Cink",
                "Florida",
                50.0
            ],
            [
                "Dudley Hart",
                "California",
                52.0
            ],
            [
                "Jeff Maggert",
                "Delaware",
                53.0
            ],
            [
                "Nick Faldo",
                "California",
                56.0
            ],
            [
                "Tiger Woods",
                "Alabama",
                67.0
            ],
            [
                "Franklin Langham",
                "Connecticut",
                67.0
            ],
            [
                "Sergio Garc\u00eda",
                "California",
                68.0
            ],
            [
                "K. J. Choi",
                "Alabama",
                69.0
            ],
            [
                "Billy Mayfair",
                "California",
                69.0
            ]
        ]
    },
    {
        "db_id": "department_management",
        "query": "MATCH (department:`department_management.department`)\nRETURN department.Creation,department.Name,department.Budget_in_Billions",
        "question": "List the creation year, name and budget of each department.",
        "answers": [
            [
                "1789",
                "State",
                9.96
            ],
            [
                "1789",
                "Treasury",
                11.1
            ],
            [
                "1947",
                "Defense",
                439.3
            ],
            [
                "1870",
                "Justice",
                23.4
            ],
            [
                "1849",
                "Interior",
                10.7
            ],
            [
                "1889",
                "Agriculture",
                77.6
            ],
            [
                "1903",
                "Commerce",
                6.2
            ],
            [
                "1913",
                "Labor",
                59.7
            ],
            [
                "1953",
                "Health and Human Services",
                543.2
            ],
            [
                "1965",
                "Housing and Urban Development",
                46.2
            ],
            [
                "1966",
                "Transportation",
                58.0
            ],
            [
                "1977",
                "Energy",
                21.5
            ],
            [
                "1979",
                "Education",
                62.8
            ],
            [
                "1989",
                "Veterans Affairs",
                73.2
            ],
            [
                "2002",
                "Homeland Security",
                44.6
            ]
        ]
    },
    {
        "db_id": "department_management",
        "query": "MATCH (T1:`department_management.department`)-[T2:`department_management.management`]-()\nWITH count(*) AS count, T1.Name AS Name, T1.Department_ID AS Department_ID\nWHERE count  > 1\nRETURN Department_ID,Name,count",
        "question": "Which department has more than 1 head at a time? List the id, name and the number of heads.",
        "answers": [
            [
                2,
                "Treasury",
                2
            ]
        ]
    },
    {
        "db_id": "department_management",
        "query": "MATCH (head:`department_management.head`)\nWHERE head.name =~'.*[H|h]a.*'\nRETURN head.head_ID,head.name",
        "question": "Which head's name has the substring 'Ha'? List the id and name.",
        "answers": [
            [
                4,
                "Dudley Hart"
            ],
            [
                9,
                "P\u00e1draig Harrington"
            ],
            [
                10,
                "Franklin Langham"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (farm:`farm.farm`)\nRETURN count(*)",
        "question": "Count the number of farms.",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (farm:`farm.farm`)\nRETURN farm.Total_Horses\nORDER BY farm.Total_Horses ASC",
        "question": "List the total number of horses on farms in ascending order.",
        "answers": [
            [
                2546.9
            ],
            [
                2604.8
            ],
            [
                3658.9
            ],
            [
                4781.3
            ],
            [
                5056.5
            ],
            [
                5308.2
            ],
            [
                5486.9
            ],
            [
                5607.5
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (farm_competition:`farm.farm_competition`)\nWHERE farm_competition.Theme <> 'Aliens'\nRETURN farm_competition.Hosts",
        "question": "What are the hosts of competitions whose theme is not \"Aliens\"?",
        "answers": [
            [
                "Miley Cyrus Jared Leto and Karen Mok"
            ],
            [
                "Leehom Wang and Kelly Rowland"
            ],
            [
                "Alicia Keys"
            ],
            [
                "Vanness Wu and Michelle Branch"
            ],
            [
                "Shaggy and Coco Lee"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (farm_competition:`farm.farm_competition`)\nRETURN farm_competition.Theme\nORDER BY farm_competition.Year ASC",
        "question": "Return the themes of farm competitions, sorted by year ascending.",
        "answers": [
            [
                "Aliens"
            ],
            [
                "MTV Cube"
            ],
            [
                "Valentine's Day"
            ],
            [
                "MTV Asia Aid"
            ],
            [
                "Codehunters"
            ],
            [
                "Carnival M is back!"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (farm:`farm.farm`)\nRETURN max(farm.Cows),min(farm.Cows)",
        "question": "What are the maximum and minimum number of cows across all farms.",
        "answers": [
            [
                3987.0,
                2407.2
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (farm:`farm.farm`)\nRETURN max(farm.Cows),min(farm.Cows)",
        "question": "Return the maximum and minimum number of cows across all farms.",
        "answers": [
            [
                3987.0,
                2407.2
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (city:`farm.city`)\nRETURN count(DISTINCT city.Status)",
        "question": "Count the number of different statuses.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (city:`farm.city`)\nRETURN city.Official_Name\nORDER BY city.Population DESC",
        "question": "List official names of cities in descending order of population.",
        "answers": [
            [
                "Grand Falls/Grand-Sault"
            ],
            [
                "Perth-Andover"
            ],
            [
                "Plaster Rock"
            ],
            [
                "Drummond"
            ],
            [
                "Aroostook"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (city:`farm.city`)\nRETURN city.Official_Name,city.Status\nORDER BY city.Population DESC\nLIMIT 1",
        "question": "List the official name and status of the city with the largest population.",
        "answers": [
            [
                "Grand Falls/Grand-Sault",
                "Town"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (T1:`farm.city`)-[]-(T2:`farm.farm_competition`)\nRETURN T2.Year,T1.Official_Name",
        "question": "Show the years and the official names of the host cities of competitions.",
        "answers": [
            [
                2013,
                "Grand Falls/Grand-Sault"
            ],
            [
                2006,
                "Perth-Andover"
            ],
            [
                2005,
                "Plaster Rock"
            ],
            [
                2004,
                "Drummond"
            ],
            [
                2002,
                "Aroostook"
            ],
            [
                2003,
                "Aroostook"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (T1:`farm.city`)-[]-(T2:`farm.farm_competition`)\nRETURN T2.Year,T1.Official_Name",
        "question": "Give the years and official names of the cities of each competition.",
        "answers": [
            [
                2013,
                "Grand Falls/Grand-Sault"
            ],
            [
                2006,
                "Perth-Andover"
            ],
            [
                2005,
                "Plaster Rock"
            ],
            [
                2004,
                "Drummond"
            ],
            [
                2002,
                "Aroostook"
            ],
            [
                2003,
                "Aroostook"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (T1:`farm.city`)-[]-(T2:`farm.farm_competition`)\nWITH count(*) AS count, T1.Official_Name AS Official_Name\nWHERE count  > 1\nRETURN Official_Name",
        "question": "Show the official names of the cities that have hosted more than one competition.",
        "answers": [
            [
                "Aroostook"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (T1:`farm.city`)-[]-(T2:`farm.farm_competition`)\nWHERE T1.Population > 1000\nRETURN T2.Theme",
        "question": "Please show the themes of competitions with host cities having populations larger than 1000.",
        "answers": [
            [
                "Carnival M is back!"
            ],
            [
                "Codehunters"
            ],
            [
                "MTV Asia Aid"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (city:`farm.city`)\nRETURN city.Status,avg(city.Population)",
        "question": "Please show the different statuses of cities and the average population of cities with each status.",
        "answers": [
            [
                "Town",
                5706.0
            ],
            [
                "Village",
                1009.75
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (city:`farm.city`)\nRETURN city.Status\nORDER BY city.Status ASC",
        "question": "Please show the different statuses, ordered by the number of cities that have each.",
        "answers": [
            [
                "Town"
            ],
            [
                "Village"
            ],
            [
                "Village"
            ],
            [
                "Village"
            ],
            [
                "Village"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (city:`farm.city`)\nRETURN city.Status\nORDER BY city.Status ASC",
        "question": "Return the different statuses of cities, ascending by frequency.",
        "answers": [
            [
                "Town"
            ],
            [
                "Village"
            ],
            [
                "Village"
            ],
            [
                "Village"
            ],
            [
                "Village"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (city:`farm.city`)\nRETURN city.Status\nORDER BY city.Status DESC\nLIMIT 1",
        "question": "List the most common type of Status across cities.",
        "answers": [
            [
                "Village"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (city:`farm.city`)\nWHERE NOT (city)-[]-(:`farm.farm_competition`)    \nRETURN city.Official_Name",
        "question": "List the official names of cities that have not held any competition.",
        "answers": []
    },
    {
        "db_id": "farm",
        "query": "MATCH (city:`farm.city`)\nWHERE NOT (city)-[]-(:`farm.farm_competition`)    \nRETURN city.Official_Name",
        "question": "What are the official names of cities that have not hosted a farm competition?",
        "answers": []
    },
    {
        "db_id": "farm",
        "query": "MATCH (city:`farm.city`)\nWHERE city.Population > 1500 OR city.Population < 500\nRETURN city.Official_Name",
        "question": "Find the official names of cities with population bigger than 1500 or smaller than 500.",
        "answers": [
            [
                "Grand Falls/Grand-Sault"
            ],
            [
                "Perth-Andover"
            ],
            [
                "Aroostook"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (city:`farm.city`)\nWHERE city.Status <> 'Village'\nRETURN city.Census_Ranking",
        "question": "Show the census ranking of cities whose status are not \"Village\".",
        "answers": [
            [
                "636 of 5008"
            ]
        ]
    },
    {
        "db_id": "farm",
        "query": "MATCH (city:`farm.city`)\nWHERE city.Status <> 'Village'\nRETURN city.Census_Ranking",
        "question": "What are the census rankings of cities that do not have the status \"Village\"?",
        "answers": [
            [
                "636 of 5008"
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (T1:`student_assessment.Candidates`)-[]-(T2:`student_assessment.People`)\nRETURN T2.first_name,T2.last_name",
        "question": "what are the first name and last name of all candidates?",
        "answers": [
            [
                "Shannon",
                "Senger"
            ],
            [
                "Virginie",
                "Hartmann"
            ],
            [
                "Dariana",
                "Bednar"
            ],
            [
                "Verna",
                "Grant"
            ],
            [
                "Hoyt",
                "Wintheiser"
            ],
            [
                "Mayra",
                "Hartmann"
            ],
            [
                "Lizeth",
                "Bartoletti"
            ],
            [
                "Nova",
                "Feest"
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (T1:`student_assessment.Candidates`)-[]-(T2:`student_assessment.People`)\nRETURN T2.first_name,T2.last_name",
        "question": "What are the first and last names of all the candidates?",
        "answers": [
            [
                "Shannon",
                "Senger"
            ],
            [
                "Virginie",
                "Hartmann"
            ],
            [
                "Dariana",
                "Bednar"
            ],
            [
                "Verna",
                "Grant"
            ],
            [
                "Hoyt",
                "Wintheiser"
            ],
            [
                "Mayra",
                "Hartmann"
            ],
            [
                "Lizeth",
                "Bartoletti"
            ],
            [
                "Nova",
                "Feest"
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (student_course_attendance:`student_assessment.Student_Course_Attendance`)\nRETURN student_course_attendance.student_id",
        "question": "List the id of students who attended some courses?",
        "answers": [
            [
                111
            ],
            [
                121
            ],
            [
                121
            ],
            [
                141
            ],
            [
                171
            ],
            [
                161
            ],
            [
                151
            ],
            [
                141
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (student_course_attendance:`student_assessment.Student_Course_Attendance`)\nRETURN student_course_attendance.student_id",
        "question": "What are the ids of all students who have attended at least one course?",
        "answers": [
            [
                111
            ],
            [
                121
            ],
            [
                121
            ],
            [
                141
            ],
            [
                171
            ],
            [
                161
            ],
            [
                151
            ],
            [
                141
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (candidate_assessments:`student_assessment.Candidate_Assessments`)\nRETURN candidate_assessments.candidate_id\nORDER BY candidate_assessments.assessment_date DESC\nLIMIT 1",
        "question": "Find id of the candidate who most recently accessed the course?",
        "answers": [
            [
                121
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (candidate_assessments:`student_assessment.Candidate_Assessments`)\nRETURN candidate_assessments.candidate_id\nORDER BY candidate_assessments.assessment_date DESC\nLIMIT 1",
        "question": "What is the id of the candidate who most recently accessed the course?",
        "answers": [
            [
                121
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (student_course_attendance:`student_assessment.Student_Course_Attendance`)\nWHERE student_course_attendance.course_id = 301\nRETURN student_course_attendance.student_id",
        "question": "What are the id of students who registered course 301?",
        "answers": [
            [
                111
            ],
            [
                121
            ],
            [
                171
            ],
            [
                141
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (student_course_attendance:`student_assessment.Student_Course_Attendance`)\nWHERE student_course_attendance.course_id = 301\nRETURN student_course_attendance.student_id",
        "question": "What are the ids of the students who registered for course 301?",
        "answers": [
            [
                111
            ],
            [
                121
            ],
            [
                171
            ],
            [
                141
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (student_course_attendance:`student_assessment.Student_Course_Attendance`)\nWHERE student_course_attendance.course_id = 301\nRETURN student_course_attendance.student_id\nORDER BY student_course_attendance.date_of_attendance DESC\nLIMIT 1",
        "question": "What is the id of the student who most recently registered course 301?",
        "answers": [
            [
                171
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (student_course_attendance:`student_assessment.Student_Course_Attendance`)\nWHERE student_course_attendance.course_id = 301\nRETURN student_course_attendance.student_id\nORDER BY student_course_attendance.date_of_attendance DESC\nLIMIT 1",
        "question": "What are the ids of the students who registered for course 301 most recently?",
        "answers": [
            [
                171
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (T1:`student_assessment.Addresses`)-[]-(T2:`student_assessment.People_Addresses`)\nRETURN DISTINCT T1.city",
        "question": "Find distinct cities of addresses of people?",
        "answers": [
            [
                "South Minnie"
            ],
            [
                "Linnealand"
            ],
            [
                "East Tavaresburgh"
            ],
            [
                "Terencetown"
            ],
            [
                "Lake Devon"
            ],
            [
                "O'Connellview"
            ],
            [
                "New Alta"
            ],
            [
                "South Naomibury"
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (T1:`student_assessment.Addresses`)-[]-(T2:`student_assessment.People_Addresses`)\nRETURN DISTINCT T1.city",
        "question": "What are the different cities where people live?",
        "answers": [
            [
                "South Minnie"
            ],
            [
                "Linnealand"
            ],
            [
                "East Tavaresburgh"
            ],
            [
                "Terencetown"
            ],
            [
                "Lake Devon"
            ],
            [
                "O'Connellview"
            ],
            [
                "New Alta"
            ],
            [
                "South Naomibury"
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (courses:`student_assessment.Courses`)\nRETURN courses.course_name\nORDER BY courses.course_name",
        "question": "List the names of courses in alphabetical order?",
        "answers": [
            [
                "Art history"
            ],
            [
                "English"
            ],
            [
                "French"
            ],
            [
                "data structure"
            ],
            [
                "database"
            ],
            [
                "statistics"
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (courses:`student_assessment.Courses`)\nRETURN courses.course_name\nORDER BY courses.course_name",
        "question": "What are the names of the courses in alphabetical order?",
        "answers": [
            [
                "Art history"
            ],
            [
                "English"
            ],
            [
                "French"
            ],
            [
                "data structure"
            ],
            [
                "database"
            ],
            [
                "statistics"
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (people:`student_assessment.People`)\nRETURN people.first_name\nORDER BY people.first_name",
        "question": "List the first names of people in alphabetical order?",
        "answers": [
            [
                "Dariana"
            ],
            [
                "Hoyt"
            ],
            [
                "Lizeth"
            ],
            [
                "Mayra"
            ],
            [
                "Nova"
            ],
            [
                "Shannon"
            ],
            [
                "Verna"
            ],
            [
                "Virginie"
            ]
        ]
    },
    {
        "db_id": "student_assessment",
        "query": "MATCH (people:`student_assessment.People`)\nRETURN people.first_name\nORDER BY people.first_name",
        "question": "What are the first names of the people in alphabetical order?",
        "answers": [
            [
                "Dariana"
            ],
            [
                "Hoyt"
            ],
            [
                "Lizeth"
            ],
            [
                "Mayra"
            ],
            [
                "Nova"
            ],
            [
                "Shannon"
            ],
            [
                "Verna"
            ],
            [
                "Virginie"
            ]
        ]
    },
    {
        "db_id": "book_2",
        "query": "MATCH (book:`book_2.book`)\nRETURN book.Writer\nORDER BY book.Writer ASC",
        "question": "List the writers of the books in ascending alphabetical order.",
        "answers": [
            [
                "Christopher Hinz"
            ],
            [
                "Christopher Hinz"
            ],
            [
                "Christopher Moeller"
            ],
            [
                "Dave Gibbons"
            ],
            [
                "Elaine Lee"
            ],
            [
                "Garth Ennis"
            ],
            [
                "Garth Ennis"
            ],
            [
                "Howard Chaykin"
            ],
            [
                "Michael Moorcock"
            ],
            [
                "Timothy Truman"
            ]
        ]
    },
    {
        "db_id": "book_2",
        "query": "MATCH (book:`book_2.book`)\nRETURN book.Title\nORDER BY book.Issues ASC",
        "question": "List the titles of the books in ascending order of issues.",
        "answers": [
            [
                "The Dome: Ground Zero"
            ],
            [
                "Bloody Mary"
            ],
            [
                "Bloody Mary : Lady Liberty"
            ],
            [
                "Dead Corps"
            ],
            [
                "Sheva's War"
            ],
            [
                "The Black Lamb"
            ],
            [
                "BrainBanx"
            ],
            [
                "Gemini Blood"
            ],
            [
                "Cyberella"
            ],
            [
                "Michael Moorcock's Multiverse"
            ]
        ]
    },
    {
        "db_id": "book_2",
        "query": "MATCH (book:`book_2.book`)\nWHERE book.Writer <> 'Elaine Lee'\nRETURN book.Title",
        "question": "What are the titles of the books whose writer is not \"Elaine Lee\"?",
        "answers": [
            [
                "The Black Lamb"
            ],
            [
                "Bloody Mary"
            ],
            [
                "Bloody Mary : Lady Liberty"
            ],
            [
                "Cyberella"
            ],
            [
                "Dead Corps"
            ],
            [
                "The Dome: Ground Zero"
            ],
            [
                "Gemini Blood"
            ],
            [
                "Michael Moorcock's Multiverse"
            ],
            [
                "Sheva's War"
            ]
        ]
    },
    {
        "db_id": "book_2",
        "query": "MATCH (publication:`book_2.publication`)\nRETURN publication.Publisher\nORDER BY publication.Price DESC\nLIMIT 1",
        "question": "List the publisher of the publication with the highest price.",
        "answers": [
            [
                "Pearson"
            ]
        ]
    },
    {
        "db_id": "book_2",
        "query": "MATCH (T1:`book_2.book`)-[]-(T2:`book_2.publication`)\nRETURN T1.Title,T2.Publication_Date",
        "question": "Show the title and publication dates of books.",
        "answers": [
            [
                "The Black Lamb",
                "August 2008"
            ],
            [
                "Bloody Mary : Lady Liberty",
                "March 2008"
            ],
            [
                "BrainBanx",
                "June 2006"
            ],
            [
                "Cyberella",
                "October 2005"
            ],
            [
                "The Dome: Ground Zero",
                "August 2008"
            ],
            [
                "Michael Moorcock's Multiverse",
                "March 2007"
            ],
            [
                "Sheva's War",
                "April 2007"
            ]
        ]
    },
    {
        "db_id": "book_2",
        "query": "MATCH (T1:`book_2.book`)-[]-(T2:`book_2.publication`)\nWHERE T2.Price > 4000000\nRETURN T1.Writer",
        "question": "Show writers who have published a book with price more than 4000000.",
        "answers": [
            [
                "Timothy Truman"
            ],
            [
                "Garth Ennis"
            ],
            [
                "Elaine Lee"
            ]
        ]
    },
    {
        "db_id": "book_2",
        "query": "MATCH (T1:`book_2.book`)-[]-(T2:`book_2.publication`)\nRETURN T1.Title\nORDER BY T2.Price DESC",
        "question": "Show the titles of books in descending order of publication price.",
        "answers": [
            [
                "The Black Lamb"
            ],
            [
                "Bloody Mary : Lady Liberty"
            ],
            [
                "BrainBanx"
            ],
            [
                "Cyberella"
            ],
            [
                "The Dome: Ground Zero"
            ],
            [
                "Michael Moorcock's Multiverse"
            ],
            [
                "Sheva's War"
            ]
        ]
    },
    {
        "db_id": "book_2",
        "query": "MATCH (publication:`book_2.publication`)\nWITH publication.Publisher AS Publisher, count(*) AS count\nWHERE count  > 1\nRETURN Publisher",
        "question": "Show publishers that have more than one publication.",
        "answers": [
            [
                "Pearson"
            ],
            [
                "Wiley"
            ]
        ]
    },
    {
        "db_id": "book_2",
        "query": "MATCH (publication:`book_2.publication`)\nRETURN publication.Publisher,count(*)",
        "question": "Show different publishers together with the number of publications they have.",
        "answers": [
            [
                "Pearson",
                2
            ],
            [
                "Thomson Reuters",
                1
            ],
            [
                "Wiley",
                2
            ],
            [
                "Springer Nature",
                1
            ],
            [
                "Bertelsmann",
                1
            ]
        ]
    },
    {
        "db_id": "book_2",
        "query": "MATCH (book:`book_2.book`)\nWITH count(*) AS count, book.Writer AS Writer\nWHERE count  > 1\nRETURN Writer",
        "question": "List the writers who have written more than one book.",
        "answers": [
            [
                "Garth Ennis"
            ],
            [
                "Christopher Hinz"
            ]
        ]
    },
    {
        "db_id": "book_2",
        "query": "MATCH (book:`book_2.book`)\nWHERE NOT (book)-[]-(:`book_2.publication`)    \nRETURN book.Title",
        "question": "List the titles of books that are not published.",
        "answers": [
            [
                "Bloody Mary"
            ],
            [
                "Dead Corps"
            ],
            [
                "Gemini Blood"
            ]
        ]
    }
]