[
    {
        "question": "Count the number of farms.",
        "query": "MATCH (farm:`farm.farm`)\nRETURN count(*)",
        "db_id": "farm",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "question": "List the total number of horses on farms in ascending order.",
        "query": "MATCH (farm:`farm.farm`)\nRETURN farm.Total_Horses\nORDER BY farm.Total_Horses ASC",
        "db_id": "farm",
        "answers": [
            [
                2546.9
            ],
            [
                2604.8
            ],
            [
                3658.9
            ],
            [
                4781.3
            ],
            [
                5056.5
            ],
            [
                5308.2
            ],
            [
                5486.9
            ],
            [
                5607.5
            ]
        ]
    },
    {
        "question": "What are the hosts of competitions whose theme is not \"Aliens\"?",
        "query": "MATCH (farm_competition:`farm.farm_competition`)\nWHERE farm_competition.Theme <> 'Aliens'\nRETURN farm_competition.Hosts",
        "db_id": "farm",
        "answers": [
            [
                "Miley Cyrus Jared Leto and Karen Mok"
            ],
            [
                "Leehom Wang and Kelly Rowland"
            ],
            [
                "Alicia Keys"
            ],
            [
                "Vanness Wu and Michelle Branch"
            ],
            [
                "Shaggy and Coco Lee"
            ]
        ]
    },
    {
        "question": "Return the themes of farm competitions, sorted by year ascending.",
        "query": "MATCH (farm_competition:`farm.farm_competition`)\nRETURN farm_competition.Theme\nORDER BY farm_competition.Year ASC",
        "db_id": "farm",
        "answers": [
            [
                "Aliens"
            ],
            [
                "MTV Cube"
            ],
            [
                "Valentine's Day"
            ],
            [
                "MTV Asia Aid"
            ],
            [
                "Codehunters"
            ],
            [
                "Carnival M is back!"
            ]
        ]
    },
    {
        "question": "What are the maximum and minimum number of cows across all farms.",
        "query": "MATCH (farm:`farm.farm`)\nRETURN max(farm.Cows),min(farm.Cows)",
        "db_id": "farm",
        "answers": [
            [
                3987.0,
                2407.2
            ]
        ]
    },
    {
        "question": "Count the number of different statuses.",
        "query": "MATCH (city:`farm.city`)\nRETURN count(DISTINCT city.Status)",
        "db_id": "farm",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "List official names of cities in descending order of population.",
        "query": "MATCH (city:`farm.city`)\nRETURN city.Official_Name\nORDER BY city.Population DESC",
        "db_id": "farm",
        "answers": [
            [
                "Grand Falls/Grand-Sault"
            ],
            [
                "Perth-Andover"
            ],
            [
                "Plaster Rock"
            ],
            [
                "Drummond"
            ],
            [
                "Aroostook"
            ]
        ]
    },
    {
        "question": "List the official name and status of the city with the largest population.",
        "query": "MATCH (city:`farm.city`)\nRETURN city.Official_Name,city.Status\nORDER BY city.Population DESC\nLIMIT 1",
        "db_id": "farm",
        "answers": [
            [
                "Grand Falls/Grand-Sault",
                "Town"
            ]
        ]
    },
    {
        "question": "Show the years and the official names of the host cities of competitions.",
        "query": "MATCH (T1:`farm.city`)-[]-(T2:`farm.farm_competition`)\nRETURN T2.Year,T1.Official_Name",
        "db_id": "farm",
        "answers": [
            [
                2013,
                "Grand Falls/Grand-Sault"
            ],
            [
                2006,
                "Perth-Andover"
            ],
            [
                2005,
                "Plaster Rock"
            ],
            [
                2004,
                "Drummond"
            ],
            [
                2002,
                "Aroostook"
            ],
            [
                2003,
                "Aroostook"
            ]
        ]
    },
    {
        "question": "Show the official names of the cities that have hosted more than one competition.",
        "query": "MATCH (T1:`farm.city`)-[]-(T2:`farm.farm_competition`)\nWITH count(*) AS count, T1.Official_Name AS Official_Name\nWHERE count  > 1\nRETURN Official_Name",
        "db_id": "farm",
        "answers": [
            [
                "Aroostook"
            ]
        ]
    },
    {
        "question": "Show the status of the city that has hosted the greatest number of competitions.",
        "query": "MATCH (T1:`farm.city`)-[]-(T2:`farm.farm_competition`)\nWITH count(T2.Host_city_ID) AS count, T1.Status AS Status\nRETURN Status\nORDER BY count DESC\nLIMIT 1",
        "db_id": "farm",
        "answers": [
            [
                "Village"
            ]
        ]
    },
    {
        "question": "Please show the themes of competitions with host cities having populations larger than 1000.",
        "query": "MATCH (T1:`farm.city`)-[]-(T2:`farm.farm_competition`)\nWHERE T1.Population > 1000\nRETURN T2.Theme",
        "db_id": "farm",
        "answers": [
            [
                "Carnival M is back!"
            ],
            [
                "Codehunters"
            ],
            [
                "MTV Asia Aid"
            ]
        ]
    },
    {
        "question": "Please show the different statuses, ordered by the number of cities that have each.",
        "query": "MATCH (city:`farm.city`)\nWITH city.Status AS Status, count(city.Status) AS count\nRETURN Status\nORDER BY count ASC",
        "db_id": "farm",
        "answers": [
            [
                "Town"
            ],
            [
                "Village"
            ]
        ]
    },
    {
        "question": "List the most common type of Status across cities.",
        "query": "MATCH (city:`farm.city`)\nWITH city.Status AS Status, count(city.Status) AS count\nRETURN Status\nORDER BY count DESC\nLIMIT 1",
        "db_id": "farm",
        "answers": [
            [
                "Village"
            ]
        ]
    },
    {
        "question": "Find the official names of cities with population bigger than 1500 or smaller than 500.",
        "query": "MATCH (city:`farm.city`)\nWHERE city.Population > 1500 OR city.Population < 500\nRETURN city.Official_Name",
        "db_id": "farm",
        "answers": [
            [
                "Grand Falls/Grand-Sault"
            ],
            [
                "Perth-Andover"
            ],
            [
                "Aroostook"
            ]
        ]
    },
    {
        "question": "Show the census ranking of cities whose status are not \"Village\".",
        "query": "MATCH (city:`farm.city`)\nWHERE city.Status <> 'Village'\nRETURN city.Census_Ranking",
        "db_id": "farm",
        "answers": [
            [
                "636 of 5008"
            ]
        ]
    },
    {
        "question": "Find id of candidates whose assessment code is \"Pass\"?",
        "query": "MATCH (candidate_assessments:`student_assessment.Candidate_Assessments`)\nWHERE candidate_assessments.asessment_outcome_code = 'Pass'\nRETURN candidate_assessments.candidate_id",
        "db_id": "student_assessment",
        "answers": [
            [
                111
            ],
            [
                121
            ],
            [
                141
            ],
            [
                151
            ]
        ]
    },
    {
        "question": "What are the ids of the candidates that have an outcome code of Pass?",
        "query": "MATCH (candidate_assessments:`student_assessment.Candidate_Assessments`)\nWHERE candidate_assessments.asessment_outcome_code = 'Pass'\nRETURN candidate_assessments.candidate_id",
        "db_id": "student_assessment",
        "answers": [
            [
                111
            ],
            [
                121
            ],
            [
                141
            ],
            [
                151
            ]
        ]
    },
    {
        "question": "List the writers of the books in ascending alphabetical order.",
        "query": "MATCH (book:`book_2.book`)\nRETURN book.Writer\nORDER BY book.Writer ASC",
        "db_id": "book_2",
        "answers": [
            [
                "Christopher Hinz"
            ],
            [
                "Christopher Hinz"
            ],
            [
                "Christopher Moeller"
            ],
            [
                "Dave Gibbons"
            ],
            [
                "Elaine Lee"
            ],
            [
                "Garth Ennis"
            ],
            [
                "Garth Ennis"
            ],
            [
                "Howard Chaykin"
            ],
            [
                "Michael Moorcock"
            ],
            [
                "Timothy Truman"
            ]
        ]
    },
    {
        "question": "List the titles of the books in ascending order of issues.",
        "query": "MATCH (book:`book_2.book`)\nRETURN book.Title\nORDER BY book.Issues ASC",
        "db_id": "book_2",
        "answers": [
            [
                "The Dome: Ground Zero"
            ],
            [
                "Bloody Mary"
            ],
            [
                "Bloody Mary : Lady Liberty"
            ],
            [
                "Dead Corps"
            ],
            [
                "Sheva's War"
            ],
            [
                "The Black Lamb"
            ],
            [
                "BrainBanx"
            ],
            [
                "Gemini Blood"
            ],
            [
                "Cyberella"
            ],
            [
                "Michael Moorcock's Multiverse"
            ]
        ]
    },
    {
        "question": "What are the titles of the books whose writer is not \"Elaine Lee\"?",
        "query": "MATCH (book:`book_2.book`)\nWHERE book.Writer <> 'Elaine Lee'\nRETURN book.Title",
        "db_id": "book_2",
        "answers": [
            [
                "The Black Lamb"
            ],
            [
                "Bloody Mary"
            ],
            [
                "Bloody Mary : Lady Liberty"
            ],
            [
                "Cyberella"
            ],
            [
                "Dead Corps"
            ],
            [
                "The Dome: Ground Zero"
            ],
            [
                "Gemini Blood"
            ],
            [
                "Michael Moorcock's Multiverse"
            ],
            [
                "Sheva's War"
            ]
        ]
    },
    {
        "question": "List the publisher of the publication with the highest price.",
        "query": "MATCH (publication:`book_2.publication`)\nRETURN publication.Publisher\nORDER BY publication.Price DESC\nLIMIT 1",
        "db_id": "book_2",
        "answers": [
            [
                "Pearson"
            ]
        ]
    },
    {
        "question": "Show the title and publication dates of books.",
        "query": "MATCH (T1:`book_2.book`)-[]-(T2:`book_2.publication`)\nRETURN T1.Title,T2.Publication_Date",
        "db_id": "book_2",
        "answers": [
            [
                "The Black Lamb",
                "August 2008"
            ],
            [
                "Bloody Mary : Lady Liberty",
                "March 2008"
            ],
            [
                "BrainBanx",
                "June 2006"
            ],
            [
                "Cyberella",
                "October 2005"
            ],
            [
                "The Dome: Ground Zero",
                "August 2008"
            ],
            [
                "Michael Moorcock's Multiverse",
                "March 2007"
            ],
            [
                "Sheva's War",
                "April 2007"
            ]
        ]
    },
    {
        "question": "Show writers who have published a book with price more than 4000000.",
        "query": "MATCH (T1:`book_2.book`)-[]-(T2:`book_2.publication`)\nWHERE T2.Price > 4000000\nRETURN T1.Writer",
        "db_id": "book_2",
        "answers": [
            [
                "Timothy Truman"
            ],
            [
                "Garth Ennis"
            ],
            [
                "Elaine Lee"
            ]
        ]
    },
    {
        "question": "Show the titles of books in descending order of publication price.",
        "query": "MATCH (T1:`book_2.book`)-[]-(T2:`book_2.publication`)\nRETURN T1.Title\nORDER BY T2.Price DESC",
        "db_id": "book_2",
        "answers": [
            [
                "The Black Lamb"
            ],
            [
                "Bloody Mary : Lady Liberty"
            ],
            [
                "BrainBanx"
            ],
            [
                "Cyberella"
            ],
            [
                "The Dome: Ground Zero"
            ],
            [
                "Michael Moorcock's Multiverse"
            ],
            [
                "Sheva's War"
            ]
        ]
    },
    {
        "question": "Show publishers that have more than one publication.",
        "query": "MATCH (publication:`book_2.publication`)\nWITH count(*) AS count, publication.Publisher AS Publisher\nWHERE count  > 1\nRETURN Publisher",
        "db_id": "book_2",
        "answers": [
            [
                "Pearson"
            ],
            [
                "Wiley"
            ]
        ]
    },
    {
        "question": "Show different publishers together with the number of publications they have.",
        "query": "MATCH (publication:`book_2.publication`)\nWITH publication.Publisher AS Publisher, count(publication.Publisher) AS count\nRETURN Publisher,count",
        "db_id": "book_2",
        "answers": [
            [
                "Pearson",
                2
            ],
            [
                "Thomson Reuters",
                1
            ],
            [
                "Wiley",
                2
            ],
            [
                "Springer Nature",
                1
            ],
            [
                "Bertelsmann",
                1
            ]
        ]
    },
    {
        "question": "Please show the most common publication date.",
        "query": "MATCH (publication:`book_2.publication`)\nWITH publication.Publication_Date AS Publication_Date, count(publication.Publication_Date) AS count\nRETURN Publication_Date\nORDER BY count DESC\nLIMIT 1",
        "db_id": "book_2",
        "answers": [
            [
                "August 2008"
            ]
        ]
    },
    {
        "question": "List the writers who have written more than one book.",
        "query": "MATCH (book:`book_2.book`)\nWITH count(*) AS count, book.Writer AS Writer\nWHERE count  > 1\nRETURN Writer",
        "db_id": "book_2",
        "answers": [
            [
                "Garth Ennis"
            ],
            [
                "Christopher Hinz"
            ]
        ]
    },
    {
        "question": "List the titles of books that are not published.",
        "query": "MATCH (book:`book_2.book`)\nWHERE NOT (book:`book_2.book`)-[]-(:`book_2.publication`)\nRETURN book.Title",
        "db_id": "book_2",
        "answers": [
            [
                "Bloody Mary"
            ],
            [
                "Dead Corps"
            ],
            [
                "Gemini Blood"
            ]
        ]
    },
    {
        "question": "Show the prices of publications whose publisher is either \"Person\" or \"Wiley\"",
        "query": "MATCH (publication:`book_2.publication`)\nWHERE publication.Publisher = 'Person' OR publication.Publisher = 'Wiley'\nRETURN publication.Price",
        "db_id": "book_2",
        "answers": [
            [
                4100000.0
            ],
            [
                3000000.0
            ]
        ]
    },
    {
        "question": "Count the number of actors.",
        "query": "MATCH (actor:`musical.actor`)\nRETURN count(*)",
        "db_id": "musical",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "question": "List the name of actors in ascending alphabetical order.",
        "query": "MATCH (actor:`musical.actor`)\nRETURN actor.Name\nORDER BY actor.Name ASC",
        "db_id": "musical",
        "answers": [
            [
                "Alan Fletcher"
            ],
            [
                "Ian Smith"
            ],
            [
                "Jackie Woodburne"
            ],
            [
                "Kate Ritchie"
            ],
            [
                "Lynne McGranger"
            ],
            [
                "Ray Meagher"
            ],
            [
                "Ryan Moloney"
            ],
            [
                "Stefan Dennis"
            ],
            [
                "Tom Oliver"
            ]
        ]
    },
    {
        "question": "Return the characters and durations for each actor.",
        "query": "MATCH (actor:`musical.actor`)\nRETURN actor.Character,actor.Duration",
        "db_id": "musical",
        "answers": [
            [
                "Alf Stewart",
                "1988\u2014"
            ],
            [
                "Lou Carpenter",
                "1988, 1992\u2014"
            ],
            [
                "Irene Roberts",
                "1993\u2014"
            ],
            [
                "Sally Fletcher",
                "1988\u20132008, 2013"
            ],
            [
                "Karl Kennedy",
                "1994\u2014"
            ],
            [
                "Susan Kennedy",
                "1994\u2014"
            ],
            [
                "Toadfish Rebecchi",
                "1995, 1996\u2014"
            ],
            [
                "Harold Bishop",
                "1987\u20131991, 1996\u20132009, 2011"
            ],
            [
                "Paul Robinson",
                "1985\u20131992, 1993, 2004\u2014"
            ]
        ]
    },
    {
        "question": "List the name of actors whose age is not 20.",
        "query": "MATCH (actor:`musical.actor`)\nWHERE actor.age <> 20\nRETURN actor.Name",
        "db_id": "musical",
        "answers": [
            [
                "Ray Meagher"
            ],
            [
                "Tom Oliver"
            ],
            [
                "Lynne McGranger"
            ],
            [
                "Ryan Moloney"
            ],
            [
                "Ian Smith"
            ],
            [
                "Stefan Dennis"
            ]
        ]
    },
    {
        "question": "Return the characters for actors, ordered by age descending.",
        "query": "MATCH (actor:`musical.actor`)\nRETURN actor.Character\nORDER BY actor.age DESC",
        "db_id": "musical",
        "answers": [
            [
                "Alf Stewart"
            ],
            [
                "Lou Carpenter"
            ],
            [
                "Irene Roberts"
            ],
            [
                "Sally Fletcher"
            ],
            [
                "Karl Kennedy"
            ],
            [
                "Susan Kennedy"
            ],
            [
                "Toadfish Rebecchi"
            ],
            [
                "Harold Bishop"
            ],
            [
                "Paul Robinson"
            ]
        ]
    },
    {
        "question": "Return the duration of the actor with the greatest age.",
        "query": "MATCH (actor:`musical.actor`)\nRETURN actor.Duration\nORDER BY actor.age DESC\nLIMIT 1",
        "db_id": "musical",
        "answers": [
            [
                "1988\u2014"
            ]
        ]
    },
    {
        "question": "What are the names of musicals with nominee \"Bob Fosse\"?",
        "query": "MATCH (musical:`musical.musical`)\nWHERE musical.Nominee = 'Bob Fosse'\nRETURN musical.Name",
        "db_id": "musical",
        "answers": [
            [
                "The Phantom of the Opera"
            ],
            [
                "Wicked"
            ],
            [
                "West Side Story"
            ],
            [
                "The Book of Mormon"
            ],
            [
                "Chicago"
            ]
        ]
    },
    {
        "question": "What are the distinct nominees of the musicals with the award that is not \"Tony Award\"?",
        "query": "MATCH (musical:`musical.musical`)\nWHERE musical.Award <> 'Tony Award'\nRETURN DISTINCT musical.Nominee",
        "db_id": "musical",
        "answers": [
            [
                "Cleavant Derricks"
            ],
            [
                "Bob Fosse"
            ]
        ]
    },
    {
        "question": "Show names of actors and names of musicals they are in.",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nRETURN T1.Name,T2.Name",
        "db_id": "musical",
        "answers": [
            [
                "Ray Meagher",
                "The Phantom of the Opera"
            ],
            [
                "Tom Oliver",
                "The Phantom of the Opera"
            ],
            [
                "Lynne McGranger",
                "Les Mis\u00e9rables"
            ],
            [
                "Kate Ritchie",
                "Les Mis\u00e9rables"
            ],
            [
                "Alan Fletcher",
                "West Side Story"
            ],
            [
                "Jackie Woodburne",
                "The Book of Mormon"
            ],
            [
                "Ryan Moloney",
                "The Book of Mormon"
            ],
            [
                "Ian Smith",
                "The Book of Mormon"
            ],
            [
                "Stefan Dennis",
                "The Book of Mormon"
            ]
        ]
    },
    {
        "question": "Show names of actors that have appeared in musical with name \"The Phantom of the Opera\".",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nWHERE T2.Name = 'The Phantom of the Opera'\nRETURN T1.Name",
        "db_id": "musical",
        "answers": [
            [
                "Tom Oliver"
            ],
            [
                "Ray Meagher"
            ]
        ]
    },
    {
        "question": "Show names of actors in descending order of the year their musical is awarded.",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nRETURN T1.Name\nORDER BY T2.Year DESC",
        "db_id": "musical",
        "answers": [
            [
                "Ray Meagher"
            ],
            [
                "Tom Oliver"
            ],
            [
                "Lynne McGranger"
            ],
            [
                "Kate Ritchie"
            ],
            [
                "Alan Fletcher"
            ],
            [
                "Jackie Woodburne"
            ],
            [
                "Ryan Moloney"
            ],
            [
                "Ian Smith"
            ],
            [
                "Stefan Dennis"
            ]
        ]
    },
    {
        "question": "Show names of musicals and the number of actors who have appeared in the musicals.",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nWITH T2.Name AS Name, count(T1.Musical_ID) AS count\nRETURN Name,count",
        "db_id": "musical",
        "answers": [
            [
                "The Phantom of the Opera",
                2
            ],
            [
                "Les Mis\u00e9rables",
                2
            ],
            [
                "West Side Story",
                1
            ],
            [
                "The Book of Mormon",
                4
            ]
        ]
    },
    {
        "question": "Show names of musicals which have at least three actors.",
        "query": "MATCH (T1:`musical.actor`)-[]-(T2:`musical.musical`)\nWITH count(*) AS count, T2.Name AS Name\nWHERE count  >= 3\nRETURN Name",
        "db_id": "musical",
        "answers": [
            [
                "The Book of Mormon"
            ]
        ]
    },
    {
        "question": "Show different nominees and the number of musicals they have been nominated.",
        "query": "MATCH (musical:`musical.musical`)\nWITH musical.Nominee AS Nominee, count(musical.Nominee) AS count\nRETURN Nominee,count",
        "db_id": "musical",
        "answers": [
            [
                "Bob Fosse",
                5
            ],
            [
                "Cleavant Derricks",
                2
            ]
        ]
    },
    {
        "question": "Please show the nominee who has been nominated the greatest number of times.",
        "query": "MATCH (musical:`musical.musical`)\nWITH musical.Nominee AS Nominee, count(musical.Nominee) AS count\nRETURN Nominee\nORDER BY count DESC\nLIMIT 1",
        "db_id": "musical",
        "answers": [
            [
                "Bob Fosse"
            ]
        ]
    },
    {
        "question": "List the most common result of the musicals.",
        "query": "MATCH (musical:`musical.musical`)\nWITH musical.Result AS Result, count(musical.Result) AS count\nRETURN Result\nORDER BY count DESC\nLIMIT 1",
        "db_id": "musical",
        "answers": [
            [
                "Nominated"
            ]
        ]
    },
    {
        "question": "List the nominees that have been nominated more than two musicals.",
        "query": "MATCH (musical:`musical.musical`)\nWITH count(*) AS count, musical.Nominee AS Nominee\nWHERE count  > 2\nRETURN Nominee",
        "db_id": "musical",
        "answers": [
            [
                "Bob Fosse"
            ]
        ]
    },
    {
        "question": "List the name of musicals that do not have actors.",
        "query": "MATCH (musical:`musical.musical`)\nWHERE NOT (musical:`musical.musical`)-[]-(:`musical.actor`)\nRETURN musical.Name",
        "db_id": "musical",
        "answers": [
            [
                "Wicked"
            ],
            [
                "Rent"
            ],
            [
                "Chicago"
            ]
        ]
    },
    {
        "question": "Show the musical nominee with award \"Bob Fosse\" or \"Cleavant Derricks\".",
        "query": "MATCH (musical:`musical.musical`)\nWHERE musical.Award = 'Tony Award' OR musical.Award = 'Cleavant Derricks'\nRETURN musical.Nominee",
        "db_id": "musical",
        "answers": [
            [
                "Bob Fosse"
            ],
            [
                "Cleavant Derricks"
            ],
            [
                "Bob Fosse"
            ],
            [
                "Bob Fosse"
            ]
        ]
    },
    {
        "question": "Find the emails of the user named \"Mary\".",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nWHERE user_profiles.name = 'Mary'\nRETURN user_profiles.email",
        "db_id": "twitter_1",
        "answers": [
            [
                "Mary@yale.edu"
            ]
        ]
    },
    {
        "question": "What is the partition id of the user named \"Iron Man\".",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nWHERE user_profiles.name = 'Iron Man'\nRETURN user_profiles.partitionid",
        "db_id": "twitter_1",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "question": "Find the number of tweets in record.",
        "query": "MATCH (tweets:`twitter_1.tweets`)\nRETURN count(*)",
        "db_id": "twitter_1",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "question": "Find the number of users who posted some tweets.",
        "query": "MATCH (tweets:`twitter_1.tweets`)\nRETURN count(DISTINCT tweets.uid)",
        "db_id": "twitter_1",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "Find the name and email of the user whose name contains the word \u2018Swift\u2019.",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nWHERE user_profiles.name =~'.*[S|s]wift.*'\nRETURN user_profiles.name,user_profiles.email",
        "db_id": "twitter_1",
        "answers": [
            [
                "Tyler Swift",
                "ts@superstar.com\n"
            ]
        ]
    },
    {
        "question": "Find the names of users whose emails contain \u2018superstar\u2019 or \u2018edu\u2019.",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nWHERE user_profiles.email =~'.*[S|s]uperstar.*' OR user_profiles.email =~'.*[E|e]du.*'\nRETURN user_profiles.name",
        "db_id": "twitter_1",
        "answers": [
            [
                "Mary"
            ],
            [
                "Celine Dion"
            ],
            [
                "Natalie Portman"
            ]
        ]
    },
    {
        "question": "Find the name and email of the users who have more than 1000 followers.",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nWHERE user_profiles.followers > 1000\nRETURN user_profiles.name,user_profiles.email",
        "db_id": "twitter_1",
        "answers": [
            [
                "Iron Man",
                "ts@richest.com"
            ],
            [
                "Black Widow\n",
                "bw@superhero.com"
            ],
            [
                "Tyler Swift",
                "ts@superstar.com\n"
            ],
            [
                "Celine Dion",
                "cd@superstar.com"
            ],
            [
                "Natalie Portman",
                "np@superstar.com"
            ]
        ]
    },
    {
        "question": "Find the names of users who have more than one tweet.",
        "query": "MATCH (T1:`twitter_1.user_profiles`)-[]-(T2:`twitter_1.tweets`)\nWITH T1.name AS name, count(*) AS count\nWHERE count  > 1\nRETURN name",
        "db_id": "twitter_1",
        "answers": [
            [
                "Iron Man"
            ],
            [
                "Susan"
            ],
            [
                "Celine Dion"
            ]
        ]
    },
    {
        "question": "Find the name of the user who has the largest number of followers.",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nRETURN user_profiles.name\nORDER BY user_profiles.followers DESC\nLIMIT 1",
        "db_id": "twitter_1",
        "answers": [
            [
                "Tyler Swift"
            ]
        ]
    },
    {
        "question": "Find the name and email of the user followed by the least number of people.",
        "query": "MATCH (user_profiles:`twitter_1.user_profiles`)\nRETURN user_profiles.name,user_profiles.email\nORDER BY user_profiles.followers\nLIMIT 1",
        "db_id": "twitter_1",
        "answers": [
            [
                "Susan",
                "susan@gmail.com\n"
            ]
        ]
    }
]