[
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.bedType,avg(rooms.basePrice)",
        "question": "What is the average base price of rooms, for each bed type?",
        "answers": [
            [
                "King",
                181.25
            ],
            [
                "Queen",
                150.0
            ],
            [
                "Double",
                100.0
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.bedType = 'King' OR rooms.bedType = 'Queen'\nRETURN rooms.roomName",
        "question": "List the name of rooms with king or queen bed.",
        "answers": [
            [
                "Recluse and defiance"
            ],
            [
                "Interim but salutary"
            ],
            [
                "Abscond or bolster"
            ],
            [
                "Harbinger but bequest"
            ],
            [
                "Immutable before decorum"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Riddle to exculpate"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.bedType = 'King' OR rooms.bedType = 'Queen'\nRETURN rooms.roomName",
        "question": "What are the names of rooms that have either king or queen bed?",
        "answers": [
            [
                "Recluse and defiance"
            ],
            [
                "Interim but salutary"
            ],
            [
                "Abscond or bolster"
            ],
            [
                "Harbinger but bequest"
            ],
            [
                "Immutable before decorum"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Riddle to exculpate"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN count(DISTINCT rooms.bedType)",
        "question": "How many different types of beds are there?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN count(DISTINCT rooms.bedType)",
        "question": "Find the number of distinct bed types available in this inn.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.RoomId,rooms.roomName\nORDER BY rooms.basePrice DESC\nLIMIT 3",
        "question": "Find the name and id of the top 3 expensive rooms.",
        "answers": [
            [
                "FNA",
                "Frugal not apropos"
            ],
            [
                "AOB",
                "Abscond or bolster"
            ],
            [
                "CAS",
                "Convoke and sanguine"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.RoomId,rooms.roomName\nORDER BY rooms.basePrice DESC\nLIMIT 3",
        "question": "What are the name and id of the three highest priced rooms?",
        "answers": [
            [
                "FNA",
                "Frugal not apropos"
            ],
            [
                "AOB",
                "Abscond or bolster"
            ],
            [
                "CAS",
                "Convoke and sanguine"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWITH avg(rooms.basePrice) AS baseprice\nMATCH (rooms:`inn_1.Rooms`)\nWHERE  rooms.basePrice >  baseprice \nRETURN rooms.roomName",
        "question": "Find the name of rooms whose price is higher than the average price.",
        "answers": [
            [
                "Abscond or bolster"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Riddle to exculpate"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWITH avg(rooms.basePrice) AS baseprice\nMATCH (rooms:`inn_1.Rooms`)\nWHERE  rooms.basePrice >  baseprice \nRETURN rooms.roomName",
        "question": "What are the name of rooms that cost more than the average.",
        "answers": [
            [
                "Abscond or bolster"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Riddle to exculpate"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nRETURN T2.roomName,count(*),T1.Room",
        "question": "Return the name and number of reservations made for each of the rooms.",
        "answers": [
            [
                "Recluse and defiance",
                62,
                "RND"
            ],
            [
                "Interim but salutary",
                59,
                "IBS"
            ],
            [
                "Abscond or bolster",
                51,
                "AOB"
            ],
            [
                "Mendicant with cryptic",
                56,
                "MWC"
            ],
            [
                "Harbinger but bequest",
                60,
                "HBB"
            ],
            [
                "Immutable before decorum",
                63,
                "IBD"
            ],
            [
                "Thrift and accolade",
                59,
                "TAA"
            ],
            [
                "Convoke and sanguine",
                69,
                "CAS"
            ],
            [
                "Riddle to exculpate",
                55,
                "RTE"
            ],
            [
                "Frugal not apropos",
                66,
                "FNA"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nRETURN T2.roomName,count(*),T1.Room",
        "question": "For each room, find its name and the number of times reservations were made for it.",
        "answers": [
            [
                "Recluse and defiance",
                62,
                "RND"
            ],
            [
                "Interim but salutary",
                59,
                "IBS"
            ],
            [
                "Abscond or bolster",
                51,
                "AOB"
            ],
            [
                "Mendicant with cryptic",
                56,
                "MWC"
            ],
            [
                "Harbinger but bequest",
                60,
                "HBB"
            ],
            [
                "Immutable before decorum",
                63,
                "IBD"
            ],
            [
                "Thrift and accolade",
                59,
                "TAA"
            ],
            [
                "Convoke and sanguine",
                69,
                "CAS"
            ],
            [
                "Riddle to exculpate",
                55,
                "RTE"
            ],
            [
                "Frugal not apropos",
                66,
                "FNA"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nWITH count(*) AS count, T2.roomName AS roomName\nWHERE count  > 60\nRETURN roomName",
        "question": "Find the names of rooms that have been reserved for more than 60 times.",
        "answers": [
            [
                "Recluse and defiance"
            ],
            [
                "Immutable before decorum"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nWITH count(*) AS count, T2.roomName AS roomName\nWHERE count  > 60\nRETURN roomName",
        "question": "What are the names of rooms whose reservation frequency exceeds 60 times?",
        "answers": [
            [
                "Recluse and defiance"
            ],
            [
                "Immutable before decorum"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE 120<=rooms.basePrice<=150\nRETURN rooms.roomName",
        "question": "Find the name of rooms whose base price is between 120 and 150.",
        "answers": [
            [
                "Recluse and defiance"
            ],
            [
                "Interim but salutary"
            ],
            [
                "Mendicant with cryptic"
            ],
            [
                "Immutable before decorum"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE 120<=rooms.basePrice<=150\nRETURN rooms.roomName",
        "question": "Which rooms cost between 120 and 150? Give me the room names.",
        "answers": [
            [
                "Recluse and defiance"
            ],
            [
                "Interim but salutary"
            ],
            [
                "Mendicant with cryptic"
            ],
            [
                "Immutable before decorum"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nWHERE T1.FirstName =~'.*[R|r]OY.*'\nRETURN T2.roomName",
        "question": "Find the name of rooms booked by some customers whose first name contains ROY.",
        "answers": [
            [
                "Harbinger but bequest"
            ],
            [
                "Harbinger but bequest"
            ],
            [
                "Harbinger but bequest"
            ],
            [
                "Thrift and accolade"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Frugal not apropos"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "db_id": "inn_1",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nWHERE T1.FirstName =~'.*[R|r]OY.*'\nRETURN T2.roomName",
        "question": "What are the name of rooms booked by customers whose first name has \"ROY\" in part?",
        "answers": [
            [
                "Harbinger but bequest"
            ],
            [
                "Harbinger but bequest"
            ],
            [
                "Harbinger but bequest"
            ],
            [
                "Thrift and accolade"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Frugal not apropos"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "db_id": "local_govt_mdm",
        "query": "MATCH (T1:`local_govt_mdm.Customer_Master_Index`)-[]-(T2:`local_govt_mdm.CMI_Cross_References`)\nWHERE T2.source_system_code = 'Tax'\nRETURN T1.cmi_details",
        "question": "what are the details of the cmi masters that have the cross reference code 'Tax'?",
        "answers": [
            [
                "Volkman, Mills and Ferry"
            ],
            [
                "Schmidt, Kertzmann and Lubowitz"
            ],
            [
                "Reynolds-McClure"
            ],
            [
                "Volkman, Mills and Ferry"
            ],
            [
                "Volkman, Mills and Ferry"
            ],
            [
                "Schmitt-Lang"
            ]
        ]
    },
    {
        "db_id": "local_govt_mdm",
        "query": "MATCH (T1:`local_govt_mdm.CMI_Cross_References`)-[]-(T2:`local_govt_mdm.Council_Tax`)\nWITH T1.cmi_cross_ref_id AS cmi_cross_ref_id, T1.source_system_code AS source_system_code, count(*) AS count\nWHERE count  >= 1\nRETURN cmi_cross_ref_id,source_system_code",
        "question": "What is the cmi cross reference id that is related to at least one council tax entry? List the cross reference id and source system code.",
        "answers": [
            [
                101,
                "Tax"
            ],
            [
                103,
                "Tax"
            ],
            [
                104,
                "Tax"
            ],
            [
                102,
                "Tax"
            ],
            [
                106,
                "Tax"
            ],
            [
                105,
                "Tax"
            ]
        ]
    },
    {
        "db_id": "local_govt_mdm",
        "query": "MATCH (T1:`local_govt_mdm.Business_Rates`)-[]-(T2:`local_govt_mdm.CMI_Cross_References`)\nRETURN T2.cmi_cross_ref_id,T2.master_customer_id,count(*)",
        "question": "How many business rates are related to each cmi cross reference? List cross reference id, master customer id and the n",
        "answers": [
            [
                99,
                9,
                1
            ],
            [
                49,
                1,
                1
            ],
            [
                95,
                2,
                1
            ]
        ]
    },
    {
        "db_id": "local_govt_mdm",
        "query": "MATCH (T1:`local_govt_mdm.CMI_Cross_References`)-[]-(T2:`local_govt_mdm.Benefits_Overpayments`)\nRETURN T1.source_system_code,T2.council_tax_id\nORDER BY T2.council_tax_id",
        "question": "What is the tax source system code related to the benefits and overpayments? List the code and the benifit id, order by benifit id.",
        "answers": [
            [
                "Benefits",
                3
            ],
            [
                "Benefits",
                6
            ],
            [
                "Benefits",
                7
            ],
            [
                "Benefits",
                8
            ]
        ]
    },
    {
        "db_id": "local_govt_mdm",
        "query": "MATCH (T1:`local_govt_mdm.CMI_Cross_References`)-[]-(T2:`local_govt_mdm.Parking_Fines`)\nRETURN T1.source_system_code,T1.master_customer_id,T2.council_tax_id",
        "question": "Wat is the tax source system code and master customer id of the taxes related to each parking fine id?",
        "answers": [
            [
                "Parking",
                5,
                9
            ],
            [
                "Parking",
                9,
                10
            ]
        ]
    },
    {
        "db_id": "local_govt_mdm",
        "query": "MATCH (T1:`local_govt_mdm.Rent_Arrears`)-[]-(T2:`local_govt_mdm.CMI_Cross_References`)-[]-(T3:`local_govt_mdm.Customer_Master_Index`)\nWHERE T3.cmi_details <> 'Schmidt ,  Kertzmann and Lubowitz'\nRETURN T1.council_tax_id",
        "question": "What are the renting arrears tax ids related to the customer master index whose detail is not 'Schmidt, Kertzmann and Lubowitz'?",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                6
            ],
            [
                7
            ]
        ]
    },
    {
        "db_id": "local_govt_mdm",
        "query": "MATCH (T1:`local_govt_mdm.Electoral_Register`)-[]-(T2:`local_govt_mdm.CMI_Cross_References`)\nWHERE T2.source_system_code = 'Electoral' OR T2.source_system_code = 'Tax'\nRETURN T1.electoral_register_id",
        "question": "What are the register ids of electoral registries that have the cross reference source system code 'Electoral' or 'Tax'?",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "local_govt_mdm",
        "query": "MATCH (cmi_cross_references:`local_govt_mdm.CMI_Cross_References`)\nRETURN count(DISTINCT cmi_cross_references.source_system_code)",
        "question": "How many different source system code for the cmi cross references are there?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "local_govt_mdm",
        "query": "MATCH (parking_fines:`local_govt_mdm.Parking_Fines`)\nRETURN parking_fines.council_tax_id,parking_fines.cmi_cross_ref_id",
        "question": "List the council tax ids and their related cmi cross references of all the parking fines.",
        "answers": [
            [
                9,
                4
            ],
            [
                10,
                81
            ]
        ]
    },
    {
        "db_id": "local_govt_mdm",
        "query": "MATCH (rent_arrears:`local_govt_mdm.Rent_Arrears`)\nRETURN count(*)",
        "question": "How many council taxes are collected for renting arrears ?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "local_govt_mdm",
        "query": "MATCH (T1:`local_govt_mdm.Customer_Master_Index`)-[]-(T2:`local_govt_mdm.CMI_Cross_References`)\nWHERE T1.cmi_details = 'Gottlieb ,  Becker and Wyman'\nRETURN DISTINCT T2.source_system_code",
        "question": "What are the distinct cross reference source system codes which are related to the master customer details 'Gottlieb, Becker and Wyman'?",
        "answers": []
    },
    {
        "db_id": "local_govt_mdm",
        "query": "MATCH (cmi_cross_references:`local_govt_mdm.CMI_Cross_References`)\nWHERE cmi_cross_references.source_system_code =~'.*[E|e]n.*'\nRETURN DISTINCT cmi_cross_references.source_system_code",
        "question": "Which distinct source system code includes the substring 'en'?",
        "answers": [
            [
                "Rent"
            ],
            [
                "Benefits"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (party:`party_host.party`)\nRETURN count(*)",
        "question": "How many parties are there?",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (party:`party_host.party`)\nRETURN count(*)",
        "question": "Count the number of parties.",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (party:`party_host.party`)\nRETURN party.Party_Theme\nORDER BY party.Number_of_hosts ASC",
        "question": "List the themes of parties in ascending order of number of hosts.",
        "answers": [
            [
                "Hardcore Resurrection"
            ],
            [
                "QrimeTime"
            ],
            [
                "Spring"
            ],
            [
                "Teqnology"
            ],
            [
                "In Qontrol"
            ],
            [
                "Houseqlassics"
            ],
            [
                "Club Q-BASE"
            ],
            [
                "Qlubtempo"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (party:`party_host.party`)\nRETURN party.Party_Theme\nORDER BY party.Number_of_hosts ASC",
        "question": "What are the themes of parties ordered by the number of hosts in ascending manner?",
        "answers": [
            [
                "Hardcore Resurrection"
            ],
            [
                "QrimeTime"
            ],
            [
                "Spring"
            ],
            [
                "Teqnology"
            ],
            [
                "In Qontrol"
            ],
            [
                "Houseqlassics"
            ],
            [
                "Club Q-BASE"
            ],
            [
                "Qlubtempo"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (party:`party_host.party`)\nRETURN party.Party_Theme,party.Location",
        "question": "What are the themes and locations of parties?",
        "answers": [
            [
                "Spring",
                "Hemkade 48 Zaandam"
            ],
            [
                "Club Q-BASE",
                "Hemkade 48 Zaandam"
            ],
            [
                "Hardcore Resurrection",
                "Various locations"
            ],
            [
                "Teqnology",
                "Heineken Music Hall Amsterdam"
            ],
            [
                "Qlubtempo",
                "Hemkade 48 Zaandam, Heineken Music Hall Amsterdam"
            ],
            [
                "QrimeTime",
                "Heineken Music Hall Amsterdam"
            ],
            [
                "In Qontrol",
                "RAI Amsterdam"
            ],
            [
                "Houseqlassics",
                "Various locations"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (party:`party_host.party`)\nRETURN party.Party_Theme,party.Location",
        "question": "Give me the theme and location of each party.",
        "answers": [
            [
                "Spring",
                "Hemkade 48 Zaandam"
            ],
            [
                "Club Q-BASE",
                "Hemkade 48 Zaandam"
            ],
            [
                "Hardcore Resurrection",
                "Various locations"
            ],
            [
                "Teqnology",
                "Heineken Music Hall Amsterdam"
            ],
            [
                "Qlubtempo",
                "Hemkade 48 Zaandam, Heineken Music Hall Amsterdam"
            ],
            [
                "QrimeTime",
                "Heineken Music Hall Amsterdam"
            ],
            [
                "In Qontrol",
                "RAI Amsterdam"
            ],
            [
                "Houseqlassics",
                "Various locations"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (party:`party_host.party`)\nWHERE party.Party_Theme = 'Spring' OR party.Party_Theme = 'Teqnology'\nRETURN party.First_year,party.Last_year",
        "question": "Show the first year and last year of parties with theme \"Spring\" or \"Teqnology\".",
        "answers": [
            [
                "2000",
                "2001"
            ],
            [
                "2002",
                "2004"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (party:`party_host.party`)\nWHERE party.Party_Theme = 'Spring' OR party.Party_Theme = 'Teqnology'\nRETURN party.First_year,party.Last_year",
        "question": "What are the first year and last year of the parties whose theme is \"Spring\" or \"Teqnology\"?",
        "answers": [
            [
                "2000",
                "2001"
            ],
            [
                "2002",
                "2004"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (party:`party_host.party`)\nRETURN avg(party.Number_of_hosts)",
        "question": "What is the average number of hosts for parties?",
        "answers": [
            [
                12.25
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (party:`party_host.party`)\nRETURN avg(party.Number_of_hosts)",
        "question": "Compute the average number of hosts for parties.",
        "answers": [
            [
                12.25
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (party:`party_host.party`)\nRETURN party.Location\nORDER BY party.Number_of_hosts DESC\nLIMIT 1",
        "question": "What is the location of the party with the most hosts?",
        "answers": [
            [
                "Hemkade 48 Zaandam, Heineken Music Hall Amsterdam"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (party:`party_host.party`)\nRETURN party.Location\nORDER BY party.Number_of_hosts DESC\nLIMIT 1",
        "question": "Which party had the most hosts? Give me the party location.",
        "answers": [
            [
                "Hemkade 48 Zaandam, Heineken Music Hall Amsterdam"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (host:`party_host.host`)\nRETURN host.Nationality,count(*)",
        "question": "Show different nationalities along with the number of hosts of each nationality.",
        "answers": [
            [
                "United States",
                8
            ],
            [
                "Argentina",
                1
            ],
            [
                "Hungary",
                1
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (host:`party_host.host`)\nRETURN host.Nationality,count(*)",
        "question": "How many hosts does each nationality have? List the nationality and the count.",
        "answers": [
            [
                "United States",
                8
            ],
            [
                "Argentina",
                1
            ],
            [
                "Hungary",
                1
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (host:`party_host.host`)\nRETURN host.Nationality\nORDER BY host.Nationality DESC\nLIMIT 1",
        "question": "Show the most common nationality of hosts.",
        "answers": [
            [
                "United States"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (host:`party_host.host`)\nRETURN host.Nationality\nORDER BY host.Nationality DESC\nLIMIT 1",
        "question": "Which nationality has the most hosts?",
        "answers": [
            [
                "United States"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (T2:`party_host.host`)-[T1:`party_host.party_host`]-(T3:`party_host.party`)\nRETURN T3.Party_Theme,T2.Name",
        "question": "Show the themes of parties and the names of the party hosts.",
        "answers": [
            [
                "Spring",
                "Austin Daye"
            ],
            [
                "Club Q-BASE",
                "Ed Davis"
            ],
            [
                "Teqnology",
                "Lloyd Daniels"
            ],
            [
                "QrimeTime",
                "Kornel David"
            ],
            [
                "QrimeTime",
                "Derrick Dial"
            ],
            [
                "Houseqlassics",
                "Carlos Delfino"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (T2:`party_host.host`)-[T1:`party_host.party_host`]-(T3:`party_host.party`)\nRETURN T3.Party_Theme,T2.Name",
        "question": "For each party, return its theme and the name of its host.",
        "answers": [
            [
                "Spring",
                "Austin Daye"
            ],
            [
                "Club Q-BASE",
                "Ed Davis"
            ],
            [
                "Teqnology",
                "Lloyd Daniels"
            ],
            [
                "QrimeTime",
                "Kornel David"
            ],
            [
                "QrimeTime",
                "Derrick Dial"
            ],
            [
                "Houseqlassics",
                "Carlos Delfino"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (T2:`party_host.host`)-[T1:`party_host.party_host`]-(T3:`party_host.party`)\nRETURN T3.Location,T2.Name\nORDER BY T2.Age",
        "question": "Show the locations of parties and the names of the party hosts in ascending order of the age of the host.",
        "answers": [
            [
                "Various locations",
                "Carlos Delfino"
            ],
            [
                "Heineken Music Hall Amsterdam",
                "Kornel David"
            ],
            [
                "Heineken Music Hall Amsterdam",
                "Lloyd Daniels"
            ],
            [
                "Hemkade 48 Zaandam",
                "Austin Daye"
            ],
            [
                "Hemkade 48 Zaandam",
                "Ed Davis"
            ],
            [
                "Heineken Music Hall Amsterdam",
                "Derrick Dial"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (T2:`party_host.host`)-[T1:`party_host.party_host`]-(T3:`party_host.party`)\nRETURN T3.Location,T2.Name\nORDER BY T2.Age",
        "question": "For each party, find its location and the name of its host. Sort the result in ascending order of the age of the host.",
        "answers": [
            [
                "Various locations",
                "Carlos Delfino"
            ],
            [
                "Heineken Music Hall Amsterdam",
                "Kornel David"
            ],
            [
                "Heineken Music Hall Amsterdam",
                "Lloyd Daniels"
            ],
            [
                "Hemkade 48 Zaandam",
                "Austin Daye"
            ],
            [
                "Hemkade 48 Zaandam",
                "Ed Davis"
            ],
            [
                "Heineken Music Hall Amsterdam",
                "Derrick Dial"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (T2:`party_host.host`)-[T1:`party_host.party_host`]-(T3:`party_host.party`)\nWHERE T2.Age > '50'\nRETURN T3.Location",
        "question": "Show the locations of parties with hosts older than 50.",
        "answers": [
            [
                "Heineken Music Hall Amsterdam"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (T2:`party_host.host`)-[T1:`party_host.party_host`]-(T3:`party_host.party`)\nWHERE T2.Age > '50'\nRETURN T3.Location",
        "question": "Which parties have hosts of age above 50? Give me the party locations.",
        "answers": [
            [
                "Heineken Music Hall Amsterdam"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (T2:`party_host.host`)-[T1:`party_host.party_host`]-(T3:`party_host.party`)\nWHERE T3.Number_of_hosts > 20\nRETURN T2.Name",
        "question": "Show the host names for parties with number of hosts greater than 20.",
        "answers": [
            [
                "Ed Davis"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (T2:`party_host.host`)-[T1:`party_host.party_host`]-(T3:`party_host.party`)\nWHERE T3.Number_of_hosts > 20\nRETURN T2.Name",
        "question": "Which parties have more than 20 hosts? Give me the host names for these parties.",
        "answers": [
            [
                "Ed Davis"
            ]
        ]
    },
    {
        "db_id": "party_host",
        "query": "MATCH (host:`party_host.host`)\nRETURN host.Name,host.Nationality\nORDER BY host.Age DESC\nLIMIT 1",
        "question": "Show the name and the nationality of the oldest host.",
        "answers": [
            [
                "Derrick Dial",
                "United States"
            ]
        ]
    }
]