[
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN count(DISTINCT customers_cards.card_type_code)",
        "question": "How many different card types are there?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH ()-[financial_transactions:`customers_card_transactions.Financial_Transactions`]-()\nRETURN DISTINCT financial_transactions.transaction_type",
        "question": "What are the different types of transactions?",
        "answers": [
            [
                "Payment"
            ],
            [
                "Refund"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH ()-[financial_transactions:`customers_card_transactions.Financial_Transactions`]-()\nRETURN count(DISTINCT financial_transactions.transaction_type)",
        "question": "How many different types of transactions are there?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (T2:`customers_card_transactions.Customers_Cards`)-[T1:`customers_card_transactions.Financial_Transactions`]-()\nRETURN T2.card_type_code,count(*)",
        "question": "Show the card type codes and the number of transactions.",
        "answers": [
            [
                "Credit",
                7
            ],
            [
                "Debit",
                8
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (T2:`customers_card_transactions.Customers_Cards`)-[T1:`customers_card_transactions.Financial_Transactions`]-()\nRETURN T2.card_type_code,count(*)",
        "question": "What are the different card types, and how many transactions have been made with each?",
        "answers": [
            [
                "Credit",
                7
            ],
            [
                "Debit",
                8
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nRETURN count(*)",
        "question": "How many tracks do we have?",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nRETURN count(*)",
        "question": "Count the number of tracks.",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nRETURN track.Name,track.Location",
        "question": "Show the name and location for all tracks.",
        "answers": [
            [
                "Auto Club Speedway",
                "Fontana, CA"
            ],
            [
                "Chicagoland Speedway",
                "Joliet, IL"
            ],
            [
                "Darlington Raceway",
                "Darlington, SC"
            ],
            [
                "Daytona International Speedway",
                "Daytona Beach, FL"
            ],
            [
                "Homestead-Miami Speedway",
                "Homestead, FL"
            ],
            [
                "Kansas Speedway",
                "Kansas City, KS"
            ],
            [
                "Martinsville Speedway",
                "Ridgeway, VA"
            ],
            [
                "Michigan International Speedway",
                "Brooklyn, MI"
            ],
            [
                "Phoenix International Raceway",
                "Avondale, AZ"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nRETURN track.Name,track.Location",
        "question": "What are the names and locations of all tracks?",
        "answers": [
            [
                "Auto Club Speedway",
                "Fontana, CA"
            ],
            [
                "Chicagoland Speedway",
                "Joliet, IL"
            ],
            [
                "Darlington Raceway",
                "Darlington, SC"
            ],
            [
                "Daytona International Speedway",
                "Daytona Beach, FL"
            ],
            [
                "Homestead-Miami Speedway",
                "Homestead, FL"
            ],
            [
                "Kansas Speedway",
                "Kansas City, KS"
            ],
            [
                "Martinsville Speedway",
                "Ridgeway, VA"
            ],
            [
                "Michigan International Speedway",
                "Brooklyn, MI"
            ],
            [
                "Phoenix International Raceway",
                "Avondale, AZ"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nWHERE track.Year_Opened > 2000\nRETURN track.Name,track.Seating\nORDER BY track.Seating",
        "question": "Show names and seatings, ordered by seating for all tracks opened after 2000.",
        "answers": [
            [
                "Chicagoland Speedway",
                75000.0
            ],
            [
                "Kansas Speedway",
                81687.0
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nWHERE track.Year_Opened > 2000\nRETURN track.Name,track.Seating\nORDER BY track.Seating",
        "question": "What are the names and seatings for all tracks opened after 2000, ordered by seating?",
        "answers": [
            [
                "Chicagoland Speedway",
                75000.0
            ],
            [
                "Kansas Speedway",
                81687.0
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nRETURN track.Name,track.Location,track.Seating\nORDER BY track.Year_Opened DESC\nLIMIT 1",
        "question": "What is the name, location and seating for the most recently opened track?",
        "answers": [
            [
                "Chicagoland Speedway",
                "Joliet, IL",
                75000.0
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nRETURN track.Name,track.Location,track.Seating\nORDER BY track.Year_Opened DESC\nLIMIT 1",
        "question": "Return the name, location, and seating of the track that was opened in the most recent year.",
        "answers": [
            [
                "Chicagoland Speedway",
                "Joliet, IL",
                75000.0
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nRETURN min(track.Seating),max(track.Seating),avg(track.Seating)",
        "question": "What is the minimum, maximum, and average seating for all tracks.",
        "answers": [
            [
                63000.0,
                168000.0,
                91526.88888888889
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nRETURN min(track.Seating),max(track.Seating),avg(track.Seating)",
        "question": "Return the minimum, maximum, and average seating across all tracks.",
        "answers": [
            [
                63000.0,
                168000.0,
                91526.88888888889
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nWITH avg(track.Seating) AS seating\nMATCH (track:`race_track.track`)\nWHERE  track.Seating >  seating \nRETURN track.Name,track.Location,track.Year_Opened",
        "question": "Show the name, location, open year for all tracks with a seating higher than the average.",
        "answers": [
            [
                "Auto Club Speedway",
                "Fontana, CA",
                1997.0
            ],
            [
                "Daytona International Speedway",
                "Daytona Beach, FL",
                1959.0
            ],
            [
                "Michigan International Speedway",
                "Brooklyn, MI",
                1968.0
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nWITH avg(track.Seating) AS seating\nMATCH (track:`race_track.track`)\nWHERE  track.Seating >  seating \nRETURN track.Name,track.Location,track.Year_Opened",
        "question": "What are the names, locations, and years of opening for tracks with seating higher than average?",
        "answers": [
            [
                "Auto Club Speedway",
                "Fontana, CA",
                1997.0
            ],
            [
                "Daytona International Speedway",
                "Daytona Beach, FL",
                1959.0
            ],
            [
                "Michigan International Speedway",
                "Brooklyn, MI",
                1968.0
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nRETURN DISTINCT track.Location",
        "question": "What are distinct locations where tracks are located?",
        "answers": [
            [
                "Fontana, CA"
            ],
            [
                "Joliet, IL"
            ],
            [
                "Darlington, SC"
            ],
            [
                "Daytona Beach, FL"
            ],
            [
                "Homestead, FL"
            ],
            [
                "Kansas City, KS"
            ],
            [
                "Ridgeway, VA"
            ],
            [
                "Brooklyn, MI"
            ],
            [
                "Avondale, AZ"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nRETURN DISTINCT track.Location",
        "question": "Give the different locations of tracks.",
        "answers": [
            [
                "Fontana, CA"
            ],
            [
                "Joliet, IL"
            ],
            [
                "Darlington, SC"
            ],
            [
                "Daytona Beach, FL"
            ],
            [
                "Homestead, FL"
            ],
            [
                "Kansas City, KS"
            ],
            [
                "Ridgeway, VA"
            ],
            [
                "Brooklyn, MI"
            ],
            [
                "Avondale, AZ"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (race:`race_track.race`)\nRETURN count(*)",
        "question": "Count the number of races.",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (race:`race_track.race`)\nRETURN DISTINCT race.Class",
        "question": "What are the distinct classes that races can have?",
        "answers": [
            [
                "DP/GT"
            ],
            [
                "GT"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (race:`race_track.race`)\nRETURN DISTINCT race.Class",
        "question": "Return the different classes of races.",
        "answers": [
            [
                "DP/GT"
            ],
            [
                "GT"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (race:`race_track.race`)\nRETURN race.Name,race.Class,race.Date",
        "question": "Show name, class, and date for all races.",
        "answers": [
            [
                "Rolex 24 At Daytona",
                "DP/GT",
                "January 26 January 27"
            ],
            [
                "Gainsco Grand Prix of Miami",
                "DP/GT",
                "March 29"
            ],
            [
                "Mexico City 250",
                "DP/GT",
                "April 19"
            ],
            [
                "Bosch Engineering 250 at VIR",
                "GT",
                "April 27"
            ],
            [
                "RumBum.com 250",
                "DP/GT",
                "May 17"
            ],
            [
                "Lime Rock GT Classic 250",
                "GT",
                "May 26"
            ],
            [
                "Sahlen's Six Hours of the Glen",
                "DP/GT",
                "June 7"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (race:`race_track.race`)\nRETURN race.Name,race.Class,race.Date",
        "question": "What are the names, classes, and dates for all races?",
        "answers": [
            [
                "Rolex 24 At Daytona",
                "DP/GT",
                "January 26 January 27"
            ],
            [
                "Gainsco Grand Prix of Miami",
                "DP/GT",
                "March 29"
            ],
            [
                "Mexico City 250",
                "DP/GT",
                "April 19"
            ],
            [
                "Bosch Engineering 250 at VIR",
                "GT",
                "April 27"
            ],
            [
                "RumBum.com 250",
                "DP/GT",
                "May 17"
            ],
            [
                "Lime Rock GT Classic 250",
                "GT",
                "May 26"
            ],
            [
                "Sahlen's Six Hours of the Glen",
                "DP/GT",
                "June 7"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (race:`race_track.race`)\nRETURN race.Class,count(*)",
        "question": "Show the race class and number of races in each class.",
        "answers": [
            [
                "DP/GT",
                5
            ],
            [
                "GT",
                2
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (race:`race_track.race`)\nRETURN race.Class,count(*)",
        "question": "What are the different classes of races, and how many races correspond to each?",
        "answers": [
            [
                "DP/GT",
                5
            ],
            [
                "GT",
                2
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (race:`race_track.race`)\nWITH count(*) AS count, race.Class AS Class\nWHERE count  >= 2\nRETURN Class",
        "question": "List the race class with at least two races.",
        "answers": [
            [
                "DP/GT"
            ],
            [
                "GT"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (race:`race_track.race`)\nWITH count(*) AS count, race.Class AS Class\nWHERE count  >= 2\nRETURN Class",
        "question": "What are the classes of races that have two or more corresponding races?",
        "answers": [
            [
                "DP/GT"
            ],
            [
                "GT"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nWHERE NOT (track)-[]-(:`race_track.race`)    \nRETURN track.Name",
        "question": "Show all track names that have had no races.",
        "answers": [
            [
                "Darlington Raceway"
            ],
            [
                "Michigan International Speedway"
            ],
            [
                "Phoenix International Raceway"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nWHERE NOT (track)-[]-(:`race_track.race`)    \nRETURN track.Name",
        "question": "Return the names of tracks that have no had any races.",
        "answers": [
            [
                "Darlington Raceway"
            ],
            [
                "Michigan International Speedway"
            ],
            [
                "Phoenix International Raceway"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nWHERE 4000<=track.Seating<=5000\nRETURN track.Year_Opened",
        "question": "Show year where a track with a seating at least 5000 opened and a track with seating no more than 4000 opened.",
        "answers": []
    },
    {
        "db_id": "race_track",
        "query": "MATCH (track:`race_track.track`)\nWHERE 4000<=track.Seating<=5000\nRETURN track.Year_Opened",
        "question": "What are the years of opening for tracks with seating between 4000 and 5000?",
        "answers": []
    },
    {
        "db_id": "race_track",
        "query": "MATCH (T1:`race_track.race`)-[]-(T2:`race_track.track`)\nRETURN T2.Name,count(*)",
        "question": "Show the name of track and the number of races in each track.",
        "answers": [
            [
                "Auto Club Speedway",
                1
            ],
            [
                "Chicagoland Speedway",
                2
            ],
            [
                "Daytona International Speedway",
                1
            ],
            [
                "Homestead-Miami Speedway",
                1
            ],
            [
                "Kansas Speedway",
                1
            ],
            [
                "Martinsville Speedway",
                1
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (T1:`race_track.race`)-[]-(T2:`race_track.track`)\nRETURN T2.Name,count(*)",
        "question": "What are the names of different tracks, and how many races has each had?",
        "answers": [
            [
                "Auto Club Speedway",
                1
            ],
            [
                "Chicagoland Speedway",
                2
            ],
            [
                "Daytona International Speedway",
                1
            ],
            [
                "Homestead-Miami Speedway",
                1
            ],
            [
                "Kansas Speedway",
                1
            ],
            [
                "Martinsville Speedway",
                1
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (T1:`race_track.race`)-[]-(T2:`race_track.track`)\nWITH T2, count(T1.Track_ID) AS cnt\nRETURN T2.Name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Show the name of track with most number of races.",
        "answers": [
            [
                "Chicagoland Speedway"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (T1:`race_track.race`)-[]-(T2:`race_track.track`)\nWITH T2, count(T1.Track_ID) AS cnt\nRETURN T2.Name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the name of the track that has had the greatest number of races?",
        "answers": [
            [
                "Chicagoland Speedway"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (T1:`race_track.race`)-[]-(T2:`race_track.track`)\nRETURN T1.Name,T1.Date,T2.Name",
        "question": "Show the name and date for each race and its track name.",
        "answers": [
            [
                "Rolex 24 At Daytona",
                "January 26 January 27",
                "Auto Club Speedway"
            ],
            [
                "Gainsco Grand Prix of Miami",
                "March 29",
                "Chicagoland Speedway"
            ],
            [
                "Mexico City 250",
                "April 19",
                "Chicagoland Speedway"
            ],
            [
                "Bosch Engineering 250 at VIR",
                "April 27",
                "Daytona International Speedway"
            ],
            [
                "RumBum.com 250",
                "May 17",
                "Homestead-Miami Speedway"
            ],
            [
                "Lime Rock GT Classic 250",
                "May 26",
                "Kansas Speedway"
            ],
            [
                "Sahlen's Six Hours of the Glen",
                "June 7",
                "Martinsville Speedway"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (T1:`race_track.race`)-[]-(T2:`race_track.track`)\nRETURN T1.Name,T1.Date,T2.Name",
        "question": "What are the names and dates of races, and the names of the tracks where they are held?",
        "answers": [
            [
                "Rolex 24 At Daytona",
                "January 26 January 27",
                "Auto Club Speedway"
            ],
            [
                "Gainsco Grand Prix of Miami",
                "March 29",
                "Chicagoland Speedway"
            ],
            [
                "Mexico City 250",
                "April 19",
                "Chicagoland Speedway"
            ],
            [
                "Bosch Engineering 250 at VIR",
                "April 27",
                "Daytona International Speedway"
            ],
            [
                "RumBum.com 250",
                "May 17",
                "Homestead-Miami Speedway"
            ],
            [
                "Lime Rock GT Classic 250",
                "May 26",
                "Kansas Speedway"
            ],
            [
                "Sahlen's Six Hours of the Glen",
                "June 7",
                "Martinsville Speedway"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (T1:`race_track.race`)-[]-(T2:`race_track.track`)\nWITH T2.Name AS Name, count(*) AS count, T2.Location AS Location\nWHERE count  = 1\nRETURN Name,Location",
        "question": "Show the name and location of track with 1 race.",
        "answers": [
            [
                "Auto Club Speedway",
                "Fontana, CA"
            ],
            [
                "Daytona International Speedway",
                "Daytona Beach, FL"
            ],
            [
                "Homestead-Miami Speedway",
                "Homestead, FL"
            ],
            [
                "Kansas Speedway",
                "Kansas City, KS"
            ],
            [
                "Martinsville Speedway",
                "Ridgeway, VA"
            ]
        ]
    },
    {
        "db_id": "race_track",
        "query": "MATCH (T1:`race_track.race`)-[]-(T2:`race_track.track`)\nWITH T2.Name AS Name, count(*) AS count, T2.Location AS Location\nWHERE count  = 1\nRETURN Name,Location",
        "question": "What are the names and locations of tracks that have had exactly 1 race?",
        "answers": [
            [
                "Auto Club Speedway",
                "Fontana, CA"
            ],
            [
                "Daytona International Speedway",
                "Daytona Beach, FL"
            ],
            [
                "Homestead-Miami Speedway",
                "Homestead, FL"
            ],
            [
                "Kansas Speedway",
                "Kansas City, KS"
            ],
            [
                "Martinsville Speedway",
                "Ridgeway, VA"
            ]
        ]
    },
    {
        "db_id": "coffee_shop",
        "query": "MATCH (member:`coffee_shop.member`)\nRETURN count(*),member.Address",
        "question": "Find the number of members living in each address.",
        "answers": [
            [
                3,
                "Hartford"
            ],
            [
                4,
                "Waterbury"
            ],
            [
                2,
                "Cheshire"
            ],
            [
                1,
                "Bridgeport"
            ]
        ]
    },
    {
        "db_id": "coffee_shop",
        "query": "MATCH (member:`coffee_shop.member`)\nWHERE member.Address = 'Harford' OR member.Address = 'Waterbury'\nRETURN member.Name",
        "question": "Give me the names of members whose address is in Harford or Waterbury.",
        "answers": [
            [
                "Breton, Robert"
            ],
            [
                "Cobb, Sedrick"
            ],
            [
                "Reynolds, Richard"
            ],
            [
                "Rizzo, Todd"
            ]
        ]
    },
    {
        "db_id": "coffee_shop",
        "query": "MATCH (member:`coffee_shop.member`)\nWHERE member.Membership_card = 'Black' OR member.Age < 30\nRETURN member.Name,member.Member_ID",
        "question": "Find the ids and names of members who are under age 30 or with black membership card.",
        "answers": [
            [
                "Ashby, Lazale",
                1
            ],
            [
                "Campbell, Jessie",
                3
            ],
            [
                "Cobb, Sedrick",
                4
            ],
            [
                "Peeler, Russell",
                7
            ],
            [
                "Reynolds, Richard",
                8
            ],
            [
                "Webb, Daniel",
                10
            ]
        ]
    },
    {
        "db_id": "coffee_shop",
        "query": "MATCH (member:`coffee_shop.member`)\nRETURN member.Time_of_purchase,member.Age,member.Address\nORDER BY member.Time_of_purchase",
        "question": "Find the purchase time, age and address of each member, and show the results in the order of purchase time.",
        "answers": [
            [
                18,
                29,
                "Hartford"
            ],
            [
                18,
                35,
                "Waterbury"
            ],
            [
                20,
                34,
                "Hartford"
            ],
            [
                24,
                45,
                "Waterbury"
            ],
            [
                26,
                33,
                "Cheshire"
            ],
            [
                26,
                42,
                "Bridgeport"
            ],
            [
                27,
                51,
                "Waterbury"
            ],
            [
                27,
                51,
                "Hartford"
            ],
            [
                41,
                67,
                "Waterbury"
            ],
            [
                44,
                50,
                "Cheshire"
            ]
        ]
    },
    {
        "db_id": "coffee_shop",
        "query": "MATCH (shop:`coffee_shop.shop`)\nRETURN shop.Address\nORDER BY shop.Open_Year",
        "question": "Show the shop addresses ordered by their opening year.",
        "answers": [
            [
                "1100 Main Street"
            ],
            [
                "1111 Main Street"
            ],
            [
                "2345 McGee Street"
            ],
            [
                "324 E. 11th Street"
            ],
            [
                "1200 Main Street"
            ],
            [
                "1330 Baltimore Street"
            ],
            [
                "909 Walnut Street"
            ],
            [
                "1201 Walnut Street"
            ],
            [
                "414 E. 12th Street"
            ],
            [
                "909 Main Street"
            ]
        ]
    },
    {
        "db_id": "coffee_shop",
        "query": "MATCH (shop:`coffee_shop.shop`)\nWITH avg(shop.Score) AS score\nMATCH (shop:`coffee_shop.shop`)\nWHERE  shop.Score <  score \nRETURN shop.Shop_ID,shop.Address",
        "question": "Find the id and address of the shops whose score is below the average score.",
        "answers": [
            [
                4,
                "909 Walnut Street"
            ],
            [
                5,
                "414 E. 12th Street"
            ],
            [
                6,
                "1201 Walnut Street"
            ],
            [
                8,
                "909 Main Street"
            ],
            [
                9,
                "1100 Main Street"
            ],
            [
                10,
                "324 E. 11th Street"
            ]
        ]
    },
    {
        "db_id": "coffee_shop",
        "query": "MATCH (shop:`coffee_shop.shop`)\nWHERE NOT (shop)-[]-(:`coffee_shop.happy_hour`)    \nRETURN shop.Address,shop.Num_of_staff",
        "question": "Find the address and staff number of the shops that do not have any happy hour.",
        "answers": [
            [
                "909 Walnut Street",
                "27"
            ],
            [
                "1201 Walnut Street",
                "34"
            ],
            [
                "2345 McGee Street",
                "425"
            ],
            [
                "909 Main Street",
                "28"
            ],
            [
                "1100 Main Street",
                "23"
            ]
        ]
    },
    {
        "db_id": "coffee_shop",
        "query": "MATCH (t1:`coffee_shop.shop`)-[]-(t2:`coffee_shop.happy_hour`)\nWHERE t2.Month = 'May'\nRETURN t1.Address,t1.Shop_ID",
        "question": "What are the id and address of the shops which have a happy hour in May?",
        "answers": [
            [
                "1200 Main Street",
                1
            ],
            [
                "1200 Main Street",
                1
            ],
            [
                "1330 Baltimore Street",
                3
            ]
        ]
    },
    {
        "db_id": "coffee_shop",
        "query": "MATCH (happy_hour:`coffee_shop.happy_hour`)\nWITH count(*) AS count, happy_hour.Month AS Month\nWHERE count  > 2\nRETURN Month",
        "question": "Which months have more than 2 happy hours?",
        "answers": [
            [
                "May"
            ],
            [
                "April"
            ]
        ]
    },
    {
        "db_id": "insurance_fnol",
        "query": "MATCH (available_policies:`insurance_fnol.Available_Policies`)\nRETURN available_policies.Customer_Phone",
        "question": "Find all the phone numbers.",
        "answers": [
            [
                "+16(2)5838999222"
            ],
            [
                "242.763.9214"
            ],
            [
                "1-416-503-7735x94204"
            ],
            [
                "(777)537-7792"
            ],
            [
                "1-446-940-9907x257"
            ],
            [
                "(379)862-8274x12620"
            ],
            [
                "+85(6)1302858396"
            ],
            [
                "1-797-927-3585x9321"
            ],
            [
                "991.642.6485x822"
            ],
            [
                "813.178.8211x557"
            ],
            [
                "889-572-0609x552"
            ],
            [
                "1-138-841-3073"
            ],
            [
                "1-381-132-0127x3801"
            ],
            [
                "00481937923"
            ],
            [
                "405.090.8654x021"
            ]
        ]
    }
]