[
    {
        "question": "Return the detail of the location named \"UK Gallery\".",
        "query": "MATCH (locations:`cre_Theme_park.Locations`)\nWHERE locations.Location_Name = 'UK Gallery'\nRETURN locations.Other_Details",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                null
            ]
        ]
    },
    {
        "question": "Count the number of distinct names associated with the photos.",
        "query": "MATCH (photos:`cre_Theme_park.Photos`)\nRETURN count(DISTINCT photos.Name)",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Find all the distinct visit dates.",
        "query": "MATCH (visits:`cre_Theme_park.Visits`)\nRETURN DISTINCT visits.Visit_Date",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "2004-08-21 03:06:14"
            ],
            [
                "2013-08-06 05:35:51"
            ],
            [
                "2013-10-27 09:56:08"
            ],
            [
                "1990-08-15 14:24:10"
            ],
            [
                "1980-11-26 02:08:00"
            ],
            [
                "2017-03-19 08:48:19"
            ],
            [
                "2008-11-09 01:28:01"
            ],
            [
                "1989-08-24 20:26:37"
            ],
            [
                "1993-02-01 15:27:20"
            ],
            [
                "2007-09-17 10:12:45"
            ],
            [
                "1998-05-12 00:50:20"
            ],
            [
                "2010-10-04 01:34:12"
            ],
            [
                "2018-01-09 20:39:52"
            ],
            [
                "1971-12-16 06:41:26"
            ],
            [
                "1998-12-10 02:46:43"
            ],
            [
                "1996-01-08 13:23:41"
            ],
            [
                "2007-09-03 04:30:01"
            ],
            [
                "1974-12-31 23:18:24"
            ],
            [
                "2001-11-13 10:08:28"
            ],
            [
                "1990-11-12 00:54:50"
            ]
        ]
    },
    {
        "question": "What are the names of the tourist attractions that can be accessed by bus?",
        "query": "MATCH (tourist_attractions:`cre_Theme_park.Tourist_Attractions`)\nWHERE tourist_attractions.How_to_Get_There = 'bus'\nRETURN tourist_attractions.Name",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "art museum"
            ],
            [
                "film festival"
            ],
            [
                "haunted mansion"
            ],
            [
                "impressions de France"
            ],
            [
                "jungle cruise"
            ],
            [
                "cafe"
            ]
        ]
    },
    {
        "question": "What are the names and opening hours of the tourist attractions that can be accessed by bus or walk?",
        "query": "MATCH (tourist_attractions:`cre_Theme_park.Tourist_Attractions`)\nWHERE tourist_attractions.How_to_Get_There = 'bus' OR tourist_attractions.How_to_Get_There = 'walk'\nRETURN tourist_attractions.Name,tourist_attractions.Opening_Hours",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "art museum",
                null
            ],
            [
                "UK gallery",
                null
            ],
            [
                "film festival",
                null
            ],
            [
                "fun games",
                null
            ],
            [
                "history gallery",
                null
            ],
            [
                "exploration trial",
                null
            ],
            [
                "haunted mansion",
                null
            ],
            [
                "presidents hall",
                null
            ],
            [
                "impressions de France",
                null
            ],
            [
                "jungle cruise",
                null
            ],
            [
                "cafe",
                null
            ]
        ]
    },
    {
        "question": "Give me the star rating descriptions of the hotels that cost more than 10000.",
        "query": "MATCH (T1:`cre_Theme_park.Hotels`)-[]-(T2:`cre_Theme_park.Ref_Hotel_Star_Ratings`)\nWHERE T1.price_range > 10000\nRETURN T2.star_rating_description",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ],
            [
                "star"
            ]
        ]
    },
    {
        "question": "Give me the detail and opening hour for each museum.",
        "query": "MATCH (T1:`cre_Theme_park.Museums`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nRETURN T1.Museum_Details,T2.Opening_Hours",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "Yale Center for British Art",
                null
            ],
            [
                "The Metropolitan Museum of Art",
                null
            ],
            [
                "MoMA",
                null
            ]
        ]
    },
    {
        "question": "What is the name of the tourist attraction that is associated with the photo \"game1\"?",
        "query": "MATCH (T1:`cre_Theme_park.Photos`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nWHERE T1.Name = 'game1'\nRETURN T2.Name",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "impressions de France"
            ]
        ]
    },
    {
        "question": "What are the names and descriptions of the photos taken at the tourist attraction \"film festival\"?",
        "query": "MATCH (T1:`cre_Theme_park.Photos`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nWHERE T2.Name = 'film festival'\nRETURN T1.Name,T1.Description",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "park1",
                null
            ]
        ]
    },
    {
        "question": "What are the details of the shops that can be accessed by walk?",
        "query": "MATCH (T1:`cre_Theme_park.Shops`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nWHERE T2.How_to_Get_There = 'walk'\nRETURN T1.Shop_Details",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "soup"
            ]
        ]
    },
    {
        "question": "What is the name of the staff that is in charge of the attraction named \"US museum\"?",
        "query": "MATCH (T1:`cre_Theme_park.Staff`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nWHERE T2.Name = 'US museum'\nRETURN T1.Name",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "Kaela"
            ],
            [
                "Whitney"
            ],
            [
                "Trinity"
            ]
        ]
    },
    {
        "question": "What are the details of the markets that can be accessed by walk or bus?",
        "query": "MATCH (T1:`cre_Theme_park.Street_Markets`)-[]-(T2:`cre_Theme_park.Tourist_Attractions`)\nWHERE T2.How_to_Get_There = 'walk' OR T2.How_to_Get_There = 'bus'\nRETURN T1.Market_Details",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "Broadway"
            ],
            [
                "Fish Farm Market"
            ]
        ]
    },
    {
        "question": "Show the id and star rating of each hotel, ordered by its price from low to high.",
        "query": "MATCH (hotels:`cre_Theme_park.Hotels`)\nRETURN hotels.hotel_id,hotels.star_rating_code\nORDER BY hotels.price_range ASC",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                144,
                "4"
            ],
            [
                222,
                "5"
            ],
            [
                239,
                "3"
            ],
            [
                331,
                "1"
            ],
            [
                350,
                "1"
            ],
            [
                376,
                "2"
            ],
            [
                431,
                "2"
            ],
            [
                426,
                "5"
            ],
            [
                473,
                "1"
            ],
            [
                555,
                "5"
            ],
            [
                420,
                "5"
            ],
            [
                172,
                "5"
            ],
            [
                264,
                "1"
            ],
            [
                442,
                "2"
            ],
            [
                514,
                "5"
            ],
            [
                123,
                "5"
            ],
            [
                421,
                "3"
            ],
            [
                379,
                "4"
            ],
            [
                373,
                "5"
            ],
            [
                314,
                "5"
            ]
        ]
    },
    {
        "question": "Show the transportation method most people choose to get to tourist attractions.",
        "query": "MATCH (tourist_attractions:`cre_Theme_park.Tourist_Attractions`)\nWITH tourist_attractions.How_to_Get_There AS How_to_Get_There, count(tourist_attractions.How_to_Get_There) AS count\nRETURN How_to_Get_There\nORDER BY count DESC\nLIMIT 1",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "bus"
            ]
        ]
    },
    {
        "question": "Which transportation method is used the most often to get to tourist attractions?",
        "query": "MATCH (tourist_attractions:`cre_Theme_park.Tourist_Attractions`)\nWITH tourist_attractions.How_to_Get_There AS How_to_Get_There, count(tourist_attractions.How_to_Get_There) AS count\nRETURN How_to_Get_There\nORDER BY count DESC\nLIMIT 1",
        "db_id": "cre_Theme_park",
        "answers": [
            [
                "bus"
            ]
        ]
    },
    {
        "question": "Show all video game types.",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN DISTINCT video_games.GType",
        "db_id": "game_1",
        "answers": [
            [
                "Collectible card game"
            ],
            [
                "Walking Simulator"
            ],
            [
                "Role-playing game"
            ],
            [
                "Grand strategy"
            ],
            [
                "Frist-person shooter"
            ],
            [
                "Massively multiplayer online game"
            ]
        ]
    },
    {
        "question": "Show all video games and their types in the order of their names.",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nRETURN video_games.GName,video_games.GType\nORDER BY video_games.GName",
        "db_id": "game_1",
        "answers": [
            [
                "Call of Destiny",
                "Frist-person shooter"
            ],
            [
                "Europe is the Universe",
                "Grand strategy"
            ],
            [
                "Grand Term Assignment",
                "Role-playing game"
            ],
            [
                "RNG Stone",
                "Collectible card game"
            ],
            [
                "The Vanishing of Eric Calder",
                "Walking Simulator"
            ],
            [
                "Works of Widenius",
                "Massively multiplayer online game"
            ]
        ]
    },
    {
        "question": "Show all video games with type Collectible card game.",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nWHERE video_games.GType = 'Collectible card game'\nRETURN video_games.GName",
        "db_id": "game_1",
        "answers": [
            [
                "RNG Stone"
            ]
        ]
    },
    {
        "question": "What is the type of video game Call of Destiny.",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nWHERE video_games.GName = 'Call of Destiny'\nRETURN video_games.GType",
        "db_id": "game_1",
        "answers": [
            [
                "Frist-person shooter"
            ]
        ]
    },
    {
        "question": "Count the number of video games with Massively multiplayer online game type .",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nWHERE video_games.GType = 'Massively multiplayer online game'\nRETURN count(*)",
        "db_id": "game_1",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "question": "Show all video game types and the number of video games in each type.",
        "query": "MATCH (video_games:`game_1.Video_Games`)\nWITH count(video_games.GType) AS count, video_games.GType AS GType\nRETURN GType,count",
        "db_id": "game_1",
        "answers": [
            [
                "Collectible card game",
                1
            ],
            [
                "Walking Simulator",
                1
            ],
            [
                "Role-playing game",
                1
            ],
            [
                "Grand strategy",
                1
            ],
            [
                "Frist-person shooter",
                1
            ],
            [
                "Massively multiplayer online game",
                1
            ]
        ]
    },
    {
        "question": "Show ids for all students who live in CHI.",
        "query": "MATCH (student:`game_1.Student`)\nWHERE student.city_code = 'CHI'\nRETURN student.StuID",
        "db_id": "game_1",
        "answers": [
            [
                1004
            ]
        ]
    },
    {
        "question": "What are the ids of all students who live in CHI?",
        "query": "MATCH (student:`game_1.Student`)\nWHERE student.city_code = 'CHI'\nRETURN student.StuID",
        "db_id": "game_1",
        "answers": [
            [
                1004
            ]
        ]
    },
    {
        "question": "Show ids for all students who have advisor 1121.",
        "query": "MATCH (student:`game_1.Student`)\nWHERE student.Advisor = 1121\nRETURN student.StuID",
        "db_id": "game_1",
        "answers": [
            [
                1001
            ],
            [
                1005
            ],
            [
                1018
            ]
        ]
    },
    {
        "question": "Show first name for all students with major 600.",
        "query": "MATCH (student:`game_1.Student`)\nWHERE student.Major = 600\nRETURN student.Fname",
        "db_id": "game_1",
        "answers": [
            [
                "Linda"
            ],
            [
                "Tracy"
            ],
            [
                "Shiela"
            ],
            [
                "Dinesh"
            ],
            [
                "Paul"
            ],
            [
                "Andy"
            ],
            [
                "Lisa"
            ],
            [
                "Jandy"
            ],
            [
                "Eric"
            ],
            [
                "Derek"
            ],
            [
                "David"
            ],
            [
                "Steven"
            ],
            [
                "Charles"
            ],
            [
                "Susan"
            ],
            [
                "Mark"
            ],
            [
                "Bruce"
            ],
            [
                "Michael"
            ],
            [
                "Arthur"
            ]
        ]
    },
    {
        "question": "Show all advisors who have at least two students.",
        "query": "MATCH (student:`game_1.Student`)\nWITH count(*) AS count, student.Advisor AS Advisor\nWHERE count  >= 2\nRETURN Advisor",
        "db_id": "game_1",
        "answers": [
            [
                1121
            ],
            [
                1148
            ],
            [
                2192
            ],
            [
                7271
            ],
            [
                8722
            ],
            [
                7134
            ],
            [
                2311
            ],
            [
                8772
            ],
            [
                5718
            ]
        ]
    },
    {
        "question": "List ids for all student who are on scholarship.",
        "query": "MATCH (sportsinfo:`game_1.SportsInfo`)\nWHERE sportsinfo.OnScholarship = 'Y'\nRETURN sportsinfo.StuID",
        "db_id": "game_1",
        "answers": [
            [
                1002
            ],
            [
                1003
            ],
            [
                1015
            ],
            [
                1019
            ],
            [
                1023
            ],
            [
                1023
            ],
            [
                1026
            ],
            [
                1033
            ]
        ]
    },
    {
        "question": "Show last names for all student who are on scholarship.",
        "query": "MATCH (T1:`game_1.SportsInfo`)-[]-(T2:`game_1.Student`)\nWHERE T1.OnScholarship = 'Y'\nRETURN T2.LName",
        "db_id": "game_1",
        "answers": [
            [
                "Kim"
            ],
            [
                "Jones"
            ],
            [
                "Lee"
            ],
            [
                "Pang"
            ],
            [
                "Shieber"
            ],
            [
                "Shieber"
            ],
            [
                "Pang"
            ],
            [
                "Simms"
            ]
        ]
    },
    {
        "question": "Show all sport name and the number of students.",
        "query": "MATCH (sportsinfo:`game_1.SportsInfo`)\nWITH count(sportsinfo.SportName) AS count, sportsinfo.SportName AS SportName\nRETURN SportName,count",
        "db_id": "game_1",
        "answers": [
            [
                "Athletics",
                1
            ],
            [
                "Football",
                2
            ],
            [
                "Lacrosse",
                3
            ],
            [
                "Swimming",
                1
            ],
            [
                "Tennis",
                2
            ],
            [
                "Baseball",
                1
            ],
            [
                "Basketball",
                1
            ],
            [
                "Cricket",
                1
            ],
            [
                "Soccer",
                1
            ],
            [
                "Curling",
                1
            ]
        ]
    },
    {
        "question": "Which sport has most number of students on scholarship?",
        "query": "MATCH (sportsinfo:`game_1.SportsInfo`)\nWHERE sportsinfo.OnScholarship = 'Y'\nWITH count(sportsinfo.SportName) AS count, sportsinfo.SportName AS SportName\nRETURN SportName\nORDER BY count DESC\nLIMIT 1",
        "db_id": "game_1",
        "answers": [
            [
                "Football"
            ]
        ]
    },
    {
        "question": "What is the sport with the most scholarship students?",
        "query": "MATCH (sportsinfo:`game_1.SportsInfo`)\nWHERE sportsinfo.OnScholarship = 'Y'\nWITH count(sportsinfo.SportName) AS count, sportsinfo.SportName AS SportName\nRETURN SportName\nORDER BY count DESC\nLIMIT 1",
        "db_id": "game_1",
        "answers": [
            [
                "Football"
            ]
        ]
    },
    {
        "question": "Find the last and first name of students who are playing Football or Lacrosse.",
        "query": "MATCH (T1:`game_1.SportsInfo`)-[]-(T2:`game_1.Student`)\nWHERE T1.SportName = 'Football' OR T1.SportName = 'Lacrosse'\nRETURN T2.LName,T2.Fname",
        "db_id": "game_1",
        "answers": [
            [
                "Kim",
                "Tracy"
            ],
            [
                "Jones",
                "Shiela"
            ],
            [
                "Gompers",
                "Paul"
            ],
            [
                "Lee",
                "Susan"
            ],
            [
                "Leighton",
                "Michael"
            ]
        ]
    },
    {
        "question": "What is the first and last name of all students who play Football or Lacrosse?",
        "query": "MATCH (T1:`game_1.SportsInfo`)-[]-(T2:`game_1.Student`)\nWHERE T1.SportName = 'Football' OR T1.SportName = 'Lacrosse'\nRETURN T2.LName,T2.Fname",
        "db_id": "game_1",
        "answers": [
            [
                "Kim",
                "Tracy"
            ],
            [
                "Jones",
                "Shiela"
            ],
            [
                "Gompers",
                "Paul"
            ],
            [
                "Lee",
                "Susan"
            ],
            [
                "Leighton",
                "Michael"
            ]
        ]
    },
    {
        "question": "Find the name of all customers.",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nRETURN customers.customer_name",
        "db_id": "customers_and_addresses",
        "answers": [
            [
                "Dr. Julia Wuckert MD"
            ],
            [
                "Tillman Ernser"
            ],
            [
                "Rodrick Heaney"
            ],
            [
                "Prof. Alexzander Hamill"
            ],
            [
                "Prof. Reyes Berge II"
            ],
            [
                "Maudie Kertzmann"
            ],
            [
                "Mozell Morissette"
            ],
            [
                "Eunice Morar"
            ],
            [
                "Devin Mills"
            ],
            [
                "Kitty Padberg III"
            ],
            [
                "Salvatore Tillman"
            ],
            [
                "Clifford Pagac"
            ],
            [
                "Miss Aliyah Witting"
            ],
            [
                "Alexane Kilback"
            ],
            [
                "Prof. Ibrahim Bashirian"
            ]
        ]
    },
    {
        "question": "Return the total number of distinct customers.",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nRETURN count(*)",
        "db_id": "customers_and_addresses",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "What are the names of customers who use payment method \"Cash\"?",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nWHERE customers.payment_method = 'Cash'\nRETURN customers.customer_name",
        "db_id": "customers_and_addresses",
        "answers": [
            [
                "Dr. Julia Wuckert MD"
            ],
            [
                "Maudie Kertzmann"
            ],
            [
                "Kitty Padberg III"
            ],
            [
                "Prof. Ibrahim Bashirian"
            ]
        ]
    },
    {
        "question": "Find the \"date became customers\" of the customers whose ID is between 10 and 20.",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nWHERE 10<=customers.customer_id<=20\nRETURN customers.date_became_customer",
        "db_id": "customers_and_addresses",
        "answers": [
            [
                "2018-03-22 18:09:09"
            ],
            [
                "2018-03-04 00:17:48"
            ],
            [
                "2018-02-24 10:24:23"
            ],
            [
                "2018-03-05 07:19:45"
            ],
            [
                "2018-03-08 01:17:31"
            ],
            [
                "2018-03-15 02:54:27"
            ]
        ]
    },
    {
        "question": "Which payment method is used by most customers?",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nWITH count(customers.payment_method) AS count, customers.payment_method AS payment_method\nRETURN payment_method\nORDER BY count DESC\nLIMIT 1",
        "db_id": "customers_and_addresses",
        "answers": [
            [
                "Cheque"
            ]
        ]
    },
    {
        "question": "Return all the distinct payment methods used by customers.",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nRETURN DISTINCT customers.payment_method",
        "db_id": "customers_and_addresses",
        "answers": [
            [
                "Cash"
            ],
            [
                "Cheque"
            ],
            [
                "Credit Card"
            ]
        ]
    },
    {
        "question": "Return the the details of all products.",
        "query": "MATCH (products:`customers_and_addresses.Products`)\nRETURN DISTINCT products.product_details",
        "db_id": "customers_and_addresses",
        "answers": [
            [
                "Americano"
            ],
            [
                "Dove Chocolate"
            ],
            [
                "Latte"
            ]
        ]
    },
    {
        "question": "Retrieve the list of all cities.",
        "query": "MATCH (addresses:`customers_and_addresses.Addresses`)\nRETURN DISTINCT addresses.city",
        "db_id": "customers_and_addresses",
        "answers": [
            [
                "Lucasville"
            ],
            [
                "New Sabryna"
            ],
            [
                "Reingertown"
            ],
            [
                "Gleasonmouth"
            ],
            [
                "Stantonville"
            ],
            [
                "South Meghanview"
            ],
            [
                "Lake Walterton"
            ],
            [
                "South Bellaland"
            ],
            [
                "Felicityfort"
            ],
            [
                "East Julianaside"
            ],
            [
                "Lake Geovannyton"
            ],
            [
                "New Terrillport"
            ],
            [
                "Port Lilyan"
            ],
            [
                "Lake Ryann"
            ],
            [
                "East Pascale"
            ]
        ]
    },
    {
        "question": "How many customers have at least one order with status \"Cancelled\"?",
        "query": "MATCH (customer_orders:`customers_and_addresses.Customer_Orders`)\nWHERE customer_orders.order_status = 'Cancelled'\nRETURN count(DISTINCT customer_orders.customer_id)",
        "db_id": "customers_and_addresses",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "How many orders have detail \"Second time\"?",
        "query": "MATCH (customer_orders:`customers_and_addresses.Customer_Orders`)\nWHERE customer_orders.order_details = 'Second time'\nRETURN count(*)",
        "db_id": "customers_and_addresses",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "Find all the addresses in East Julianaside, Texas or in Gleasonmouth, Arizona.",
        "query": "MATCH (addresses:`customers_and_addresses.Addresses`)\nWHERE addresses.city = 'East Julianaside' AND addresses.state_province_county = 'Texas'\nRETURN addresses.address_content  AS address_content \nUNION\nMATCH (addresses:`customers_and_addresses.Addresses`)\nWHERE addresses.city = 'Gleasonmouth' AND addresses.state_province_county = 'Arizona'\nRETURN addresses.address_content  AS address_content",
        "db_id": "customers_and_addresses",
        "answers": [
            [
                "120 Noble Radial"
            ],
            [
                "92865 Margaretta Streets Suite 467"
            ]
        ]
    },
    {
        "question": "Find the name of customers who did not pay with Cash.",
        "query": "MATCH (customers:`customers_and_addresses.Customers`)\nWHERE customers.payment_method <> 'Cash'\nRETURN customers.customer_name",
        "db_id": "customers_and_addresses",
        "answers": [
            [
                "Tillman Ernser"
            ],
            [
                "Rodrick Heaney"
            ],
            [
                "Prof. Alexzander Hamill"
            ],
            [
                "Prof. Reyes Berge II"
            ],
            [
                "Mozell Morissette"
            ],
            [
                "Eunice Morar"
            ],
            [
                "Devin Mills"
            ],
            [
                "Salvatore Tillman"
            ],
            [
                "Clifford Pagac"
            ],
            [
                "Miss Aliyah Witting"
            ],
            [
                "Alexane Kilback"
            ]
        ]
    },
    {
        "question": "Count the number of artists.",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN count(*)",
        "db_id": "music_4",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "question": "List the age of all music artists.",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN artist.Age",
        "db_id": "music_4",
        "answers": [
            [
                34
            ],
            [
                35
            ],
            [
                22
            ],
            [
                18
            ],
            [
                35
            ],
            [
                27
            ],
            [
                49
            ]
        ]
    },
    {
        "question": "Return the average age across all artists.",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN avg(artist.Age)",
        "db_id": "music_4",
        "answers": [
            [
                31.428571428571427
            ]
        ]
    },
    {
        "question": "What are the famous titles of the artist \"Triumfall\"?",
        "query": "MATCH (artist:`music_4.artist`)\nWHERE artist.Artist = 'Triumfall'\nRETURN artist.Famous_Title",
        "db_id": "music_4",
        "answers": [
            [
                "Antithesis of All Flesh"
            ]
        ]
    },
    {
        "question": "Give the distinct famous release dates for all artists.",
        "query": "MATCH (artist:`music_4.artist`)\nRETURN DISTINCT artist.Famous_Release_date",
        "db_id": "music_4",
        "answers": [
            [
                "November 2007"
            ],
            [
                "January 21, 2008"
            ],
            [
                "2009"
            ],
            [
                "June 23, 2008"
            ],
            [
                "June 15, 2009"
            ]
        ]
    }
]