[
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.review`)-[]-(t4:`yelp.user`)\nWHERE t2.category_name = 'restaurant'\nRETURN t4.name",
        "question": "List all users who reviewed businesses that are restaurant .",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.tip`)-[]-(t1:`yelp.business`)\nWHERE t1.name = 'Cafe Zinho' AND t1.state = 'Pennsylvania' AND t2.year = 2010\nRETURN t2.text",
        "question": "List all tips for \" Cafe Zinho \" in Pennsylvania in 2010 .",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.review`)-[]-(t4:`yelp.user`)\nWHERE t2.category_name = 'restaurant' AND t3.year = 2010\nRETURN t4.name",
        "question": "List all users who reviewed businesses that are restaurant in 2010 .",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t3:`yelp.user`)-[]-(t1:`yelp.review`)-[]-(t2:`yelp.tip`)\nWHERE t1.year = 2012\nRETURN t2.text",
        "question": "Find all the tips from a user who has written a review in 2012",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.review`)-[]-(t1:`yelp.business`)\nWHERE t1.rating = 2.5\nRETURN t2.text",
        "question": "Find all reviews for businesses rated 2.5",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.city = 'Madison' AND t2.category_name = 'escape games'\nRETURN count(DISTINCT t1.name)",
        "question": "find the number of escape games in Madison",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.city = 'Madison' AND t2.category_name = 'escape games'\nRETURN count(DISTINCT t1.name)",
        "question": "What is the number of escape games in Madison",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.city = 'Madison' AND t2.category_name = 'escape games'\nRETURN count(DISTINCT t1.name)",
        "question": "How many escape games exist in Madison",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.city = 'Madison' AND t2.category_name = 'escape games'\nRETURN count(DISTINCT t1.name)",
        "question": "How many escape games are there in Madison ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.rating > 3.5 AND t2.category_name = 'restaurant'\nRETURN count(DISTINCT t1.name)",
        "question": "find the number of restaurant rated more than 3.5",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.user`)-[]-(t1:`yelp.review`)\nWHERE t1.year = 2015 AND t2.name = 'Niloofar'\nRETURN count(DISTINCT t1.None)",
        "question": "How many reviews has Niloofar written in 2015",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.checkin`)-[]-(t1:`yelp.business`)\nWHERE t1.name = 'Cafe Zinho' AND t2.day = 'Friday'\nRETURN t2.count",
        "question": "What is the number of checkins for \" Cafe Zinho \" on Friday",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.review`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.user`)\nWHERE t1.city = 'Pittsburgh' AND t1.name = 'Sushi Too'\nRETURN count(DISTINCT t3.name)",
        "question": "how many users reviewed \" Sushi Too \" in Pittsburgh",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.city = 'Pittsburgh' AND t1.rating = 4.5 AND t2.category_name = 'restaurant'\nRETURN count(DISTINCT t1.name)",
        "question": "What is the number of restaurant in Pittsburgh rated 4.5",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (tip:`yelp.tip`)\nWHERE tip.year = 2015\nRETURN count(DISTINCT tip.text)",
        "question": "How many tips have been written in 2015",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.user`)-[]-(t1:`yelp.tip`)\nWHERE t1.year = 2010 AND t2.name = 'Michelle'\nRETURN count(DISTINCT t1.None)",
        "question": "How many tips has Michelle written in 2010",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.user`)-[]-(t1:`yelp.tip`)\nWHERE t1.year = 2010 AND t2.name = 'Michelle'\nRETURN count(DISTINCT t1.None)",
        "question": "Return me the number of tips that are written by Michelle in 2010 .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.user`)-[]-(t1:`yelp.tip`)\nWHERE t1.month = 'April' AND t2.name = 'Michelle'\nRETURN count(DISTINCT t1.None)",
        "question": "How many tips has Michelle written in April",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.state = 'Texas' AND t2.category_name = 'restaurant'\nRETURN count(DISTINCT t1.name)",
        "question": "what is the number of restaurant in Texas",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.city = 'Dallas' AND t1.rating > 3.5 AND t2.category_name = 'Bars'\nRETURN count(DISTINCT t1.name)",
        "question": "How many Bars in \" Dallas \" have a rating above 3.5 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.city = 'Dallas' AND t1.rating > 3.5 AND t2.category_name = 'Bars'\nRETURN count(DISTINCT t1.name)",
        "question": "How many Bars in Dallas have a rating above 3.5 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.review`)-[]-(t4:`yelp.user`)\nWHERE t1.city = 'Dallas' AND t1.name = 'Texas de Brazil' AND t1.state = 'Texas' AND t2.category_name = 'restaurant'\nRETURN count(DISTINCT t4.name)",
        "question": "How many people reviewed the restaurant \" Texas de Brazil \" in Dallas Texas ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.review`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.user`)\nWHERE t1.name = 'Bistro Di Napoli' AND t2.year = 2015\nRETURN count(DISTINCT t3.name)",
        "question": "How many people reviewed \" Bistro Di Napoli \" in 2015 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t3:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t2:`yelp.neighbourhood`)\nWHERE t1.city = 'Dallas' AND t3.category_name = 'restaurant' AND t2.neighbourhood_name = 'Hazelwood'\nRETURN count(DISTINCT t1.name)",
        "question": "How many restaurant are there in the Hazelwood district of Dallas ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.city = 'Dallas' AND business.name = 'Starbucks' AND business.state = 'Texas'\nRETURN count(DISTINCT business.business_id)",
        "question": "How many Starbucks are there in Dallas Texas ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.name = 'Acacia Cafe'\nRETURN business.review_count",
        "question": "How many reviews does \" Acacia Cafe \" have ?",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.neighbourhood`)-[]-(t1:`yelp.business`)\nWHERE t1.city = 'Madison' AND t2.neighbourhood_name = 'Stone Meadows'\nRETURN count(DISTINCT t1.name)",
        "question": "How many businesses are there in the \" Stone Meadows \" neighbourhood in Madison ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.user`)-[]-(t1:`yelp.review`)\nWHERE t2.name = 'Adrienne'\nRETURN count(DISTINCT t1.None)",
        "question": "How many reviews has Adrienne written ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.user`)-[]-(t1:`yelp.review`)\nWHERE t1.month = 'March' AND t1.year = 2014 AND t2.name = 'Michelle'\nRETURN count(DISTINCT t1.None)",
        "question": "How many reviews has Michelle written in March 2014 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.review`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.user`)\nWHERE t2.year = 2010 AND t3.name = 'Michelle'\nRETURN count(DISTINCT t1.name)",
        "question": "How many businesses has Michelle reviewed in 2010 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.review`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.user`)\nWHERE t1.city = 'San Diego' AND t2.year = 2010 AND t3.name = 'Christine'\nRETURN count(DISTINCT t1.name)",
        "question": "How many businesses in \" San Diego \" has Christine reviewed in 2010 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.city = 'Los Angeles' AND business.name = 'Target'\nRETURN count(DISTINCT business.business_id)",
        "question": "How many Target are there in \" Los Angeles \" ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.review`)-[]-(t4:`yelp.user`)\nWHERE t1.city = 'Dallas' AND t2.category_name = 'Irish Pub'\nRETURN count(DISTINCT t4.name)",
        "question": "How many users have reviewed Irish Pub in Dallas ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (review:`yelp.review`)\nWHERE review.year = 2014\nRETURN avg(review.rating)",
        "question": "What is the average rating of reviews written in year 2014 ?",
        "answers": [
            [
                null
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.review`)-[]-(t4:`yelp.user`)\nWHERE t1.name = 'Vintner Grill' AND t2.category_name = 'category_category_name0' AND t3.year = 2010\nRETURN count(DISTINCT t4.name)",
        "question": "How many people reviewed restaurant \" Vintner Grill \" in 2010 ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t1:`yelp.neighbourhood`)-[]-(t2:`yelp.business`)-[]-(t3:`yelp.review`)\nWHERE t1.neighbourhood_name = 'South Summerlin'\nRETURN count(DISTINCT t3.None)",
        "question": "Find the number of reviews on businesses located in \" South Summerlin \" neighbourhood",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (user:`yelp.user`)\nWHERE user.name = 'Michelle'\nRETURN count(DISTINCT user.name)",
        "question": "Find the number of users called Michelle",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t2.category_name = 'restaurant'\nRETURN count(DISTINCT t1.name)",
        "question": "Return me the number of businesses that are restaurant .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (business:`yelp.business`)\nWHERE business.name = 'Panda Express'\nRETURN count(DISTINCT business.city)",
        "question": "Return me the number of cities that has \" Panda Express \" .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.user`)-[]-(t1:`yelp.tip`)\nWHERE t2.name = 'Michelle'\nRETURN count(DISTINCT t1.None)",
        "question": "Return me the number of tips that are written by Michelle .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (review:`yelp.review`)\nWHERE review.month = 'March'\nRETURN count(DISTINCT review.text)",
        "question": "Find the total number of reviews written in March",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t1:`yelp.neighbourhood`)-[]-(t2:`yelp.business`)\nWHERE t2.city = 'Madison' AND t2.rating = 5\nRETURN count(DISTINCT t1.neighbourhood_name)",
        "question": "How many neighbourhoods have a business with rating 5 in Madison ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.category`)\nWHERE t1.state = 'Texas' AND t2.category_name = 'Moroccan' AND t3.category_name = 'restaurant'\nRETURN t1.name",
        "question": "Give me all the Moroccan restaurant in Texas",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.category`)\nWHERE t1.city = 'Dallas' AND t1.rating > 3.5 AND t2.category_name = 'Mexican' AND t3.category_name = 'restaurant'\nRETURN t1.name",
        "question": "Find all Mexican restaurant in Dallas with at least 3.5 stars",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.category`)\nWHERE t1.city = 'Dallas' AND t1.state = 'Texas' AND t2.category_name = 'Valet Service' AND t3.category_name = 'restaurant'\nRETURN t1.name",
        "question": "Find all restaurant with Valet Service in Dallas Texas",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t3:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t4:`yelp.category`)-[]-(t2:`yelp.neighbourhood`)\nWHERE t1.city = 'Madison' AND t3.category_name = 'Italian' AND t4.category_name = 'restaurant' AND t2.neighbourhood_name = 'Meadowood'\nRETURN t1.name",
        "question": "Find all Italian restaurant in the Meadowood neighbourhood of Madison",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)\nWHERE t1.city = 'Los Angeles' AND t1.rating > 3 AND t1.review_count > 30 AND t2.category_name = 'Bars'\nRETURN t1.name",
        "question": "Find all Bars in \" Los Angeles \" with at least 30 reviews and average rating above 3 stars",
        "answers": []
    },
    {
        "db_id": "yelp",
        "query": "MATCH (t2:`yelp.category`)-[]-(t1:`yelp.business`)-[]-(t3:`yelp.category`)\nWHERE t1.city = 'Edinburgh' AND t2.category_name = 'restaurant' AND t3.category_name = 'Egyptian'\nRETURN count(DISTINCT t1.name)",
        "question": "How many Egyptian restaurant are there in Edinburgh ?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (journal:`academic.journal`)\nWHERE journal.name = 'PVLDB'\nRETURN journal.homepage",
        "question": "return me the homepage of PVLDB .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (publication:`academic.publication`)\nWHERE publication.title = 'Making database systems usable'\nRETURN publication.abstract",
        "question": "return me the abstract of \" Making database systems usable \" .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (publication:`academic.publication`)\nWHERE publication.title = 'Making database systems usable'\nRETURN publication.year",
        "question": "return me the year of \" Making database systems usable \"",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (publication:`academic.publication`)\nWHERE publication.year > 2000\nRETURN publication.title",
        "question": "return me the papers after 2000 .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (conference:`academic.conference`)\nWHERE conference.name = 'VLDB'\nRETURN conference.homepage",
        "question": "return me the homepage of the VLDB conference .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (organization:`academic.organization`)\nWHERE organization.continent = 'North America'\nRETURN organization.name",
        "question": "return me all the organizations in \" North America \" .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (organization:`academic.organization`)\nWHERE organization.name = 'University of Michigan'\nRETURN organization.homepage",
        "question": "return me the homepage of \" University of Michigan \" .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (publication:`academic.publication`)\nWHERE publication.title = 'Making database systems usable'\nRETURN publication.reference_num",
        "question": "return me the number of references of \" Making database systems usable \" .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (publication:`academic.publication`)\nWHERE publication.title = 'Making database systems usable'\nRETURN publication.reference_num",
        "question": "return me the references of \" Making database systems usable \" .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (publication:`academic.publication`)\nWHERE publication.title = 'Making database systems usable'\nRETURN publication.citation_num",
        "question": "return me the number of citations of \" Making database systems usable \" .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (publication:`academic.publication`)\nWHERE publication.title = 'Making database systems usable'\nRETURN publication.citation_num",
        "question": "return me the citations of \" Making database systems usable \" .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (publication:`academic.publication`)\nWHERE publication.citation_num > 200\nRETURN publication.title",
        "question": "return me the paper with more than 200 citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t3:`academic.domain`)-[t1:`academic.domain_journal`]-(t2:`academic.journal`)\nWHERE t2.name = 'PVLDB'\nRETURN t3.name",
        "question": "return me the area of PVLDB .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t1:`academic.author`)-[t2:`academic.writes`]-(t3:`academic.publication`)\nWHERE t3.title = 'Making database systems usable'\nRETURN t1.name",
        "question": "return me the authors of \" Making database systems usable \" .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.conference`)\nWHERE t2.title = 'Making database systems usable'\nRETURN t1.name",
        "question": "return me the conference, which published \" Making database systems usable \" .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.conference`)\nWHERE t1.name = 'VLDB'\nRETURN t2.title",
        "question": "return me the papers on VLDB conference .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.journal`)\nWHERE t1.name = 'PVLDB'\nRETURN t2.title",
        "question": "return me the papers on PVLDB .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.journal`)\nWHERE t1.name = 'PVLDB' AND t2.year > 2000\nRETURN t2.title",
        "question": "return me the papers on PVLDB after 2000 .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.conference`)\nWHERE t1.name = 'VLDB' AND t2.year > 2000\nRETURN t2.title",
        "question": "return me the papers on VLDB conference after 2000 .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t1:`academic.conference`)-[t3:`academic.domain_conference`]-(t2:`academic.domain`)\nWHERE t1.name = 'VLDB'\nRETURN t2.name",
        "question": "return me the area of the VLDB conference .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t3:`academic.domain`)-[t2:`academic.domain_keyword`]-(t1:`academic.keyword`)\nWHERE t3.name = 'Databases'\nRETURN t1.keyword",
        "question": "return me all the keywords in Databases area .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t1:`academic.keyword`)-[t2:`academic.publication_keyword`]-(t3:`academic.publication`)\nWHERE t1.keyword = 'Natural Language'\nRETURN t3.title",
        "question": "return me all the papers, which contain the keyword \" Natural Language \" .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t1:`academic.keyword`)-[t3:`academic.publication_keyword`]-(t2:`academic.publication`)\nWHERE t2.title = 'Making database systems usable'\nRETURN t1.keyword",
        "question": "return me the keywords of \" Making database systems usable \" .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.organization`)-[]-(t1:`academic.author`)\nWHERE t2.name = 'University of Michigan'\nRETURN t1.name",
        "question": "return me all the researchers in \" University of Michigan \" .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.domain`)-[t1:`academic.domain_publication`]-(t3:`academic.publication`)\nWHERE t2.name = 'Databases' AND t3.citation_num > 200\nRETURN t3.title",
        "question": "return me the paper in Databases area with more than 200 citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.journal`)\nWHERE t1.name = 'PVLDB' AND t2.citation_num > 200\nRETURN t2.title",
        "question": "return me the paper in PVLDB with more than 200 citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.conference`)\nWHERE t1.name = 'VLDB' AND t2.citation_num > 200\nRETURN t2.title",
        "question": "return me the paper in VLDB conference with more than 200 citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (publication:`academic.publication`)\nWHERE publication.citation_num > 200 AND publication.year > 2000\nRETURN publication.title",
        "question": "return me the paper after 2000 with more than 200 citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.domain`)-[t1:`academic.domain_publication`]-(t3:`academic.publication`)\nWHERE t2.name = 'Databases' AND t3.citation_num > 200 AND t3.year > 2000\nRETURN t3.title",
        "question": "return me the paper after 2000 in Databases area with more than 200 citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.journal`)\nWHERE t1.name = 'PVLDB' AND t2.citation_num > 200 AND t2.year > 2000\nRETURN t2.title",
        "question": "return me the paper after 2000 in PVLDB with more than 200 citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.conference`)\nWHERE t1.name = 'VLDB' AND t2.citation_num > 200 AND t2.year > 2000\nRETURN t2.title",
        "question": "return me the paper after 2000 in VLDB conference with more than 200 citations .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t1:`academic.author`)-[t2:`academic.writes`]-(t3:`academic.publication`)\nWHERE t3.title = 'Making database systems usable'\nRETURN count(DISTINCT t1.name)",
        "question": "return me the number of authors of \" Making database systems usable \" .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (t3:`academic.publication`)-[]-(t1:`academic.cite`)-[]-(t2:`academic.publication`)\nWHERE t3.title = 'Making database systems usable' AND t2.year < 2010\nRETURN count(DISTINCT t2.title)",
        "question": "return me the number of citations of \" Making database systems usable \" before 2010 .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.conference`)\nWHERE t1.name = 'VLDB'\nRETURN count(DISTINCT t2.title)",
        "question": "return me the number of papers on VLDB conference .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.journal`)\nWHERE t1.name = 'PVLDB'\nRETURN count(DISTINCT t2.title)",
        "question": "return me the number of papers on PVLDB .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (publication:`academic.publication`)\nWHERE publication.year > 2000\nRETURN count(DISTINCT publication.title)",
        "question": "return me the number of papers after 2000 .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.journal`)\nWHERE t1.name = 'PVLDB' AND t2.year > 2000\nRETURN count(DISTINCT t2.title)",
        "question": "return me the number of papers on PVLDB after 2000 .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.conference`)\nWHERE t1.name = 'VLDB' AND t2.year > 2000\nRETURN count(DISTINCT t2.title)",
        "question": "return me the number of papers on VLDB conference after 2000 .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (t3:`academic.domain`)-[t2:`academic.domain_keyword`]-(t1:`academic.keyword`)\nWHERE t3.name = 'Databases'\nRETURN count(DISTINCT t1.keyword)",
        "question": "return me the number of keywords in Databases area .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (t1:`academic.keyword`)-[t2:`academic.publication_keyword`]-(t3:`academic.publication`)\nWHERE t1.keyword = 'Natural Language'\nRETURN count(DISTINCT t3.title)",
        "question": "return me the number of papers which contain the keyword \" Natural Language \" .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (t1:`academic.keyword`)-[t3:`academic.publication_keyword`]-(t2:`academic.publication`)\nWHERE t2.title = 'Making database systems usable'\nRETURN count(DISTINCT t1.keyword)",
        "question": "return me the number of the keywords of \" Making database systems usable \" .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (organization:`academic.organization`)\nWHERE organization.continent = 'North America'\nRETURN count(DISTINCT organization.name)",
        "question": "return me the number of the organizations in \" North America \" .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.organization`)-[]-(t1:`academic.author`)\nWHERE t2.name = 'University of Michigan'\nRETURN count(DISTINCT t1.name)",
        "question": "return me the number of researchers in \" University of Michigan \" .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.journal`)\nWHERE t1.name = 'PVLDB' AND t2.year < 2000\nRETURN count(DISTINCT t2.title)",
        "question": "return me the number of papers published on PVLDB before 2000 .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.conference`)\nWHERE t1.name = 'VLDB' AND t2.year < 2000\nRETURN count(DISTINCT t2.title)",
        "question": "return me the number of papers published in the VLDB conference before 2000 .",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.journal`)\nWHERE t1.name = 'PVLDB'\nRETURN t2.citation_num",
        "question": "return me the citations of each paper in PVLDB .",
        "answers": []
    },
    {
        "db_id": "academic",
        "query": "MATCH (t2:`academic.publication`)-[]-(t1:`academic.journal`)\nWHERE t1.name = 'PVLDB'\nRETURN count(DISTINCT t2.title),t2.year",
        "question": "return me the number of papers published in PVLDB in each year .",
        "answers": []
    }
]