[
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (project_staff:`tracking_grants_for_research.Project_Staff`)\nRETURN project_staff.role_code\nORDER BY project_staff.role_code DESC\nLIMIT 1",
        "question": "What is the most common role for the staff?",
        "answers": [
            [
                "researcher"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.gender = 'female'\nRETURN count(*)",
        "question": "How many females does this network has?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.gender = 'female'\nRETURN count(*)",
        "question": "How many females are in the network?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN avg(person.age)",
        "question": "What is the average age for all person?",
        "answers": [
            [
                32.75
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN avg(person.age)",
        "question": "What is the average age for all people in the table?",
        "answers": [
            [
                32.75
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN count(DISTINCT person.city)",
        "question": "How many different cities are they from?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN count(DISTINCT person.city)",
        "question": "How many different cities do people originate from?",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN count(DISTINCT person.job)",
        "question": "How many type of jobs do they have?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN count(DISTINCT person.job)",
        "question": "How many different jobs are listed?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWITH max(person.age) AS age\nMATCH (person:`network_2.Person`)\nWHERE  person.age =  age \nRETURN person.name",
        "question": "Who is the oldest person?",
        "answers": [
            [
                "Zach"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWITH max(person.age) AS age\nMATCH (person:`network_2.Person`)\nWHERE  person.age =  age \nRETURN person.name",
        "question": "What is the name of the person who is the oldest?",
        "answers": [
            [
                "Zach"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.job = 'doctor' AND person.name = 'Zach'\nRETURN person.age",
        "question": "How old is the doctor named Zach?",
        "answers": [
            [
                45
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.job = 'doctor' AND person.name = 'Zach'\nRETURN person.age",
        "question": "What is the age of the doctor named Zach?",
        "answers": [
            [
                45
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.age < 30\nRETURN person.name",
        "question": "Who is the person whose age is below 30?",
        "answers": [
            [
                "Alice"
            ],
            [
                "Dan"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.age < 30\nRETURN person.name",
        "question": "What is the name of the person whose age is below 30?",
        "answers": [
            [
                "Alice"
            ],
            [
                "Dan"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.age > 30 AND person.job = 'engineer'\nRETURN count(*)",
        "question": "How many people whose age is greater 30 and job is engineer?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.age > 30 AND person.job = 'engineer'\nRETURN count(*)",
        "question": "HOw many engineers are older than 30?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN avg(person.age),person.gender",
        "question": "What is the average age for each gender?",
        "answers": [
            [
                25.5,
                "female"
            ],
            [
                40.0,
                "male"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN avg(person.age),person.gender",
        "question": "How old is each gender, on average?",
        "answers": [
            [
                25.5,
                "female"
            ],
            [
                40.0,
                "male"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN avg(person.age),person.job",
        "question": "What is average age for different job title?",
        "answers": [
            [
                25.5,
                "student"
            ],
            [
                35.0,
                "engineer"
            ],
            [
                45.0,
                "doctor"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN avg(person.age),person.job",
        "question": "How old is the average person for each job?",
        "answers": [
            [
                25.5,
                "student"
            ],
            [
                35.0,
                "engineer"
            ],
            [
                45.0,
                "doctor"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.gender = 'male'\nRETURN avg(person.age),person.job",
        "question": "What is average age of male for different job title?",
        "answers": [
            [
                35.0,
                "engineer"
            ],
            [
                45.0,
                "doctor"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.gender = 'male'\nRETURN avg(person.age),person.job",
        "question": "What is the average age for a male in each job?",
        "answers": [
            [
                35.0,
                "engineer"
            ],
            [
                45.0,
                "doctor"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN min(person.age),person.job",
        "question": "What is minimum age for different job title?",
        "answers": [
            [
                25,
                "student"
            ],
            [
                35,
                "engineer"
            ],
            [
                45,
                "doctor"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN min(person.age),person.job",
        "question": "How old is the youngest person for each job?",
        "answers": [
            [
                25,
                "student"
            ],
            [
                35,
                "engineer"
            ],
            [
                45,
                "doctor"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.age < 40\nRETURN count(*),person.gender",
        "question": "Find the number of people who is under 40 for each gender.",
        "answers": [
            [
                2,
                "female"
            ],
            [
                1,
                "male"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.age < 40\nRETURN count(*),person.gender",
        "question": "How many people are under 40 for each gender?",
        "answers": [
            [
                2,
                "female"
            ],
            [
                1,
                "male"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN person.name,person.job\nORDER BY person.name",
        "question": "list the name, job title of all people ordered by their names.",
        "answers": [
            [
                "Alice",
                "student"
            ],
            [
                "Bob",
                "engineer"
            ],
            [
                "Dan",
                "student"
            ],
            [
                "Zach",
                "doctor"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN person.name,person.job\nORDER BY person.name",
        "question": "What are the names and job titles of every person ordered alphabetically by name?",
        "answers": [
            [
                "Alice",
                "student"
            ],
            [
                "Bob",
                "engineer"
            ],
            [
                "Dan",
                "student"
            ],
            [
                "Zach",
                "doctor"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN person.name\nORDER BY person.age DESC",
        "question": "Find the names of all person sorted in the descending order using age.",
        "answers": [
            [
                "Zach"
            ],
            [
                "Bob"
            ],
            [
                "Dan"
            ],
            [
                "Alice"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nRETURN person.name\nORDER BY person.age DESC",
        "question": "What are the names of everybody sorted by age in descending order?",
        "answers": [
            [
                "Zach"
            ],
            [
                "Bob"
            ],
            [
                "Dan"
            ],
            [
                "Alice"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.gender = 'male'\nRETURN person.name\nORDER BY person.age",
        "question": "Find the name and age of all males in order of their age.",
        "answers": [
            [
                "Bob"
            ],
            [
                "Zach"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.gender = 'male'\nRETURN person.name\nORDER BY person.age",
        "question": "What is the name and age of every male? Order the results by age.",
        "answers": [
            [
                "Bob"
            ],
            [
                "Zach"
            ]
        ]
    },
    {
        "db_id": "network_2",
        "query": "MATCH (T1:`network_2.Person`)-[]-(T2:`network_2.PersonFriend`)\nWHERE T2.friend = 'Zach' AND T1.gender = 'female'\nRETURN T1.name",
        "question": "Find the names of females who are friends with Zach",
        "answers": []
    },
    {
        "db_id": "network_2",
        "query": "MATCH (T1:`network_2.Person`)-[]-(T2:`network_2.PersonFriend`)\nWHERE T2.friend = 'Zach' AND T1.gender = 'female'\nRETURN T1.name",
        "question": "What are the names of all females who are friends with Zach?",
        "answers": []
    },
    {
        "db_id": "network_2",
        "query": "MATCH (T1:`network_2.Person`)-[]-(T2:`network_2.PersonFriend`)\nWHERE T2.name = 'Alice' AND T1.gender = 'female'\nRETURN T2.friend",
        "question": "Find the female friends of Alice.",
        "answers": []
    },
    {
        "db_id": "network_2",
        "query": "MATCH (T1:`network_2.Person`)-[]-(T2:`network_2.PersonFriend`)\nWHERE T2.name = 'Alice' AND T1.gender = 'female'\nRETURN T2.friend",
        "question": "What are all the friends of Alice who are female?",
        "answers": []
    },
    {
        "db_id": "network_2",
        "query": "MATCH (T1:`network_2.Person`)-[]-(T2:`network_2.PersonFriend`)\nWHERE T2.name = 'Alice' AND T1.gender = 'male' AND T1.job = 'doctor'\nRETURN T2.friend",
        "question": "Find the male friend of Alice whose job is a doctor?",
        "answers": []
    },
    {
        "db_id": "network_2",
        "query": "MATCH (T1:`network_2.Person`)-[]-(T2:`network_2.PersonFriend`)\nWHERE T2.name = 'Alice' AND T1.gender = 'male' AND T1.job = 'doctor'\nRETURN T2.friend",
        "question": "Who are the friends of Alice that are doctors?",
        "answers": []
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (member:`decoration_competition.member`)\nRETURN member.Name\nORDER BY member.Name ASC",
        "question": "List the names of members in ascending alphabetical order.",
        "answers": [
            [
                "Arnold Palmer"
            ],
            [
                "Billy Casper"
            ],
            [
                "Bobby Nichols"
            ],
            [
                "Homero Blancas"
            ],
            [
                "J. C. Snead"
            ],
            [
                "Jack Nicklaus"
            ],
            [
                "Lee Trevino"
            ],
            [
                "Pat Fitzsimons"
            ],
            [
                "Tom Watson"
            ],
            [
                "Tom Weiskopf"
            ]
        ]
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (member:`decoration_competition.member`)\nRETURN member.Name,member.Country",
        "question": "What are the names and countries of members?",
        "answers": [
            [
                "Jack Nicklaus",
                "United States"
            ],
            [
                "Billy Casper",
                "United States"
            ],
            [
                "Arnold Palmer",
                "Canada"
            ],
            [
                "Tom Watson",
                "United States"
            ],
            [
                "Homero Blancas",
                "United States"
            ],
            [
                "Pat Fitzsimons",
                "Canada"
            ],
            [
                "Bobby Nichols",
                "Canada"
            ],
            [
                "J. C. Snead",
                "Canada"
            ],
            [
                "Lee Trevino",
                "United States"
            ],
            [
                "Tom Weiskopf",
                "United States"
            ]
        ]
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (member:`decoration_competition.member`)\nWHERE member.Country = 'United States' OR member.Country = 'Canada'\nRETURN member.Name",
        "question": "Show the names of members whose country is \"United States\" or \"Canada\".",
        "answers": [
            [
                "Jack Nicklaus"
            ],
            [
                "Billy Casper"
            ],
            [
                "Arnold Palmer"
            ],
            [
                "Tom Watson"
            ],
            [
                "Homero Blancas"
            ],
            [
                "Pat Fitzsimons"
            ],
            [
                "Bobby Nichols"
            ],
            [
                "J. C. Snead"
            ],
            [
                "Lee Trevino"
            ],
            [
                "Tom Weiskopf"
            ]
        ]
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (member:`decoration_competition.member`)\nRETURN member.Country,count(*)",
        "question": "Show the different countries and the number of members from each.",
        "answers": [
            [
                "United States",
                6
            ],
            [
                "Canada",
                4
            ]
        ]
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (member:`decoration_competition.member`)\nRETURN member.Country\nORDER BY member.Country DESC\nLIMIT 1",
        "question": "Show the most common country across members.",
        "answers": [
            [
                "United States"
            ]
        ]
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (member:`decoration_competition.member`)\nWITH member.Country AS Country, count(*) AS count\nWHERE count  > 2\nRETURN Country",
        "question": "Which countries have more than two members?",
        "answers": [
            [
                "United States"
            ],
            [
                "Canada"
            ]
        ]
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (college:`decoration_competition.college`)\nRETURN college.Leader_Name,college.College_Location",
        "question": "Show the leader names and locations of colleges.",
        "answers": [
            [
                "Ousame Tounkara",
                "Ottawa"
            ],
            [
                "Ryan Thelwell",
                "Minnesota"
            ],
            [
                "Andre Arlain",
                "St. Francis Xavier"
            ],
            [
                "Samir Chahine",
                "McGill"
            ],
            [
                "Roger Dunbrack",
                "Western Ontario"
            ]
        ]
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (T1:`decoration_competition.college`)-[]-(T2:`decoration_competition.member`)\nRETURN T2.Name,T1.Name",
        "question": "Show the names of members and names of colleges they go to.",
        "answers": [
            [
                "Billy Casper",
                "Saskatchewan School"
            ],
            [
                "Jack Nicklaus",
                "Saskatchewan School"
            ],
            [
                "Homero Blancas",
                "B.C. School"
            ],
            [
                "Lee Trevino",
                "Calgary School"
            ],
            [
                "Tom Weiskopf",
                "Calgary School"
            ],
            [
                "Arnold Palmer",
                "Edmonton School"
            ],
            [
                "J. C. Snead",
                "Edmonton School"
            ],
            [
                "Tom Watson",
                "Edmonton School"
            ],
            [
                "Bobby Nichols",
                "Toronto School"
            ],
            [
                "Pat Fitzsimons",
                "Toronto School"
            ]
        ]
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (T1:`decoration_competition.college`)-[]-(T2:`decoration_competition.member`)\nRETURN T2.Name,T1.College_Location\nORDER BY T2.Name ASC",
        "question": "Show the names of members and the locations of colleges they go to in ascending alphabetical order of member names.",
        "answers": [
            [
                "Arnold Palmer",
                "McGill"
            ],
            [
                "Billy Casper",
                "Ottawa"
            ],
            [
                "Bobby Nichols",
                "Western Ontario"
            ],
            [
                "Homero Blancas",
                "Minnesota"
            ],
            [
                "J. C. Snead",
                "McGill"
            ],
            [
                "Jack Nicklaus",
                "Ottawa"
            ],
            [
                "Lee Trevino",
                "St. Francis Xavier"
            ],
            [
                "Pat Fitzsimons",
                "Western Ontario"
            ],
            [
                "Tom Watson",
                "McGill"
            ],
            [
                "Tom Weiskopf",
                "St. Francis Xavier"
            ]
        ]
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (T1:`decoration_competition.college`)-[]-(T2:`decoration_competition.member`)\nWHERE T2.Country = 'Canada'\nRETURN DISTINCT T1.Leader_Name",
        "question": "Show the distinct leader names of colleges associated with members from country \"Canada\".",
        "answers": [
            [
                "Samir Chahine"
            ],
            [
                "Roger Dunbrack"
            ]
        ]
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (T1:`decoration_competition.member`)-[]-(T2:`decoration_competition.round`)\nRETURN T1.Name,T2.Decoration_Theme",
        "question": "Show the names of members and the decoration themes they have.",
        "answers": [
            [
                "Jack Nicklaus",
                "Walk on the Moon"
            ],
            [
                "Billy Casper",
                "Soft Dream"
            ],
            [
                "Tom Weiskopf",
                "Dark Nights"
            ],
            [
                "Tom Watson",
                "Sweetie"
            ],
            [
                "Pat Fitzsimons",
                "Summer"
            ],
            [
                "Lee Trevino",
                "Happiness"
            ]
        ]
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (T1:`decoration_competition.member`)-[]-(T2:`decoration_competition.round`)\nWHERE T2.Rank_in_Round > 3\nRETURN T1.Name",
        "question": "Show the names of members that have a rank in round higher than 3.",
        "answers": [
            [
                "Tom Weiskopf"
            ]
        ]
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (T1:`decoration_competition.member`)-[]-(T2:`decoration_competition.round`)\nRETURN T1.Name\nORDER BY T2.Rank_in_Round ASC",
        "question": "Show the names of members in ascending order of their rank in rounds.",
        "answers": [
            [
                "Jack Nicklaus"
            ],
            [
                "Lee Trevino"
            ],
            [
                "Billy Casper"
            ],
            [
                "Pat Fitzsimons"
            ],
            [
                "Tom Watson"
            ],
            [
                "Tom Weiskopf"
            ]
        ]
    },
    {
        "db_id": "decoration_competition",
        "query": "MATCH (member:`decoration_competition.member`)\nWHERE NOT (member)-[]-(:`decoration_competition.round`)    \nRETURN member.Name",
        "question": "List the names of members who did not participate in any round.",
        "answers": [
            [
                "Arnold Palmer"
            ],
            [
                "Homero Blancas"
            ],
            [
                "Bobby Nichols"
            ],
            [
                "J. C. Snead"
            ]
        ]
    },
    {
        "db_id": "document_management",
        "query": "MATCH (documents:`document_management.Documents`)\nRETURN documents.document_name,documents.access_count\nORDER BY documents.document_name",
        "question": "Find the name and access counts of all documents, in alphabetic order of the document name.",
        "answers": [
            [
                "David CV",
                6345
            ],
            [
                "Fall Sails",
                7509
            ],
            [
                "How to cook pasta",
                2045
            ],
            [
                "Humanity: a fact",
                3479
            ],
            [
                "Joe CV",
                2294
            ],
            [
                "John CV",
                5924
            ],
            [
                "Learning Database",
                3769
            ],
            [
                "Learning English",
                1864
            ],
            [
                "Learning Japanese",
                2910
            ],
            [
                "Life about Claude Monet",
                1219
            ],
            [
                "Relationships between History and Arts",
                9948
            ],
            [
                "Research about Art history",
                8208
            ],
            [
                "Spring Sails",
                3289
            ],
            [
                "Summer Sails",
                6661
            ],
            [
                "Winter Sails",
                8623
            ]
        ]
    },
    {
        "db_id": "document_management",
        "query": "MATCH (documents:`document_management.Documents`)\nRETURN documents.document_name,documents.access_count\nORDER BY documents.document_name",
        "question": "What are the names of all the documents, as well as the access counts of each, ordered alphabetically?",
        "answers": [
            [
                "David CV",
                6345
            ],
            [
                "Fall Sails",
                7509
            ],
            [
                "How to cook pasta",
                2045
            ],
            [
                "Humanity: a fact",
                3479
            ],
            [
                "Joe CV",
                2294
            ],
            [
                "John CV",
                5924
            ],
            [
                "Learning Database",
                3769
            ],
            [
                "Learning English",
                1864
            ],
            [
                "Learning Japanese",
                2910
            ],
            [
                "Life about Claude Monet",
                1219
            ],
            [
                "Relationships between History and Arts",
                9948
            ],
            [
                "Research about Art history",
                8208
            ],
            [
                "Spring Sails",
                3289
            ],
            [
                "Summer Sails",
                6661
            ],
            [
                "Winter Sails",
                8623
            ]
        ]
    },
    {
        "db_id": "document_management",
        "query": "MATCH (documents:`document_management.Documents`)\nRETURN documents.document_name,documents.access_count\nORDER BY documents.access_count DESC\nLIMIT 1",
        "question": "Find the name of the document that has been accessed the greatest number of times, as well as the count of how many times it has been accessed?",
        "answers": [
            [
                "Relationships between History and Arts",
                9948
            ]
        ]
    },
    {
        "db_id": "document_management",
        "query": "MATCH (documents:`document_management.Documents`)\nRETURN documents.document_name,documents.access_count\nORDER BY documents.access_count DESC\nLIMIT 1",
        "question": "What is the name of the document which has been accessed the most times, as well as the number of times it has been accessed?",
        "answers": [
            [
                "Relationships between History and Arts",
                9948
            ]
        ]
    },
    {
        "db_id": "document_management",
        "query": "MATCH (documents:`document_management.Documents`)\nWITH count(*) AS count, documents.document_type_code AS document_type_code\nWHERE count  > 4\nRETURN document_type_code",
        "question": "Find the types of documents with more than 4 documents.",
        "answers": [
            [
                "Book"
            ]
        ]
    },
    {
        "db_id": "document_management",
        "query": "MATCH (documents:`document_management.Documents`)\nWITH count(*) AS count, documents.document_type_code AS document_type_code\nWHERE count  > 4\nRETURN document_type_code",
        "question": "What are the codes of types of documents of which there are for or more?",
        "answers": [
            [
                "Book"
            ]
        ]
    },
    {
        "db_id": "document_management",
        "query": "MATCH (documents:`document_management.Documents`)\nRETURN avg(documents.access_count)",
        "question": "What is the average access count of documents?",
        "answers": [
            [
                4939.133333333333
            ]
        ]
    },
    {
        "db_id": "document_management",
        "query": "MATCH (documents:`document_management.Documents`)\nRETURN avg(documents.access_count)",
        "question": "Find the average access count across all documents?",
        "answers": [
            [
                4939.133333333333
            ]
        ]
    },
    {
        "db_id": "document_management",
        "query": "MATCH (t1:`document_management.Documents`)-[]-(t2:`document_management.Document_Structures`)\nWITH count(t1.document_structure_code) AS cnt, t2\nRETURN t2.document_structure_description\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the structure of the document with the least number of accesses?",
        "answers": [
            [
                "Author section"
            ]
        ]
    },
    {
        "db_id": "document_management",
        "query": "MATCH (documents:`document_management.Documents`)\nWHERE documents.document_name = \"David CV\"\nRETURN documents.document_type_code",
        "question": "What is the type of the document named \"David CV\"?",
        "answers": [
            [
                "CV"
            ]
        ]
    },
    {
        "db_id": "document_management",
        "query": "MATCH (documents:`document_management.Documents`)\nWHERE documents.document_name = \"David CV\"\nRETURN documents.document_type_code",
        "question": "Return the type code of the document named \"David CV\".",
        "answers": [
            [
                "CV"
            ]
        ]
    },
    {
        "db_id": "document_management",
        "query": "MATCH (t1:`document_management.Documents`)-[]-(t2:`document_management.Document_Sections`)\nWHERE t1.document_name = \"David CV\"\nRETURN t2.section_title",
        "question": "What are all the section titles of the document named \"David CV\"?",
        "answers": [
            [
                "after"
            ]
        ]
    }
]