[
    {
        "db_id": "club_1",
        "query": "MATCH (student:`club_1.Student`)\nRETURN DISTINCT student.Fname",
        "question": "Find each student's first name.",
        "answers": [
            [
                "Linda"
            ],
            [
                "Tracy"
            ],
            [
                "Shiela"
            ],
            [
                "Dinesh"
            ],
            [
                "Paul"
            ],
            [
                "Andy"
            ],
            [
                "Lisa"
            ],
            [
                "Jandy"
            ],
            [
                "Eric"
            ],
            [
                "Derek"
            ],
            [
                "David"
            ],
            [
                "Steven"
            ],
            [
                "Charles"
            ],
            [
                "Susan"
            ],
            [
                "Mark"
            ],
            [
                "Bruce"
            ],
            [
                "Michael"
            ],
            [
                "Arthur"
            ],
            [
                "Ian"
            ],
            [
                "George"
            ],
            [
                "Stacy"
            ],
            [
                "Jun"
            ],
            [
                "Sarah"
            ],
            [
                "William"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t1.ClubName = \"Bootup Baltimore\"\nRETURN t3.LName",
        "question": "Find the last names of the members of the club \"Bootup Baltimore\".",
        "answers": [
            [
                "Lee"
            ],
            [
                "Smith"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t1.ClubName = \"Bootup Baltimore\"\nRETURN t3.LName",
        "question": "Who are the members of the club named \"Bootup Baltimore\"? Give me their last names.",
        "answers": [
            [
                "Lee"
            ],
            [
                "Smith"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t1.ClubName = \"Hopkins Student Enterprises\"\nRETURN t3.LName",
        "question": "Who are the members of the club named \"Hopkins Student Enterprises\"? Show the last name.",
        "answers": [
            [
                "Nelson"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t1.ClubName = \"Hopkins Student Enterprises\"\nRETURN t3.LName",
        "question": "Return the last name for the members of the club named \"Hopkins Student Enterprises\".",
        "answers": [
            [
                "Nelson"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t1.ClubName = \"Tennis Club\"\nRETURN count(*)",
        "question": "How many members does the club \"Tennis Club\" has?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t1.ClubName = \"Tennis Club\"\nRETURN count(*)",
        "question": "Count the members of the club \"Tennis Club\".",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t1.ClubName = \"Pen and Paper Gaming\"\nRETURN count(*)",
        "question": "Find the number of members of club \"Pen and Paper Gaming\".",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t1.ClubName = \"Pen and Paper Gaming\"\nRETURN count(*)",
        "question": "How many people have membership in the club \"Pen and Paper Gaming\"?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t1.ClubName = \"Bootup Baltimore\" AND t3.Major = 600\nRETURN t3.Fname,t3.LName",
        "question": "Find all members of \"Bootup Baltimore\" whose major is \"600\". Show the first name and last name.",
        "answers": [
            [
                "Derek",
                "Lee"
            ],
            [
                "Linda",
                "Smith"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t1.ClubName = \"Bootup Baltimore\" AND t3.Major = 600\nRETURN t3.Fname,t3.LName",
        "question": "Which members of \"Bootup Baltimore\" major in \"600\"? Give me their first names and last names.",
        "answers": [
            [
                "Derek",
                "Lee"
            ],
            [
                "Linda",
                "Smith"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t3.Major = 600\nWITH t1, count(t1.ClubName) AS cnt\nRETURN t1.ClubName\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Which club has the most members majoring in \"600\"?",
        "answers": [
            [
                "Bootup Baltimore"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t3.Major = 600\nWITH t1, count(t1.ClubName) AS cnt\nRETURN t1.ClubName\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Find the club which has the largest number of members majoring in \"600\".",
        "answers": [
            [
                "Bootup Baltimore"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = \"Tennis Club\"\nRETURN club.ClubDesc",
        "question": "What is the description of the club named \"Tennis Club\"?",
        "answers": [
            [
                "A competitive tennis club."
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = \"Tennis Club\"\nRETURN club.ClubDesc",
        "question": "Find the description of the club called \"Tennis Club\".",
        "answers": [
            [
                "A competitive tennis club."
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = \"Pen and Paper Gaming\"\nRETURN club.ClubDesc",
        "question": "Find the description of the club \"Pen and Paper Gaming\".",
        "answers": [
            [
                "Play pen and paper games on campus."
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = \"Pen and Paper Gaming\"\nRETURN club.ClubDesc",
        "question": "What is the description of the club \"Pen and Paper Gaming\"?",
        "answers": [
            [
                "Play pen and paper games on campus."
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = \"Tennis Club\"\nRETURN club.ClubLocation",
        "question": "What is the location of the club named \"Tennis Club\"?",
        "answers": [
            [
                "AKW"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = \"Tennis Club\"\nRETURN club.ClubLocation",
        "question": "Where us the club named \"Tennis Club\" located?",
        "answers": [
            [
                "AKW"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = \"Pen and Paper Gaming\"\nRETURN club.ClubLocation",
        "question": "Find the location of the club \"Pen and Paper Gaming\".",
        "answers": [
            [
                "HHH"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = \"Pen and Paper Gaming\"\nRETURN club.ClubLocation",
        "question": "Where is the club \"Pen and Paper Gaming\" located?",
        "answers": [
            [
                "HHH"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = \"Hopkins Student Enterprises\"\nRETURN club.ClubLocation",
        "question": "Where is the club \"Hopkins Student Enterprises\" located?",
        "answers": [
            [
                "AKW"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = \"Hopkins Student Enterprises\"\nRETURN club.ClubLocation",
        "question": "Tell me the location of the club \"Hopkins Student Enterprises\".",
        "answers": [
            [
                "AKW"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t1.ClubName = \"Bootup Baltimore\" AND t3.Age > 18\nRETURN count(*)",
        "question": "How many members of \"Bootup Baltimore\" are older than 18?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t1.ClubName = \"Bootup Baltimore\" AND t3.Age > 18\nRETURN count(*)",
        "question": "Count the number of members in club \"Bootup Baltimore\" whose age is above 18.",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t1.ClubName = \"Bootup Baltimore\" AND t3.Age < 18\nRETURN count(*)",
        "question": "How many members of club \"Bootup Baltimore\" are younger than 18?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t3.Advisor = 1121\nRETURN DISTINCT t1.ClubName",
        "question": "List the clubs that have at least a member with advisor \"1121\".",
        "answers": [
            [
                "Bootup Baltimore"
            ]
        ]
    },
    {
        "db_id": "club_1",
        "query": "MATCH (t1:`club_1.Club`)-[t2:`club_1.Member_of_club`]-(t3:`club_1.Student`)\nWHERE t3.Advisor = 1121\nRETURN DISTINCT t1.ClubName",
        "question": "Which clubs have one or more members whose advisor is \"1121\"?",
        "answers": [
            [
                "Bootup Baltimore"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Organisations`)-[]-(T2:`tracking_grants_for_research.Research_Staff`)\nWITH T1, count(T1.organisation_id) AS cnt\nRETURN T1.organisation_type,T1.organisation_id\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the organisation type and id of the organisation which has the most number of research staff?",
        "answers": [
            [
                "SPON",
                5
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Organisations`)-[]-(T2:`tracking_grants_for_research.Research_Staff`)\nWITH T1, count(T1.organisation_id) AS cnt\nRETURN T1.organisation_type,T1.organisation_id\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the type and id of the organization that has the most research staff?",
        "answers": [
            [
                "SPON",
                5
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Documents`)-[]-(T2:`tracking_grants_for_research.Grants`)-[]-(T3:`tracking_grants_for_research.Organisations`)-[]-(T4:`tracking_grants_for_research.Organisation_Types`)\nWHERE T2.grant_amount > 5000 AND T4.organisation_type_description = 'Research'\nRETURN T1.sent_date",
        "question": "Find out the send dates of the documents with the grant amount of more than 5000 were granted by organisation type described",
        "answers": [
            [
                "1993-02-19 16:31:12"
            ],
            [
                "2001-06-18 06:35:49"
            ],
            [
                "2000-06-06 01:03:46"
            ],
            [
                "1979-07-04 08:54:23"
            ],
            [
                "1986-11-30 07:56:35"
            ],
            [
                "2002-07-26 15:50:28"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Documents`)-[]-(T2:`tracking_grants_for_research.Grants`)-[]-(T3:`tracking_grants_for_research.Organisations`)-[]-(T4:`tracking_grants_for_research.Organisation_Types`)\nWHERE T2.grant_amount > 5000 AND T4.organisation_type_description = 'Research'\nRETURN T1.sent_date",
        "question": "What are the send dates for all documents that have a grant amount of more than 5000 and are involved in research?",
        "answers": [
            [
                "1993-02-19 16:31:12"
            ],
            [
                "2001-06-18 06:35:49"
            ],
            [
                "2000-06-06 01:03:46"
            ],
            [
                "1979-07-04 08:54:23"
            ],
            [
                "1986-11-30 07:56:35"
            ],
            [
                "2002-07-26 15:50:28"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (project_staff:`tracking_grants_for_research.Project_Staff`)\nRETURN count(DISTINCT project_staff.role_code)",
        "question": "How many kinds of roles are there for the staff?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (project_staff:`tracking_grants_for_research.Project_Staff`)\nRETURN count(DISTINCT project_staff.role_code)",
        "question": "How many different roles are there on the project staff?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Projects`)-[T2:`tracking_grants_for_research.Project_Outcomes`]-(T3:`tracking_grants_for_research.Research_Outcomes`)\nWHERE T3.outcome_description =~'.*[P|p]ublished.*'\nRETURN T1.project_details",
        "question": "List the project details of the projects with the research outcome described with the substring 'Published'.",
        "answers": [
            [
                "non"
            ],
            [
                "impedit"
            ],
            [
                "deleniti"
            ],
            [
                "deserunt"
            ],
            [
                "sed"
            ],
            [
                "doloremque"
            ],
            [
                "beatae"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Projects`)-[T2:`tracking_grants_for_research.Project_Outcomes`]-(T3:`tracking_grants_for_research.Research_Outcomes`)\nWHERE T3.outcome_description =~'.*[P|p]ublished.*'\nRETURN T1.project_details",
        "question": "What are the details for the project whose research has been published?",
        "answers": [
            [
                "non"
            ],
            [
                "impedit"
            ],
            [
                "deleniti"
            ],
            [
                "deserunt"
            ],
            [
                "sed"
            ],
            [
                "doloremque"
            ],
            [
                "beatae"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (staff_roles:`tracking_grants_for_research.Staff_Roles`)\nWHERE staff_roles.role_code = 'researcher'\nRETURN staff_roles.role_description",
        "question": "What is the complete description of the researcher role.",
        "answers": [
            [
                "Project Researcher"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (staff_roles:`tracking_grants_for_research.Staff_Roles`)\nWHERE staff_roles.role_code = 'researcher'\nRETURN staff_roles.role_description",
        "question": "What is the complete description of the job of a researcher?",
        "answers": [
            [
                "Project Researcher"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (project_staff:`tracking_grants_for_research.Project_Staff`)\nRETURN project_staff.date_from\nORDER BY project_staff.date_from ASC\nLIMIT 1",
        "question": "When did the first staff for the projects started working?",
        "answers": [
            [
                "1970-01-02 15:35:05"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (project_staff:`tracking_grants_for_research.Project_Staff`)\nRETURN project_staff.date_from\nORDER BY project_staff.date_from ASC\nLIMIT 1",
        "question": "When did the first staff member start working?",
        "answers": [
            [
                "1970-01-02 15:35:05"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Organisations`)-[]-(T2:`tracking_grants_for_research.Research_Staff`)\nWITH T1, count(T1.organisation_id) AS cnt\nRETURN T1.organisation_id,T1.organisation_type,T1.organisation_details\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Which organisation hired the most number of research staff? List the organisation id, type and detail.",
        "answers": [
            [
                5,
                "SPON",
                "tenetur"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Organisations`)-[]-(T2:`tracking_grants_for_research.Research_Staff`)\nWITH T1, count(T1.organisation_id) AS cnt\nRETURN T1.organisation_id,T1.organisation_type,T1.organisation_details\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What are the ids, types, and details of the organization with the most research staff?",
        "answers": [
            [
                5,
                "SPON",
                "tenetur"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (document_types:`tracking_grants_for_research.Document_Types`)\nWHERE document_types.document_description =~'.*[I|i]nitial.*'\nRETURN document_types.document_type_code",
        "question": "Which document type is described with the prefix 'Initial'?",
        "answers": [
            [
                "APP"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (document_types:`tracking_grants_for_research.Document_Types`)\nWHERE document_types.document_description =~'.*[I|i]nitial.*'\nRETURN document_types.document_type_code",
        "question": "What is the type of the document whose description starts with the word 'Initial'?",
        "answers": [
            [
                "APP"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Organisation_Types`)-[]-(T2:`tracking_grants_for_research.Organisations`)\nWHERE T2.organisation_details = 'quo'\nRETURN T1.organisation_type_description",
        "question": "Find the organisation type description of the organisation detailed as 'quo'.",
        "answers": [
            [
                "Research"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Organisation_Types`)-[]-(T2:`tracking_grants_for_research.Organisations`)\nWHERE T2.organisation_details = 'quo'\nRETURN T1.organisation_type_description",
        "question": "What is the type description of the organization whose detail is listed as 'quo'?",
        "answers": [
            [
                "Research"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (project_staff:`tracking_grants_for_research.Project_Staff`)\nRETURN project_staff.date_to\nORDER BY project_staff.date_to DESC\nLIMIT 1",
        "question": "What is the last date of the staff leaving the projects?",
        "answers": [
            [
                "2016-03-15 00:33:18"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (project_staff:`tracking_grants_for_research.Project_Staff`)\nRETURN project_staff.date_to\nORDER BY project_staff.date_to DESC\nLIMIT 1",
        "question": "What is the last date that a staff member left a project?",
        "answers": [
            [
                "2016-03-15 00:33:18"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Research_Outcomes`)-[T2:`tracking_grants_for_research.Project_Outcomes`]-(T3:`tracking_grants_for_research.Projects`)\nWHERE T3.project_details = 'sint'\nRETURN T1.outcome_description",
        "question": "What are the result description of the project whose detail is 'sint'?",
        "answers": [
            [
                "Research Patent"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Research_Outcomes`)-[T2:`tracking_grants_for_research.Project_Outcomes`]-(T3:`tracking_grants_for_research.Projects`)\nWHERE T3.project_details = 'sint'\nRETURN T1.outcome_description",
        "question": "What is the description for the results whose project detail is 'sint'?",
        "answers": [
            [
                "Research Patent"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (research_staff:`tracking_grants_for_research.Research_Staff`)\nRETURN research_staff.staff_details\nORDER BY research_staff.staff_details ASC",
        "question": "List the research staff details, and order in ascending order.",
        "answers": [
            [
                "ab"
            ],
            [
                "accusamus"
            ],
            [
                "animi"
            ],
            [
                "aspernatur"
            ],
            [
                "consequatur"
            ],
            [
                "consequatur"
            ],
            [
                "dicta"
            ],
            [
                "dolor"
            ],
            [
                "doloribus"
            ],
            [
                "est"
            ],
            [
                "iure"
            ],
            [
                "nulla"
            ],
            [
                "quo"
            ],
            [
                "sint"
            ],
            [
                "voluptatibus"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (research_staff:`tracking_grants_for_research.Research_Staff`)\nRETURN research_staff.staff_details\nORDER BY research_staff.staff_details ASC",
        "question": "What details are there on the research staff? List the result in ascending alphabetical order.",
        "answers": [
            [
                "ab"
            ],
            [
                "accusamus"
            ],
            [
                "animi"
            ],
            [
                "aspernatur"
            ],
            [
                "consequatur"
            ],
            [
                "consequatur"
            ],
            [
                "dicta"
            ],
            [
                "dolor"
            ],
            [
                "doloribus"
            ],
            [
                "est"
            ],
            [
                "iure"
            ],
            [
                "nulla"
            ],
            [
                "quo"
            ],
            [
                "sint"
            ],
            [
                "voluptatibus"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (tasks:`tracking_grants_for_research.Tasks`)\nRETURN count(*)",
        "question": "How many tasks are there in total?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (tasks:`tracking_grants_for_research.Tasks`)\nRETURN count(*)",
        "question": "How many tasks are there?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Projects`)-[]-(T2:`tracking_grants_for_research.Tasks`)\nRETURN count(*),T1.project_details",
        "question": "How many tasks does each project have? List the task count and the project detail.",
        "answers": [
            [
                1,
                "porro"
            ],
            [
                1,
                "et"
            ],
            [
                1,
                "sint"
            ],
            [
                1,
                "doloremque"
            ],
            [
                1,
                "vel"
            ],
            [
                1,
                "deserunt"
            ],
            [
                1,
                "deleniti"
            ],
            [
                1,
                "ad"
            ],
            [
                1,
                "sed"
            ],
            [
                1,
                "consectetur"
            ],
            [
                1,
                "impedit"
            ],
            [
                1,
                "omnis"
            ],
            [
                1,
                "non"
            ],
            [
                1,
                "beatae"
            ],
            [
                1,
                "dolorem"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Projects`)-[]-(T2:`tracking_grants_for_research.Tasks`)\nRETURN count(*),T1.project_details",
        "question": "For each project id, how many tasks are there?",
        "answers": [
            [
                1,
                "porro"
            ],
            [
                1,
                "et"
            ],
            [
                1,
                "sint"
            ],
            [
                1,
                "doloremque"
            ],
            [
                1,
                "vel"
            ],
            [
                1,
                "deserunt"
            ],
            [
                1,
                "deleniti"
            ],
            [
                1,
                "ad"
            ],
            [
                1,
                "sed"
            ],
            [
                1,
                "consectetur"
            ],
            [
                1,
                "impedit"
            ],
            [
                1,
                "omnis"
            ],
            [
                1,
                "non"
            ],
            [
                1,
                "beatae"
            ],
            [
                1,
                "dolorem"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Research_Outcomes`)-[T2:`tracking_grants_for_research.Project_Outcomes`]-()\nRETURN T1.outcome_description",
        "question": "What are the descriptions of all the project outcomes?",
        "answers": [
            [
                "Published Research Paper"
            ],
            [
                "Published Research Paper"
            ],
            [
                "Published Research Paper"
            ],
            [
                "Published Research Paper"
            ],
            [
                "Published Research Paper"
            ],
            [
                "Published Research Paper"
            ],
            [
                "Published Research Paper"
            ],
            [
                "Research Patent"
            ],
            [
                "Research Patent"
            ],
            [
                "Research Patent"
            ],
            [
                "Research Patent"
            ],
            [
                "Research Patent"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (T1:`tracking_grants_for_research.Research_Outcomes`)-[T2:`tracking_grants_for_research.Project_Outcomes`]-()\nRETURN T1.outcome_description",
        "question": "List the description of the outcomes for all projects.",
        "answers": [
            [
                "Published Research Paper"
            ],
            [
                "Published Research Paper"
            ],
            [
                "Published Research Paper"
            ],
            [
                "Published Research Paper"
            ],
            [
                "Published Research Paper"
            ],
            [
                "Published Research Paper"
            ],
            [
                "Published Research Paper"
            ],
            [
                "Research Patent"
            ],
            [
                "Research Patent"
            ],
            [
                "Research Patent"
            ],
            [
                "Research Patent"
            ],
            [
                "Research Patent"
            ]
        ]
    },
    {
        "db_id": "tracking_grants_for_research",
        "query": "MATCH (project_staff:`tracking_grants_for_research.Project_Staff`)\nRETURN project_staff.role_code\nORDER BY project_staff.role_code DESC\nLIMIT 1",
        "question": "Which role is most common for the staff?",
        "answers": [
            [
                "researcher"
            ]
        ]
    }
]