[
    {
        "question": "Show the names of mountains with height more than 5000 or prominence more than 1000.",
        "query": "MATCH (mountain:`climbing.mountain`)\nWHERE mountain.Height > 5000 OR mountain.Prominence > 1000\nRETURN mountain.Name",
        "db_id": "climbing",
        "answers": [
            [
                "Kibo (Uhuru Pk)"
            ],
            [
                "Mount Kenya (Batian)"
            ],
            [
                "Mawenzi (Hans Meyer Pk)"
            ],
            [
                "Ngaliema / Mt Stanley (Margherita Pk)"
            ]
        ]
    },
    {
        "question": "List the total scores of body builders in ascending order.",
        "query": "MATCH (body_builder:`body_builder.body_builder`)\nRETURN body_builder.Total\nORDER BY body_builder.Total ASC",
        "db_id": "body_builder",
        "answers": [
            [
                292.5
            ],
            [
                312.5
            ],
            [
                315.0
            ],
            [
                315.0
            ],
            [
                317.5
            ]
        ]
    },
    {
        "question": "List the snatch score and clean jerk score of body builders in ascending order of snatch score.",
        "query": "MATCH (body_builder:`body_builder.body_builder`)\nRETURN body_builder.Snatch,body_builder.Clean_Jerk\nORDER BY body_builder.Snatch ASC",
        "db_id": "body_builder",
        "answers": [
            [
                130.0,
                162.5
            ],
            [
                137.5,
                177.5
            ],
            [
                137.5,
                175.0
            ],
            [
                140.0,
                175.0
            ],
            [
                142.5,
                175.0
            ]
        ]
    },
    {
        "question": "What is the average total score of body builders with height bigger than 200?",
        "query": "MATCH (T1:`body_builder.body_builder`)-[]-(T2:`body_builder.people`)\nWHERE T2.Height > 200\nRETURN avg(T1.Total)",
        "db_id": "body_builder",
        "answers": [
            [
                292.5
            ]
        ]
    },
    {
        "question": "List each birth place along with the number of people from there.",
        "query": "MATCH (people:`body_builder.people`)\nWITH people.Birth_Place AS Birth_Place, count(people.Birth_Place) AS count\nRETURN Birth_Place,count",
        "db_id": "body_builder",
        "answers": [
            [
                "Port Huron, Michigan",
                1
            ],
            [
                "Anchorage, Alaska",
                1
            ],
            [
                "Glenview, Illinois",
                1
            ],
            [
                "Nashua, New Hampshire",
                1
            ],
            [
                "Farmington Hills, Michigan",
                1
            ],
            [
                "Minnetonka, Minnesota",
                1
            ]
        ]
    },
    {
        "question": "List the height and weight of people in descending order of height.",
        "query": "MATCH (people:`body_builder.people`)\nRETURN people.Height,people.Weight\nORDER BY people.Height DESC",
        "db_id": "body_builder",
        "answers": [
            [
                215.0,
                102.0
            ],
            [
                205.0,
                92.0
            ],
            [
                196.0,
                89.0
            ],
            [
                195.0,
                100.0
            ],
            [
                192.0,
                90.0
            ],
            [
                182.0,
                80.0
            ]
        ]
    },
    {
        "question": "List the weight of the body builders who have snatch score higher than 140 or have the height greater than 200.",
        "query": "MATCH (T1:`body_builder.body_builder`)-[]-(T2:`body_builder.people`)\nWHERE T1.Snatch > 140 OR T2.Height > 200\nRETURN T2.Weight",
        "db_id": "body_builder",
        "answers": [
            [
                80.0
            ],
            [
                92.0
            ]
        ]
    },
    {
        "question": "List the votes of elections in descending order.",
        "query": "MATCH (election:`election_representative.election`)\nRETURN election.Votes\nORDER BY election.Votes DESC",
        "db_id": "election_representative",
        "answers": [
            [
                14077.0
            ],
            [
                13049.0
            ],
            [
                12422.0
            ],
            [
                11059.0
            ],
            [
                9423.0
            ]
        ]
    },
    {
        "question": "What are the names of representatives whose party is not \"Republican\"?",
        "query": "MATCH (representative:`election_representative.representative`)\nWHERE representative.Party <> 'Republican'\nRETURN representative.Name",
        "db_id": "election_representative",
        "answers": [
            [
                "John Quayle"
            ],
            [
                "James M. Quigley"
            ],
            [
                "James L. Quinn"
            ]
        ]
    },
    {
        "question": "What are the names of representatives and the dates of elections they participated in.",
        "query": "MATCH (T1:`election_representative.election`)-[]-(T2:`election_representative.representative`)\nRETURN T2.Name,T1.Date",
        "db_id": "election_representative",
        "answers": [
            [
                "Dan Quayle",
                "July 1942"
            ],
            [
                "John Quayle",
                "October 1942"
            ],
            [
                "James M. Quigley",
                "1946"
            ],
            [
                "Jimmy Quillen",
                "1949"
            ],
            [
                "James L. Quinn",
                "1953"
            ]
        ]
    },
    {
        "question": "What is the party of the representative that has the smallest number of votes.",
        "query": "MATCH (T1:`election_representative.election`)-[]-(T2:`election_representative.representative`)\nRETURN T2.Party\nORDER BY T1.Votes ASC\nLIMIT 1",
        "db_id": "election_representative",
        "answers": [
            [
                "Republican"
            ]
        ]
    },
    {
        "question": "What is the average number of votes of representatives from party \"Republican\"?",
        "query": "MATCH (T1:`election_representative.election`)-[]-(T2:`election_representative.representative`)\nWHERE T2.Party = 'Republican'\nRETURN avg(T1.Votes)",
        "db_id": "election_representative",
        "answers": [
            [
                11750.0
            ]
        ]
    },
    {
        "question": "What are the different parties of representative? Show the party name and the number of representatives in each party.",
        "query": "MATCH (representative:`election_representative.representative`)\nWITH count(representative.Party) AS count, representative.Party AS Party\nRETURN Party,count",
        "db_id": "election_representative",
        "answers": [
            [
                "Republican",
                4
            ],
            [
                "Democratic",
                3
            ]
        ]
    },
    {
        "question": "List the names of representatives that have not participated in elections listed here.",
        "query": "MATCH (representative:`election_representative.representative`)\nWHERE NOT (representative:`election_representative.representative`)-[]-(:`election_representative.election`)\nRETURN representative.Name",
        "db_id": "election_representative",
        "answers": [
            [
                "Al Quie"
            ],
            [
                "Jack Quinn"
            ]
        ]
    },
    {
        "question": "Count the total number of apartment bookings.",
        "query": "MATCH (apartment_bookings:`apartment_rentals.Apartment_Bookings`)\nRETURN count(*)",
        "db_id": "apartment_rentals",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Show the start dates and end dates of all the apartment bookings.",
        "query": "MATCH (apartment_bookings:`apartment_rentals.Apartment_Bookings`)\nRETURN apartment_bookings.booking_start_date,apartment_bookings.booking_end_date",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "2016-09-26 17:13:49",
                "2017-10-07 11:38:48"
            ],
            [
                "2016-04-01 06:28:08",
                "2017-10-25 11:08:42"
            ],
            [
                "2017-03-13 16:20:14",
                "2018-02-19 16:59:08"
            ],
            [
                "2016-08-04 10:33:00",
                "2017-09-29 12:43:50"
            ],
            [
                "2017-02-11 14:34:14",
                "2017-10-07 20:47:19"
            ],
            [
                "2016-05-24 20:09:38",
                "2017-10-03 01:56:21"
            ],
            [
                "2016-07-25 02:57:04",
                "2017-09-28 11:08:15"
            ],
            [
                "2016-11-26 05:04:31",
                "2018-02-25 15:15:37"
            ],
            [
                "2017-05-13 18:17:20",
                "2017-10-06 11:15:58"
            ],
            [
                "2017-03-04 02:23:49",
                "2018-02-06 16:57:05"
            ],
            [
                "2016-06-07 05:05:18",
                "2017-11-13 13:59:45"
            ],
            [
                "2016-04-17 12:53:59",
                "2018-03-20 17:32:58"
            ],
            [
                "2016-09-28 05:00:50",
                "2017-09-30 18:41:04"
            ],
            [
                "2017-04-07 04:53:27",
                "2017-11-29 12:59:42"
            ],
            [
                "2017-07-03 14:15:56",
                "2017-11-12 01:05:09"
            ]
        ]
    },
    {
        "question": "Show all distinct building descriptions.",
        "query": "MATCH (apartment_buildings:`apartment_rentals.Apartment_Buildings`)\nRETURN DISTINCT apartment_buildings.building_description",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Studio"
            ],
            [
                "Flat"
            ],
            [
                "Duplex"
            ]
        ]
    },
    {
        "question": "Show the short names of the buildings managed by \"Emma\".",
        "query": "MATCH (apartment_buildings:`apartment_rentals.Apartment_Buildings`)\nWHERE apartment_buildings.building_manager = 'Emma'\nRETURN apartment_buildings.building_short_name",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Normandie Court"
            ]
        ]
    },
    {
        "question": "Show the addresses and phones of all the buildings managed by \"Brenden\".",
        "query": "MATCH (apartment_buildings:`apartment_rentals.Apartment_Buildings`)\nWHERE apartment_buildings.building_manager = 'Brenden'\nRETURN apartment_buildings.building_address,apartment_buildings.building_phone",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "354 Otto Villages\nCharliefort, VT 71664",
                "915-617-2408x832"
            ]
        ]
    },
    {
        "question": "Give me the minimum and maximum bathroom count among all the apartments.",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN min(apartments.bathroom_count),max(apartments.bathroom_count)",
        "db_id": "apartment_rentals",
        "answers": [
            [
                1,
                3
            ]
        ]
    },
    {
        "question": "Return the apartment number and the number of rooms for each apartment.",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN apartments.apt_number,apartments.room_count",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Suite 645",
                "7"
            ],
            [
                "Apt. 585",
                "5"
            ],
            [
                "Apt. 908",
                "7"
            ],
            [
                "Suite 749",
                "8"
            ],
            [
                "Suite 307",
                "9"
            ],
            [
                "Apt. 187",
                "9"
            ],
            [
                "Suite 088",
                "6"
            ],
            [
                "Suite 693",
                "9"
            ],
            [
                "Apt. 940",
                "8"
            ],
            [
                "Apt. 859",
                "6"
            ],
            [
                "Apt. 794",
                "3"
            ],
            [
                "Apt. 477",
                "3"
            ],
            [
                "Apt. 411",
                "9"
            ],
            [
                "Apt. 837",
                "8"
            ],
            [
                "Suite 634",
                "8"
            ]
        ]
    },
    {
        "question": "Return the apartment numbers of the apartments with type code \"Flat\".",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nWHERE apartments.apt_type_code = 'Flat'\nRETURN apartments.apt_number",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Suite 645"
            ],
            [
                "Apt. 585"
            ],
            [
                "Suite 307"
            ],
            [
                "Suite 693"
            ],
            [
                "Apt. 794"
            ],
            [
                "Apt. 837"
            ]
        ]
    },
    {
        "question": "Return the first names and last names of all guests",
        "query": "MATCH (guests:`apartment_rentals.Guests`)\nRETURN guests.guest_first_name,guests.guest_last_name",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Kip",
                "DuBuque"
            ],
            [
                "Rebeca",
                "Runolfsdottir"
            ],
            [
                "Keon",
                "Treutel"
            ],
            [
                "Gabe",
                "Bode"
            ],
            [
                "Lou",
                "Grady"
            ],
            [
                "Josefina",
                "Jerde"
            ],
            [
                "Mozell",
                "Toy"
            ],
            [
                "Keith",
                "Hoeger"
            ],
            [
                "Crystal",
                "Runolfsson"
            ],
            [
                "Nikki",
                "Lehner"
            ],
            [
                "Gregoria",
                "Schowalter"
            ],
            [
                "Louvenia",
                "Crona"
            ],
            [
                "Else",
                "Roberts"
            ],
            [
                "Juvenal",
                "Kautzer"
            ],
            [
                "Tamia",
                "Mante"
            ]
        ]
    },
    {
        "question": "Return the date of birth for all the guests with gender code \"Male\".",
        "query": "MATCH (guests:`apartment_rentals.Guests`)\nWHERE guests.gender_code = 'Male'\nRETURN guests.date_of_birth",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "1995-11-04 07:09:57"
            ],
            [
                "2015-02-03 23:34:13"
            ],
            [
                "1983-08-26 15:45:08"
            ]
        ]
    },
    {
        "question": "Show the facility codes of apartments with more than 4 bedrooms.",
        "query": "MATCH (T1:`apartment_rentals.Apartment_Facilities`)-[]-(T2:`apartment_rentals.Apartments`)\nWHERE T2.bedroom_count > 4\nRETURN T1.facility_code",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Gym"
            ],
            [
                "Cable TV"
            ],
            [
                "Gym"
            ]
        ]
    },
    {
        "question": "Show the addresses of the buildings that have apartments with more than 2 bathrooms.",
        "query": "MATCH (T1:`apartment_rentals.Apartment_Buildings`)-[]-(T2:`apartment_rentals.Apartments`)\nWHERE T2.bathroom_count > 2\nRETURN T1.building_address",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "71537 Gorczany Inlet\nWisozkburgh, AL 08256"
            ],
            [
                "489 Josh Orchard Apt. 998\nSipesview, DE 69053"
            ]
        ]
    },
    {
        "question": "Show the apartment type codes and apartment numbers in the buildings managed by \"Kyle\".",
        "query": "MATCH (T1:`apartment_rentals.Apartment_Buildings`)-[]-(T2:`apartment_rentals.Apartments`)\nWHERE T1.building_manager = 'Kyle'\nRETURN T2.apt_type_code,T2.apt_number",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Duplex",
                "Apt. 859"
            ],
            [
                "Flat",
                "Apt. 837"
            ],
            [
                "Duplex",
                "Suite 749"
            ],
            [
                "Studio",
                "Apt. 908"
            ]
        ]
    },
    {
        "question": "Show the booking status code and the corresponding number of bookings.",
        "query": "MATCH (apartment_bookings:`apartment_rentals.Apartment_Bookings`)\nWITH apartment_bookings.booking_status_code AS booking_status_code, count(apartment_bookings.booking_status_code) AS count\nRETURN booking_status_code,count",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Provisional",
                8
            ],
            [
                "Confirmed",
                7
            ]
        ]
    },
    {
        "question": "Return all the apartment numbers sorted by the room count in ascending order.",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN apartments.apt_number\nORDER BY apartments.room_count ASC",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Apt. 794"
            ],
            [
                "Apt. 477"
            ],
            [
                "Apt. 585"
            ],
            [
                "Suite 088"
            ],
            [
                "Apt. 859"
            ],
            [
                "Suite 645"
            ],
            [
                "Apt. 908"
            ],
            [
                "Suite 749"
            ],
            [
                "Apt. 940"
            ],
            [
                "Apt. 837"
            ],
            [
                "Suite 634"
            ],
            [
                "Suite 307"
            ],
            [
                "Apt. 187"
            ],
            [
                "Suite 693"
            ],
            [
                "Apt. 411"
            ]
        ]
    },
    {
        "question": "Return the apartment number with the largest number of bedrooms.",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nRETURN apartments.apt_number\nORDER BY apartments.bedroom_count DESC\nLIMIT 1",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Apt. 908"
            ]
        ]
    },
    {
        "question": "Show the apartment type codes and the corresponding number of apartments sorted by the number of apartments in ascending order.",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nWITH apartments.apt_type_code AS apt_type_code, count(apartments.apt_type_code) AS count\nRETURN apt_type_code,count\nORDER BY count ASC",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Studio",
                4
            ],
            [
                "Duplex",
                5
            ],
            [
                "Flat",
                6
            ]
        ]
    },
    {
        "question": "Show the most common apartment type code.",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nWITH apartments.apt_type_code AS apt_type_code, count(apartments.apt_type_code) AS count\nRETURN apt_type_code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Flat"
            ]
        ]
    },
    {
        "question": "Which apartment type code appears the most often?",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nWITH apartments.apt_type_code AS apt_type_code, count(apartments.apt_type_code) AS count\nRETURN apt_type_code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Flat"
            ]
        ]
    },
    {
        "question": "Show the most common apartment type code among apartments with more than 1 bathroom.",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nWHERE apartments.bathroom_count > 1\nWITH apartments.apt_type_code AS apt_type_code, count(apartments.apt_type_code) AS count\nRETURN apt_type_code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Flat"
            ]
        ]
    },
    {
        "question": "Which apartment type code is the most common among apartments with more than one bathroom?",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nWHERE apartments.bathroom_count > 1\nWITH apartments.apt_type_code AS apt_type_code, count(apartments.apt_type_code) AS count\nRETURN apt_type_code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Flat"
            ]
        ]
    },
    {
        "question": "Show each gender code and the corresponding count of guests sorted by the count in descending order.",
        "query": "MATCH (guests:`apartment_rentals.Guests`)\nWITH count(guests.gender_code) AS count, guests.gender_code AS gender_code\nRETURN gender_code,count\nORDER BY count DESC",
        "db_id": "apartment_rentals",
        "answers": [
            [
                "Female",
                9
            ],
            [
                "Male",
                3
            ],
            [
                "Unknown",
                3
            ]
        ]
    },
    {
        "question": "How many apartments do not have any facility?",
        "query": "MATCH (apartments:`apartment_rentals.Apartments`)\nWHERE NOT (apartments:`apartment_rentals.Apartments`)-[]-(:`apartment_rentals.Apartment_Facilities`)\nRETURN count(*)",
        "db_id": "apartment_rentals",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "question": "List the season, home team, away team of all the games.",
        "query": "MATCH (game:`game_injury.game`)\nRETURN game.Season,game.Home_team,game.Away_team",
        "db_id": "game_injury",
        "answers": [
            [
                2007,
                "Quruvchi",
                "Pakhtakor"
            ],
            [
                2007,
                "Pakhtakor",
                "Quruvchi"
            ],
            [
                2007,
                "Pakhtakor",
                "Quruvchi"
            ],
            [
                2008,
                "Pakhtakor",
                "Quruvchi"
            ],
            [
                2008,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2008,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2009,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2009,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2009,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2010,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2010,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2011,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2011,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2012,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2012,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2012,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2012,
                "Bunyodkor",
                "Pakhtakor"
            ],
            [
                2012,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2013,
                "Pakhtakor",
                "Bunyodkor"
            ],
            [
                2013,
                "Bunyodkor",
                "Pakhtakor"
            ]
        ]
    },
    {
        "question": "For each injury accident, find the date of the game and the name of the injured player in the game, and sort the results in descending order of game season.",
        "query": "MATCH (T1:`game_injury.game`)-[]-(T2:`game_injury.injury_accident`)\nRETURN T1.Date,T2.Player\nORDER BY T1.Season DESC",
        "db_id": "game_injury",
        "answers": [
            [
                "7 July 2011",
                "Thiago Motta (2)"
            ],
            [
                "14 March 2010",
                "Dejan Stankovi\u0107 (2)"
            ],
            [
                "14 March 2010",
                "Wesley Sneijder (2)"
            ],
            [
                "31 October 2010",
                "Esteban Cambiasso (2)"
            ],
            [
                "14 October 2009",
                "Iv\u00e1n C\u00f3rdoba"
            ],
            [
                "8 August 2009",
                "Esteban Cambiasso"
            ],
            [
                "10 July 2008",
                "Wesley Sneijder"
            ],
            [
                "16 August 2008",
                "Diego Milito"
            ],
            [
                "16 August 2008",
                "Javier Zanetti"
            ],
            [
                "31 October 2008",
                "Walter Samuel"
            ],
            [
                "31 October 2008",
                "Thiago Motta"
            ],
            [
                "31 October 2008",
                "Goran Pandev"
            ],
            [
                "18 May 2007",
                "Davide Santon"
            ],
            [
                "22 September 2007",
                "Maicon"
            ],
            [
                "9 December 2007",
                "Dejan Stankovi\u0107"
            ]
        ]
    },
    {
        "question": "List the hosts of performances in ascending order of attendance.",
        "query": "MATCH (performance:`performance_attendance.performance`)\nRETURN performance.Host\nORDER BY performance.Attendance ASC",
        "db_id": "performance_attendance",
        "answers": [
            [
                "Boston Bruins"
            ],
            [
                "New York Rangers"
            ],
            [
                "Pittsburgh Penguins"
            ],
            [
                "Atlanta Thrashers"
            ],
            [
                "Ottawa Senators"
            ],
            [
                "Montreal Canadiens"
            ]
        ]
    },
    {
        "question": "Show the attendances of the performances at location \"TD Garden\" or \"Bell Centre\"",
        "query": "MATCH (performance:`performance_attendance.performance`)\nWHERE performance.Location = 'TD Garden' OR performance.Location = 'Bell Centre'\nRETURN performance.Attendance",
        "db_id": "performance_attendance",
        "answers": [
            [
                165
            ],
            [
                2173
            ]
        ]
    },
    {
        "question": "Show different locations and the number of performances at each location.",
        "query": "MATCH (performance:`performance_attendance.performance`)\nWITH count(performance.Location) AS count, performance.Location AS Location\nRETURN Location,count",
        "db_id": "performance_attendance",
        "answers": [
            [
                "TD Garden",
                1
            ],
            [
                "Madison Square Garden",
                1
            ],
            [
                "Verizon Center",
                2
            ],
            [
                "Bell Centre",
                1
            ],
            [
                "Scotiabank Place",
                1
            ]
        ]
    },
    {
        "question": "Show the most common location of performances.",
        "query": "MATCH (performance:`performance_attendance.performance`)\nWITH count(performance.Location) AS count, performance.Location AS Location\nRETURN Location\nORDER BY count DESC\nLIMIT 1",
        "db_id": "performance_attendance",
        "answers": [
            [
                "Verizon Center"
            ]
        ]
    },
    {
        "question": "Show the locations that have at least two performances.",
        "query": "MATCH (performance:`performance_attendance.performance`)\nWITH count(*) AS count, performance.Location AS Location\nWHERE count  >= 2\nRETURN Location",
        "db_id": "performance_attendance",
        "answers": [
            [
                "Verizon Center"
            ]
        ]
    },
    {
        "question": "List the venues of debates in ascending order of the number of audience.",
        "query": "MATCH (debate:`debate.debate`)\nRETURN debate.Venue\nORDER BY debate.Num_of_Audience ASC",
        "db_id": "debate",
        "answers": [
            [
                "Manama , Bahrain"
            ],
            [
                "Doha , Qatar"
            ],
            [
                "Abu Dhabi , UAE"
            ],
            [
                "Manama , Bahrain"
            ],
            [
                "Dubai , UAE"
            ],
            [
                "Manama , Bahrain"
            ]
        ]
    },
    {
        "question": "Show the names of people aged either 35 or 36.",
        "query": "MATCH (people:`debate.people`)\nWHERE people.Age = 35 OR people.Age = 36\nRETURN people.Name",
        "db_id": "debate",
        "answers": [
            [
                "Luther C. Carter"
            ],
            [
                "William B. Maclay"
            ],
            [
                "Charles Van Wyck"
            ]
        ]
    }
]