[
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "What papers have Peter Mertens and Dina Barbian written ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "what paper did Peter Mertens and Dina Barbian write together ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "Has Peter Mertens and Dina Barbian written a paper together ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "Papers by Peter Mertens and Dina Barbian",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "papers by authors Peter Mertens and Dina Barbian",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "What papers were written by authors Peter Mertens and Dina Barbian",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "papers written by authors Peter Mertens and Dina Barbian",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "When did Peter Mertens and Dina Barbian collaborate ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "what are the collaborations of Peter Mertens and Dina Barbian ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "Have Peter Mertens and Dina Barbian written a paper together ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "Peter Mertens and Dina Barbian as co-authors",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "Does Peter Mertens ever collaborated with Dina Barbian ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "Which papers have Peter Mertens and Dina Barbian as co-authors ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "papers coauthored by Peter Mertens and Dina Barbian",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "What papers have been written by Peter Mertens and Dina Barbian ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Peter Mertens\" AND t1.authorName = \"Dina Barbian\"\nRETURN DISTINCT t3.paperId",
        "question": "What papers have been written by both Peter Mertens and Dina Barbian ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "What papers has sharon goldwater written ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "What papers has written by sharon goldwater ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "papers by sharon goldwater",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "what did sharon goldwater write ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "papers where sharon goldwater is an author",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "Papers authored by sharon goldwater",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "sharon goldwater papers",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "Papers written by sharon goldwater",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "which papers has sharon goldwater written ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "What has sharon goldwater published ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "Does sharon goldwater have any papers published ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "sharon goldwater 's papers",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "show me papers by sharon goldwater .",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "What papers are authored by sharon goldwater ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-()\nWHERE t1.authorName = \"sharon goldwater\"\nRETURN DISTINCT t2.paperId",
        "question": "papers by sharon goldwater ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"monte carlo simulation\" AND t3.year > 2011\nRETURN DISTINCT t3.paperId",
        "question": "are there any monte carlo simulation papers since 2011 ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"monte carlo simulation\" AND t3.year > 2011\nRETURN DISTINCT t3.paperId",
        "question": "monte carlo simulation papers later than 2011",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (paper:`scholar.paper`)\nWHERE paper.title = \"machine networks for one shot learning\"\nRETURN DISTINCT paper.paperId",
        "question": "List all academic papers on machine networks for one shot learning",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (paper:`scholar.paper`)\nWHERE paper.title = \"machine networks for one shot learning\"\nRETURN DISTINCT paper.paperId",
        "question": "machine networks for one shot learning",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Daniella Coelho\"\nRETURN DISTINCT t3.venueId",
        "question": "What conference does Daniella Coelho publish in ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Daniella Coelho\"\nRETURN DISTINCT t3.venueId",
        "question": "conferences that Daniella Coelho has published in",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Daniella Coelho\"\nRETURN DISTINCT t3.venueId",
        "question": "In which conferences does Daniella Coelho typically publish ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Daniella Coelho\"\nRETURN DISTINCT t3.venueId",
        "question": "in what conferences does Daniella Coelho publish ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Daniella Coelho\"\nRETURN DISTINCT t3.venueId",
        "question": "What conferences does Daniella Coelho publish in ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Daniella Coelho\"\nRETURN DISTINCT t3.venueId",
        "question": "At which conferences does Daniella Coelho publish ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Daniella Coelho\"\nRETURN DISTINCT t3.venueId",
        "question": "What conferences does Daniella Coelho submit to ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"li dong\" AND t3.year = 2016\nRETURN DISTINCT t3.venueId",
        "question": "What conferences did li dong submit to in 2016 ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"li dong\" AND t3.year = 2016\nRETURN DISTINCT t3.venueId",
        "question": "Where did li dong publish in 2016",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"li dong\" AND t3.year = 2016\nRETURN DISTINCT t3.venueId",
        "question": "What conferences did li dong publish in in 2016 ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"li dong\" AND t3.year = 2016\nRETURN DISTINCT t3.venueId",
        "question": "Where did li dong publish in 2016 ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"dependent types\"\nRETURN DISTINCT t3.paperId",
        "question": "List the popular publications on dependent types",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"dependent types\"\nRETURN DISTINCT t3.paperId",
        "question": "Which paper should I read about dependent types ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"dependent types\"\nRETURN DISTINCT t3.paperId",
        "question": "top dependent types papers",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "List papers that has a keyword Question Answering",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "Question Answering research papers",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "papers on Question Answering",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "papers related to Question Answering",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "papers about Question Answering",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "papers published in the area of Question Answering",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "Question Answering experiments",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "Show me the papers on Question Answering",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "papers that used Question Answering",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "papers that mention Question Answering",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "Question Answering papers",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "Show me Question Answering papers .",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "Question Answering publications",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "Fetch me some papers on Question Answering",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "papers on Question Answering experiments",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "What papers talk about Question Answering ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "What is the paper about Question Answering ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "Which papers are about about Question Answering ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "list papers that used Question Answering",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "papers for Question Answering",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "List papers that has keyword Question Answering",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"Question Answering\"\nRETURN DISTINCT t3.paperId",
        "question": "papers with Question Answering in keyphrases",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t3:`scholar.paper`)-[t2:`scholar.paperKeyphrase`]-(t1:`scholar.author`)\nWHERE t1.authorName = \"Luke S Zettlemoyer\"\nRETURN DISTINCT t2.keyphraseId,t3.year\nORDER BY t3.year,t2.keyphraseId",
        "question": "keyphrases used by Luke S Zettlemoyer for each year",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"balakrishnan prabhakaran\"\nRETURN DISTINCT t3.paperId,t3.year",
        "question": "list papers published by balakrishnan prabhakaran",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"zachary tatlock\"\nRETURN DISTINCT t3.paperId,t3.year",
        "question": "citation count of zachary tatlock 's papers",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"subhasis chaudhuri\"\nRETURN DISTINCT t3.paperId",
        "question": "subhasis chaudhuri",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"subhasis chaudhuri\"\nRETURN DISTINCT t3.paperId",
        "question": "list papers by subhasis chaudhuri",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"subhasis chaudhuri\"\nRETURN DISTINCT t3.paperId",
        "question": "List of papers by subhasis chaudhuri",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"subhasis chaudhuri\"\nRETURN DISTINCT t3.paperId",
        "question": "conference papers of subhasis chaudhuri",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "What papers has Liwen Xiong written in 2015",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "papers by Liwen Xiong in 2015",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "What did Liwen Xiong published in 2015 ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "Papers written by Liwen Xiong in 2015",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "What are the papers of Liwen Xiong in 2015",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "papers by Liwen Xiong from 2015",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "Papers published in 2015 by Liwen Xiong",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "what has Liwen Xiong done in the past year",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "What papers did Liwen Xiong publish last year ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "Liwen Xiong 's papers in 2015 ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "Liwen Xiong publication 2015",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "Papers authored by Liwen Xiong in 2015",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "Papers from Liwen Xiong in 2015",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"Liwen Xiong\" AND t3.year = 2015\nRETURN DISTINCT t3.paperId",
        "question": "what papers are published by Liwen Xiong in 2015",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t3:`scholar.paper`)-[t2:`scholar.paperKeyphrase`]-(t1:`scholar.author`)\nWHERE t1.authorName = \"Christof Dallermassl\" AND t3.year = 2000\nRETURN DISTINCT t2.keyphraseId",
        "question": "keyphrases used by Christof Dallermassl in 2000",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t3:`scholar.paper`)-[t2:`scholar.paperKeyphrase`]-(t1:`scholar.author`)\nWHERE t1.authorName = \"Christof Dallermassl\" AND t3.year = 2000\nRETURN DISTINCT t2.keyphraseId",
        "question": "keyphrases Christof Dallermassl used in papers written last year",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t3:`scholar.paper`)-[t2:`scholar.paperKeyphrase`]-(t1:`scholar.author`)\nWHERE t1.authorName = \"Christof Dallermassl\" AND t3.year = 2000\nRETURN DISTINCT t2.keyphraseId",
        "question": "What are keyphrases by Christof Dallermassl in 2000 ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"mohammad rastegari\" AND t3.journalId >= 0\nRETURN DISTINCT t3.paperId",
        "question": "journal articles by mohammad rastegari",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.author`)-[t2:`scholar.writes`]-(t3:`scholar.paper`)\nWHERE t1.authorName = \"mohammad rastegari\" AND t3.journalId >= 0\nRETURN DISTINCT t3.paperId",
        "question": "Journal Papers by mohammad rastegari",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t1:`scholar.keyphrase`)-[t2:`scholar.paperKeyphrase`]-(t3:`scholar.paper`)\nWHERE t1.keyphraseName = \"question answering\" AND t3.year = 2016\nRETURN DISTINCT t3.paperId",
        "question": "What papers were written on question answering this year ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Noah A Smith\"\nRETURN DISTINCT t1.authorId",
        "question": "who writes papers with Noah A Smith ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Noah A Smith\"\nRETURN DISTINCT t1.authorId",
        "question": "Who is a coauthor with Noah A Smith ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Noah A Smith\"\nRETURN DISTINCT t1.authorId",
        "question": "Who are Noah A Smith 's co-authors",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Noah A Smith\"\nRETURN DISTINCT t1.authorId",
        "question": "Who has coauthored with Noah A Smith ?",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Noah A Smith\"\nRETURN DISTINCT t1.authorId",
        "question": "co-authors of Noah A Smith",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Noah A Smith\"\nRETURN DISTINCT t1.authorId",
        "question": "author who wrote papers with Noah A Smith",
        "answers": []
    },
    {
        "db_id": "scholar",
        "query": "MATCH (t2:`scholar.author`)-[t3:`scholar.writes`]-(t1:`scholar.author`)\nWHERE t2.authorName = \"Noah A Smith\"\nRETURN DISTINCT t1.authorId",
        "question": "authors who collaborated with Noah A Smith",
        "answers": []
    }
]