[
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes'\nRETURN T1.pName,T2.cName",
        "question": "Find the name and college of students whose decisions are yes in the tryout.",
        "answers": [
            [
                "Andrew",
                "ASU"
            ],
            [
                "Blake",
                "FSU"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes'\nRETURN T1.pName,T2.cName",
        "question": "What are the names of all the players who received a yes during tryouts, and also what are the names of their colleges?",
        "answers": [
            [
                "Andrew",
                "ASU"
            ],
            [
                "Blake",
                "FSU"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nRETURN T1.pName\nORDER BY T1.pName",
        "question": "Find the name of all students who were in the tryout sorted in alphabetic order.",
        "answers": [
            [
                "Andrew"
            ],
            [
                "Andrew"
            ],
            [
                "Blake"
            ],
            [
                "Charles"
            ],
            [
                "David"
            ],
            [
                "Eddie"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nRETURN T1.pName\nORDER BY T1.pName",
        "question": "What are the names of all students who tried out in alphabetical order?",
        "answers": [
            [
                "Andrew"
            ],
            [
                "Andrew"
            ],
            [
                "Blake"
            ],
            [
                "Charles"
            ],
            [
                "David"
            ],
            [
                "Eddie"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes'\nRETURN T1.pName,T1.HS",
        "question": "Find the name and hours of the students whose tryout decision is yes.",
        "answers": [
            [
                "Andrew",
                1200
            ],
            [
                "Blake",
                1600
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes'\nRETURN T1.pName,T1.HS",
        "question": "What are the names and hours spent practicing of every student who received a yes at tryouts?",
        "answers": [
            [
                "Andrew",
                1200
            ],
            [
                "Blake",
                1600
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.pPos = 'striker'\nRETURN T1.state",
        "question": "Find the states of the colleges that have students in the tryout who played in striker position.",
        "answers": [
            [
                "FL"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.pPos = 'striker'\nRETURN T1.state",
        "question": "What are the states of the colleges where students who tried out for the striker position attend?",
        "answers": [
            [
                "FL"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes' AND T2.pPos = 'striker'\nRETURN T1.pName",
        "question": "Find the names of the students who are in the position of striker and got a yes tryout decision.",
        "answers": [
            [
                "Blake"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes' AND T2.pPos = 'striker'\nRETURN T1.pName",
        "question": "What are the names of all students who successfully tried out for the position of striker?",
        "answers": [
            [
                "Blake"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-(T3:`soccer_2.Player`)\nWHERE T3.pName = 'Charles'\nRETURN T1.state",
        "question": "Find the state of the college which player Charles is attending.",
        "answers": [
            [
                "OK"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-(T3:`soccer_2.Player`)\nWHERE T3.pName = 'Charles'\nRETURN T1.state",
        "question": "In which state is the college that Charles attends?",
        "answers": [
            [
                "OK"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH ()-[tryout:`soccer_2.Tryout`]-()\nWHERE tryout.decision = 'yes' AND tryout.pPos = 'goalie'\nRETURN tryout.cName",
        "question": "What college has a student who successfully made the team in the role of a goalie?",
        "answers": [
            [
                "ASU"
            ],
            [
                "ASU"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes'\nRETURN DISTINCT T1.state,T1.enr",
        "question": "What is the state and enrollment of the colleges where have any students who got accepted in the tryout decision.",
        "answers": [
            [
                "AZ",
                12000
            ],
            [
                "FL",
                19000
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes'\nRETURN DISTINCT T1.state,T1.enr",
        "question": "How many students are enrolled in colleges that have student accepted during tryouts, and in which states are those colleges?",
        "answers": [
            [
                "AZ",
                12000
            ],
            [
                "FL",
                19000
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nWITH max(college.enr) AS enr\nMATCH (college:`soccer_2.College`)\nWHERE  college.enr <  enr \nRETURN DISTINCT college.state",
        "question": "Find the states where have the colleges whose enrollments are less than the largest size.",
        "answers": [
            [
                "LA"
            ],
            [
                "AZ"
            ],
            [
                "FL"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nWITH max(college.enr) AS enr\nMATCH (college:`soccer_2.College`)\nWHERE  college.enr <  enr \nRETURN DISTINCT college.state",
        "question": "What are the states with colleges that have enrollments less than the some other college?",
        "answers": [
            [
                "LA"
            ],
            [
                "AZ"
            ],
            [
                "FL"
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nWITH avg(college.enr) AS enr\nMATCH (college:`soccer_2.College`)\nWHERE  college.enr >  enr \nRETURN count(DISTINCT college.state)",
        "question": "What is the number of states that has some college whose enrollment is larger than the average enrollment?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nWITH avg(college.enr) AS enr\nMATCH (college:`soccer_2.College`)\nWHERE  college.enr >  enr \nRETURN count(DISTINCT college.state)",
        "question": "How many states have a college with more students than average?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nWITH avg(college.enr) AS enr\nMATCH (college:`soccer_2.College`)\nWHERE  college.enr <  enr \nRETURN count(DISTINCT college.state)",
        "question": "What is the number of states that has some colleges whose enrollment is smaller than the average enrollment?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "soccer_2",
        "query": "MATCH (college:`soccer_2.College`)\nWITH avg(college.enr) AS enr\nMATCH (college:`soccer_2.College`)\nWHERE  college.enr <  enr \nRETURN count(DISTINCT college.state)",
        "question": "How many states have smaller colleges than average?",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (device:`device.device`)\nRETURN count(*)",
        "question": "How many devices are there?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (device:`device.device`)\nRETURN count(*)",
        "question": "Count the number of devices.",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (device:`device.device`)\nRETURN device.Carrier\nORDER BY device.Carrier ASC",
        "question": "List the carriers of devices in ascending alphabetical order.",
        "answers": [
            [
                "Bell Mobility"
            ],
            [
                "Iusacell"
            ],
            [
                "MTS Mobility"
            ],
            [
                "Telus Mobility"
            ],
            [
                "Verizon Wireless"
            ],
            [
                "Vodafone AU"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (device:`device.device`)\nRETURN device.Carrier\nORDER BY device.Carrier ASC",
        "question": "What are the different carriers for devices, listed in alphabetical order?",
        "answers": [
            [
                "Bell Mobility"
            ],
            [
                "Iusacell"
            ],
            [
                "MTS Mobility"
            ],
            [
                "Telus Mobility"
            ],
            [
                "Verizon Wireless"
            ],
            [
                "Vodafone AU"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (device:`device.device`)\nWHERE device.Software_Platform <> 'Android'\nRETURN device.Carrier",
        "question": "What are the carriers of devices whose software platforms are not \"Android\"?",
        "answers": [
            [
                "Verizon Wireless"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (device:`device.device`)\nWHERE device.Software_Platform <> 'Android'\nRETURN device.Carrier",
        "question": "Return the device carriers that do not have Android as their software platform.",
        "answers": [
            [
                "Verizon Wireless"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (shop:`device.shop`)\nRETURN shop.Shop_Name\nORDER BY shop.Open_Year ASC",
        "question": "What are the names of shops in ascending order of open year?",
        "answers": [
            [
                "Best Buy"
            ],
            [
                "Tynewydd repair"
            ],
            [
                "Ferndale"
            ],
            [
                "Apple"
            ],
            [
                "Dinas store"
            ],
            [
                "Naval repair"
            ],
            [
                "Pentre store"
            ],
            [
                "Gelli repair"
            ],
            [
                "Dinas Device"
            ],
            [
                "Naval's shop"
            ],
            [
                "ATnT"
            ],
            [
                "National Cellphone"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (shop:`device.shop`)\nRETURN shop.Shop_Name\nORDER BY shop.Open_Year ASC",
        "question": "Return the names of shops, ordered by year of opening ascending.",
        "answers": [
            [
                "Best Buy"
            ],
            [
                "Tynewydd repair"
            ],
            [
                "Ferndale"
            ],
            [
                "Apple"
            ],
            [
                "Dinas store"
            ],
            [
                "Naval repair"
            ],
            [
                "Pentre store"
            ],
            [
                "Gelli repair"
            ],
            [
                "Dinas Device"
            ],
            [
                "Naval's shop"
            ],
            [
                "ATnT"
            ],
            [
                "National Cellphone"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH ()-[stock:`device.stock`]-()\nRETURN avg(stock.Quantity)",
        "question": "What is the average quantity of stocks?",
        "answers": [
            [
                110.875
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (shop:`device.shop`)\nRETURN shop.Shop_Name,shop.Location\nORDER BY shop.Shop_Name ASC",
        "question": "What are the names and location of the shops in ascending alphabetical order of name.",
        "answers": [
            [
                "ATnT",
                "Maerdy"
            ],
            [
                "Apple",
                "Blaenllechau"
            ],
            [
                "Best Buy",
                "Cymmer"
            ],
            [
                "Dinas Device",
                "Dinas"
            ],
            [
                "Dinas store",
                "Dinas"
            ],
            [
                "Ferndale",
                "Blaenllechau"
            ],
            [
                "Gelli repair",
                "Gelli"
            ],
            [
                "National Cellphone",
                "Wattstown"
            ],
            [
                "Naval repair",
                "Penygraig"
            ],
            [
                "Naval's shop",
                "Penygraig"
            ],
            [
                "Pentre store",
                "Pentre"
            ],
            [
                "Tynewydd repair",
                "Porth"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (shop:`device.shop`)\nRETURN shop.Shop_Name,shop.Location\nORDER BY shop.Shop_Name ASC",
        "question": "Return the names and locations of shops, ordered by name in alphabetical order.",
        "answers": [
            [
                "ATnT",
                "Maerdy"
            ],
            [
                "Apple",
                "Blaenllechau"
            ],
            [
                "Best Buy",
                "Cymmer"
            ],
            [
                "Dinas Device",
                "Dinas"
            ],
            [
                "Dinas store",
                "Dinas"
            ],
            [
                "Ferndale",
                "Blaenllechau"
            ],
            [
                "Gelli repair",
                "Gelli"
            ],
            [
                "National Cellphone",
                "Wattstown"
            ],
            [
                "Naval repair",
                "Penygraig"
            ],
            [
                "Naval's shop",
                "Penygraig"
            ],
            [
                "Pentre store",
                "Pentre"
            ],
            [
                "Tynewydd repair",
                "Porth"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (device:`device.device`)\nRETURN count(DISTINCT device.Software_Platform)",
        "question": "How many different software platforms are there for devices?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (device:`device.device`)\nRETURN count(DISTINCT device.Software_Platform)",
        "question": "Count the number of different software platforms.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (shop:`device.shop`)\nWHERE shop.Shop_Name = 'Apple'\nRETURN shop.Open_Date,shop.Open_Year",
        "question": "List the open date of open year of the shop named \"Apple\".",
        "answers": [
            [
                "10 June",
                2009
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (shop:`device.shop`)\nWHERE shop.Shop_Name = 'Apple'\nRETURN shop.Open_Date,shop.Open_Year",
        "question": "What are the open dates and years for the shop named Apple?",
        "answers": [
            [
                "10 June",
                2009
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (shop:`device.shop`)\nRETURN shop.Shop_Name\nORDER BY shop.Open_Year DESC\nLIMIT 1",
        "question": "List the name of the shop with the latest open year.",
        "answers": [
            [
                "National Cellphone"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (shop:`device.shop`)\nRETURN shop.Shop_Name\nORDER BY shop.Open_Year DESC\nLIMIT 1",
        "question": "What is the shop name corresponding to the shop that opened in the most recent year?",
        "answers": [
            [
                "National Cellphone"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (T2:`device.device`)-[T1:`device.stock`]-(T3:`device.shop`)\nRETURN T3.Shop_Name,T2.Carrier",
        "question": "Show names of shops and the carriers of devices they have in stock.",
        "answers": [
            [
                "Gelli repair",
                "Bell Mobility"
            ],
            [
                "Dinas Device",
                "Bell Mobility"
            ],
            [
                "Ferndale",
                "Bell Mobility"
            ],
            [
                "Ferndale",
                "Vodafone AU"
            ],
            [
                "ATnT",
                "Vodafone AU"
            ],
            [
                "Dinas Device",
                "Vodafone AU"
            ],
            [
                "Apple",
                "Vodafone AU"
            ],
            [
                "Best Buy",
                "Vodafone AU"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (T2:`device.device`)-[T1:`device.stock`]-(T3:`device.shop`)\nRETURN T3.Shop_Name,T2.Carrier",
        "question": "What are the names of device shops, and what are the carriers that they carry devices in stock for?",
        "answers": [
            [
                "Gelli repair",
                "Bell Mobility"
            ],
            [
                "Dinas Device",
                "Bell Mobility"
            ],
            [
                "Ferndale",
                "Bell Mobility"
            ],
            [
                "Ferndale",
                "Vodafone AU"
            ],
            [
                "ATnT",
                "Vodafone AU"
            ],
            [
                "Dinas Device",
                "Vodafone AU"
            ],
            [
                "Apple",
                "Vodafone AU"
            ],
            [
                "Best Buy",
                "Vodafone AU"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (T2:`device.shop`)-[T1:`device.stock`]-()\nWITH T2.Shop_Name AS Shop_Name, count(*) AS count\nWHERE count  > 1\nRETURN Shop_Name",
        "question": "Show names of shops that have more than one kind of device in stock.",
        "answers": [
            [
                "Dinas Device"
            ],
            [
                "Ferndale"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (T2:`device.shop`)-[T1:`device.stock`]-()\nWITH T2.Shop_Name AS Shop_Name, count(*) AS count\nWHERE count  > 1\nRETURN Shop_Name",
        "question": "What are the names of shops that have more than a single kind of device in stock?",
        "answers": [
            [
                "Dinas Device"
            ],
            [
                "Ferndale"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (T2:`device.shop`)-[T1:`device.stock`]-()\nWITH count(T1.Shop_ID) AS cnt, T2\nRETURN T2.Shop_Name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "Show the name of the shop that has the most kind of devices in stock.",
        "answers": [
            [
                "Dinas Device"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (T2:`device.shop`)-[T1:`device.stock`]-()\nWITH count(T1.Shop_ID) AS cnt, T2\nRETURN T2.Shop_Name\nORDER BY cnt DESC\nLIMIT 1",
        "question": "What is the name of the shop that has the most different kinds of devices in stock?",
        "answers": [
            [
                "Dinas Device"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (device:`device.device`)\nRETURN device.Software_Platform,count(*)",
        "question": "Please show different software platforms and the corresponding number of devices using each.",
        "answers": [
            [
                "Android",
                5
            ],
            [
                "iOS",
                1
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (device:`device.device`)\nRETURN device.Software_Platform,count(*)",
        "question": "What are the different software platforms for devices, and how many devices have each?",
        "answers": [
            [
                "Android",
                5
            ],
            [
                "iOS",
                1
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (device:`device.device`)\nRETURN device.Software_Platform\nORDER BY device.Software_Platform DESC",
        "question": "Please show the software platforms of devices in descending order of the count.",
        "answers": [
            [
                "iOS"
            ],
            [
                "Android"
            ],
            [
                "Android"
            ],
            [
                "Android"
            ],
            [
                "Android"
            ],
            [
                "Android"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (device:`device.device`)\nRETURN device.Software_Platform\nORDER BY device.Software_Platform DESC",
        "question": "What are the different software platforms for devices, ordered by frequency descending?",
        "answers": [
            [
                "iOS"
            ],
            [
                "Android"
            ],
            [
                "Android"
            ],
            [
                "Android"
            ],
            [
                "Android"
            ],
            [
                "Android"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (T2:`device.device`)-[T1:`device.stock`]-()\nWITH count(*) AS count, T2.Carrier AS Carrier\nWHERE count  > 1\nRETURN Carrier",
        "question": "Show the carriers of devices in stock at more than one shop.",
        "answers": [
            [
                "Bell Mobility"
            ],
            [
                "Vodafone AU"
            ]
        ]
    },
    {
        "db_id": "device",
        "query": "MATCH (T2:`device.device`)-[T1:`device.stock`]-()\nWITH count(*) AS count, T2.Carrier AS Carrier\nWHERE count  > 1\nRETURN Carrier",
        "question": "What are the carriers of devices that are in stock in more than a single shop?",
        "answers": [
            [
                "Bell Mobility"
            ],
            [
                "Vodafone AU"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (bookings:`cre_Drama_Workshop_Groups.Bookings`)\nRETURN count(*)",
        "question": "How many bookings do we have?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (bookings:`cre_Drama_Workshop_Groups.Bookings`)\nRETURN count(*)",
        "question": "Count the total number of bookings made.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (bookings:`cre_Drama_Workshop_Groups.Bookings`)\nRETURN bookings.Order_Date",
        "question": "List the order dates of all the bookings.",
        "answers": [
            [
                "2016-12-12 10:43:01"
            ],
            [
                "1976-08-20 00:33:08"
            ],
            [
                "1975-11-23 06:28:47"
            ],
            [
                "1995-02-02 15:52:57"
            ],
            [
                "1995-05-10 14:49:47"
            ],
            [
                "1992-11-26 18:11:10"
            ],
            [
                "1975-12-30 14:12:32"
            ],
            [
                "1992-05-11 23:22:41"
            ],
            [
                "1971-05-11 06:53:01"
            ],
            [
                "1982-05-19 05:37:51"
            ],
            [
                "1991-10-11 17:24:15"
            ],
            [
                "1984-12-17 12:53:51"
            ],
            [
                "1996-09-14 10:17:55"
            ],
            [
                "2007-08-05 15:46:29"
            ],
            [
                "1976-10-24 07:40:47"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (bookings:`cre_Drama_Workshop_Groups.Bookings`)\nRETURN bookings.Order_Date",
        "question": "What is the order date of each booking?",
        "answers": [
            [
                "2016-12-12 10:43:01"
            ],
            [
                "1976-08-20 00:33:08"
            ],
            [
                "1975-11-23 06:28:47"
            ],
            [
                "1995-02-02 15:52:57"
            ],
            [
                "1995-05-10 14:49:47"
            ],
            [
                "1992-11-26 18:11:10"
            ],
            [
                "1975-12-30 14:12:32"
            ],
            [
                "1992-05-11 23:22:41"
            ],
            [
                "1971-05-11 06:53:01"
            ],
            [
                "1982-05-19 05:37:51"
            ],
            [
                "1991-10-11 17:24:15"
            ],
            [
                "1984-12-17 12:53:51"
            ],
            [
                "1996-09-14 10:17:55"
            ],
            [
                "2007-08-05 15:46:29"
            ],
            [
                "1976-10-24 07:40:47"
            ]
        ]
    },
    {
        "db_id": "cre_Drama_Workshop_Groups",
        "query": "MATCH (bookings:`cre_Drama_Workshop_Groups.Bookings`)\nRETURN bookings.Planned_Delivery_Date,bookings.Actual_Delivery_Date",
        "question": "Show all the planned delivery dates and actual delivery dates of bookings.",
        "answers": [
            [
                "2013-03-10 18:47:05",
                "1997-11-21 10:07:40"
            ],
            [
                "2009-07-09 09:18:38",
                "1976-01-08 07:19:23"
            ],
            [
                "1989-01-05 19:24:45",
                "1990-03-16 19:38:47"
            ],
            [
                "2017-04-27 00:16:00",
                "1996-10-24 21:15:27"
            ],
            [
                "1979-07-19 19:44:01",
                "1971-01-13 13:24:52"
            ],
            [
                "2016-06-06 20:35:14",
                "2016-04-30 11:45:39"
            ],
            [
                "2008-07-18 18:15:40",
                "1983-10-09 10:48:48"
            ],
            [
                "1973-04-02 03:10:21",
                "1983-07-01 22:10:19"
            ],
            [
                "1974-05-07 21:40:39",
                "1986-10-04 13:31:10"
            ],
            [
                "1999-05-11 01:26:06",
                "1989-11-17 00:32:13"
            ],
            [
                "1978-04-10 12:23:59",
                "1983-02-07 20:27:10"
            ],
            [
                "2014-06-05 10:19:46",
                "1985-09-02 11:34:39"
            ],
            [
                "1993-04-17 23:53:01",
                "1982-04-18 02:59:08"
            ],
            [
                "1971-06-29 03:04:47",
                "1995-12-21 05:01:38"
            ],
            [
                "1972-06-25 15:51:34",
                "2004-02-22 04:37:14"
            ]
        ]
    }
]