[
    {
        "question": "Show the role code with the least employees.",
        "query": "MATCH (employees:`cre_Doc_Tracking_DB.Employees`)\nWITH employees.Role_Code AS Role_Code, count(employees.Role_Code) AS count\nRETURN Role_Code\nORDER BY count ASC\nLIMIT 1",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "HR"
            ]
        ]
    },
    {
        "question": "Show the name and description of the role played by the employee named Ebba.",
        "query": "MATCH (T1:`cre_Doc_Tracking_DB.Employees`)-[]-(T2:`cre_Doc_Tracking_DB.Roles`)\nWHERE T1.Employee_Name = 'Ebba'\nRETURN T2.Role_Name,T2.Role_Description",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "Manager",
                "Vero harum corrupti odit ipsa vero et odio. Iste et recusandae temporibus maxime. Magni aspernatur fugit quis explicabo totam esse corrupti."
            ]
        ]
    },
    {
        "question": "Show the names of employees with role name Editor.",
        "query": "MATCH (T1:`cre_Doc_Tracking_DB.Employees`)-[]-(T2:`cre_Doc_Tracking_DB.Roles`)\nWHERE T2.Role_Name = 'Editor'\nRETURN T1.Employee_Name",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "Izabella"
            ],
            [
                "Gussie"
            ],
            [
                "Beatrice"
            ],
            [
                "Harley"
            ],
            [
                "Armani"
            ],
            [
                "Stephanie"
            ],
            [
                "Mallie"
            ]
        ]
    },
    {
        "question": "Show the employee ids for all employees with role name \"Human Resource\" or \"Manager\".",
        "query": "MATCH (T1:`cre_Doc_Tracking_DB.Employees`)-[]-(T2:`cre_Doc_Tracking_DB.Roles`)\nWHERE T2.Role_Name = 'Human Resource' OR T2.Role_Name = 'Manager'\nRETURN T1.Employee_ID",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                30
            ],
            [
                25
            ]
        ]
    },
    {
        "question": "Give me all the distinct location codes for documents.",
        "query": "MATCH (document_locations:`cre_Doc_Tracking_DB.Document_Locations`)\nRETURN DISTINCT document_locations.Location_Code",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "e"
            ],
            [
                "x"
            ],
            [
                "c"
            ],
            [
                "b"
            ],
            [
                "n"
            ]
        ]
    },
    {
        "question": "Show the location code, the starting date and ending data in that location for all the documents.",
        "query": "MATCH (document_locations:`cre_Doc_Tracking_DB.Document_Locations`)\nRETURN document_locations.Location_Code,document_locations.Date_in_Location_From,document_locations.Date_in_Locaton_To",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "e",
                "2017-01-06 23:17:22",
                "2008-06-08 12:45:38"
            ],
            [
                "x",
                "2017-01-06 23:17:22",
                "2012-07-03 09:48:46"
            ],
            [
                "c",
                "1972-03-31 09:47:22",
                "1987-11-05 06:11:22"
            ],
            [
                "c",
                "2017-01-06 23:17:22",
                "2010-11-26 19:22:50"
            ],
            [
                "x",
                "2008-06-08 12:45:38",
                "1976-06-15 03:40:06"
            ],
            [
                "x",
                "1986-10-14 17:53:39",
                "2010-11-26 19:22:50"
            ],
            [
                "b",
                "2017-01-06 23:17:22",
                "1995-01-01 03:52:11"
            ],
            [
                "b",
                "1985-05-13 12:19:43",
                "1986-10-14 17:53:39"
            ],
            [
                "b",
                "1986-10-14 17:53:39",
                "2010-11-26 19:22:50"
            ],
            [
                "x",
                "1997-03-10 15:24:00",
                "1976-06-15 03:40:06"
            ],
            [
                "e",
                "1972-03-31 09:47:22",
                "1987-11-05 06:11:22"
            ],
            [
                "e",
                "2010-11-26 19:22:50",
                "2017-01-06 23:17:22"
            ],
            [
                "n",
                "2017-01-06 23:17:22",
                "1997-03-10 15:24:00"
            ],
            [
                "x",
                "1972-03-31 09:47:22",
                "2009-08-18 03:29:08"
            ],
            [
                "e",
                "2009-08-18 03:29:08",
                "1986-10-14 17:53:39"
            ]
        ]
    },
    {
        "question": "Show the location codes and the number of documents in each location.",
        "query": "MATCH (document_locations:`cre_Doc_Tracking_DB.Document_Locations`)\nWITH count(document_locations.Location_Code) AS count, document_locations.Location_Code AS Location_Code\nRETURN Location_Code,count",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "e",
                4
            ],
            [
                "x",
                5
            ],
            [
                "c",
                2
            ],
            [
                "b",
                3
            ],
            [
                "n",
                1
            ]
        ]
    },
    {
        "question": "Show the location codes with at least 3 documents.",
        "query": "MATCH (document_locations:`cre_Doc_Tracking_DB.Document_Locations`)\nWITH count(*) AS count, document_locations.Location_Code AS Location_Code\nWHERE count  >= 3\nRETURN Location_Code",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "e"
            ],
            [
                "x"
            ],
            [
                "b"
            ]
        ]
    },
    {
        "question": "Show the location name and code with the least documents.",
        "query": "MATCH (T1:`cre_Doc_Tracking_DB.Document_Locations`)-[]-(T2:`cre_Doc_Tracking_DB.Ref_Locations`)\nWITH T2.Location_Name AS Location_Name, count(T1.Location_Code) AS count, T1.Location_Code AS Location_Code\nRETURN Location_Name,Location_Code\nORDER BY count ASC\nLIMIT 1",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "Nanjing",
                "n"
            ]
        ]
    },
    {
        "question": "What are the name and code of the location with the smallest number of documents?",
        "query": "MATCH (T1:`cre_Doc_Tracking_DB.Document_Locations`)-[]-(T2:`cre_Doc_Tracking_DB.Ref_Locations`)\nWITH T2.Location_Name AS Location_Name, count(T1.Location_Code) AS count, T1.Location_Code AS Location_Code\nRETURN Location_Name,Location_Code\nORDER BY count ASC\nLIMIT 1",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                "Nanjing",
                "n"
            ]
        ]
    },
    {
        "question": "Show the id of each employee and the number of document destruction authorised by that employee.",
        "query": "MATCH (documents_to_be_destroyed:`cre_Doc_Tracking_DB.Documents_to_be_Destroyed`)\nWITH count(documents_to_be_destroyed.Destruction_Authorised_by_Employee_ID) AS count, documents_to_be_destroyed.Destruction_Authorised_by_Employee_ID AS Destruction_Authorised_by_Employee_ID\nRETURN Destruction_Authorised_by_Employee_ID,count",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                156,
                2
            ],
            [
                55,
                3
            ],
            [
                183,
                3
            ],
            [
                38,
                1
            ],
            [
                123,
                1
            ],
            [
                30,
                1
            ]
        ]
    },
    {
        "question": "Show the employee ids and the number of documents destroyed by each employee.",
        "query": "MATCH (documents_to_be_destroyed:`cre_Doc_Tracking_DB.Documents_to_be_Destroyed`)\nWITH documents_to_be_destroyed.Destroyed_by_Employee_ID AS Destroyed_by_Employee_ID, count(documents_to_be_destroyed.Destroyed_by_Employee_ID) AS count\nRETURN Destroyed_by_Employee_ID,count",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                138,
                1
            ],
            [
                173,
                3
            ],
            [
                156,
                1
            ],
            [
                136,
                2
            ],
            [
                99,
                2
            ],
            [
                38,
                1
            ],
            [
                55,
                1
            ]
        ]
    },
    {
        "question": "Show the ids of all employees who have authorized destruction.",
        "query": "MATCH (documents_to_be_destroyed:`cre_Doc_Tracking_DB.Documents_to_be_Destroyed`)\nRETURN DISTINCT documents_to_be_destroyed.Destruction_Authorised_by_Employee_ID",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                156
            ],
            [
                55
            ],
            [
                183
            ],
            [
                38
            ],
            [
                123
            ],
            [
                30
            ]
        ]
    },
    {
        "question": "Show the ids of all employees who have destroyed a document.",
        "query": "MATCH (documents_to_be_destroyed:`cre_Doc_Tracking_DB.Documents_to_be_Destroyed`)\nRETURN DISTINCT documents_to_be_destroyed.Destroyed_by_Employee_ID",
        "db_id": "cre_Doc_Tracking_DB",
        "answers": [
            [
                138
            ],
            [
                173
            ],
            [
                156
            ],
            [
                136
            ],
            [
                99
            ],
            [
                38
            ],
            [
                55
            ]
        ]
    },
    {
        "question": "Count the total number of clubs.",
        "query": "MATCH (club:`club_1.Club`)\nRETURN count(*)",
        "db_id": "club_1",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "question": "Give me the name of each club.",
        "query": "MATCH (club:`club_1.Club`)\nRETURN club.ClubName",
        "db_id": "club_1",
        "answers": [
            [
                "Bootup Baltimore"
            ],
            [
                "Hopkins Student Enterprises"
            ],
            [
                "Pen and Paper Gaming"
            ],
            [
                "Tennis Club"
            ]
        ]
    },
    {
        "question": "Count the total number of students.",
        "query": "MATCH (student:`club_1.Student`)\nRETURN count(*)",
        "db_id": "club_1",
        "answers": [
            [
                34
            ]
        ]
    },
    {
        "question": "Find each student's first name.",
        "query": "MATCH (student:`club_1.Student`)\nRETURN DISTINCT student.Fname",
        "db_id": "club_1",
        "answers": [
            [
                "Linda"
            ],
            [
                "Tracy"
            ],
            [
                "Shiela"
            ],
            [
                "Dinesh"
            ],
            [
                "Paul"
            ],
            [
                "Andy"
            ],
            [
                "Lisa"
            ],
            [
                "Jandy"
            ],
            [
                "Eric"
            ],
            [
                "Derek"
            ],
            [
                "David"
            ],
            [
                "Steven"
            ],
            [
                "Charles"
            ],
            [
                "Susan"
            ],
            [
                "Mark"
            ],
            [
                "Bruce"
            ],
            [
                "Michael"
            ],
            [
                "Arthur"
            ],
            [
                "Ian"
            ],
            [
                "George"
            ],
            [
                "Stacy"
            ],
            [
                "Jun"
            ],
            [
                "Sarah"
            ],
            [
                "William"
            ]
        ]
    },
    {
        "question": "What is the description of the club named \"Tennis Club\"?",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = 'Tennis Club'\nRETURN club.ClubDesc",
        "db_id": "club_1",
        "answers": [
            [
                "A competitive tennis club."
            ]
        ]
    },
    {
        "question": "Find the description of the club \"Pen and Paper Gaming\".",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = 'Pen and Paper Gaming'\nRETURN club.ClubDesc",
        "db_id": "club_1",
        "answers": [
            [
                "Play pen and paper games on campus."
            ]
        ]
    },
    {
        "question": "What is the location of the club named \"Tennis Club\"?",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = 'Tennis Club'\nRETURN club.ClubLocation",
        "db_id": "club_1",
        "answers": [
            [
                "AKW"
            ]
        ]
    },
    {
        "question": "Find the location of the club \"Pen and Paper Gaming\".",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = 'Pen and Paper Gaming'\nRETURN club.ClubLocation",
        "db_id": "club_1",
        "answers": [
            [
                "HHH"
            ]
        ]
    },
    {
        "question": "Where is the club \"Hopkins Student Enterprises\" located?",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubName = 'Hopkins Student Enterprises'\nRETURN club.ClubLocation",
        "db_id": "club_1",
        "answers": [
            [
                "AKW"
            ]
        ]
    },
    {
        "question": "Find the name of all the clubs at \"AKW\".",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubLocation = 'AKW'\nRETURN club.ClubName",
        "db_id": "club_1",
        "answers": [
            [
                "Bootup Baltimore"
            ],
            [
                "Hopkins Student Enterprises"
            ],
            [
                "Tennis Club"
            ]
        ]
    },
    {
        "question": "How many clubs are located at \"HHH\"?",
        "query": "MATCH (club:`club_1.Club`)\nWHERE club.ClubLocation = 'HHH'\nRETURN count(*)",
        "db_id": "club_1",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "question": "Which organisation type hires most research staff?",
        "query": "MATCH (T1:`tracking_grants_for_research.Organisations`)-[]-(T2:`tracking_grants_for_research.Research_Staff`)\nWITH count(T1.organisation_type) AS count, T1.organisation_type AS organisation_type\nRETURN organisation_type\nORDER BY count DESC\nLIMIT 1",
        "db_id": "tracking_grants_for_research",
        "answers": [
            [
                "RES"
            ]
        ]
    },
    {
        "question": "What is the type of the organization with the most research staff?",
        "query": "MATCH (T1:`tracking_grants_for_research.Organisations`)-[]-(T2:`tracking_grants_for_research.Research_Staff`)\nWITH count(T1.organisation_type) AS count, T1.organisation_type AS organisation_type\nRETURN organisation_type\nORDER BY count DESC\nLIMIT 1",
        "db_id": "tracking_grants_for_research",
        "answers": [
            [
                "RES"
            ]
        ]
    },
    {
        "question": "What is the complete description of the researcher role.",
        "query": "MATCH (staff_roles:`tracking_grants_for_research.Staff_Roles`)\nWHERE staff_roles.role_code = 'researcher'\nRETURN staff_roles.role_description",
        "db_id": "tracking_grants_for_research",
        "answers": [
            [
                "Project Researcher"
            ]
        ]
    },
    {
        "question": "Which organisation hired the most number of research staff? List the organisation id, type and detail.",
        "query": "MATCH (T1:`tracking_grants_for_research.Organisations`)-[]-(T2:`tracking_grants_for_research.Research_Staff`)\nWITH T1.organisation_id AS organisation_id, count(T1.organisation_id) AS count, T1.organisation_details AS organisation_details, T1.organisation_type AS organisation_type\nRETURN organisation_id,organisation_type,organisation_details\nORDER BY count DESC\nLIMIT 1",
        "db_id": "tracking_grants_for_research",
        "answers": [
            [
                5,
                "SPON",
                "tenetur"
            ]
        ]
    },
    {
        "question": "How many documents can one grant have at most? List the grant id and number.",
        "query": "MATCH (documents:`tracking_grants_for_research.Documents`)\nWITH documents.grant_id AS grant_id, count(documents.grant_id) AS count\nRETURN grant_id,count\nORDER BY count DESC\nLIMIT 1",
        "db_id": "tracking_grants_for_research",
        "answers": [
            [
                13,
                5
            ]
        ]
    },
    {
        "question": "For each grant id, how many documents does it have, and which one has the most?",
        "query": "MATCH (documents:`tracking_grants_for_research.Documents`)\nWITH documents.grant_id AS grant_id, count(documents.grant_id) AS count\nRETURN grant_id,count\nORDER BY count DESC\nLIMIT 1",
        "db_id": "tracking_grants_for_research",
        "answers": [
            [
                13,
                5
            ]
        ]
    },
    {
        "question": "Find the organisation type description of the organisation detailed as 'quo'.",
        "query": "MATCH (T1:`tracking_grants_for_research.Organisation_Types`)-[]-(T2:`tracking_grants_for_research.Organisations`)\nWHERE T2.organisation_details = 'quo'\nRETURN T1.organisation_type_description",
        "db_id": "tracking_grants_for_research",
        "answers": [
            [
                "Research"
            ]
        ]
    },
    {
        "question": "What are all the details of the organisations described as 'Sponsor'? Sort the result in an ascending order.",
        "query": "MATCH (T1:`tracking_grants_for_research.Organisations`)-[]-(T2:`tracking_grants_for_research.Organisation_Types`)\nWHERE T2.organisation_type_description = 'Sponsor'\nRETURN T1.organisation_details\nORDER BY T1.organisation_details",
        "db_id": "tracking_grants_for_research",
        "answers": [
            [
                "aperiam"
            ],
            [
                "consequuntur"
            ],
            [
                "eos"
            ],
            [
                "eveniet"
            ],
            [
                "officiis"
            ],
            [
                "tenetur"
            ],
            [
                "voluptas"
            ]
        ]
    },
    {
        "question": "What are the details of all organizations that are described as Sponsors and sort the results in ascending order?",
        "query": "MATCH (T1:`tracking_grants_for_research.Organisations`)-[]-(T2:`tracking_grants_for_research.Organisation_Types`)\nWHERE T2.organisation_type_description = 'Sponsor'\nRETURN T1.organisation_details\nORDER BY T1.organisation_details",
        "db_id": "tracking_grants_for_research",
        "answers": [
            [
                "aperiam"
            ],
            [
                "consequuntur"
            ],
            [
                "eos"
            ],
            [
                "eveniet"
            ],
            [
                "officiis"
            ],
            [
                "tenetur"
            ],
            [
                "voluptas"
            ]
        ]
    },
    {
        "question": "List the research staff details, and order in ascending order.",
        "query": "MATCH (research_staff:`tracking_grants_for_research.Research_Staff`)\nRETURN research_staff.staff_details\nORDER BY research_staff.staff_details ASC",
        "db_id": "tracking_grants_for_research",
        "answers": [
            [
                "ab"
            ],
            [
                "accusamus"
            ],
            [
                "animi"
            ],
            [
                "aspernatur"
            ],
            [
                "consequatur"
            ],
            [
                "consequatur"
            ],
            [
                "dicta"
            ],
            [
                "dolor"
            ],
            [
                "doloribus"
            ],
            [
                "est"
            ],
            [
                "iure"
            ],
            [
                "nulla"
            ],
            [
                "quo"
            ],
            [
                "sint"
            ],
            [
                "voluptatibus"
            ]
        ]
    },
    {
        "question": "How many tasks does each project have? List the task count and the project detail.",
        "query": "MATCH (T1:`tracking_grants_for_research.Projects`)-[]-(T2:`tracking_grants_for_research.Tasks`)\nWITH count(T1.project_id) AS count, T1.project_details AS project_details\nRETURN count,project_details",
        "db_id": "tracking_grants_for_research",
        "answers": [
            [
                1,
                "porro"
            ],
            [
                1,
                "et"
            ],
            [
                1,
                "sint"
            ],
            [
                1,
                "doloremque"
            ],
            [
                1,
                "vel"
            ],
            [
                1,
                "deserunt"
            ],
            [
                1,
                "deleniti"
            ],
            [
                1,
                "ad"
            ],
            [
                1,
                "sed"
            ],
            [
                1,
                "consectetur"
            ],
            [
                1,
                "impedit"
            ],
            [
                1,
                "omnis"
            ],
            [
                1,
                "non"
            ],
            [
                1,
                "beatae"
            ],
            [
                1,
                "dolorem"
            ]
        ]
    },
    {
        "question": "How many friends does Dan have?",
        "query": "MATCH (T1:`network_2.Person`)-[]-(T2:`network_2.PersonFriend`)\nWHERE T1.name = 'Dan'\nRETURN count(T2.friend)",
        "db_id": "network_2",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Find the number of people who is under 40 for each gender.",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.age < 40\nWITH person.gender AS gender, count(person.gender) AS count\nRETURN count,gender",
        "db_id": "network_2",
        "answers": [
            [
                2,
                "female"
            ],
            [
                1,
                "male"
            ]
        ]
    },
    {
        "question": "list the name, job title of all people ordered by their names.",
        "query": "MATCH (person:`network_2.Person`)\nRETURN person.name,person.job\nORDER BY person.name",
        "db_id": "network_2",
        "answers": [
            [
                "Alice",
                "student"
            ],
            [
                "Bob",
                "engineer"
            ],
            [
                "Dan",
                "student"
            ],
            [
                "Zach",
                "doctor"
            ]
        ]
    },
    {
        "question": "Find the names of all person sorted in the descending order using age.",
        "query": "MATCH (person:`network_2.Person`)\nRETURN person.name\nORDER BY person.age DESC",
        "db_id": "network_2",
        "answers": [
            [
                "Zach"
            ],
            [
                "Bob"
            ],
            [
                "Dan"
            ],
            [
                "Alice"
            ]
        ]
    },
    {
        "question": "Find the name and age of all males in order of their age.",
        "query": "MATCH (person:`network_2.Person`)\nWHERE person.gender = 'male'\nRETURN person.name\nORDER BY person.age",
        "db_id": "network_2",
        "answers": [
            [
                "Bob"
            ],
            [
                "Zach"
            ]
        ]
    },
    {
        "question": "Find the person who has exactly one friend.",
        "query": "MATCH (personfriend:`network_2.PersonFriend`)\nWITH count(*) AS count, personfriend.name AS name\nWHERE count  = 1\nRETURN name",
        "db_id": "network_2",
        "answers": [
            [
                "Alice"
            ],
            [
                "Bob"
            ]
        ]
    },
    {
        "question": "What are the names of everybody who has exactly one friend?",
        "query": "MATCH (personfriend:`network_2.PersonFriend`)\nWITH count(*) AS count, personfriend.name AS name\nWHERE count  = 1\nRETURN name",
        "db_id": "network_2",
        "answers": [
            [
                "Alice"
            ],
            [
                "Bob"
            ]
        ]
    },
    {
        "question": "What is the total number of people who has no friend living in the city of Austin.",
        "query": "MATCH (personfriend:`network_2.PersonFriend`)\nWHERE NOT (personfriend:`network_2.PersonFriend`)-[]-(:`network_2.Person { city : 'Austin' }`)\nRETURN count(DISTINCT personfriend.name)",
        "db_id": "network_2",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "What is the total number of people who have no friends living in Austin?",
        "query": "MATCH (personfriend:`network_2.PersonFriend`)\nWHERE NOT (personfriend:`network_2.PersonFriend`)-[]-(:`network_2.Person { city : 'Austin' }`)\nRETURN count(DISTINCT personfriend.name)",
        "db_id": "network_2",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "List the names of members in ascending alphabetical order.",
        "query": "MATCH (member:`decoration_competition.member`)\nRETURN member.Name\nORDER BY member.Name ASC",
        "db_id": "decoration_competition",
        "answers": [
            [
                "Arnold Palmer"
            ],
            [
                "Billy Casper"
            ],
            [
                "Bobby Nichols"
            ],
            [
                "Homero Blancas"
            ],
            [
                "J. C. Snead"
            ],
            [
                "Jack Nicklaus"
            ],
            [
                "Lee Trevino"
            ],
            [
                "Pat Fitzsimons"
            ],
            [
                "Tom Watson"
            ],
            [
                "Tom Weiskopf"
            ]
        ]
    },
    {
        "question": "Show the names of members whose country is \"United States\" or \"Canada\".",
        "query": "MATCH (member:`decoration_competition.member`)\nWHERE member.Country = 'United States' OR member.Country = 'Canada'\nRETURN member.Name",
        "db_id": "decoration_competition",
        "answers": [
            [
                "Jack Nicklaus"
            ],
            [
                "Billy Casper"
            ],
            [
                "Arnold Palmer"
            ],
            [
                "Tom Watson"
            ],
            [
                "Homero Blancas"
            ],
            [
                "Pat Fitzsimons"
            ],
            [
                "Bobby Nichols"
            ],
            [
                "J. C. Snead"
            ],
            [
                "Lee Trevino"
            ],
            [
                "Tom Weiskopf"
            ]
        ]
    },
    {
        "question": "Show the different countries and the number of members from each.",
        "query": "MATCH (member:`decoration_competition.member`)\nWITH member.Country AS Country, count(member.Country) AS count\nRETURN Country,count",
        "db_id": "decoration_competition",
        "answers": [
            [
                "United States",
                6
            ],
            [
                "Canada",
                4
            ]
        ]
    },
    {
        "question": "Show the most common country across members.",
        "query": "MATCH (member:`decoration_competition.member`)\nWITH member.Country AS Country, count(member.Country) AS count\nRETURN Country\nORDER BY count DESC\nLIMIT 1",
        "db_id": "decoration_competition",
        "answers": [
            [
                "United States"
            ]
        ]
    },
    {
        "question": "Show the leader names and locations of colleges.",
        "query": "MATCH (college:`decoration_competition.college`)\nRETURN college.Leader_Name,college.College_Location",
        "db_id": "decoration_competition",
        "answers": [
            [
                "Ousame Tounkara",
                "Ottawa"
            ],
            [
                "Ryan Thelwell",
                "Minnesota"
            ],
            [
                "Andre Arlain",
                "St. Francis Xavier"
            ],
            [
                "Samir Chahine",
                "McGill"
            ],
            [
                "Roger Dunbrack",
                "Western Ontario"
            ]
        ]
    },
    {
        "question": "Show the names of members and names of colleges they go to.",
        "query": "MATCH (T1:`decoration_competition.college`)-[]-(T2:`decoration_competition.member`)\nRETURN T2.Name,T1.Name",
        "db_id": "decoration_competition",
        "answers": [
            [
                "Jack Nicklaus",
                "Saskatchewan School"
            ],
            [
                "Billy Casper",
                "Saskatchewan School"
            ],
            [
                "Homero Blancas",
                "B.C. School"
            ],
            [
                "Lee Trevino",
                "Calgary School"
            ],
            [
                "Tom Weiskopf",
                "Calgary School"
            ],
            [
                "Arnold Palmer",
                "Edmonton School"
            ],
            [
                "J. C. Snead",
                "Edmonton School"
            ],
            [
                "Tom Watson",
                "Edmonton School"
            ],
            [
                "Bobby Nichols",
                "Toronto School"
            ],
            [
                "Pat Fitzsimons",
                "Toronto School"
            ]
        ]
    }
]