[
    {
        "db_id": "aircraft",
        "query": "MATCH (pilot:`aircraft.pilot`)\nRETURN pilot.Name\nORDER BY pilot.Name ASC",
        "question": "What are the names of the pilots in alphabetical order?",
        "answers": [
            [
                "Ayana Spencer"
            ],
            [
                "Baylee Steuber"
            ],
            [
                "Blaise Muller"
            ],
            [
                "Della Lindgren"
            ],
            [
                "Dr. Jade Bradtke V"
            ],
            [
                "Elisha Hickle V"
            ],
            [
                "Ellen Ledner III"
            ],
            [
                "Katheryn Gorczany IV"
            ],
            [
                "Maxwell Graham"
            ],
            [
                "Mr. Cristian Halvorson II"
            ],
            [
                "Prof. Zackery Collins"
            ],
            [
                "Winnifred Boyle"
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (pilot:`aircraft.pilot`)\nWHERE pilot.Age <= 30\nRETURN pilot.Name\nORDER BY pilot.Name DESC",
        "question": "List names of all pilot aged 30 or younger in descending alphabetical order.",
        "answers": [
            [
                "Winnifred Boyle"
            ],
            [
                "Prof. Zackery Collins"
            ],
            [
                "Mr. Cristian Halvorson II"
            ],
            [
                "Maxwell Graham"
            ],
            [
                "Katheryn Gorczany IV"
            ],
            [
                "Dr. Jade Bradtke V"
            ],
            [
                "Della Lindgren"
            ],
            [
                "Baylee Steuber"
            ],
            [
                "Ayana Spencer"
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (pilot:`aircraft.pilot`)\nWHERE pilot.Age <= 30\nRETURN pilot.Name\nORDER BY pilot.Name DESC",
        "question": "What are the names of all pilots 30 years old or young in descending alphabetical order?",
        "answers": [
            [
                "Winnifred Boyle"
            ],
            [
                "Prof. Zackery Collins"
            ],
            [
                "Mr. Cristian Halvorson II"
            ],
            [
                "Maxwell Graham"
            ],
            [
                "Katheryn Gorczany IV"
            ],
            [
                "Dr. Jade Bradtke V"
            ],
            [
                "Della Lindgren"
            ],
            [
                "Baylee Steuber"
            ],
            [
                "Ayana Spencer"
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (T1:`aircraft.aircraft`)-[T2:`aircraft.airport_aircraft`]-(T3:`aircraft.airport`)\nWHERE T3.Airport_Name = 'London Gatwick'\nRETURN T1.Aircraft",
        "question": "Please show the names of aircrafts associated with airport with name \"London Gatwick\".",
        "answers": [
            [
                "Robinson R-22"
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (T1:`aircraft.aircraft`)-[T2:`aircraft.airport_aircraft`]-(T3:`aircraft.airport`)\nWHERE T3.Airport_Name = 'London Gatwick'\nRETURN T1.Aircraft",
        "question": "What are the names of all the aircrafts associated with London Gatwick airport?",
        "answers": [
            [
                "Robinson R-22"
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (T1:`aircraft.aircraft`)-[T2:`aircraft.airport_aircraft`]-(T3:`aircraft.airport`)\nWHERE T3.Total_Passengers > 10000000\nRETURN T1.Aircraft,T1.Description",
        "question": "Please show the names and descriptions of aircrafts associated with airports that have a total number of passengers bigger than 10000000.",
        "answers": [
            [
                "Robinson R-22",
                "Light utility helicopter"
            ],
            [
                "Bell 206B3 JetRanger",
                "Turboshaft utility helicopter"
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (T1:`aircraft.aircraft`)-[T2:`aircraft.airport_aircraft`]-(T3:`aircraft.airport`)\nWHERE T3.Total_Passengers > 10000000\nRETURN T1.Aircraft,T1.Description",
        "question": "What are the names and descriptions of aircrafts associated with an airport that has more total passengers than 10000000?",
        "answers": [
            [
                "Robinson R-22",
                "Light utility helicopter"
            ],
            [
                "Bell 206B3 JetRanger",
                "Turboshaft utility helicopter"
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (pilot:`aircraft.pilot`)\nRETURN pilot.Name\nORDER BY pilot.Age DESC",
        "question": "List names of all pilot in descending order of age.",
        "answers": [
            [
                "Elisha Hickle V"
            ],
            [
                "Blaise Muller"
            ],
            [
                "Ellen Ledner III"
            ],
            [
                "Winnifred Boyle"
            ],
            [
                "Baylee Steuber"
            ],
            [
                "Della Lindgren"
            ],
            [
                "Dr. Jade Bradtke V"
            ],
            [
                "Maxwell Graham"
            ],
            [
                "Ayana Spencer"
            ],
            [
                "Prof. Zackery Collins"
            ],
            [
                "Mr. Cristian Halvorson II"
            ],
            [
                "Katheryn Gorczany IV"
            ]
        ]
    },
    {
        "db_id": "aircraft",
        "query": "MATCH (pilot:`aircraft.pilot`)\nRETURN pilot.Name\nORDER BY pilot.Age DESC",
        "question": "What are the names of all pilots listed by descending age?",
        "answers": [
            [
                "Elisha Hickle V"
            ],
            [
                "Blaise Muller"
            ],
            [
                "Ellen Ledner III"
            ],
            [
                "Winnifred Boyle"
            ],
            [
                "Baylee Steuber"
            ],
            [
                "Della Lindgren"
            ],
            [
                "Dr. Jade Bradtke V"
            ],
            [
                "Maxwell Graham"
            ],
            [
                "Ayana Spencer"
            ],
            [
                "Prof. Zackery Collins"
            ],
            [
                "Mr. Cristian Halvorson II"
            ],
            [
                "Katheryn Gorczany IV"
            ]
        ]
    },
    {
        "db_id": "local_govt_and_lot",
        "query": "MATCH (T1:`local_govt_and_lot.Properties`)-[]-(T2:`local_govt_and_lot.Residents`)\nRETURN T1.property_id,count(*)",
        "question": "How many residents does each property have? List property id and resident count.",
        "answers": [
            [
                107,
                2
            ],
            [
                108,
                1
            ],
            [
                120,
                1
            ],
            [
                373,
                1
            ],
            [
                445,
                1
            ],
            [
                605,
                1
            ],
            [
                629,
                1
            ],
            [
                669,
                2
            ],
            [
                748,
                2
            ],
            [
                879,
                1
            ],
            [
                954,
                2
            ]
        ]
    },
    {
        "db_id": "local_govt_and_lot",
        "query": "MATCH (T1:`local_govt_and_lot.Services`)-[]-(T2:`local_govt_and_lot.Organizations`)\nWHERE T2.organization_details = 'Denesik and Sons Party'\nRETURN DISTINCT T1.service_type_code",
        "question": "What is the distinct service types that are provided by the organization which has detail 'Denesik and Sons Party'?",
        "answers": [
            [
                "Check"
            ],
            [
                "Pay bills"
            ],
            [
                "Cleanning"
            ],
            [
                "Moving Out"
            ]
        ]
    },
    {
        "db_id": "local_govt_and_lot",
        "query": "MATCH (T1:`local_govt_and_lot.Things`)-[]-(T2:`local_govt_and_lot.Organizations`)\nRETURN T1.thing_id,T1.Type_of_Thing_Code,T2.organization_details",
        "question": "List the id and type of each thing, and the details of the organization that owns it.",
        "answers": [
            [
                35,
                "Electronics",
                "Reinger, Hudson and Nolan Group"
            ],
            [
                92,
                "Commen",
                "Reinger, Hudson and Nolan Group"
            ],
            [
                46,
                "Commen",
                "Denesik and Sons Party"
            ],
            [
                10,
                "Commen",
                "Denesik and Sons Party"
            ],
            [
                2,
                "Electronics",
                "Denesik and Sons Party"
            ],
            [
                58,
                "Electronics",
                "Denesik and Sons Party"
            ],
            [
                80,
                "Furniture",
                "Denesik and Sons Party"
            ],
            [
                85,
                "Commen",
                "Denesik and Sons Party"
            ],
            [
                45,
                "Commen",
                "Denesik and Sons Party"
            ],
            [
                1,
                "Electronics",
                "Denesik and Sons Party"
            ],
            [
                26,
                "Electronics",
                "Denesik and Sons Party"
            ],
            [
                84,
                "Commen",
                "Denesik and Sons Party"
            ],
            [
                47,
                "Commen",
                "Robel-Schulist Group"
            ],
            [
                68,
                "Commen",
                "Robel-Schulist Group"
            ],
            [
                14,
                "Furniture",
                "Robel-Schulist Group"
            ]
        ]
    },
    {
        "db_id": "local_govt_and_lot",
        "query": "MATCH (T1:`local_govt_and_lot.Customers`)-[]-(T2:`local_govt_and_lot.Customer_Events`)\nWITH count(*) AS count, T1.customer_details AS customer_details, T1.customer_id AS customer_id\nWHERE count  >= 3\nRETURN customer_id,customer_details",
        "question": "What are the id and details of the customers who have at least 3 events?",
        "answers": [
            [
                19,
                "Sabryna Moore PhD"
            ]
        ]
    },
    {
        "db_id": "local_govt_and_lot",
        "query": "MATCH (T1:`local_govt_and_lot.Customers`)-[]-(T2:`local_govt_and_lot.Customer_Events`)\nRETURN T2.date_moved_in,T1.customer_id,T1.customer_details",
        "question": "What is each customer's move in date, and the corresponding customer id and details?",
        "answers": [
            [
                "2015-03-27 12:00:00",
                4,
                "Mr. Raul Prosacco"
            ],
            [
                "2015-03-27 12:00:00",
                5,
                "Esteban Senger"
            ],
            [
                "2015-03-27 12:00:00",
                16,
                "Tyrique Durgan II"
            ],
            [
                "2016-09-27 12:00:00",
                19,
                "Sabryna Moore PhD"
            ],
            [
                "2015-03-27 12:00:00",
                19,
                "Sabryna Moore PhD"
            ],
            [
                "2015-03-27 12:00:00",
                19,
                "Sabryna Moore PhD"
            ],
            [
                "2015-03-27 12:00:00",
                19,
                "Sabryna Moore PhD"
            ],
            [
                "2016-09-27 12:00:00",
                31,
                "Monty Sauer III"
            ],
            [
                "2015-03-27 12:00:00",
                63,
                "Vincenza Price"
            ],
            [
                "2015-03-27 12:00:00",
                79,
                "Oma Smith"
            ],
            [
                "2015-03-27 12:00:00",
                79,
                "Oma Smith"
            ],
            [
                "2016-09-27 12:00:00",
                91,
                "Mackenzie Hettinger V"
            ],
            [
                "2016-09-27 12:00:00",
                91,
                "Mackenzie Hettinger V"
            ]
        ]
    },
    {
        "db_id": "local_govt_and_lot",
        "query": "MATCH (T1:`local_govt_and_lot.Timed_Status_of_Things`)-[]-(T2:`local_govt_and_lot.Things`)\nWHERE T1.Status_of_Thing_Code = 'Close' OR T1.Date_and_Date < '2017-06-19 02:59:21'\nRETURN DISTINCT T2.thing_id,T2.Type_of_Thing_Code",
        "question": "What are the distinct id and type of the thing that has the status 'Close' or has a status record before the date '2017-06-19 02:59:21'",
        "answers": [
            [
                2,
                "Electronics"
            ],
            [
                10,
                "Commen"
            ],
            [
                26,
                "Electronics"
            ],
            [
                47,
                "Commen"
            ],
            [
                58,
                "Electronics"
            ],
            [
                80,
                "Furniture"
            ],
            [
                85,
                "Commen"
            ],
            [
                92,
                "Commen"
            ]
        ]
    },
    {
        "db_id": "local_govt_and_lot",
        "query": "MATCH (customer_events:`local_govt_and_lot.Customer_Events`)\nRETURN customer_events.Customer_Event_ID,customer_events.date_moved_in,customer_events.property_id",
        "question": "List the customer event id and the corresponding move in date and property id.",
        "answers": [
            [
                70,
                "2015-03-27 12:00:00",
                605
            ],
            [
                160,
                "2015-03-27 12:00:00",
                879
            ],
            [
                166,
                "2015-03-27 12:00:00",
                629
            ],
            [
                216,
                "2015-03-27 12:00:00",
                669
            ],
            [
                226,
                "2015-03-27 12:00:00",
                748
            ],
            [
                256,
                "2015-03-27 12:00:00",
                108
            ],
            [
                428,
                "2015-03-27 12:00:00",
                954
            ],
            [
                530,
                "2015-03-27 12:00:00",
                669
            ],
            [
                559,
                "2015-03-27 12:00:00",
                107
            ],
            [
                591,
                "2016-09-27 12:00:00",
                120
            ],
            [
                606,
                "2016-09-27 12:00:00",
                445
            ],
            [
                627,
                "2016-09-27 12:00:00",
                748
            ],
            [
                817,
                "2016-09-27 12:00:00",
                107
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nRETURN count(*)",
        "question": "Count the number of schools.",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nRETURN school.Location\nORDER BY school.Enrollment ASC",
        "question": "List the locations of schools in ascending order of enrollment.",
        "answers": [
            [
                "Bellevue Hill"
            ],
            [
                "Milsons Point"
            ],
            [
                "Waverley"
            ],
            [
                "Wahroonga"
            ],
            [
                "Summer Hill"
            ],
            [
                "Hornsby"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nRETURN school.Location\nORDER BY school.Enrollment ASC",
        "question": "What is the list of school locations sorted in ascending order of school enrollment?",
        "answers": [
            [
                "Bellevue Hill"
            ],
            [
                "Milsons Point"
            ],
            [
                "Waverley"
            ],
            [
                "Wahroonga"
            ],
            [
                "Summer Hill"
            ],
            [
                "Hornsby"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nRETURN school.Location\nORDER BY school.Founded DESC",
        "question": "List the locations of schools in descending order of founded year.",
        "answers": [
            [
                "Wahroonga"
            ],
            [
                "Bellevue Hill"
            ],
            [
                "Summer Hill"
            ],
            [
                "Waverley"
            ],
            [
                "Hornsby"
            ],
            [
                "Milsons Point"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nRETURN school.Location\nORDER BY school.Founded DESC",
        "question": "What is the list of school locations sorted in descending order of school foundation year?",
        "answers": [
            [
                "Wahroonga"
            ],
            [
                "Bellevue Hill"
            ],
            [
                "Summer Hill"
            ],
            [
                "Waverley"
            ],
            [
                "Hornsby"
            ],
            [
                "Milsons Point"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nWHERE school.Denomination <> 'Catholic'\nRETURN school.Enrollment",
        "question": "What are the enrollments of schools whose denomination is not \"Catholic\"?",
        "answers": [
            [
                2300.0
            ],
            [
                1000.0
            ],
            [
                1850.0
            ],
            [
                2200.0
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nWHERE school.Denomination <> 'Catholic'\nRETURN school.Enrollment",
        "question": "List the enrollment for each school that does not have \"Catholic\" as denomination.",
        "answers": [
            [
                2300.0
            ],
            [
                1000.0
            ],
            [
                1850.0
            ],
            [
                2200.0
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nRETURN avg(school.Enrollment)",
        "question": "What is the average enrollment of schools?",
        "answers": [
            [
                1663.3333333333333
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (school:`school_player.school`)\nRETURN avg(school.Enrollment)",
        "question": "Take the average of the school enrollment.",
        "answers": [
            [
                1663.3333333333333
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (player:`school_player.player`)\nRETURN player.Team\nORDER BY player.Team ASC",
        "question": "What are the teams of the players, sorted in ascending alphabetical order?",
        "answers": [
            [
                "Baltimore Orioles"
            ],
            [
                "Chicago Cubs"
            ],
            [
                "Chicago White Sox"
            ],
            [
                "Cincinnati Reds"
            ],
            [
                "Detroit Tigers"
            ],
            [
                "Florida Marlins"
            ],
            [
                "Houston Astros"
            ],
            [
                "Kansas City Royals"
            ],
            [
                "Los Angeles Dodgers"
            ],
            [
                "Milwaukee Brewers"
            ],
            [
                "Minnesota Twins"
            ],
            [
                "New York Mets"
            ],
            [
                "New York Mets"
            ],
            [
                "Oakland Athletics"
            ],
            [
                "Pittsburgh Pirates"
            ],
            [
                "San Diego Padres"
            ],
            [
                "San Francisco Giants"
            ],
            [
                "Seattle Mariners"
            ],
            [
                "St. Louis Cardinals"
            ],
            [
                "Tampa Bay Devil Rays"
            ],
            [
                "Texas Rangers"
            ],
            [
                "Toronto Blue Jays"
            ],
            [
                "Washington Nationals"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (player:`school_player.player`)\nRETURN player.Team\nORDER BY player.Team ASC",
        "question": "Find the team of each player and sort them in ascending alphabetical order.",
        "answers": [
            [
                "Baltimore Orioles"
            ],
            [
                "Chicago Cubs"
            ],
            [
                "Chicago White Sox"
            ],
            [
                "Cincinnati Reds"
            ],
            [
                "Detroit Tigers"
            ],
            [
                "Florida Marlins"
            ],
            [
                "Houston Astros"
            ],
            [
                "Kansas City Royals"
            ],
            [
                "Los Angeles Dodgers"
            ],
            [
                "Milwaukee Brewers"
            ],
            [
                "Minnesota Twins"
            ],
            [
                "New York Mets"
            ],
            [
                "New York Mets"
            ],
            [
                "Oakland Athletics"
            ],
            [
                "Pittsburgh Pirates"
            ],
            [
                "San Diego Padres"
            ],
            [
                "San Francisco Giants"
            ],
            [
                "Seattle Mariners"
            ],
            [
                "St. Louis Cardinals"
            ],
            [
                "Tampa Bay Devil Rays"
            ],
            [
                "Texas Rangers"
            ],
            [
                "Toronto Blue Jays"
            ],
            [
                "Washington Nationals"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (player:`school_player.player`)\nRETURN count(DISTINCT player.Position)",
        "question": "How many different positions of players are there?",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (player:`school_player.player`)\nRETURN count(DISTINCT player.Position)",
        "question": "Count the number of distinct player positions.",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (player:`school_player.player`)\nRETURN player.Team\nORDER BY player.Age DESC\nLIMIT 1",
        "question": "Find the team of the player of the highest age.",
        "answers": [
            [
                "New York Mets"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (player:`school_player.player`)\nRETURN player.Team\nORDER BY player.Age DESC\nLIMIT 1",
        "question": "Which team has the oldest player?",
        "answers": [
            [
                "New York Mets"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (player:`school_player.player`)\nRETURN player.Team\nORDER BY player.Age DESC\nLIMIT 5",
        "question": "List the teams of the players with the top 5 largest ages.",
        "answers": [
            [
                "New York Mets"
            ],
            [
                "Detroit Tigers"
            ],
            [
                "Baltimore Orioles"
            ],
            [
                "St. Louis Cardinals"
            ],
            [
                "Toronto Blue Jays"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (player:`school_player.player`)\nRETURN player.Team\nORDER BY player.Age DESC\nLIMIT 5",
        "question": "What are the teams that have the 5 oldest players?",
        "answers": [
            [
                "New York Mets"
            ],
            [
                "Detroit Tigers"
            ],
            [
                "Baltimore Orioles"
            ],
            [
                "St. Louis Cardinals"
            ],
            [
                "Toronto Blue Jays"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (T1:`school_player.player`)-[]-(T2:`school_player.school`)\nRETURN T1.Team,T2.Location",
        "question": "For each player, show the team and the location of school they belong to.",
        "answers": [
            [
                "Los Angeles Dodgers",
                "Milsons Point"
            ],
            [
                "Kansas City Royals",
                "Milsons Point"
            ],
            [
                "Texas Rangers",
                "Milsons Point"
            ],
            [
                "Washington Nationals",
                "Milsons Point"
            ],
            [
                "Cincinnati Reds",
                "Milsons Point"
            ],
            [
                "Baltimore Orioles",
                "Milsons Point"
            ],
            [
                "Chicago White Sox",
                "Milsons Point"
            ],
            [
                "Milwaukee Brewers",
                "Milsons Point"
            ],
            [
                "Houston Astros",
                "Milsons Point"
            ],
            [
                "Tampa Bay Devil Rays",
                "Milsons Point"
            ],
            [
                "Toronto Blue Jays",
                "Milsons Point"
            ],
            [
                "Oakland Athletics",
                "Hornsby"
            ],
            [
                "Florida Marlins",
                "Hornsby"
            ],
            [
                "San Francisco Giants",
                "Hornsby"
            ],
            [
                "Pittsburgh Pirates",
                "Hornsby"
            ],
            [
                "Detroit Tigers",
                "Bellevue Hill"
            ],
            [
                "Seattle Mariners",
                "Wahroonga"
            ],
            [
                "Chicago Cubs",
                "Wahroonga"
            ],
            [
                "New York Mets",
                "Wahroonga"
            ],
            [
                "San Diego Padres",
                "Summer Hill"
            ],
            [
                "New York Mets",
                "Summer Hill"
            ],
            [
                "St. Louis Cardinals",
                "Summer Hill"
            ],
            [
                "Minnesota Twins",
                "Waverley"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (T1:`school_player.player`)-[]-(T2:`school_player.school`)\nRETURN T1.Team,T2.Location",
        "question": "What are the team and the location of school each player belongs to?",
        "answers": [
            [
                "Los Angeles Dodgers",
                "Milsons Point"
            ],
            [
                "Kansas City Royals",
                "Milsons Point"
            ],
            [
                "Texas Rangers",
                "Milsons Point"
            ],
            [
                "Washington Nationals",
                "Milsons Point"
            ],
            [
                "Cincinnati Reds",
                "Milsons Point"
            ],
            [
                "Baltimore Orioles",
                "Milsons Point"
            ],
            [
                "Chicago White Sox",
                "Milsons Point"
            ],
            [
                "Milwaukee Brewers",
                "Milsons Point"
            ],
            [
                "Houston Astros",
                "Milsons Point"
            ],
            [
                "Tampa Bay Devil Rays",
                "Milsons Point"
            ],
            [
                "Toronto Blue Jays",
                "Milsons Point"
            ],
            [
                "Oakland Athletics",
                "Hornsby"
            ],
            [
                "Florida Marlins",
                "Hornsby"
            ],
            [
                "San Francisco Giants",
                "Hornsby"
            ],
            [
                "Pittsburgh Pirates",
                "Hornsby"
            ],
            [
                "Detroit Tigers",
                "Bellevue Hill"
            ],
            [
                "Seattle Mariners",
                "Wahroonga"
            ],
            [
                "Chicago Cubs",
                "Wahroonga"
            ],
            [
                "New York Mets",
                "Wahroonga"
            ],
            [
                "San Diego Padres",
                "Summer Hill"
            ],
            [
                "New York Mets",
                "Summer Hill"
            ],
            [
                "St. Louis Cardinals",
                "Summer Hill"
            ],
            [
                "Minnesota Twins",
                "Waverley"
            ]
        ]
    },
    {
        "db_id": "school_player",
        "query": "MATCH (T1:`school_player.player`)-[]-(T2:`school_player.school`)\nWITH T2.Location AS Location, count(*) AS count\nWHERE count  > 1\nRETURN Location",
        "question": "Show the locations of schools that have more than 1 player.",
        "answers": [
            [
                "Milsons Point"
            ],
            [
                "Hornsby"
            ],
            [
                "Wahroonga"
            ],
            [
                "Summer Hill"
            ]
        ]
    }
]