[
    {
        "db_id": "candidate_poll",
        "query": "MATCH (people:`candidate_poll.people`)\nWHERE NOT (people)-[]-(:`candidate_poll.candidate`)    \nRETURN people.Name",
        "question": "what are the names of people who did not participate in the candidate election.",
        "answers": [
            [
                "Dominique Daquin"
            ],
            [
                "Frantz Granvorka"
            ],
            [
                "Philippe Bar\u00e7a-Cysique"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (people:`candidate_poll.people`)\nWHERE NOT (people)-[]-(:`candidate_poll.candidate`)    \nRETURN people.Name",
        "question": "Give the names of people who did not participate in the candidate election.",
        "answers": [
            [
                "Dominique Daquin"
            ],
            [
                "Frantz Granvorka"
            ],
            [
                "Philippe Bar\u00e7a-Cysique"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (t1:`candidate_poll.people`)-[]-(t2:`candidate_poll.candidate`)\nWHERE t2.Support_rate < t2.Oppose_rate\nRETURN t1.Name",
        "question": "Find the names of the candidates whose support percentage is lower than their oppose rate.",
        "answers": [
            [
                "Hubert Henno"
            ],
            [
                "St\u00e9phane Antiga"
            ],
            [
                "Laurent Capet"
            ],
            [
                "Vincent Montm\u00e9at"
            ],
            [
                "Lo\u00efc De Kergret"
            ],
            [
                "Guillaume Samica"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (t1:`candidate_poll.people`)-[]-(t2:`candidate_poll.candidate`)\nWHERE t2.Support_rate < t2.Oppose_rate\nRETURN t1.Name",
        "question": "What are the names of candidates who have a lower support rate than oppose rate?",
        "answers": [
            [
                "Hubert Henno"
            ],
            [
                "St\u00e9phane Antiga"
            ],
            [
                "Laurent Capet"
            ],
            [
                "Vincent Montm\u00e9at"
            ],
            [
                "Lo\u00efc De Kergret"
            ],
            [
                "Guillaume Samica"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (people:`candidate_poll.people`)\nWHERE people.Weight > 85\nRETURN count(*),people.Sex",
        "question": "Count the number of people of each sex who have a weight higher than 85.",
        "answers": [
            [
                2,
                "F"
            ],
            [
                4,
                "M"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN max(candidate.Support_rate),min(candidate.Consider_rate),min(candidate.Oppose_rate)",
        "question": "find the highest support percentage, lowest consider rate and oppose rate of all candidates.",
        "answers": [
            [
                0.33,
                0.2,
                0.32
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN max(candidate.Support_rate),min(candidate.Consider_rate),min(candidate.Oppose_rate)",
        "question": "Return the maximum support rate, minimum consider rate, and minimum oppose rate across all candidates?",
        "answers": [
            [
                0.33,
                0.2,
                0.32
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (t1:`candidate_poll.people`)-[]-(t2:`candidate_poll.candidate`)\nWHERE t1.Sex = 'F'\nRETURN t1.Name\nORDER BY t1.Name",
        "question": "list all female (sex is F) candidate names in the alphabetical order.",
        "answers": [
            [
                "St\u00e9phane Antiga"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (t1:`candidate_poll.people`)-[]-(t2:`candidate_poll.candidate`)\nWHERE t1.Sex = 'F'\nRETURN t1.Name\nORDER BY t1.Name",
        "question": "What are the names of all female candidates in alphabetical order (sex is F)?",
        "answers": [
            [
                "St\u00e9phane Antiga"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (people:`candidate_poll.people`)\nWITH avg(people.Height) AS height\nMATCH (people:`candidate_poll.people`)\nWHERE  people.Height <  height \nRETURN people.Name",
        "question": "find the name of people whose height is lower than the average.",
        "answers": [
            [
                "Hubert Henno"
            ],
            [
                "Frantz Granvorka"
            ],
            [
                "Lo\u00efc De Kergret"
            ],
            [
                "Philippe Bar\u00e7a-Cysique"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (people:`candidate_poll.people`)\nWITH avg(people.Height) AS height\nMATCH (people:`candidate_poll.people`)\nWHERE  people.Height <  height \nRETURN people.Name",
        "question": "What are the names of people who are shorter than average?",
        "answers": [
            [
                "Hubert Henno"
            ],
            [
                "Frantz Granvorka"
            ],
            [
                "Lo\u00efc De Kergret"
            ],
            [
                "Philippe Bar\u00e7a-Cysique"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWHERE movie.director = 'Steven Spielberg'\nRETURN movie.title",
        "question": "Find the titles of all movies directed by steven spielberg.",
        "answers": [
            [
                "E.T."
            ],
            [
                "Raiders of the Lost Ark"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWHERE movie.director = 'Steven Spielberg'\nRETURN movie.title",
        "question": "What are the names of all movies directed by Steven Spielberg?",
        "answers": [
            [
                "E.T."
            ],
            [
                "Raiders of the Lost Ark"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWHERE movie.director = 'James Cameron' AND movie.year > 2000\nRETURN movie.title",
        "question": "What is the name of the movie produced after 2000 and directed by James Cameron?",
        "answers": [
            [
                "Avatar"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWHERE movie.director = 'James Cameron' AND movie.year > 2000\nRETURN movie.title",
        "question": "What are the titles of all movies that James Cameron directed after 2000?",
        "answers": [
            [
                "Avatar"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWHERE movie.year < 2000\nRETURN count(*)",
        "question": "How many movies were made before 2000?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWHERE movie.title = 'Avatar'\nRETURN movie.director",
        "question": "Who is the director of movie Avatar?",
        "answers": [
            [
                "James Cameron"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWHERE movie.title = 'Avatar'\nRETURN movie.director",
        "question": "Who directed Avatar?",
        "answers": [
            [
                "James Cameron"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (reviewer:`movie_1.Reviewer`)\nRETURN count(*)",
        "question": "How many reviewers listed?",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (reviewer:`movie_1.Reviewer`)\nRETURN count(*)",
        "question": "How many reviewers are there?",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (reviewer:`movie_1.Reviewer`)\nWHERE reviewer.name = 'Daniel Lewis'\nRETURN reviewer.rID",
        "question": "What is the reviewer id of Daniel Lewis?",
        "answers": [
            [
                202
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (reviewer:`movie_1.Reviewer`)\nWHERE reviewer.name = 'Daniel Lewis'\nRETURN reviewer.rID",
        "question": "What is the id of the reviewer named Daniel Lewis?",
        "answers": [
            [
                202
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH ()-[rating:`movie_1.Rating`]-()\nRETURN max(rating.stars),min(rating.stars)",
        "question": "What is the lowest and highest rating star?",
        "answers": [
            [
                5,
                2
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH ()-[rating:`movie_1.Rating`]-()\nRETURN max(rating.stars),min(rating.stars)",
        "question": "What is the maximum and mininum number of stars a rating can receive?",
        "answers": [
            [
                5,
                2
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T1:`movie_1.Movie`)-[T2:`movie_1.Rating`]-()\nWHERE T2.stars = 5\nRETURN T1.director,T1.title",
        "question": "What are the names of directors who directed movies with 5 star rating? Also return the title of these movies.",
        "answers": [
            [
                null,
                "Snow White"
            ],
            [
                "James Cameron",
                "Avatar"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T1:`movie_1.Movie`)-[T2:`movie_1.Rating`]-()\nWHERE T2.stars = 5\nRETURN T1.director,T1.title",
        "question": "What are the names of the directors who created a movie with a 5 star rating, and what was the name of those movies?",
        "answers": [
            [
                null,
                "Snow White"
            ],
            [
                "James Cameron",
                "Avatar"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWITH max(movie.year) AS year\nMATCH (movie:`movie_1.Movie`)\nWHERE  movie.year =  year \nRETURN movie.title",
        "question": "What is the name of the most recent movie?",
        "answers": [
            [
                "Avatar"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWITH max(movie.year) AS year\nMATCH (movie:`movie_1.Movie`)\nWHERE  movie.year =  year \nRETURN movie.title",
        "question": "What is the title of the newest movie?",
        "answers": [
            [
                "Avatar"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T2:`movie_1.Movie`)-[T1:`movie_1.Rating`]-(T3:`movie_1.Reviewer`)\nWHERE T2.title = 'Gone with the Wind'\nRETURN DISTINCT T3.name",
        "question": "Find the names of all reviewers who rated Gone with the Wind.",
        "answers": [
            [
                "Sarah Martinez"
            ],
            [
                "Mike Anderson"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T2:`movie_1.Movie`)-[T1:`movie_1.Rating`]-(T3:`movie_1.Reviewer`)\nWHERE T2.title = 'Gone with the Wind'\nRETURN DISTINCT T3.name",
        "question": "What are the names of all the different reviewers who rates Gone with the Wind?",
        "answers": [
            [
                "Sarah Martinez"
            ],
            [
                "Mike Anderson"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T2:`movie_1.Movie`)-[T1:`movie_1.Rating`]-(T3:`movie_1.Reviewer`)\nWHERE T3.name = 'Sarah Martinez'\nRETURN DISTINCT T2.director",
        "question": "Find the names of all directors whose movies are rated by Sarah Martinez.",
        "answers": [
            [
                "Victor Fleming"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T2:`movie_1.Movie`)-[T1:`movie_1.Rating`]-(T3:`movie_1.Reviewer`)\nWHERE T3.name = 'Sarah Martinez'\nRETURN DISTINCT T2.director",
        "question": "What are the names of all directors whose movies have been reviewed by Sarah Martinez?",
        "answers": [
            [
                "Victor Fleming"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T2:`movie_1.Movie`)-[T1:`movie_1.Rating`]-(T3:`movie_1.Reviewer`)\nWHERE T2.director = T3.name\nRETURN DISTINCT T3.name,T2.title,T1.stars",
        "question": "For any rating where the name of reviewer is the same as the director of the movie, return the reviewer name, movie title, and number of stars.",
        "answers": [
            [
                "James Cameron",
                "Avatar",
                5
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T2:`movie_1.Movie`)-[T1:`movie_1.Rating`]-(T3:`movie_1.Reviewer`)\nWHERE T2.director = T3.name\nRETURN DISTINCT T3.name,T2.title,T1.stars",
        "question": "What are the different reviewer names, movie titles, and stars for every rating where the reviewer had the same name as the director?",
        "answers": [
            [
                "James Cameron",
                "Avatar",
                5
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWITH count(*) AS count, movie.director AS director\nWHERE count  = 1\nRETURN director",
        "question": "What are the names of the directors who made exactly one movie?",
        "answers": [
            [
                "Victor Fleming"
            ],
            [
                "George Lucas"
            ],
            [
                "Robert Wise"
            ],
            [
                null
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWITH count(*) AS count, movie.director AS director\nWHERE count  = 1\nRETURN director",
        "question": "What are the names of all directors who made one movie?",
        "answers": [
            [
                "Victor Fleming"
            ],
            [
                "George Lucas"
            ],
            [
                "Robert Wise"
            ],
            [
                null
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWHERE exists(movie.director)\nWITH count(*) AS count, movie.director AS director\nWHERE count  = 1\nRETURN director",
        "question": "What are the names of the directors who made exactly one movie excluding director NULL?",
        "answers": [
            [
                "Victor Fleming"
            ],
            [
                "George Lucas"
            ],
            [
                "Robert Wise"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWHERE exists(movie.director)\nWITH count(*) AS count, movie.director AS director\nWHERE count  = 1\nRETURN director",
        "question": "What are the names of all directors who have made one movie except for the director named NULL?",
        "answers": [
            [
                "Victor Fleming"
            ],
            [
                "George Lucas"
            ],
            [
                "Robert Wise"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T2:`movie_1.Movie`)-[T1:`movie_1.Rating`]-()\nRETURN T2.title,T2.year\nORDER BY T1.stars DESC\nLIMIT 3",
        "question": "What are the names and years of the movies that has the top 3 highest rating star?",
        "answers": [
            [
                "Snow White",
                1937
            ],
            [
                "Avatar",
                2009
            ],
            [
                "Gone with the Wind",
                1939
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T2:`movie_1.Movie`)-[T1:`movie_1.Rating`]-()\nRETURN T2.title,T2.year\nORDER BY T1.stars DESC\nLIMIT 3",
        "question": "What are the names and years released for the movies with the top 3 highest ratings?",
        "answers": [
            [
                "Snow White",
                1937
            ],
            [
                "Avatar",
                2009
            ],
            [
                "Gone with the Wind",
                1939
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T2:`movie_1.Movie`)-[T1:`movie_1.Rating`]-()\nRETURN T2.title",
        "question": "What are the titles of all movies that have rating star is between 3 and 5?",
        "answers": [
            [
                "Gone with the Wind"
            ],
            [
                "Gone with the Wind"
            ],
            [
                "The Sound of Music"
            ],
            [
                "The Sound of Music"
            ],
            [
                "E.T."
            ],
            [
                "E.T."
            ],
            [
                "Snow White"
            ],
            [
                "Snow White"
            ],
            [
                "Avatar"
            ],
            [
                "Avatar"
            ],
            [
                "Raiders of the Lost Ark"
            ],
            [
                "Raiders of the Lost Ark"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T2:`movie_1.Movie`)-[T1:`movie_1.Rating`]-()\nRETURN T2.title",
        "question": "What are the titles of all movies that have between 3 and 5 stars?",
        "answers": [
            [
                "Gone with the Wind"
            ],
            [
                "Gone with the Wind"
            ],
            [
                "The Sound of Music"
            ],
            [
                "The Sound of Music"
            ],
            [
                "E.T."
            ],
            [
                "E.T."
            ],
            [
                "Snow White"
            ],
            [
                "Snow White"
            ],
            [
                "Avatar"
            ],
            [
                "Avatar"
            ],
            [
                "Raiders of the Lost Ark"
            ],
            [
                "Raiders of the Lost Ark"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T2:`movie_1.Movie`)-[T1:`movie_1.Rating`]-(T3:`movie_1.Reviewer`)\nWHERE T3.name = 'Brittany Harris' OR T2.year > 2000\nRETURN DISTINCT T2.title",
        "question": "What are names of the movies that are either made after 2000 or reviewed by Brittany Harris?",
        "answers": [
            [
                "The Sound of Music"
            ],
            [
                "Avatar"
            ],
            [
                "Raiders of the Lost Ark"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (T2:`movie_1.Movie`)-[T1:`movie_1.Rating`]-(T3:`movie_1.Reviewer`)\nWHERE T3.name = 'Brittany Harris' OR T2.year > 2000\nRETURN DISTINCT T2.title",
        "question": "What are the names of all movies that were made after 2000 or reviewed by Brittany Harris?",
        "answers": [
            [
                "The Sound of Music"
            ],
            [
                "Avatar"
            ],
            [
                "Raiders of the Lost Ark"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWHERE movie.director = 'James Cameron' OR movie.year < 1980\nRETURN movie.title",
        "question": "What are names of the movies that are either made before 1980 or directed by James Cameron?",
        "answers": [
            [
                "Gone with the Wind"
            ],
            [
                "Star Wars"
            ],
            [
                "The Sound of Music"
            ],
            [
                "Titanic"
            ],
            [
                "Snow White"
            ],
            [
                "Avatar"
            ]
        ]
    },
    {
        "db_id": "movie_1",
        "query": "MATCH (movie:`movie_1.Movie`)\nWHERE movie.director = 'James Cameron' OR movie.year < 1980\nRETURN movie.title",
        "question": "What are the names of all movies made before 1980 or had James Cameron as the director?",
        "answers": [
            [
                "Gone with the Wind"
            ],
            [
                "Star Wars"
            ],
            [
                "The Sound of Music"
            ],
            [
                "Titanic"
            ],
            [
                "Snow White"
            ],
            [
                "Avatar"
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN count(*)",
        "question": "How many counties are there?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN count(*)",
        "question": "Count the number of countries.",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Name\nORDER BY county_public_safety.Population DESC",
        "question": "List the names of counties in descending order of population.",
        "answers": [
            [
                "Burnaby"
            ],
            [
                "Abbotsford"
            ],
            [
                "Chilliwack"
            ],
            [
                "Campbell River"
            ],
            [
                "Central Saanich"
            ],
            [
                "Castlegar"
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Name\nORDER BY county_public_safety.Population DESC",
        "question": "What are the names of the counties of public safety, ordered by population descending?",
        "answers": [
            [
                "Burnaby"
            ],
            [
                "Abbotsford"
            ],
            [
                "Chilliwack"
            ],
            [
                "Campbell River"
            ],
            [
                "Central Saanich"
            ],
            [
                "Castlegar"
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nWHERE county_public_safety.Location <> 'East'\nRETURN DISTINCT county_public_safety.Police_force",
        "question": "List the distinct police forces of counties whose location is not on east side.",
        "answers": [
            [
                "RCMP"
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nWHERE county_public_safety.Location <> 'East'\nRETURN DISTINCT county_public_safety.Police_force",
        "question": "What are the different police forces of counties that are not located in the East?",
        "answers": [
            [
                "RCMP"
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN min(county_public_safety.Crime_rate),max(county_public_safety.Crime_rate)",
        "question": "What are the minimum and maximum crime rate of counties?",
        "answers": [
            [
                49.0,
                178.0
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN min(county_public_safety.Crime_rate),max(county_public_safety.Crime_rate)",
        "question": "Return the minimum and maximum crime rates across all counties.",
        "answers": [
            [
                49.0,
                178.0
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Crime_rate\nORDER BY county_public_safety.Police_officers ASC",
        "question": "Show the crime rates of counties in ascending order of number of police officers.",
        "answers": [
            [
                150.0
            ],
            [
                49.0
            ],
            [
                178.0
            ],
            [
                174.0
            ],
            [
                118.0
            ],
            [
                123.0
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Crime_rate\nORDER BY county_public_safety.Police_officers ASC",
        "question": "What are the crime rates of counties sorted by number of offices ascending?",
        "answers": [
            [
                150.0
            ],
            [
                49.0
            ],
            [
                178.0
            ],
            [
                174.0
            ],
            [
                118.0
            ],
            [
                123.0
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (city:`county_public_safety.city`)\nRETURN city.Name\nORDER BY city.Name ASC",
        "question": "What are the names of cities in ascending alphabetical order?",
        "answers": [
            [
                "Adjuntas"
            ],
            [
                "Aguada"
            ],
            [
                "Aguadilla"
            ],
            [
                "Aguas Buenas"
            ],
            [
                "Aibonito"
            ],
            [
                "Arecibo"
            ],
            [
                "Arroyo"
            ],
            [
                "A\u00f1asco"
            ],
            [
                "Barceloneta"
            ],
            [
                "Barranquitas"
            ],
            [
                "Bayam\u00f3n"
            ],
            [
                "Cabo Rojo"
            ],
            [
                "Caguas"
            ],
            [
                "Camuy"
            ],
            [
                "Can\u00f3vanas"
            ],
            [
                "Carolina"
            ],
            [
                "Cata\u00f1o"
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (city:`county_public_safety.city`)\nRETURN city.Name\nORDER BY city.Name ASC",
        "question": "Return the names of cities, ordered alphabetically.",
        "answers": [
            [
                "Adjuntas"
            ],
            [
                "Aguada"
            ],
            [
                "Aguadilla"
            ],
            [
                "Aguas Buenas"
            ],
            [
                "Aibonito"
            ],
            [
                "Arecibo"
            ],
            [
                "Arroyo"
            ],
            [
                "A\u00f1asco"
            ],
            [
                "Barceloneta"
            ],
            [
                "Barranquitas"
            ],
            [
                "Bayam\u00f3n"
            ],
            [
                "Cabo Rojo"
            ],
            [
                "Caguas"
            ],
            [
                "Camuy"
            ],
            [
                "Can\u00f3vanas"
            ],
            [
                "Carolina"
            ],
            [
                "Cata\u00f1o"
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (city:`county_public_safety.city`)\nWHERE city.Black > 10\nRETURN city.Hispanic",
        "question": "What are the percentage of hispanics in cities with the black percentage higher than 10?",
        "answers": [
            [
                99.5
            ],
            [
                99.1
            ],
            [
                99.0
            ],
            [
                99.1
            ],
            [
                99.2
            ],
            [
                98.6
            ],
            [
                99.0
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (city:`county_public_safety.city`)\nWHERE city.Black > 10\nRETURN city.Hispanic",
        "question": "Return the hispanic percentage for cities in which the black percentage is greater than 10.",
        "answers": [
            [
                99.5
            ],
            [
                99.1
            ],
            [
                99.0
            ],
            [
                99.1
            ],
            [
                99.2
            ],
            [
                98.6
            ],
            [
                99.0
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Name\nORDER BY county_public_safety.Population DESC\nLIMIT 1",
        "question": "List the name of the county with the largest population.",
        "answers": [
            [
                "Burnaby"
            ]
        ]
    },
    {
        "db_id": "county_public_safety",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Name\nORDER BY county_public_safety.Population DESC\nLIMIT 1",
        "question": "What is the name of the county with the greatest population?",
        "answers": [
            [
                "Burnaby"
            ]
        ]
    }
]