[
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nRETURN count(*)",
        "question": "How many cinema do we have?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nRETURN count(*)",
        "question": "Count the number of cinemas.",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nRETURN cinema.Name,cinema.Openning_year,cinema.Capacity",
        "question": "Show name, opening year, and capacity for each cinema.",
        "answers": [
            [
                "Codling",
                2010,
                1100
            ],
            [
                "Carrowleagh",
                2012,
                368
            ],
            [
                "Dublin Array",
                2015,
                364
            ],
            [
                "Glenmore",
                2009,
                305
            ],
            [
                "Glenough",
                2010,
                325
            ],
            [
                "Gortahile",
                2010,
                208
            ],
            [
                "Grouse Lodge",
                2011,
                203
            ],
            [
                "Moneypoint",
                2011,
                225
            ],
            [
                "Mount Callan",
                2011,
                908
            ],
            [
                "Oriel",
                2013,
                330
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nWITH avg(cinema.Capacity) AS capacity\nMATCH (cinema:`cinema.cinema`)\nWHERE  cinema.Capacity >  capacity \nRETURN cinema.Name,cinema.Location",
        "question": "Show the cinema name and location for cinemas with capacity above average.",
        "answers": [
            [
                "Codling",
                "County Wicklow"
            ],
            [
                "Mount Callan",
                "County Clare"
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nRETURN DISTINCT cinema.Location",
        "question": "What are all the locations with a cinema?",
        "answers": [
            [
                "County Wicklow"
            ],
            [
                "County Cork"
            ],
            [
                "County Dublin"
            ],
            [
                "County Clare"
            ],
            [
                "County Tipperary"
            ],
            [
                "County Laois"
            ],
            [
                "County Louth"
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nRETURN DISTINCT cinema.Location",
        "question": "Find the distinct locations that has a cinema.",
        "answers": [
            [
                "County Wicklow"
            ],
            [
                "County Cork"
            ],
            [
                "County Dublin"
            ],
            [
                "County Clare"
            ],
            [
                "County Tipperary"
            ],
            [
                "County Laois"
            ],
            [
                "County Louth"
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nRETURN cinema.Name,cinema.Openning_year\nORDER BY cinema.Openning_year DESC",
        "question": "Show all the cinema names and opening years in descending order of opening year.",
        "answers": [
            [
                "Dublin Array",
                2015
            ],
            [
                "Oriel",
                2013
            ],
            [
                "Carrowleagh",
                2012
            ],
            [
                "Grouse Lodge",
                2011
            ],
            [
                "Moneypoint",
                2011
            ],
            [
                "Mount Callan",
                2011
            ],
            [
                "Codling",
                2010
            ],
            [
                "Glenough",
                2010
            ],
            [
                "Gortahile",
                2010
            ],
            [
                "Glenmore",
                2009
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nRETURN cinema.Name,cinema.Location\nORDER BY cinema.Capacity DESC\nLIMIT 1",
        "question": "What are the name and location of the cinema with the largest capacity?",
        "answers": [
            [
                "Codling",
                "County Wicklow"
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nWHERE cinema.Openning_year >= 2011\nRETURN avg(cinema.Capacity),min(cinema.Capacity),max(cinema.Capacity)",
        "question": "Show the average, minimum, and maximum capacity for all the cinemas opened in year 2011 or later.",
        "answers": [
            [
                399.6666666666667,
                203,
                908
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nRETURN cinema.Location,count(*)",
        "question": "Show each location and the number of cinemas there.",
        "answers": [
            [
                "County Wicklow",
                1
            ],
            [
                "County Cork",
                1
            ],
            [
                "County Dublin",
                1
            ],
            [
                "County Clare",
                3
            ],
            [
                "County Tipperary",
                2
            ],
            [
                "County Laois",
                1
            ],
            [
                "County Louth",
                1
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nWHERE cinema.Capacity > 300\nWITH cinema.Location AS Location, count(*) AS count\nWHERE count  >= 2\nRETURN Location",
        "question": "Show all the locations with at least two cinemas with capacity above 300.",
        "answers": [
            [
                "County Clare"
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nWHERE cinema.Capacity > 300\nWITH cinema.Location AS Location, count(*) AS count\nWHERE count  >= 2\nRETURN Location",
        "question": "Which locations have 2 or more cinemas with capacity over 300?",
        "answers": [
            [
                "County Clare"
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (film:`cinema.film`)\nRETURN film.Title,film.Directed_by",
        "question": "Show the title and director for all films.",
        "answers": [
            [
                "The Case of the Mystery Weekend",
                "Bill Schreiner"
            ],
            [
                "The Case of the Smart Dummy",
                "Bill Schreiner"
            ],
            [
                "The Case: Off the Record",
                "Bill Schreiner"
            ],
            [
                "The Case of the Bermuda Triangle",
                "Jesus Salvador Trevi\u00f1o"
            ],
            [
                "The Case of the Piggy Banker",
                "Bill Schreiner"
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (film:`cinema.film`)\nRETURN film.Title,film.Directed_by",
        "question": "What are the title and director of each film?",
        "answers": [
            [
                "The Case of the Mystery Weekend",
                "Bill Schreiner"
            ],
            [
                "The Case of the Smart Dummy",
                "Bill Schreiner"
            ],
            [
                "The Case: Off the Record",
                "Bill Schreiner"
            ],
            [
                "The Case of the Bermuda Triangle",
                "Jesus Salvador Trevi\u00f1o"
            ],
            [
                "The Case of the Piggy Banker",
                "Bill Schreiner"
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (film:`cinema.film`)\nRETURN DISTINCT film.Directed_by",
        "question": "Show all directors.",
        "answers": [
            [
                "Bill Schreiner"
            ],
            [
                "Jesus Salvador Trevi\u00f1o"
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (film:`cinema.film`)\nRETURN DISTINCT film.Directed_by",
        "question": "Who are all the directors?",
        "answers": [
            [
                "Bill Schreiner"
            ],
            [
                "Jesus Salvador Trevi\u00f1o"
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (film:`cinema.film`)\nRETURN film.Directed_by,count(*)",
        "question": "List all directors along with the number of films directed by each director.",
        "answers": [
            [
                "Bill Schreiner",
                4
            ],
            [
                "Jesus Salvador Trevi\u00f1o",
                1
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (T2:`cinema.film`)-[T1:`cinema.schedule`]-(T3:`cinema.cinema`)\nRETURN T3.Name,T2.Title,T1.Date,T1.Price",
        "question": "Show cinema name, film title, date, and price for each record in schedule.",
        "answers": [
            [
                "Codling",
                "The Case of the Smart Dummy",
                "21 May",
                12.99
            ],
            [
                "Codling",
                "The Case of the Mystery Weekend",
                "21 May",
                12.99
            ],
            [
                "Codling",
                "The Case: Off the Record",
                "21 Jun",
                8.99
            ],
            [
                "Carrowleagh",
                "The Case of the Mystery Weekend",
                "11 July",
                9.99
            ],
            [
                "Gortahile",
                "The Case of the Piggy Banker",
                "2 Aug",
                12.99
            ],
            [
                "Mount Callan",
                "The Case of the Bermuda Triangle",
                "20 May",
                9.99
            ],
            [
                "Oriel",
                "The Case of the Mystery Weekend",
                "19 May",
                15.99
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nWHERE cinema.Capacity > 300\nWITH cinema.Location AS Location, count(*) AS count\nWHERE count  > 1\nRETURN Location",
        "question": "Find the locations that have more than one movie theater with capacity above 300.",
        "answers": [
            [
                "County Clare"
            ]
        ]
    },
    {
        "db_id": "cinema",
        "query": "MATCH (cinema:`cinema.cinema`)\nWHERE cinema.Capacity > 300\nWITH cinema.Location AS Location, count(*) AS count\nWHERE count  > 1\nRETURN Location",
        "question": "In which locations are there more than one movie theater with capacity above 300?",
        "answers": [
            [
                "County Clare"
            ]
        ]
    },
    {
        "db_id": "products_for_hire",
        "query": "MATCH (T1:`products_for_hire.Customers`)-[]-(T2:`products_for_hire.Discount_Coupons`)\nWHERE T2.coupon_amount = 500\nRETURN T1.good_or_bad_customer",
        "question": "Are the customers holding coupons with amount 500 bad or good?",
        "answers": [
            [
                "bad"
            ]
        ]
    },
    {
        "db_id": "products_for_hire",
        "query": "MATCH (T1:`products_for_hire.Customers`)-[]-(T2:`products_for_hire.Bookings`)\nRETURN T1.customer_id,T1.first_name,count(*)",
        "question": "How many bookings did each customer make? List the customer id, first name, and the count.",
        "answers": [
            [
                3,
                "Rosalee",
                4
            ],
            [
                7,
                "Marilou",
                3
            ],
            [
                8,
                "Elinore",
                2
            ],
            [
                9,
                "German",
                2
            ],
            [
                10,
                "Layne",
                2
            ],
            [
                11,
                "Maximilian",
                1
            ],
            [
                15,
                "Jamir",
                1
            ]
        ]
    },
    {
        "db_id": "products_for_hire",
        "query": "MATCH (T2:`products_for_hire.Products_for_Hire`)-[T1:`products_for_hire.Products_Booked`]-()\nWHERE T1.booked_amount = 102.76\nRETURN T2.product_description",
        "question": "What is the product description of the product booked with an amount of 102.76?",
        "answers": [
            [
                "Anna Karenina"
            ]
        ]
    },
    {
        "db_id": "products_for_hire",
        "query": "MATCH (T1:`products_for_hire.Products_for_Hire`)-[T2:`products_for_hire.Products_Booked`]-(T3:`products_for_hire.Bookings`)\nWHERE T1.product_name = 'Book collection A'\nRETURN T3.booking_start_date,T3.booking_end_date",
        "question": "What are the start date and end date of the booking that has booked the product named 'Book collection A'?",
        "answers": [
            [
                "2017-04-28 08:35:56",
                "2018-01-18 23:54:44"
            ],
            [
                "2016-11-27 17:19:40",
                "2018-03-04 21:42:45"
            ]
        ]
    },
    {
        "db_id": "products_for_hire",
        "query": "MATCH (products_for_hire:`products_for_hire.Products_for_Hire`)\nRETURN count(DISTINCT products_for_hire.product_type_code)",
        "question": "How many different product types are there?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "products_for_hire",
        "query": "MATCH (customers:`products_for_hire.Customers`)\nWHERE customers.good_or_bad_customer = 'good'\nRETURN customers.first_name,customers.last_name,customers.gender_mf\nORDER BY customers.last_name",
        "question": "What are the first name, last name, and gender of all the good customers? Order by their last name.",
        "answers": [
            [
                "Tyler",
                "Breitenberg",
                "1"
            ],
            [
                "Elinore",
                "Crona",
                "0"
            ],
            [
                "Jailyn",
                "Gerlach",
                "0"
            ],
            [
                "Ericka",
                "Greenholt",
                "0"
            ],
            [
                "Geovany",
                "Homenick",
                "0"
            ],
            [
                "Rosalee",
                "Kessler",
                "0"
            ],
            [
                "Laury",
                "Lemke",
                "1"
            ],
            [
                "German",
                "Little",
                "1"
            ],
            [
                "Maximilian",
                "Murphy",
                "0"
            ],
            [
                "Vergie",
                "Nicolas",
                "0"
            ],
            [
                "Marilou",
                "Strosin",
                "1"
            ]
        ]
    },
    {
        "db_id": "products_for_hire",
        "query": "MATCH (payments:`products_for_hire.Payments`)\nRETURN DISTINCT payments.payment_type_code",
        "question": "What are all the distinct payment types?",
        "answers": [
            [
                "Check"
            ],
            [
                "Cash"
            ],
            [
                "Credit Card"
            ],
            [
                "Direct Debit"
            ]
        ]
    },
    {
        "db_id": "products_for_hire",
        "query": "MATCH (products_for_hire:`products_for_hire.Products_for_Hire`)\nWHERE products_for_hire.product_name =~'.*[B|b]ook.*'\nRETURN products_for_hire.daily_hire_cost",
        "question": "What are the daily hire costs for the products with substring 'Book' in its name?",
        "answers": [
            [
                26.15
            ],
            [
                15.62
            ],
            [
                39.73
            ]
        ]
    },
    {
        "db_id": "products_for_hire",
        "query": "MATCH (payments:`products_for_hire.Payments`)\nWHERE payments.amount_paid > 300 OR payments.payment_type_code = 'Check'\nRETURN payments.payment_date",
        "question": "What are the payment date of the payment with amount paid higher than 300 or with payment type is 'Check'",
        "answers": [
            [
                "2018-03-09 16:28:00"
            ],
            [
                "2018-03-03 13:39:44"
            ],
            [
                "2018-03-22 02:28:11"
            ],
            [
                "2018-03-23 20:36:04"
            ],
            [
                "2018-03-19 12:39:31"
            ],
            [
                "2018-03-02 06:25:45"
            ],
            [
                "2018-03-12 23:00:55"
            ],
            [
                "2018-03-12 23:23:56"
            ],
            [
                "2018-03-23 13:24:33"
            ],
            [
                "2018-03-03 03:07:00"
            ],
            [
                "2018-02-27 10:50:39"
            ],
            [
                "2018-03-03 14:22:51"
            ],
            [
                "2018-03-17 15:51:52"
            ],
            [
                "2018-03-17 03:07:45"
            ]
        ]
    },
    {
        "db_id": "products_for_hire",
        "query": "MATCH (products_for_hire:`products_for_hire.Products_for_Hire`)\nWHERE products_for_hire.product_type_code = 'Cutlery' AND products_for_hire.daily_hire_cost < 20\nRETURN products_for_hire.product_name,products_for_hire.product_description",
        "question": "What are the names and descriptions of the products that are of 'Cutlery' type and have daily hire cost lower than 20?",
        "answers": [
            [
                "Book collection B",
                "War and Peace"
            ]
        ]
    },
    {
        "db_id": "phone_market",
        "query": "MATCH (phone:`phone_market.phone`)\nRETURN phone.Name\nORDER BY phone.Price ASC",
        "question": "List the names of phones in ascending order of price.",
        "answers": [
            [
                "IPhone 5s"
            ],
            [
                "IPhone 6"
            ],
            [
                "IPhone 6s"
            ],
            [
                "IPhone 7"
            ],
            [
                "IPhone X"
            ]
        ]
    },
    {
        "db_id": "phone_market",
        "query": "MATCH (phone:`phone_market.phone`)\nRETURN phone.Memory_in_G,phone.Carrier",
        "question": "What are the memories and carriers of phones?",
        "answers": [
            [
                32,
                "Sprint"
            ],
            [
                128,
                "Sprint"
            ],
            [
                128,
                "TMobile"
            ],
            [
                16,
                "TMobile"
            ],
            [
                64,
                "TMobile"
            ]
        ]
    },
    {
        "db_id": "phone_market",
        "query": "MATCH (phone:`phone_market.phone`)\nWHERE phone.Memory_in_G > 32\nRETURN DISTINCT phone.Carrier",
        "question": "List the distinct carriers of phones with memories bigger than 32.",
        "answers": [
            [
                "Sprint"
            ],
            [
                "TMobile"
            ]
        ]
    },
    {
        "db_id": "phone_market",
        "query": "MATCH (phone:`phone_market.phone`)\nWHERE phone.Carrier = 'Sprint' OR phone.Carrier = 'TMobile'\nRETURN phone.Name",
        "question": "Show the names of phones with carrier either \"Sprint\" or \"TMobile\".",
        "answers": [
            [
                "IPhone 5s"
            ],
            [
                "IPhone 6"
            ],
            [
                "IPhone 6s"
            ],
            [
                "IPhone 7"
            ],
            [
                "IPhone X"
            ]
        ]
    },
    {
        "db_id": "phone_market",
        "query": "MATCH (phone:`phone_market.phone`)\nRETURN phone.Carrier\nORDER BY phone.Price DESC\nLIMIT 1",
        "question": "What is the carrier of the most expensive phone?",
        "answers": [
            [
                "TMobile"
            ]
        ]
    },
    {
        "db_id": "phone_market",
        "query": "MATCH (phone:`phone_market.phone`)\nRETURN phone.Carrier,count(*)",
        "question": "Show different carriers of phones together with the number of phones with each carrier.",
        "answers": [
            [
                "Sprint",
                2
            ],
            [
                "TMobile",
                3
            ]
        ]
    },
    {
        "db_id": "phone_market",
        "query": "MATCH (phone:`phone_market.phone`)\nRETURN phone.Carrier\nORDER BY phone.Carrier DESC\nLIMIT 1",
        "question": "Show the most frequently used carrier of the phones.",
        "answers": [
            [
                "TMobile"
            ]
        ]
    },
    {
        "db_id": "phone_market",
        "query": "MATCH (T2:`phone_market.market`)-[T1:`phone_market.phone_market`]-(T3:`phone_market.phone`)\nRETURN T3.Name,T2.District",
        "question": "Show the names of phones and the districts of markets they are on.",
        "answers": [
            [
                "IPhone 5s",
                "Ontario"
            ],
            [
                "IPhone 5s",
                "Alberta"
            ],
            [
                "IPhone 6s",
                "British Columbia"
            ],
            [
                "IPhone 7",
                "Alberta"
            ],
            [
                "IPhone X",
                "British Columbia"
            ],
            [
                "IPhone X",
                "Quebec"
            ]
        ]
    },
    {
        "db_id": "phone_market",
        "query": "MATCH (T2:`phone_market.market`)-[T1:`phone_market.phone_market`]-(T3:`phone_market.phone`)\nRETURN T3.Name,T2.District\nORDER BY T2.Ranking",
        "question": "Show the names of phones and the districts of markets they are on, in ascending order of the ranking of the market.",
        "answers": [
            [
                "IPhone 5s",
                "Alberta"
            ],
            [
                "IPhone 7",
                "Alberta"
            ],
            [
                "IPhone 5s",
                "Ontario"
            ],
            [
                "IPhone X",
                "Quebec"
            ],
            [
                "IPhone 6s",
                "British Columbia"
            ],
            [
                "IPhone X",
                "British Columbia"
            ]
        ]
    },
    {
        "db_id": "phone_market",
        "query": "MATCH (T2:`phone_market.market`)-[T1:`phone_market.phone_market`]-(T3:`phone_market.phone`)\nWHERE T2.Num_of_shops > 50\nRETURN T3.Name",
        "question": "Show the names of phones that are on market with number of shops greater than 50.",
        "answers": [
            [
                "IPhone 5s"
            ],
            [
                "IPhone X"
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (company:`gas_company.company`)\nRETURN company.Company,company.Rank\nORDER BY company.Sales_billion DESC",
        "question": "List the company name and rank for all companies in the decreasing order of their sales.",
        "answers": [
            [
                "Royal Dutch Shell",
                4
            ],
            [
                "ExxonMobil",
                1
            ],
            [
                "BP",
                11
            ],
            [
                "PetroChina",
                7
            ],
            [
                "General Electric",
                3
            ],
            [
                "Petrobras",
                10
            ],
            [
                "Berkshire Hathaway",
                8
            ],
            [
                "HSBC",
                6
            ],
            [
                "Wells Fargo",
                9
            ],
            [
                "Industrial and Commercial Bank of China",
                5
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (company:`gas_company.company`)\nWHERE company.Headquarters <> 'USA'\nRETURN company.Company,company.Main_Industry",
        "question": "Show the company name and the main industry for all companies whose headquarters are not from USA.",
        "answers": [
            [
                "Royal Dutch Shell",
                "Oil and gas"
            ],
            [
                "Industrial and Commercial Bank of China",
                "Banking"
            ],
            [
                "HSBC",
                "Banking"
            ],
            [
                "PetroChina",
                "Oil and gas"
            ],
            [
                "Petrobras",
                "Oil and gas"
            ],
            [
                "BP",
                "Oil and gas"
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (company:`gas_company.company`)\nRETURN company.Company,company.Headquarters\nORDER BY company.Market_Value DESC",
        "question": "Show all company names and headquarters in the descending order of market value.",
        "answers": [
            [
                "ExxonMobil",
                "USA"
            ],
            [
                "PetroChina",
                "China"
            ],
            [
                "Industrial and Commercial Bank of China",
                "China"
            ],
            [
                "Royal Dutch Shell",
                "Netherlands"
            ],
            [
                "General Electric",
                "USA"
            ],
            [
                "Berkshire Hathaway",
                "USA"
            ],
            [
                "Petrobras",
                "Brazil"
            ],
            [
                "Wells Fargo",
                "USA"
            ],
            [
                "HSBC",
                "UK"
            ],
            [
                "BP",
                "UK"
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (company:`gas_company.company`)\nRETURN min(company.Market_Value),max(company.Market_Value),avg(company.Market_Value)",
        "question": "Show minimum, maximum, and average market value for all companies.",
        "answers": [
            [
                147.4,
                407.4,
                225.34
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (company:`gas_company.company`)\nRETURN DISTINCT company.Main_Industry",
        "question": "Show all main industry for all companies.",
        "answers": [
            [
                "Oil and gas"
            ],
            [
                "Conglomerate"
            ],
            [
                "Banking"
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (company:`gas_company.company`)\nRETURN company.Headquarters,count(*)",
        "question": "List all headquarters and the number of companies in each headquarter.",
        "answers": [
            [
                "USA",
                4
            ],
            [
                "Netherlands",
                1
            ],
            [
                "China",
                2
            ],
            [
                "UK",
                2
            ],
            [
                "Brazil",
                1
            ]
        ]
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (company:`gas_company.company`)\nWHERE company.Main_Industry = 'Banking'\nWITH count(*) AS count, company.Headquarters AS Headquarters\nWHERE count  >= 2\nRETURN Headquarters",
        "question": "Show headquarters with at least two companies in the banking industry.",
        "answers": []
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (company:`gas_company.company`)\nWHERE company.Main_Industry = 'Banking'\nWITH count(*) AS count, company.Headquarters AS Headquarters\nWHERE count  >= 2\nRETURN Headquarters",
        "question": "What are the headquarters with at least two companies in the banking industry?",
        "answers": []
    },
    {
        "db_id": "gas_company",
        "query": "MATCH (gas_station:`gas_company.gas_station`)\nRETURN gas_station.Station_ID,gas_station.Location,gas_station.Manager_Name\nORDER BY gas_station.Open_Year",
        "question": "Show gas station id, location, and manager_name for all gas stations ordered by open year.",
        "answers": [
            [
                1,
                "Herne Hill",
                "BrianWingrave"
            ],
            [
                2,
                "Channel Hill",
                "SimonMarloe"
            ],
            [
                3,
                "Reading North",
                "Simon Cope Derek Marloe"
            ],
            [
                4,
                "Herne St",
                "Colin Denman"
            ],
            [
                5,
                "Reading",
                "Colin Denman"
            ],
            [
                6,
                "Herne Ave",
                "Tom Whit"
            ],
            [
                7,
                "Hennry Hill",
                "Bryan Taylor"
            ],
            [
                8,
                "Jane Ave",
                "BryanDenman"
            ],
            [
                9,
                "Maindy Hill",
                "Tony Bristow"
            ],
            [
                10,
                "Maindy Ave",
                "Luke Rowe"
            ],
            [
                11,
                "Newport Rd",
                "Jon Rowe"
            ]
        ]
    }
]