[
    {
        "question": "Which position is most popular among players in the tryout?",
        "query": "MATCH ()-[tryout:`soccer_2.Tryout`]-()\nWITH tryout.pPos AS pPos, count(tryout.pPos) AS count\nRETURN pPos\nORDER BY count DESC\nLIMIT 1",
        "db_id": "soccer_2",
        "answers": [
            [
                "goalie"
            ]
        ]
    },
    {
        "question": "What was the most popular position at tryouts?",
        "query": "MATCH ()-[tryout:`soccer_2.Tryout`]-()\nWITH tryout.pPos AS pPos, count(tryout.pPos) AS count\nRETURN pPos\nORDER BY count DESC\nLIMIT 1",
        "db_id": "soccer_2",
        "answers": [
            [
                "goalie"
            ]
        ]
    },
    {
        "question": "Find the states where have some college students in tryout.",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-()\nRETURN DISTINCT T1.state",
        "db_id": "soccer_2",
        "answers": [
            [
                "LA"
            ],
            [
                "AZ"
            ],
            [
                "OK"
            ],
            [
                "FL"
            ]
        ]
    },
    {
        "question": "What are the different states that have students trying out?",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-()\nRETURN DISTINCT T1.state",
        "db_id": "soccer_2",
        "answers": [
            [
                "LA"
            ],
            [
                "AZ"
            ],
            [
                "OK"
            ],
            [
                "FL"
            ]
        ]
    },
    {
        "question": "Find the states where have some college students in tryout and their decisions are yes.",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes'\nRETURN DISTINCT T1.state",
        "db_id": "soccer_2",
        "answers": [
            [
                "AZ"
            ],
            [
                "FL"
            ]
        ]
    },
    {
        "question": "Find the name of all students who were in the tryout sorted in alphabetic order.",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nRETURN T1.pName\nORDER BY T1.pName",
        "db_id": "soccer_2",
        "answers": [
            [
                "Andrew"
            ],
            [
                "Andrew"
            ],
            [
                "Blake"
            ],
            [
                "Charles"
            ],
            [
                "David"
            ],
            [
                "Eddie"
            ]
        ]
    },
    {
        "question": "Find the name and hours of the students whose tryout decision is yes.",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes'\nRETURN T1.pName,T1.HS",
        "db_id": "soccer_2",
        "answers": [
            [
                "Andrew",
                1200
            ],
            [
                "Blake",
                1600
            ]
        ]
    },
    {
        "question": "Find the states of the colleges that have students in the tryout who played in striker position.",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.pPos = 'striker'\nRETURN T1.state",
        "db_id": "soccer_2",
        "answers": [
            [
                "FL"
            ]
        ]
    },
    {
        "question": "Find the names of the students who are in the position of striker and got a yes tryout decision.",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes' AND T2.pPos = 'striker'\nRETURN T1.pName",
        "db_id": "soccer_2",
        "answers": [
            [
                "Blake"
            ]
        ]
    },
    {
        "question": "Find the state of the college which player Charles is attending.",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-(T3:`soccer_2.Player`)\nWHERE T3.pName = 'Charles'\nRETURN T1.state",
        "db_id": "soccer_2",
        "answers": [
            [
                "OK"
            ]
        ]
    },
    {
        "question": "Find the average and maximum hours for the students whose tryout decision is yes.",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes'\nRETURN avg(T1.HS),max(T1.HS)",
        "db_id": "soccer_2",
        "answers": [
            [
                1400.0,
                1600
            ]
        ]
    },
    {
        "question": "What is the average and maximum number of hours students who made the team practiced?",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes'\nRETURN avg(T1.HS),max(T1.HS)",
        "db_id": "soccer_2",
        "answers": [
            [
                1400.0,
                1600
            ]
        ]
    },
    {
        "question": "Find the average hours for the students whose tryout decision is no.",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'no'\nRETURN avg(T1.HS)",
        "db_id": "soccer_2",
        "answers": [
            [
                925.0
            ]
        ]
    },
    {
        "question": "What is the average number of hours spent practicing for students who got rejected?",
        "query": "MATCH (T1:`soccer_2.Player`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'no'\nRETURN avg(T1.HS)",
        "db_id": "soccer_2",
        "answers": [
            [
                925.0
            ]
        ]
    },
    {
        "question": "What is the state and enrollment of the colleges where have any students who got accepted in the tryout decision.",
        "query": "MATCH (T1:`soccer_2.College`)-[T2:`soccer_2.Tryout`]-()\nWHERE T2.decision = 'yes'\nRETURN DISTINCT T1.state,T1.enr",
        "db_id": "soccer_2",
        "answers": [
            [
                "AZ",
                12000
            ],
            [
                "FL",
                19000
            ]
        ]
    },
    {
        "question": "Find the names of either colleges in LA with greater than 15000 size or in state AZ with less than 13000 enrollment.",
        "query": "MATCH (college:`soccer_2.College`)\nWHERE college.enr < 13000 AND college.state = 'AZ'\nRETURN college.cName  AS cname \nUNION\nMATCH (college:`soccer_2.College`)\nWHERE college.enr > 15000 AND college.state = 'LA'\nRETURN college.cName  AS cname",
        "db_id": "soccer_2",
        "answers": [
            [
                "ASU"
            ],
            [
                "LSU"
            ]
        ]
    },
    {
        "question": "What are the names of colleges in LA that have more than 15,000 students and of colleges in AZ with less than 13,000 students?",
        "query": "MATCH (college:`soccer_2.College`)\nWHERE college.enr < 13000 AND college.state = 'AZ'\nRETURN college.cName  AS cname \nUNION\nMATCH (college:`soccer_2.College`)\nWHERE college.enr > 15000 AND college.state = 'LA'\nRETURN college.cName  AS cname",
        "db_id": "soccer_2",
        "answers": [
            [
                "ASU"
            ],
            [
                "LSU"
            ]
        ]
    },
    {
        "question": "Count the number of devices.",
        "query": "MATCH (device:`device.device`)\nRETURN count(*)",
        "db_id": "device",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "question": "List the carriers of devices in ascending alphabetical order.",
        "query": "MATCH (device:`device.device`)\nRETURN device.Carrier\nORDER BY device.Carrier ASC",
        "db_id": "device",
        "answers": [
            [
                "Bell Mobility"
            ],
            [
                "Iusacell"
            ],
            [
                "MTS Mobility"
            ],
            [
                "Telus Mobility"
            ],
            [
                "Verizon Wireless"
            ],
            [
                "Vodafone AU"
            ]
        ]
    },
    {
        "question": "What are the carriers of devices whose software platforms are not \"Android\"?",
        "query": "MATCH (device:`device.device`)\nWHERE device.Software_Platform <> 'Android'\nRETURN device.Carrier",
        "db_id": "device",
        "answers": [
            [
                "Verizon Wireless"
            ]
        ]
    },
    {
        "question": "Return the names of shops, ordered by year of opening ascending.",
        "query": "MATCH (shop:`device.shop`)\nRETURN shop.Shop_Name\nORDER BY shop.Open_Year ASC",
        "db_id": "device",
        "answers": [
            [
                "Best Buy"
            ],
            [
                "Tynewydd repair"
            ],
            [
                "Ferndale"
            ],
            [
                "Apple"
            ],
            [
                "Dinas store"
            ],
            [
                "Naval repair"
            ],
            [
                "Pentre store"
            ],
            [
                "Gelli repair"
            ],
            [
                "Dinas Device"
            ],
            [
                "Naval's shop"
            ],
            [
                "ATnT"
            ],
            [
                "National Cellphone"
            ]
        ]
    },
    {
        "question": "What are the names and location of the shops in ascending alphabetical order of name.",
        "query": "MATCH (shop:`device.shop`)\nRETURN shop.Shop_Name,shop.Location\nORDER BY shop.Shop_Name ASC",
        "db_id": "device",
        "answers": [
            [
                "ATnT",
                "Maerdy"
            ],
            [
                "Apple",
                "Blaenllechau"
            ],
            [
                "Best Buy",
                "Cymmer"
            ],
            [
                "Dinas Device",
                "Dinas"
            ],
            [
                "Dinas store",
                "Dinas"
            ],
            [
                "Ferndale",
                "Blaenllechau"
            ],
            [
                "Gelli repair",
                "Gelli"
            ],
            [
                "National Cellphone",
                "Wattstown"
            ],
            [
                "Naval repair",
                "Penygraig"
            ],
            [
                "Naval's shop",
                "Penygraig"
            ],
            [
                "Pentre store",
                "Pentre"
            ],
            [
                "Tynewydd repair",
                "Porth"
            ]
        ]
    },
    {
        "question": "Count the number of different software platforms.",
        "query": "MATCH (device:`device.device`)\nRETURN count(DISTINCT device.Software_Platform)",
        "db_id": "device",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "List the open date of open year of the shop named \"Apple\".",
        "query": "MATCH (shop:`device.shop`)\nWHERE shop.Shop_Name = 'Apple'\nRETURN shop.Open_Date,shop.Open_Year",
        "db_id": "device",
        "answers": [
            [
                "10 June",
                2009
            ]
        ]
    },
    {
        "question": "List the name of the shop with the latest open year.",
        "query": "MATCH (shop:`device.shop`)\nRETURN shop.Shop_Name\nORDER BY shop.Open_Year DESC\nLIMIT 1",
        "db_id": "device",
        "answers": [
            [
                "National Cellphone"
            ]
        ]
    },
    {
        "question": "Please show different software platforms and the corresponding number of devices using each.",
        "query": "MATCH (device:`device.device`)\nWITH device.Software_Platform AS Software_Platform, count(device.Software_Platform) AS count\nRETURN Software_Platform,count",
        "db_id": "device",
        "answers": [
            [
                "Android",
                5
            ],
            [
                "iOS",
                1
            ]
        ]
    },
    {
        "question": "Please show the software platforms of devices in descending order of the count.",
        "query": "MATCH (device:`device.device`)\nWITH device.Software_Platform AS Software_Platform, count(device.Software_Platform) AS count\nRETURN Software_Platform\nORDER BY count DESC",
        "db_id": "device",
        "answers": [
            [
                "Android"
            ],
            [
                "iOS"
            ]
        ]
    },
    {
        "question": "List the software platform shared by the greatest number of devices.",
        "query": "MATCH (device:`device.device`)\nWITH device.Software_Platform AS Software_Platform, count(device.Software_Platform) AS count\nRETURN Software_Platform\nORDER BY count DESC\nLIMIT 1",
        "db_id": "device",
        "answers": [
            [
                "Android"
            ]
        ]
    },
    {
        "question": "What is the software platform that is most common amongst all devices?",
        "query": "MATCH (device:`device.device`)\nWITH device.Software_Platform AS Software_Platform, count(device.Software_Platform) AS count\nRETURN Software_Platform\nORDER BY count DESC\nLIMIT 1",
        "db_id": "device",
        "answers": [
            [
                "Android"
            ]
        ]
    },
    {
        "question": "List the names of shops that have no devices in stock.",
        "query": "MATCH (shop:`device.shop`)\nWHERE NOT (shop:`device.shop`)-[:`device.stock`]-()\nRETURN shop.Shop_Name",
        "db_id": "device",
        "answers": [
            [
                "Pentre store"
            ],
            [
                "Tynewydd repair"
            ],
            [
                "Dinas store"
            ],
            [
                "Naval repair"
            ],
            [
                "Naval's shop"
            ],
            [
                "National Cellphone"
            ]
        ]
    },
    {
        "question": "What are the names of shops that do not have any devices in stock?",
        "query": "MATCH (shop:`device.shop`)\nWHERE NOT (shop:`device.shop`)-[:`device.stock`]-()\nRETURN shop.Shop_Name",
        "db_id": "device",
        "answers": [
            [
                "Pentre store"
            ],
            [
                "Tynewydd repair"
            ],
            [
                "Dinas store"
            ],
            [
                "Naval repair"
            ],
            [
                "Naval's shop"
            ],
            [
                "National Cellphone"
            ]
        ]
    },
    {
        "question": "List the carriers of devices that have no devices in stock.",
        "query": "MATCH (device:`device.device`)\nWHERE NOT (device:`device.device`)-[:`device.stock`]-()\nRETURN device.Carrier",
        "db_id": "device",
        "answers": [
            [
                "MTS Mobility"
            ],
            [
                "Verizon Wireless"
            ],
            [
                "Telus Mobility"
            ],
            [
                "Iusacell"
            ]
        ]
    },
    {
        "question": "What are the carriers of devices that are not in stock anywhere?",
        "query": "MATCH (device:`device.device`)\nWHERE NOT (device:`device.device`)-[:`device.stock`]-()\nRETURN device.Carrier",
        "db_id": "device",
        "answers": [
            [
                "MTS Mobility"
            ],
            [
                "Verizon Wireless"
            ],
            [
                "Telus Mobility"
            ],
            [
                "Iusacell"
            ]
        ]
    },
    {
        "question": "Count the total number of bookings made.",
        "query": "MATCH (bookings:`cre_Drama_Workshop_Groups.Bookings`)\nRETURN count(*)",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "List the order dates of all the bookings.",
        "query": "MATCH (bookings:`cre_Drama_Workshop_Groups.Bookings`)\nRETURN bookings.Order_Date",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "2016-12-12 10:43:01"
            ],
            [
                "1976-08-20 00:33:08"
            ],
            [
                "1975-11-23 06:28:47"
            ],
            [
                "1995-02-02 15:52:57"
            ],
            [
                "1995-05-10 14:49:47"
            ],
            [
                "1992-11-26 18:11:10"
            ],
            [
                "1975-12-30 14:12:32"
            ],
            [
                "1992-05-11 23:22:41"
            ],
            [
                "1971-05-11 06:53:01"
            ],
            [
                "1982-05-19 05:37:51"
            ],
            [
                "1991-10-11 17:24:15"
            ],
            [
                "1984-12-17 12:53:51"
            ],
            [
                "1996-09-14 10:17:55"
            ],
            [
                "2007-08-05 15:46:29"
            ],
            [
                "1976-10-24 07:40:47"
            ]
        ]
    },
    {
        "question": "Show all the planned delivery dates and actual delivery dates of bookings.",
        "query": "MATCH (bookings:`cre_Drama_Workshop_Groups.Bookings`)\nRETURN bookings.Planned_Delivery_Date,bookings.Actual_Delivery_Date",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "2013-03-10 18:47:05",
                "1997-11-21 10:07:40"
            ],
            [
                "2009-07-09 09:18:38",
                "1976-01-08 07:19:23"
            ],
            [
                "1989-01-05 19:24:45",
                "1990-03-16 19:38:47"
            ],
            [
                "2017-04-27 00:16:00",
                "1996-10-24 21:15:27"
            ],
            [
                "1979-07-19 19:44:01",
                "1971-01-13 13:24:52"
            ],
            [
                "2016-06-06 20:35:14",
                "2016-04-30 11:45:39"
            ],
            [
                "2008-07-18 18:15:40",
                "1983-10-09 10:48:48"
            ],
            [
                "1973-04-02 03:10:21",
                "1983-07-01 22:10:19"
            ],
            [
                "1974-05-07 21:40:39",
                "1986-10-04 13:31:10"
            ],
            [
                "1999-05-11 01:26:06",
                "1989-11-17 00:32:13"
            ],
            [
                "1978-04-10 12:23:59",
                "1983-02-07 20:27:10"
            ],
            [
                "2014-06-05 10:19:46",
                "1985-09-02 11:34:39"
            ],
            [
                "1993-04-17 23:53:01",
                "1982-04-18 02:59:08"
            ],
            [
                "1971-06-29 03:04:47",
                "1995-12-21 05:01:38"
            ],
            [
                "1972-06-25 15:51:34",
                "2004-02-22 04:37:14"
            ]
        ]
    },
    {
        "question": "Count the number of customers recorded.",
        "query": "MATCH (customers:`cre_Drama_Workshop_Groups.Customers`)\nRETURN count(*)",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "What are the phone and email for customer Harold?",
        "query": "MATCH (customers:`cre_Drama_Workshop_Groups.Customers`)\nWHERE customers.Customer_Name = 'Harold'\nRETURN customers.Customer_Phone,customers.Customer_Email_Address",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "624-096-7791",
                "jerde.harmon@example.com"
            ]
        ]
    },
    {
        "question": "Show all the Store_Name of drama workshop groups.",
        "query": "MATCH (drama_workshop_groups:`cre_Drama_Workshop_Groups.Drama_Workshop_Groups`)\nRETURN drama_workshop_groups.Store_Name",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "Amely Cafe"
            ],
            [
                "Veda Film"
            ],
            [
                "Queen Art"
            ],
            [
                "Kole Photo"
            ],
            [
                "WAT Food"
            ],
            [
                "Hansen Print"
            ],
            [
                "Roo Place"
            ],
            [
                "Uhuels Fruit"
            ],
            [
                "Harry Beef"
            ],
            [
                "Welch Flower"
            ],
            [
                "Kling Workshop"
            ],
            [
                "Orn News"
            ],
            [
                "Bednar Film"
            ],
            [
                "Kessler Exploration"
            ],
            [
                "Warino Photo"
            ]
        ]
    },
    {
        "question": "Show me the distinct payment method codes from the invoice record.",
        "query": "MATCH (invoices:`cre_Drama_Workshop_Groups.Invoices`)\nRETURN DISTINCT invoices.payment_method_code",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "MasterCard"
            ],
            [
                "Visa"
            ],
            [
                "American E"
            ]
        ]
    },
    {
        "question": "What is the description of the marketing region China?",
        "query": "MATCH (marketing_regions:`cre_Drama_Workshop_Groups.Marketing_Regions`)\nWHERE marketing_regions.Marketing_Region_Name = 'China'\nRETURN marketing_regions.Marketing_Region_Descriptrion",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "Our largest market"
            ]
        ]
    },
    {
        "question": "Find the marketing region description of China?",
        "query": "MATCH (marketing_regions:`cre_Drama_Workshop_Groups.Marketing_Regions`)\nWHERE marketing_regions.Marketing_Region_Name = 'China'\nRETURN marketing_regions.Marketing_Region_Descriptrion",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "Our largest market"
            ]
        ]
    },
    {
        "question": "Tell me the name of the most pricy product.",
        "query": "MATCH (products:`cre_Drama_Workshop_Groups.Products`)\nRETURN products.Product_Name\nORDER BY products.Product_Price DESC\nLIMIT 1",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "film"
            ]
        ]
    },
    {
        "question": "List all product names in ascending order of price.",
        "query": "MATCH (products:`cre_Drama_Workshop_Groups.Products`)\nRETURN products.Product_Name\nORDER BY products.Product_Price ASC",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "photo"
            ],
            [
                "photo"
            ],
            [
                "film"
            ],
            [
                "photo"
            ],
            [
                "film"
            ],
            [
                "dinning"
            ],
            [
                "dinning"
            ],
            [
                "film"
            ],
            [
                "dinning"
            ],
            [
                "film"
            ],
            [
                "photo"
            ],
            [
                "photo"
            ],
            [
                "film"
            ],
            [
                "photo"
            ],
            [
                "film"
            ]
        ]
    },
    {
        "question": "What is the phone number of the performer Ashley?",
        "query": "MATCH (performers:`cre_Drama_Workshop_Groups.Performers`)\nWHERE performers.Customer_Name = 'Ashley'\nRETURN performers.Customer_Phone",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "893-536-8857"
            ]
        ]
    },
    {
        "question": "Show all payment method codes and the number of orders for each code.",
        "query": "MATCH (invoices:`cre_Drama_Workshop_Groups.Invoices`)\nWITH invoices.payment_method_code AS payment_method_code, count(invoices.payment_method_code) AS count\nRETURN payment_method_code,count",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "MasterCard",
                6
            ],
            [
                "Visa",
                5
            ],
            [
                "American E",
                4
            ]
        ]
    },
    {
        "question": "What is the payment method code used by the most orders?",
        "query": "MATCH (invoices:`cre_Drama_Workshop_Groups.Invoices`)\nWITH invoices.payment_method_code AS payment_method_code, count(invoices.payment_method_code) AS count\nRETURN payment_method_code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "MasterCard"
            ]
        ]
    },
    {
        "question": "Find the number of distinct currency codes used in drama workshop groups.",
        "query": "MATCH (drama_workshop_groups:`cre_Drama_Workshop_Groups.Drama_Workshop_Groups`)\nRETURN count(DISTINCT drama_workshop_groups.Currency_Code)",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "What is the marketing region code that has the most drama workshop groups?",
        "query": "MATCH (drama_workshop_groups:`cre_Drama_Workshop_Groups.Drama_Workshop_Groups`)\nWITH drama_workshop_groups.Marketing_Region_Code AS Marketing_Region_Code, count(drama_workshop_groups.Marketing_Region_Code) AS count\nRETURN Marketing_Region_Code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "RU"
            ]
        ]
    },
    {
        "question": "What is the most frequent status of bookings?",
        "query": "MATCH (bookings:`cre_Drama_Workshop_Groups.Bookings`)\nWITH count(bookings.Status_Code) AS count, bookings.Status_Code AS Status_Code\nRETURN Status_Code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "good"
            ]
        ]
    },
    {
        "question": "Which status code is the most common of all the bookings?",
        "query": "MATCH (bookings:`cre_Drama_Workshop_Groups.Bookings`)\nWITH count(bookings.Status_Code) AS count, bookings.Status_Code AS Status_Code\nRETURN Status_Code\nORDER BY count DESC\nLIMIT 1",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                "good"
            ]
        ]
    },
    {
        "question": "What is the product ID of the most frequently ordered item on invoices?",
        "query": "MATCH (invoices:`cre_Drama_Workshop_Groups.Invoices`)\nWITH count(invoices.Product_ID) AS count, invoices.Product_ID AS Product_ID\nRETURN Product_ID\nORDER BY count DESC\nLIMIT 1",
        "db_id": "cre_Drama_Workshop_Groups",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "question": "How many songs have a lead vocal?",
        "query": "MATCH ()-[T1:`music_2.Vocals`]-(T2:`music_2.Songs`)\nWHERE T1.Type = 'lead'\nRETURN count(DISTINCT T2.Title)",
        "db_id": "music_2",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "How many songs have vocals of type lead?",
        "query": "MATCH ()-[T1:`music_2.Vocals`]-(T2:`music_2.Songs`)\nWHERE T1.Type = 'lead'\nRETURN count(DISTINCT T2.Title)",
        "db_id": "music_2",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "How many songs have a shared vocal?",
        "query": "MATCH ()-[T1:`music_2.Vocals`]-(T2:`music_2.Songs`)\nWHERE T1.Type = 'shared'\nRETURN count(DISTINCT T2.Title)",
        "db_id": "music_2",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "How many different songs have shared vocals?",
        "query": "MATCH ()-[T1:`music_2.Vocals`]-(T2:`music_2.Songs`)\nWHERE T1.Type = 'shared'\nRETURN count(DISTINCT T2.Title)",
        "db_id": "music_2",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Return the founder of Sony.",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE manufacturers.Name = 'Sony'\nRETURN manufacturers.Founder",
        "db_id": "manufactory_1",
        "answers": [
            [
                "Andy"
            ]
        ]
    },
    {
        "question": "Find all manufacturers' names and their headquarters, sorted by the ones with highest revenue first.",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN manufacturers.Name,manufacturers.Headquarter\nORDER BY manufacturers.Revenue DESC",
        "db_id": "manufactory_1",
        "answers": [
            [
                "Iomega",
                "Beijing"
            ],
            [
                "Fujitsu",
                "Taiwan"
            ],
            [
                "Sony",
                "Tokyo"
            ],
            [
                "Creative Labs",
                "Austin"
            ],
            [
                "Hewlett-Packard",
                "Los Angeles"
            ],
            [
                "Winchester",
                "Paris"
            ]
        ]
    },
    {
        "question": "Return the number of companies created by Andy.",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE manufacturers.Founder = 'Andy'\nRETURN count(*)",
        "db_id": "manufactory_1",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "question": "Give the distinct headquarters of manufacturers.",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN DISTINCT manufacturers.Headquarter",
        "db_id": "manufactory_1",
        "answers": [
            [
                "Tokyo"
            ],
            [
                "Austin"
            ],
            [
                "Los Angeles"
            ],
            [
                "Beijing"
            ],
            [
                "Taiwan"
            ],
            [
                "Paris"
            ]
        ]
    },
    {
        "question": "Find the number of manufactures that are based in Tokyo or Beijing.",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE manufacturers.Headquarter = 'Tokyo' OR manufacturers.Headquarter = 'Beijing'\nRETURN count(*)",
        "db_id": "manufactory_1",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "Find the name of companies whose revenue is between 100 and 150.",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nWHERE 100<=manufacturers.Revenue<=150\nRETURN manufacturers.Name",
        "db_id": "manufactory_1",
        "answers": [
            [
                "Sony"
            ],
            [
                "Creative Labs"
            ],
            [
                "Fujitsu"
            ]
        ]
    }
]