[
    {
        "question": "Find the name, headquarter and founder of the manufacturer that has the highest revenue.",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN manufacturers.Name,manufacturers.Headquarter,manufacturers.Founder\nORDER BY manufacturers.Revenue DESC\nLIMIT 1",
        "db_id": "manufactory_1",
        "answers": [
            [
                "Iomega",
                "Beijing",
                "Mary"
            ]
        ]
    },
    {
        "question": "Find the name, headquarter and revenue of all manufacturers sorted by their revenue in the descending order.",
        "query": "MATCH (manufacturers:`manufactory_1.Manufacturers`)\nRETURN manufacturers.Name,manufacturers.Headquarter,manufacturers.Revenue\nORDER BY manufacturers.Revenue DESC",
        "db_id": "manufactory_1",
        "answers": [
            [
                "Iomega",
                "Beijing",
                200.0
            ],
            [
                "Fujitsu",
                "Taiwan",
                130.0
            ],
            [
                "Sony",
                "Tokyo",
                120.0
            ],
            [
                "Creative Labs",
                "Austin",
                100.0
            ],
            [
                "Hewlett-Packard",
                "Los Angeles",
                50.0
            ],
            [
                "Winchester",
                "Paris",
                30.0
            ]
        ]
    },
    {
        "question": "Find the number of products for each manufacturer, showing the name of each company.",
        "query": "MATCH (T1:`manufactory_1.Products`)-[]-(T2:`manufactory_1.Manufacturers`)\nWITH count(T2.Name) AS count, T2.Name AS Name\nRETURN count,Name",
        "db_id": "manufactory_1",
        "answers": [
            [
                1,
                "Sony"
            ],
            [
                3,
                "Creative Labs"
            ],
            [
                3,
                "Hewlett-Packard"
            ],
            [
                1,
                "Iomega"
            ],
            [
                1,
                "Fujitsu"
            ],
            [
                2,
                "Winchester"
            ]
        ]
    },
    {
        "question": "Select the names of all the products in the store.",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN products.Name",
        "db_id": "manufactory_1",
        "answers": [
            [
                "Hard drive"
            ],
            [
                "Memory"
            ],
            [
                "ZIP drive"
            ],
            [
                "Floppy disk"
            ],
            [
                "Monitor"
            ],
            [
                "DVD drive"
            ],
            [
                "CD drive"
            ],
            [
                "Printer"
            ],
            [
                "Toner cartridge"
            ],
            [
                "DVD burner"
            ],
            [
                "DVD drive"
            ]
        ]
    },
    {
        "question": "Select the names and the prices of all the products in the store.",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN products.Name,products.Price",
        "db_id": "manufactory_1",
        "answers": [
            [
                "Hard drive",
                240
            ],
            [
                "Memory",
                120
            ],
            [
                "ZIP drive",
                150
            ],
            [
                "Floppy disk",
                5
            ],
            [
                "Monitor",
                240
            ],
            [
                "DVD drive",
                180
            ],
            [
                "CD drive",
                90
            ],
            [
                "Printer",
                270
            ],
            [
                "Toner cartridge",
                66
            ],
            [
                "DVD burner",
                180
            ],
            [
                "DVD drive",
                150
            ]
        ]
    },
    {
        "question": "Select the name of the products with a price less than or equal to $200.",
        "query": "MATCH (products:`manufactory_1.Products`)\nWHERE products.Price <= 200\nRETURN products.Name",
        "db_id": "manufactory_1",
        "answers": [
            [
                "Memory"
            ],
            [
                "ZIP drive"
            ],
            [
                "Floppy disk"
            ],
            [
                "DVD drive"
            ],
            [
                "CD drive"
            ],
            [
                "Toner cartridge"
            ],
            [
                "DVD burner"
            ],
            [
                "DVD drive"
            ]
        ]
    },
    {
        "question": "Compute the average price of all the products.",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN avg(products.Price)",
        "db_id": "manufactory_1",
        "answers": [
            [
                153.72727272727272
            ]
        ]
    },
    {
        "question": "Compute the average price of all products with manufacturer code equal to 2.",
        "query": "MATCH (products:`manufactory_1.Products`)\nWHERE products.Manufacturer = 2\nRETURN avg(products.Price)",
        "db_id": "manufactory_1",
        "answers": [
            [
                150.0
            ]
        ]
    },
    {
        "question": "Compute the number of products with a price larger than or equal to $180.",
        "query": "MATCH (products:`manufactory_1.Products`)\nWHERE products.Price >= 180\nRETURN count(*)",
        "db_id": "manufactory_1",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "Select the name and price of all products with a price larger than or equal to $180, and sort first by price (in descending order), and then by name  (in ascending order).",
        "query": "MATCH (products:`manufactory_1.Products`)\nWHERE products.Price >= 180\nRETURN products.Name,products.Price\nORDER BY products.Price DESC,products.Name ASC",
        "db_id": "manufactory_1",
        "answers": [
            [
                "Printer",
                270
            ],
            [
                "Hard drive",
                240
            ],
            [
                "Monitor",
                240
            ],
            [
                "DVD burner",
                180
            ],
            [
                "DVD drive",
                180
            ]
        ]
    },
    {
        "question": "Select the name and price of the cheapest product.",
        "query": "MATCH (products:`manufactory_1.Products`)\nRETURN products.Name,products.Price\nORDER BY products.Price ASC\nLIMIT 1",
        "db_id": "manufactory_1",
        "answers": [
            [
                "Floppy disk",
                5
            ]
        ]
    },
    {
        "question": "Which problem log was created most recently? Give me the log id.",
        "query": "MATCH (problem_log:`tracking_software_problems.Problem_Log`)\nRETURN problem_log.problem_log_id\nORDER BY problem_log.log_entry_date DESC\nLIMIT 1",
        "db_id": "tracking_software_problems",
        "answers": [
            [
                14
            ]
        ]
    },
    {
        "question": "Find the oldest log id and its corresponding problem id.",
        "query": "MATCH (problem_log:`tracking_software_problems.Problem_Log`)\nRETURN problem_log.problem_log_id,problem_log.problem_id\nORDER BY problem_log.log_entry_date\nLIMIT 1",
        "db_id": "tracking_software_problems",
        "answers": [
            [
                11,
                8
            ]
        ]
    },
    {
        "question": "Find all the ids and dates of the logs for the problem whose id is 10.",
        "query": "MATCH (problem_log:`tracking_software_problems.Problem_Log`)\nWHERE problem_log.problem_id = 10\nRETURN problem_log.problem_log_id,problem_log.log_entry_date",
        "db_id": "tracking_software_problems",
        "answers": [
            [
                12,
                "1997-08-31 08:19:12"
            ],
            [
                13,
                "2009-04-10 19:09:30"
            ]
        ]
    },
    {
        "question": "List all the log ids and their descriptions from the problem logs.",
        "query": "MATCH (problem_log:`tracking_software_problems.Problem_Log`)\nRETURN problem_log.problem_log_id,problem_log.log_entry_description",
        "db_id": "tracking_software_problems",
        "answers": [
            [
                1,
                "t"
            ],
            [
                2,
                "a"
            ],
            [
                3,
                "b"
            ],
            [
                4,
                "a"
            ],
            [
                5,
                "c"
            ],
            [
                6,
                "h"
            ],
            [
                7,
                "s"
            ],
            [
                8,
                "j"
            ],
            [
                9,
                "p"
            ],
            [
                10,
                "d"
            ],
            [
                11,
                "w"
            ],
            [
                12,
                "c"
            ],
            [
                13,
                "q"
            ],
            [
                14,
                "a"
            ],
            [
                15,
                "v"
            ]
        ]
    },
    {
        "question": "List the first and last names of all distinct staff members who are assigned to the problem whose id is 1.",
        "query": "MATCH (T1:`tracking_software_problems.Staff`)-[]-(T2:`tracking_software_problems.Problem_Log`)\nWHERE T2.problem_id = 1\nRETURN DISTINCT T1.staff_first_name,T1.staff_last_name",
        "db_id": "tracking_software_problems",
        "answers": [
            [
                "Stevie",
                "Mante"
            ],
            [
                "Lysanne",
                "Turcotte"
            ],
            [
                "Kristian",
                "Lynch"
            ]
        ]
    },
    {
        "question": "List the problem id and log id which are assigned to the staff named Rylan Homenick.",
        "query": "MATCH (T1:`tracking_software_problems.Staff`)-[]-(T2:`tracking_software_problems.Problem_Log`)\nWHERE T1.staff_first_name = 'Rylan' AND T1.staff_last_name = 'Homenick'\nRETURN DISTINCT T2.problem_id,T2.problem_log_id",
        "db_id": "tracking_software_problems",
        "answers": [
            [
                8,
                2
            ],
            [
                11,
                1
            ]
        ]
    },
    {
        "question": "Which problem id and log id are assigned to the staff named Rylan Homenick?",
        "query": "MATCH (T1:`tracking_software_problems.Staff`)-[]-(T2:`tracking_software_problems.Problem_Log`)\nWHERE T1.staff_first_name = 'Rylan' AND T1.staff_last_name = 'Homenick'\nRETURN DISTINCT T2.problem_id,T2.problem_log_id",
        "db_id": "tracking_software_problems",
        "answers": [
            [
                8,
                2
            ],
            [
                11,
                1
            ]
        ]
    },
    {
        "question": "How many problems are there for product voluptatem?",
        "query": "MATCH (T1:`tracking_software_problems.Product`)-[]-(T2:`tracking_software_problems.Problems`)\nWHERE T1.product_name = 'voluptatem'\nRETURN count(*)",
        "db_id": "tracking_software_problems",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Find the ids of the problems reported after 1978-06-26.",
        "query": "MATCH (problems:`tracking_software_problems.Problems`)\nWHERE problems.date_problem_reported > \"1978-06-26\"\nRETURN problems.problem_id",
        "db_id": "tracking_software_problems",
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ],
            [
                5
            ],
            [
                6
            ],
            [
                7
            ],
            [
                9
            ],
            [
                10
            ]
        ]
    },
    {
        "question": "Which problems are reported before 1978-06-26? Give me the ids of the problems.",
        "query": "MATCH (problems:`tracking_software_problems.Problems`)\nWHERE problems.date_problem_reported < \"1978-06-26\"\nRETURN problems.problem_id",
        "db_id": "tracking_software_problems",
        "answers": [
            [
                4
            ],
            [
                8
            ],
            [
                11
            ],
            [
                12
            ],
            [
                13
            ],
            [
                14
            ],
            [
                15
            ]
        ]
    },
    {
        "question": "Sort all the distinct product names in alphabetical order.",
        "query": "MATCH (product:`tracking_software_problems.Product`)\nRETURN DISTINCT product.product_name\nORDER BY product.product_name",
        "db_id": "tracking_software_problems",
        "answers": [
            [
                "blog"
            ],
            [
                "chat"
            ],
            [
                "doulingo"
            ],
            [
                "game"
            ],
            [
                "hangout"
            ],
            [
                "keep"
            ],
            [
                "learn"
            ],
            [
                "life"
            ],
            [
                "messager"
            ],
            [
                "rose"
            ],
            [
                "snapchat"
            ],
            [
                "teach"
            ],
            [
                "twitter"
            ],
            [
                "wechat"
            ],
            [
                "yellow"
            ]
        ]
    },
    {
        "question": "Show name, address road, and city for all branches sorted by open year.",
        "query": "MATCH (branch:`shop_membership.branch`)\nRETURN branch.Name,branch.Address_road,branch.City\nORDER BY branch.Open_year",
        "db_id": "shop_membership",
        "answers": [
            [
                "Alexandre",
                "Valleys Place",
                "London"
            ],
            [
                "Popert",
                "Oaks Crescent",
                "London"
            ],
            [
                "Zytogorski",
                "Abbey Rise",
                "Oxford"
            ],
            [
                "Brooke Greville",
                "Glebe Street",
                "Oxford"
            ],
            [
                "Cochrane",
                "Brampton Road",
                "London"
            ],
            [
                "Stanley",
                "Abbott Street",
                "London"
            ],
            [
                "Taverner",
                "Cecilia Avenue",
                "Oxford"
            ],
            [
                "Saint Amant",
                "Concord Road",
                "London"
            ]
        ]
    },
    {
        "question": "List all open years when at least two shops are opened.",
        "query": "MATCH (branch:`shop_membership.branch`)\nWITH count(*) AS count, branch.Open_year AS Open_year\nWHERE count  >= 2\nRETURN Open_year",
        "db_id": "shop_membership",
        "answers": [
            [
                "2009"
            ]
        ]
    },
    {
        "question": "Show minimum and maximum amount of memberships for all branches opened in 2011 or located at city London.",
        "query": "MATCH (branch:`shop_membership.branch`)\nWHERE branch.Open_year = 2011 OR branch.City = 'London'\nRETURN min(branch.membership_amount),max(branch.membership_amount)",
        "db_id": "shop_membership",
        "answers": [
            [
                "11",
                "91"
            ]
        ]
    },
    {
        "question": "Show card number, name, and hometown for all members in a descending order of level.",
        "query": "MATCH (member:`shop_membership.member`)\nRETURN member.Card_Number,member.Name,member.Hometown\nORDER BY member.Level DESC",
        "db_id": "shop_membership",
        "answers": [
            [
                "LE99",
                "Jeremy Jarmon",
                "Collierville, Tennessee"
            ],
            [
                "LT98",
                "Myron Pryor",
                "Louisville, Kentucky"
            ],
            [
                "RT91",
                "Corey Peters",
                "Louisville, Kentucky"
            ],
            [
                "RE95",
                "Ventrell Jenkins",
                "Columbia, South Carolina"
            ],
            [
                "OLB56",
                "Braxton Kelley",
                "LaGrange, Georgia"
            ],
            [
                "SLB51",
                "Johnny Williams",
                "Jacksonville, Florida"
            ],
            [
                "RCB32",
                "Trevard Lindley",
                "Hiram, Georgia"
            ],
            [
                "LCB7",
                "David Jones",
                "Red Jacket, West Virginia"
            ],
            [
                "MLB4",
                "Micah Johnson",
                "Fort Campbell, Kentucky"
            ],
            [
                "FS10",
                "Matt Lentz",
                "Simpsonville, South Carolina"
            ]
        ]
    },
    {
        "question": "Show the membership level with most number of members.",
        "query": "MATCH (member:`shop_membership.member`)\nWITH count(member.Level) AS count, member.Level AS Level\nRETURN Level\nORDER BY count DESC\nLIMIT 1",
        "db_id": "shop_membership",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "question": "Find the number of students in total.",
        "query": "MATCH (student:`voter_2.Student`)\nRETURN count(*)",
        "db_id": "voter_2",
        "answers": [
            [
                34
            ]
        ]
    },
    {
        "question": "Find the number of voting records in total.",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN count(*)",
        "db_id": "voter_2",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "question": "Find the distinct number of president votes.",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN count(DISTINCT voting_record.President_Vote)",
        "db_id": "voter_2",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "Find the maximum age of all the students.",
        "query": "MATCH (student:`voter_2.Student`)\nRETURN max(student.Age)",
        "db_id": "voter_2",
        "answers": [
            [
                27
            ]
        ]
    },
    {
        "question": "Find the last names of students with major 50.",
        "query": "MATCH (student:`voter_2.Student`)\nWHERE student.Major = 50\nRETURN student.LName",
        "db_id": "voter_2",
        "answers": [
            [
                "Epp"
            ],
            [
                "Schmidt"
            ]
        ]
    },
    {
        "question": "Find the first names of students with age above 22.",
        "query": "MATCH (student:`voter_2.Student`)\nWHERE student.Age > 22\nRETURN student.Fname",
        "db_id": "voter_2",
        "answers": [
            [
                "Paul"
            ],
            [
                "Bruce"
            ],
            [
                "Sarah"
            ]
        ]
    },
    {
        "question": "What are the majors of male (sex is M) students?",
        "query": "MATCH (student:`voter_2.Student`)\nWHERE student.Sex = 'M'\nRETURN student.Major",
        "db_id": "voter_2",
        "answers": [
            [
                600
            ],
            [
                600
            ],
            [
                600
            ],
            [
                600
            ],
            [
                600
            ],
            [
                600
            ],
            [
                600
            ],
            [
                600
            ],
            [
                600
            ],
            [
                600
            ],
            [
                600
            ],
            [
                600
            ],
            [
                520
            ],
            [
                520
            ],
            [
                540
            ],
            [
                520
            ],
            [
                520
            ],
            [
                520
            ],
            [
                520
            ],
            [
                550
            ],
            [
                100
            ],
            [
                550
            ],
            [
                550
            ],
            [
                50
            ]
        ]
    },
    {
        "question": "What is the average age of female (sex is F) students?",
        "query": "MATCH (student:`voter_2.Student`)\nWHERE student.Sex = 'F'\nRETURN avg(student.Age)",
        "db_id": "voter_2",
        "answers": [
            [
                19.7
            ]
        ]
    },
    {
        "question": "Tell me the ages of the oldest and youngest students studying major 600.",
        "query": "MATCH (student:`voter_2.Student`)\nWHERE student.Major = 600\nRETURN max(student.Age),min(student.Age)",
        "db_id": "voter_2",
        "answers": [
            [
                27,
                16
            ]
        ]
    },
    {
        "question": "Who are the advisors for students that live in a city with city code \"BAL\"?",
        "query": "MATCH (student:`voter_2.Student`)\nWHERE student.city_code = 'BAL'\nRETURN student.Advisor",
        "db_id": "voter_2",
        "answers": [
            [
                1121
            ],
            [
                1148
            ],
            [
                9172
            ],
            [
                7271
            ]
        ]
    },
    {
        "question": "What are the distinct secretary votes in the fall election cycle?",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nWHERE voting_record.Election_Cycle = 'Fall'\nRETURN DISTINCT voting_record.Secretary_Vote",
        "db_id": "voter_2",
        "answers": [
            [
                1010
            ],
            [
                1020
            ]
        ]
    },
    {
        "question": "Show all the distinct president votes made on 08/30/2015.",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nWHERE voting_record.Registration_Date = \"08/30/2015\"\nRETURN DISTINCT voting_record.President_Vote",
        "db_id": "voter_2",
        "answers": [
            [
                1004
            ]
        ]
    },
    {
        "question": "Report the distinct registration date and the election cycle.",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN DISTINCT voting_record.Registration_Date,voting_record.Election_Cycle",
        "db_id": "voter_2",
        "answers": [
            [
                "08/30/2015",
                "Spring"
            ],
            [
                "08/30/2014",
                "Spring"
            ],
            [
                "08/30/2013",
                "Spring"
            ],
            [
                "08/30/2012",
                "Spring"
            ],
            [
                "08/30/2015",
                "Fall"
            ],
            [
                "08/30/2014",
                "Fall"
            ],
            [
                "08/30/2013",
                "Fall"
            ],
            [
                "08/30/2012",
                "Fall"
            ]
        ]
    },
    {
        "question": "Report the distinct president vote and the vice president vote.",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nRETURN DISTINCT voting_record.President_Vote,voting_record.Vice_President_Vote",
        "db_id": "voter_2",
        "answers": [
            [
                1004,
                1007
            ],
            [
                1014,
                1007
            ],
            [
                1004,
                1017
            ],
            [
                1024,
                1017
            ]
        ]
    },
    {
        "question": "For each advisor, report the total number of students advised by him or her.",
        "query": "MATCH (student:`voter_2.Student`)\nWITH count(student.Advisor) AS count, student.Advisor AS Advisor\nRETURN Advisor,count",
        "db_id": "voter_2",
        "answers": [
            [
                1121,
                3
            ],
            [
                7712,
                1
            ],
            [
                7792,
                1
            ],
            [
                8423,
                1
            ],
            [
                1148,
                3
            ],
            [
                8918,
                1
            ],
            [
                9172,
                1
            ],
            [
                2192,
                4
            ],
            [
                7723,
                1
            ],
            [
                8741,
                1
            ],
            [
                8721,
                1
            ],
            [
                7271,
                2
            ],
            [
                8722,
                3
            ],
            [
                7134,
                2
            ],
            [
                8723,
                1
            ],
            [
                2311,
                3
            ],
            [
                8772,
                3
            ],
            [
                5718,
                2
            ]
        ]
    },
    {
        "question": "Report all advisors that advise more than 2 students.",
        "query": "MATCH (student:`voter_2.Student`)\nWITH count(*) AS count, student.Advisor AS Advisor\nWHERE count  > 2\nRETURN Advisor",
        "db_id": "voter_2",
        "answers": [
            [
                1121
            ],
            [
                1148
            ],
            [
                2192
            ],
            [
                8722
            ],
            [
                2311
            ],
            [
                8772
            ]
        ]
    },
    {
        "question": "Report all majors that have less than 3 students.",
        "query": "MATCH (student:`voter_2.Student`)\nWITH count(*) AS count, student.Major AS Major\nWHERE count  < 3\nRETURN Major",
        "db_id": "voter_2",
        "answers": [
            [
                540
            ],
            [
                100
            ],
            [
                50
            ]
        ]
    },
    {
        "question": "For each election cycle, report the number of voting records.",
        "query": "MATCH (voting_record:`voter_2.Voting_record`)\nWITH voting_record.Election_Cycle AS Election_Cycle, count(voting_record.Election_Cycle) AS count\nRETURN Election_Cycle,count",
        "db_id": "voter_2",
        "answers": [
            [
                "Spring",
                5
            ],
            [
                "Fall",
                5
            ]
        ]
    },
    {
        "question": "Find the major that is studied by the largest number of students.",
        "query": "MATCH (student:`voter_2.Student`)\nWITH student.Major AS Major, count(student.Major) AS count\nRETURN Major\nORDER BY count DESC\nLIMIT 1",
        "db_id": "voter_2",
        "answers": [
            [
                600
            ]
        ]
    },
    {
        "question": "What is the most common major among female (sex is F) students?",
        "query": "MATCH (student:`voter_2.Student`)\nWHERE student.Sex = 'F'\nWITH student.Major AS Major, count(student.Major) AS count\nRETURN Major\nORDER BY count DESC\nLIMIT 1",
        "db_id": "voter_2",
        "answers": [
            [
                600
            ]
        ]
    },
    {
        "question": "Count the number of products.",
        "query": "MATCH (products:`products_gen_characteristics.Products`)\nRETURN count(*)",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Count the number of colors.",
        "query": "MATCH (ref_colors:`products_gen_characteristics.Ref_Colors`)\nRETURN count(*)",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "question": "Count the number of characteristics.",
        "query": "MATCH (characteristics:`products_gen_characteristics.Characteristics`)\nRETURN count(*)",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "question": "Return the names and typical buying prices for all products.",
        "query": "MATCH (products:`products_gen_characteristics.Products`)\nRETURN products.product_name,products.typical_buying_price",
        "db_id": "products_gen_characteristics",
        "answers": [
            [
                "cumin",
                ""
            ],
            [
                "peper",
                "352447.2874677"
            ],
            [
                "basil",
                "503.8431967"
            ],
            [
                "borage",
                ""
            ],
            [
                "chili",
                ""
            ],
            [
                "ginger",
                "5.578"
            ],
            [
                "sesame",
                "1284268.0659"
            ],
            [
                "caraway",
                "24493"
            ],
            [
                "catnip",
                "12008702.623"
            ],
            [
                "flax",
                "339404395.7"
            ],
            [
                "chervil",
                ""
            ],
            [
                "voluptatem",
                "162"
            ],
            [
                "cinnam",
                "1686539.4"
            ],
            [
                "lotus",
                "43221310.465574"
            ],
            [
                "laurel",
                ""
            ]
        ]
    }
]