[
    {
        "db_id": "railway",
        "query": "MATCH (manager:`railway.manager`)\nWHERE manager.Country <> 'Australia\t'\nRETURN max(manager.Level)",
        "question": "What is the maximum level of managers in countries that are not \"Australia\"?",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (manager:`railway.manager`)\nRETURN avg(manager.Age)",
        "question": "What is the average age for all managers?",
        "answers": [
            [
                49.142857142857146
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (manager:`railway.manager`)\nRETURN manager.Name\nORDER BY manager.Level ASC",
        "question": "What are the names of managers in ascending order of level?",
        "answers": [
            [
                "Ben Curtis"
            ],
            [
                "Todd Hamilton"
            ],
            [
                "Tiger Woods"
            ],
            [
                "David Duval"
            ],
            [
                "Sandy Lyle"
            ],
            [
                "Nick Faldo"
            ],
            [
                "Greg Norman"
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (train:`railway.train`)\nRETURN train.Name,train.Arrival",
        "question": "What are the names and arrival times of trains?",
        "answers": [
            [
                "Wardha-Ballarshah Pass",
                "08:54"
            ],
            [
                "Sewagram Exp",
                "09:08"
            ],
            [
                "Ballarshah-Mumbai Pass",
                "09:48"
            ],
            [
                "Nagpur-Kazipet Pass",
                "23:44"
            ],
            [
                "Kazipet-Nagpur Pass",
                "05:09"
            ],
            [
                "Lucknow-Chennai Exp",
                "13:04"
            ],
            [
                "Andaman Exp",
                "13:04"
            ],
            [
                "Andaman Exp",
                "23:39"
            ],
            [
                "Nandigram Exp",
                "13:28"
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (manager:`railway.manager`)\nRETURN manager.Name\nORDER BY manager.Age DESC\nLIMIT 1",
        "question": "What is the name of the oldest manager?",
        "answers": [
            [
                "Todd Hamilton"
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (T1:`railway.railway`)-[]-(T2:`railway.train`)\nRETURN T2.Name,T1.Location",
        "question": "Show the names of trains and locations of railways they are in.",
        "answers": [
            [
                "Wardha-Ballarshah Pass",
                "York"
            ],
            [
                "Sewagram Exp",
                "York"
            ],
            [
                "Ballarshah-Mumbai Pass",
                "Bo'ness"
            ],
            [
                "Nagpur-Kazipet Pass",
                "Barrow Hill"
            ],
            [
                "Kazipet-Nagpur Pass",
                "Bressingham"
            ],
            [
                "Lucknow-Chennai Exp",
                "Bressingham"
            ],
            [
                "Andaman Exp",
                "Shildon"
            ],
            [
                "Andaman Exp",
                "Bressingham"
            ],
            [
                "Nandigram Exp",
                "Basingstoke"
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (T1:`railway.railway`)-[]-(T2:`railway.train`)\nWHERE T2.Name = 'Andaman Exp'\nRETURN T1.Builder",
        "question": "Show the builder of railways associated with the trains named \"Andaman Exp\".",
        "answers": [
            [
                "GWR Swindon"
            ],
            [
                "Stephenson"
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (T1:`railway.railway`)-[]-(T2:`railway.train`)\nWITH count(*) AS count, T1.Location AS Location, T2.Railway_ID AS Railway_ID\nWHERE count  > 1\nRETURN Railway_ID,Location",
        "question": "Show id and location of railways that are associated with more than one train.",
        "answers": [
            [
                1,
                "York"
            ],
            [
                5,
                "Bressingham"
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (railway:`railway.railway`)\nRETURN railway.Builder,count(*)",
        "question": "Show different builders of railways, along with the corresponding number of railways using each builder.",
        "answers": [
            [
                "SECR Ashford",
                1
            ],
            [
                "MR Derby",
                1
            ],
            [
                "GNR Doncaster",
                1
            ],
            [
                "GWR Swindon",
                2
            ],
            [
                "GER Stratford",
                1
            ],
            [
                "GER Hartford",
                1
            ],
            [
                "Swindon Works",
                1
            ],
            [
                "Stephenson",
                1
            ],
            [
                "Avonside",
                1
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (railway:`railway.railway`)\nRETURN railway.Location,count(*)",
        "question": "Show different locations of railways along with the corresponding number of railways at each location.",
        "answers": [
            [
                "York",
                1
            ],
            [
                "Bo'ness",
                1
            ],
            [
                "Barrow Hill",
                2
            ],
            [
                "Toddington",
                1
            ],
            [
                "Bressingham",
                2
            ],
            [
                "Shildon",
                1
            ],
            [
                "Swindon",
                1
            ],
            [
                "Basingstoke",
                1
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (railway:`railway.railway`)\nWITH count(*) AS count, railway.Location AS Location\nWHERE count  > 1\nRETURN Location",
        "question": "Show the locations that have more than one railways.",
        "answers": [
            [
                "Barrow Hill"
            ],
            [
                "Bressingham"
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (railway:`railway.railway`)\nWHERE NOT (railway)-[]-(:`railway.train`)    \nRETURN railway.ObjectNumber",
        "question": "List the object number of railways that do not have any trains.",
        "answers": [
            [
                "1978-7025"
            ],
            [
                "1978-7026"
            ],
            [
                "1978-7027"
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (manager:`railway.manager`)\nRETURN DISTINCT manager.Country",
        "question": "Show the distinct countries of managers.",
        "answers": [
            [
                "United States"
            ],
            [
                "Scotland"
            ],
            [
                "England"
            ],
            [
                "Australia"
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (manager:`railway.manager`)\nRETURN manager.Working_year_starts\nORDER BY manager.Level DESC",
        "question": "Show the working years of managers in descending order of their level.",
        "answers": [
            [
                "1993"
            ],
            [
                "1999"
            ],
            [
                "1985"
            ],
            [
                "2001"
            ],
            [
                "2003"
            ],
            [
                "2004"
            ],
            [
                "2006"
            ]
        ]
    },
    {
        "db_id": "railway",
        "query": "MATCH (manager:`railway.manager`)\nWHERE manager.Age > 50 OR manager.Age < 46\nRETURN manager.Country",
        "question": "Show the countries that have managers of age above 50 or below 46.",
        "answers": [
            [
                "United States"
            ],
            [
                "United States"
            ],
            [
                "England"
            ],
            [
                "Australia"
            ]
        ]
    },
    {
        "db_id": "customers_and_products_contacts",
        "query": "MATCH (addresses:`customers_and_products_contacts.Addresses`)\nWHERE addresses.country = 'USA'\nRETURN count(*)",
        "question": "How many addresses are there in country USA?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "customers_and_products_contacts",
        "query": "MATCH (addresses:`customers_and_products_contacts.Addresses`)\nRETURN DISTINCT addresses.city",
        "question": "Show all distinct cities in the address record.",
        "answers": [
            [
                "Hertafurt"
            ],
            [
                "Edgardoberg"
            ],
            [
                "Gilbertmouth"
            ],
            [
                "Lake Floyd"
            ],
            [
                "Gibsonfurt"
            ],
            [
                "North Jairo"
            ],
            [
                "East Rickey"
            ],
            [
                "West Kaiatown"
            ],
            [
                "Agustinstad"
            ],
            [
                "Gleasonland"
            ],
            [
                "Lake Katheryn"
            ],
            [
                "North Lisandroport"
            ],
            [
                "Estaland"
            ],
            [
                "West Muriel"
            ],
            [
                "Port Montytown"
            ]
        ]
    },
    {
        "db_id": "customers_and_products_contacts",
        "query": "MATCH (addresses:`customers_and_products_contacts.Addresses`)\nRETURN addresses.state_province_county,count(*)",
        "question": "Show each state and the number of addresses in each state.",
        "answers": [
            [
                "Nevada",
                1
            ],
            [
                "Colorado",
                1
            ],
            [
                "Virginia",
                1
            ],
            [
                "Oklahoma",
                1
            ],
            [
                "District of Columbia",
                1
            ],
            [
                "Maryland",
                1
            ],
            [
                "Louisiana",
                1
            ],
            [
                "Oregon",
                1
            ],
            [
                "Illinois",
                1
            ],
            [
                "Kentucky",
                2
            ],
            [
                "Maine",
                1
            ],
            [
                "Idaho",
                1
            ],
            [
                "Vermont",
                1
            ],
            [
                "SouthDakota",
                1
            ]
        ]
    },
    {
        "db_id": "customers_and_products_contacts",
        "query": "MATCH (products:`customers_and_products_contacts.Products`)\nWITH count(*) AS count, products.product_type_code AS product_type_code\nWHERE count  >= 2\nRETURN product_type_code",
        "question": "Show the product type codes which have at least two products.",
        "answers": [
            [
                "Hardware"
            ],
            [
                "Clothes"
            ]
        ]
    },
    {
        "db_id": "customers_and_products_contacts",
        "query": "MATCH (customers:`customers_and_products_contacts.Customers`)\nRETURN customers.customer_name,customers.customer_phone,customers.payment_method_code\nORDER BY customers.customer_number DESC",
        "question": "Show the name, phone, and payment method code for all customers in descending order of customer number.",
        "answers": [
            [
                "Buford",
                "(192)144-4687",
                "Credit Card"
            ],
            [
                "Cheyenne",
                "009-136-4509x19635",
                "Direct Debit"
            ],
            [
                "Cleo",
                "1-202-928-5395",
                "Credit Card"
            ],
            [
                "Raymond",
                "1-513-427-0125",
                "Direct Debit"
            ],
            [
                "Orion",
                "479-171-6355x66065",
                "Direct Debit"
            ],
            [
                "Madaline",
                "097-514-4641",
                "Credit Card"
            ],
            [
                "Brenna",
                "1-271-345-4681x1131",
                "Credit Card"
            ],
            [
                "Sterling",
                "896.685.8228x2786",
                "Credit Card"
            ],
            [
                "Lela",
                "838.718.8618x23239",
                "Credit Card"
            ],
            [
                "Ottilie",
                "393-750-2077x72779",
                "Direct Debit"
            ],
            [
                "Caterina",
                "387.053.1225",
                "Direct Debit"
            ],
            [
                "Kayley",
                "+87(9)5279161988",
                "Credit Card"
            ],
            [
                "Melissa",
                "529.148.1926",
                "Direct Debit"
            ],
            [
                "Cecelia",
                "672-559-0630x7875",
                "Direct Debit"
            ],
            [
                "Shany",
                "936.929.9929",
                "Direct Debit"
            ]
        ]
    },
    {
        "db_id": "customers_and_products_contacts",
        "query": "MATCH (products:`customers_and_products_contacts.Products`)\nWITH avg(products.product_price) AS product_price\nMATCH (products:`customers_and_products_contacts.Products`)\nWHERE  products.product_price >  product_price \nRETURN count(*)",
        "question": "How many products have a price higher than the average?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "customers_and_products_contacts",
        "query": "MATCH (T1:`customers_and_products_contacts.Customers`)-[]-(T2:`customers_and_products_contacts.Customer_Orders`)\nWHERE T1.payment_method_code = 'Credit Card'\nWITH count(*) AS count, T1.customer_name AS customer_name\nWHERE count  > 2\nRETURN customer_name",
        "question": "Show the names of customers who use Credit Card payment method and have more than 2 orders.",
        "answers": [
            [
                "Sterling"
            ],
            [
                "Cleo"
            ]
        ]
    },
    {
        "db_id": "customers_and_products_contacts",
        "query": "MATCH (products:`customers_and_products_contacts.Products`)\nWHERE products.product_price > 1000 OR products.product_price < 500\nRETURN products.product_type_code,products.product_name",
        "question": "Show the product type and name for the products with price higher than 1000 or lower than 500.",
        "answers": [
            [
                "Hardware",
                "Apple"
            ],
            [
                "Clothes",
                "jcrew"
            ],
            [
                "Hardware",
                "Apple"
            ],
            [
                "Hardware",
                "Apple"
            ],
            [
                "Clothes",
                "jcrew"
            ],
            [
                "Hardware",
                "Apple"
            ],
            [
                "Hardware",
                "Apple"
            ],
            [
                "Hardware",
                "Sony"
            ],
            [
                "Hardware",
                "Sony"
            ],
            [
                "Clothes",
                "jcrew"
            ],
            [
                "Clothes",
                "gucci"
            ],
            [
                "Hardware",
                "Sony"
            ],
            [
                "Clothes",
                "gucci"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nWHERE dorm.gender = 'F'\nRETURN dorm.dorm_name",
        "question": "Find the name of dorms only for female (F gender).",
        "answers": [
            [
                "Anonymous Donor Hall"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nWHERE dorm.gender = 'F'\nRETURN dorm.dorm_name",
        "question": "What are the names of the all-female dorms?",
        "answers": [
            [
                "Anonymous Donor Hall"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nWHERE dorm.student_capacity > 300\nRETURN dorm.dorm_name",
        "question": "Find the name of dorms that can accommodate more than 300 students.",
        "answers": [
            [
                "Fawlty Towers"
            ],
            [
                "Dorm-plex 2000"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nWHERE dorm.student_capacity > 300\nRETURN dorm.dorm_name",
        "question": "What are the names of all the dorms that can accomdate more than 300 students?",
        "answers": [
            [
                "Fawlty Towers"
            ],
            [
                "Dorm-plex 2000"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWHERE student.Sex = 'F' AND student.Age < 25\nRETURN count(*)",
        "question": "How many female students (sex is F) whose age is below 25?",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWHERE student.Sex = 'F' AND student.Age < 25\nRETURN count(*)",
        "question": "How many girl students who are younger than 25?",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWHERE student.Age > 20\nRETURN student.Fname",
        "question": "Find the first name of students who is older than 20.",
        "answers": [
            [
                "Shiela"
            ],
            [
                "Paul"
            ],
            [
                "David"
            ],
            [
                "Bruce"
            ],
            [
                "Ian"
            ],
            [
                "Lisa"
            ],
            [
                "Sarah"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWHERE student.Age > 20\nRETURN student.Fname",
        "question": "What are the first names of all students who are older than 20?",
        "answers": [
            [
                "Shiela"
            ],
            [
                "Paul"
            ],
            [
                "David"
            ],
            [
                "Bruce"
            ],
            [
                "Ian"
            ],
            [
                "Lisa"
            ],
            [
                "Sarah"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nRETURN count(*)",
        "question": "How many dorms are there?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nRETURN count(*)",
        "question": "How many dorms are in the database?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm_amenity:`dorm_1.Dorm_amenity`)\nRETURN count(*)",
        "question": "Find the number of distinct amenities.",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm_amenity:`dorm_1.Dorm_amenity`)\nRETURN count(*)",
        "question": "How many diffrent dorm amenities are there?",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nRETURN count(*)",
        "question": "How many students exist?",
        "answers": [
            [
                34
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nRETURN avg(student.Age),student.city_code",
        "question": "Find the average age of all students living in the each city.",
        "answers": [
            [
                18.5,
                "BAL"
            ],
            [
                18.0,
                "HKG"
            ],
            [
                21.666666666666668,
                "WAS"
            ],
            [
                20.0,
                "CHI"
            ],
            [
                22.5,
                "YYZ"
            ],
            [
                19.0,
                "PIT"
            ],
            [
                17.0,
                "HOU"
            ],
            [
                19.666666666666668,
                "PHL"
            ],
            [
                18.0,
                "DAL"
            ],
            [
                17.0,
                "DET"
            ],
            [
                27.0,
                "LON"
            ],
            [
                20.333333333333332,
                "NYC"
            ],
            [
                18.0,
                "LOS"
            ],
            [
                20.0,
                "ROC"
            ],
            [
                17.0,
                "PEK"
            ],
            [
                21.0,
                "SFO"
            ],
            [
                20.0,
                "ATL"
            ],
            [
                18.0,
                "NAR"
            ],
            [
                18.0,
                "BOS"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nRETURN avg(student.Age),student.city_code",
        "question": "What is the average age for each city and what are those cities?",
        "answers": [
            [
                18.5,
                "BAL"
            ],
            [
                18.0,
                "HKG"
            ],
            [
                21.666666666666668,
                "WAS"
            ],
            [
                20.0,
                "CHI"
            ],
            [
                22.5,
                "YYZ"
            ],
            [
                19.0,
                "PIT"
            ],
            [
                17.0,
                "HOU"
            ],
            [
                19.666666666666668,
                "PHL"
            ],
            [
                18.0,
                "DAL"
            ],
            [
                17.0,
                "DET"
            ],
            [
                27.0,
                "LON"
            ],
            [
                20.333333333333332,
                "NYC"
            ],
            [
                18.0,
                "LOS"
            ],
            [
                20.0,
                "ROC"
            ],
            [
                17.0,
                "PEK"
            ],
            [
                21.0,
                "SFO"
            ],
            [
                20.0,
                "ATL"
            ],
            [
                18.0,
                "NAR"
            ],
            [
                18.0,
                "BOS"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH ()-[has_amenity:`dorm_1.Has_amenity`]-()\nRETURN count(DISTINCT has_amenity.dormid)",
        "question": "How many dorms have amenities?",
        "answers": [
            [
                7
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nRETURN count(DISTINCT dorm.gender)",
        "question": "Find the number of distinct gender for dorms.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nRETURN count(DISTINCT dorm.gender)",
        "question": "How many different genders are there in the dorms?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nWHERE dorm.dorm_name =~'.*[D|d]onor.*'\nRETURN dorm.student_capacity,dorm.gender",
        "question": "Find the capacity and gender type of the dorm whose name has substring \u2018Donor\u2019.",
        "answers": [
            [
                128,
                "F"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nWHERE dorm.dorm_name =~'.*[D|d]onor.*'\nRETURN dorm.student_capacity,dorm.gender",
        "question": "What is the student capacity and type of gender for the dorm whose name as the phrase Donor in it?",
        "answers": [
            [
                128,
                "F"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nWHERE dorm.student_capacity > 300 OR dorm.student_capacity < 100\nRETURN dorm.dorm_name,dorm.gender",
        "question": "Find the name and gender type of the dorms whose capacity is greater than 300 or less than 100.",
        "answers": [
            [
                "Smith Hall",
                "X"
            ],
            [
                "Fawlty Towers",
                "X"
            ],
            [
                "Dorm-plex 2000",
                "X"
            ],
            [
                "University Hovels",
                "X"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nWHERE dorm.student_capacity > 300 OR dorm.student_capacity < 100\nRETURN dorm.dorm_name,dorm.gender",
        "question": "What are the names and types of the dorms that have a capacity greater than 300 or less than 100?",
        "answers": [
            [
                "Smith Hall",
                "X"
            ],
            [
                "Fawlty Towers",
                "X"
            ],
            [
                "Dorm-plex 2000",
                "X"
            ],
            [
                "University Hovels",
                "X"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nRETURN count(DISTINCT student.Major),count(DISTINCT student.city_code)",
        "question": "Find the numbers of different majors and cities.",
        "answers": [
            [
                6,
                19
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nRETURN count(DISTINCT student.Major),count(DISTINCT student.city_code)",
        "question": "How many different majors are there and how many different city codes are there for each student?",
        "answers": [
            [
                6,
                19
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWHERE student.Sex = 'F' AND student.city_code = 'BAL'\nRETURN student.LName  AS lname \nUNION\nMATCH (student:`dorm_1.Student`)\nWHERE student.Sex = 'M' AND student.Age < 20\nRETURN student.LName  AS lname",
        "question": "Find the last name of students who is either female (sex is F) and living in the city of code BAL or male (sex is M) and in age of below 20.",
        "answers": [
            [
                "Smith"
            ],
            [
                "Nelson"
            ],
            [
                "Prater"
            ],
            [
                "Schultz"
            ],
            [
                "Tai"
            ],
            [
                "Lee"
            ],
            [
                "Norris"
            ],
            [
                "Schwartz"
            ],
            [
                "Pang"
            ],
            [
                "Andreou"
            ],
            [
                "Woods"
            ],
            [
                "Goldman"
            ],
            [
                "Brody"
            ],
            [
                "Han"
            ],
            [
                "Simms"
            ],
            [
                "Epp"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (student:`dorm_1.Student`)\nWHERE student.Sex = 'F' AND student.city_code = 'BAL'\nRETURN student.LName  AS lname \nUNION\nMATCH (student:`dorm_1.Student`)\nWHERE student.Sex = 'M' AND student.Age < 20\nRETURN student.LName  AS lname",
        "question": "What is the last name of every student who is either female or living in a city with the code BAL or male and under 20?",
        "answers": [
            [
                "Smith"
            ],
            [
                "Nelson"
            ],
            [
                "Prater"
            ],
            [
                "Schultz"
            ],
            [
                "Tai"
            ],
            [
                "Lee"
            ],
            [
                "Norris"
            ],
            [
                "Schwartz"
            ],
            [
                "Pang"
            ],
            [
                "Andreou"
            ],
            [
                "Woods"
            ],
            [
                "Goldman"
            ],
            [
                "Brody"
            ],
            [
                "Han"
            ],
            [
                "Simms"
            ],
            [
                "Epp"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nRETURN dorm.dorm_name\nORDER BY dorm.student_capacity DESC\nLIMIT 1",
        "question": "Find the name of the dorm with the largest capacity.",
        "answers": [
            [
                "Dorm-plex 2000"
            ]
        ]
    },
    {
        "db_id": "dorm_1",
        "query": "MATCH (dorm:`dorm_1.Dorm`)\nRETURN dorm.dorm_name\nORDER BY dorm.student_capacity DESC\nLIMIT 1",
        "question": "What are the names of the dorm with the largest capacity?",
        "answers": [
            [
                "Dorm-plex 2000"
            ]
        ]
    }
]