[
    {
        "db_id": "journal_committee",
        "query": "MATCH (journal:`journal_committee.journal`)\nRETURN DISTINCT journal.Theme",
        "question": "Show the distinct themes of journals.",
        "answers": [
            [
                "Miami Dolphins"
            ],
            [
                "at Jacksonville Jaguars"
            ],
            [
                "at Baltimore Ravens"
            ],
            [
                "Tampa Bay Buccaneers"
            ],
            [
                "at Detroit Lions"
            ],
            [
                "at Pittsburgh Steelers"
            ],
            [
                "Jacksonville Jaguars"
            ],
            [
                "Baltimore Ravens"
            ],
            [
                "at Cincinnati Bengals"
            ],
            [
                "Pittsburgh Steelers"
            ],
            [
                "at Cleveland Browns"
            ],
            [
                "at Minnesota Vikings"
            ],
            [
                "Green Bay Packers"
            ],
            [
                "at Oakland Raiders"
            ],
            [
                "Cleveland Browns"
            ],
            [
                "Cincinnati Bengals"
            ]
        ]
    },
    {
        "db_id": "journal_committee",
        "query": "MATCH (T2:`journal_committee.editor`)-[T1:`journal_committee.journal_committee`]-(T3:`journal_committee.journal`)\nRETURN T2.Name,T3.Theme",
        "question": "Show the names of editors and the theme of journals for which they serve on committees.",
        "answers": [
            [
                "Kamila Porczyk",
                "at Minnesota Vikings"
            ],
            [
                "Marek Siudym",
                "at Detroit Lions"
            ],
            [
                "Piotr Pr\u0119gowski",
                "at Jacksonville Jaguars"
            ],
            [
                "W\u0142adys\u0142aw Grzywna",
                "Pittsburgh Steelers"
            ],
            [
                "Gra\u017cyna Wolszczak",
                "Cincinnati Bengals"
            ],
            [
                "Gra\u017cyna Wolszczak",
                "at Baltimore Ravens"
            ],
            [
                "Maria G\u00f3ralczyk",
                "at Cleveland Browns"
            ]
        ]
    },
    {
        "db_id": "journal_committee",
        "query": "MATCH (T2:`journal_committee.editor`)-[T1:`journal_committee.journal_committee`]-(T3:`journal_committee.journal`)\nRETURN T2.Name,T3.Theme",
        "question": "For each journal_committee, find the editor name and the journal theme.",
        "answers": [
            [
                "Kamila Porczyk",
                "at Minnesota Vikings"
            ],
            [
                "Marek Siudym",
                "at Detroit Lions"
            ],
            [
                "Piotr Pr\u0119gowski",
                "at Jacksonville Jaguars"
            ],
            [
                "W\u0142adys\u0142aw Grzywna",
                "Pittsburgh Steelers"
            ],
            [
                "Gra\u017cyna Wolszczak",
                "Cincinnati Bengals"
            ],
            [
                "Gra\u017cyna Wolszczak",
                "at Baltimore Ravens"
            ],
            [
                "Maria G\u00f3ralczyk",
                "at Cleveland Browns"
            ]
        ]
    },
    {
        "db_id": "journal_committee",
        "query": "MATCH (T2:`journal_committee.editor`)-[T1:`journal_committee.journal_committee`]-(T3:`journal_committee.journal`)\nRETURN T2.Name,T2.Age,T3.Theme\nORDER BY T3.Theme ASC",
        "question": "Show the names and ages of editors and the theme of journals for which they serve on committees, in ascending alphabetical order of theme.",
        "answers": [
            [
                "Gra\u017cyna Wolszczak",
                54.0,
                "Cincinnati Bengals"
            ],
            [
                "W\u0142adys\u0142aw Grzywna",
                24.0,
                "Pittsburgh Steelers"
            ],
            [
                "Gra\u017cyna Wolszczak",
                54.0,
                "at Baltimore Ravens"
            ],
            [
                "Maria G\u00f3ralczyk",
                38.0,
                "at Cleveland Browns"
            ],
            [
                "Marek Siudym",
                21.0,
                "at Detroit Lions"
            ],
            [
                "Piotr Pr\u0119gowski",
                43.0,
                "at Jacksonville Jaguars"
            ],
            [
                "Kamila Porczyk",
                34.0,
                "at Minnesota Vikings"
            ]
        ]
    },
    {
        "db_id": "journal_committee",
        "query": "MATCH (T2:`journal_committee.editor`)-[T1:`journal_committee.journal_committee`]-(T3:`journal_committee.journal`)\nWHERE T3.Sales > 3000\nRETURN T2.Name",
        "question": "Show the names of editors that are on the committee of journals with sales bigger than 3000.",
        "answers": [
            [
                "Kamila Porczyk"
            ],
            [
                "W\u0142adys\u0142aw Grzywna"
            ],
            [
                "Gra\u017cyna Wolszczak"
            ],
            [
                "Gra\u017cyna Wolszczak"
            ],
            [
                "Maria G\u00f3ralczyk"
            ]
        ]
    },
    {
        "db_id": "journal_committee",
        "query": "MATCH (T1:`journal_committee.editor`)-[T2:`journal_committee.journal_committee`]-()\nRETURN T1.Editor_ID,T1.Name,count(*)",
        "question": "Show the id, name of each editor and the number of journal committees they are on.",
        "answers": [
            [
                1,
                "Kamila Porczyk",
                1
            ],
            [
                3,
                "Marek Siudym",
                1
            ],
            [
                4,
                "Piotr Pr\u0119gowski",
                1
            ],
            [
                6,
                "W\u0142adys\u0142aw Grzywna",
                1
            ],
            [
                8,
                "Gra\u017cyna Wolszczak",
                2
            ],
            [
                9,
                "Maria G\u00f3ralczyk",
                1
            ]
        ]
    },
    {
        "db_id": "journal_committee",
        "query": "MATCH (T1:`journal_committee.editor`)-[T2:`journal_committee.journal_committee`]-()\nWITH T1.Name AS Name, count(*) AS count\nWHERE count  >= 2\nRETURN Name",
        "question": "Show the names of editors that are on at least two journal committees.",
        "answers": [
            [
                "Gra\u017cyna Wolszczak"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nRETURN count(*)",
        "question": "How many accounts do we have?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nRETURN count(*)",
        "question": "Count the number of accounts.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nRETURN accounts.account_id,accounts.customer_id,accounts.account_name",
        "question": "Show ids, customer ids, names for all accounts.",
        "answers": [
            [
                1,
                6,
                "338"
            ],
            [
                2,
                14,
                "562"
            ],
            [
                3,
                9,
                "162"
            ],
            [
                4,
                12,
                "038"
            ],
            [
                5,
                13,
                "858"
            ],
            [
                6,
                12,
                "262"
            ],
            [
                7,
                9,
                "621"
            ],
            [
                8,
                8,
                "381"
            ],
            [
                9,
                9,
                "546"
            ],
            [
                10,
                4,
                "767"
            ],
            [
                11,
                4,
                "022"
            ],
            [
                12,
                2,
                "866"
            ],
            [
                13,
                10,
                "234"
            ],
            [
                14,
                9,
                "557"
            ],
            [
                15,
                4,
                "725"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nRETURN accounts.account_id,accounts.customer_id,accounts.account_name",
        "question": "What are the account ids, customer ids, and account names for all the accounts?",
        "answers": [
            [
                1,
                6,
                "338"
            ],
            [
                2,
                14,
                "562"
            ],
            [
                3,
                9,
                "162"
            ],
            [
                4,
                12,
                "038"
            ],
            [
                5,
                13,
                "858"
            ],
            [
                6,
                12,
                "262"
            ],
            [
                7,
                9,
                "621"
            ],
            [
                8,
                8,
                "381"
            ],
            [
                9,
                9,
                "546"
            ],
            [
                10,
                4,
                "767"
            ],
            [
                11,
                4,
                "022"
            ],
            [
                12,
                2,
                "866"
            ],
            [
                13,
                10,
                "234"
            ],
            [
                14,
                9,
                "557"
            ],
            [
                15,
                4,
                "725"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nRETURN accounts.customer_id,count(*)",
        "question": "Show all customer ids and the number of accounts for each customer.",
        "answers": [
            [
                6,
                1
            ],
            [
                14,
                1
            ],
            [
                9,
                4
            ],
            [
                12,
                2
            ],
            [
                13,
                1
            ],
            [
                8,
                1
            ],
            [
                4,
                3
            ],
            [
                2,
                1
            ],
            [
                10,
                1
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nRETURN accounts.customer_id,count(*)",
        "question": "How many accounts are there for each customer id?",
        "answers": [
            [
                6,
                1
            ],
            [
                14,
                1
            ],
            [
                9,
                4
            ],
            [
                12,
                2
            ],
            [
                13,
                1
            ],
            [
                8,
                1
            ],
            [
                4,
                3
            ],
            [
                2,
                1
            ],
            [
                10,
                1
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nRETURN count(DISTINCT accounts.customer_id)",
        "question": "How many customers have an account?",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (accounts:`customers_card_transactions.Accounts`)\nRETURN count(DISTINCT accounts.customer_id)",
        "question": "Count the number of customers who hold an account.",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers:`customers_card_transactions.Customers`)\nRETURN count(*)",
        "question": "Count the number of customers.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers:`customers_card_transactions.Customers`)\nRETURN customers.customer_id,customers.customer_first_name,customers.customer_last_name,customers.customer_phone",
        "question": "Show ids, first names, last names, and phones for all customers.",
        "answers": [
            [
                1,
                "Aniyah",
                "Feest",
                "(673)872-5338"
            ],
            [
                2,
                "Susie",
                "Wiza",
                "679-845-8645x94312"
            ],
            [
                3,
                "Marcel",
                "Brekke",
                "1-511-656-6664"
            ],
            [
                4,
                "Art",
                "Turcotte",
                "941-213-6716x675"
            ],
            [
                5,
                "Armani",
                "Farrell",
                "224-123-1012"
            ],
            [
                6,
                "Kiel",
                "Schinner",
                "1-564-044-3909"
            ],
            [
                7,
                "Izabella",
                "Erdman",
                "751.049.9948"
            ],
            [
                8,
                "Elyssa",
                "Lind",
                "+12(6)9024410984"
            ],
            [
                9,
                "Faustino",
                "Langworth",
                "284.749.0453"
            ],
            [
                10,
                "Axel",
                "Effertz",
                "+90(8)1290735932"
            ],
            [
                11,
                "Frederic",
                "Swift",
                "1-207-977-5182"
            ],
            [
                12,
                "Bryce",
                "Rath",
                "(415)237-0701x3115"
            ],
            [
                13,
                "Serenity",
                "Effertz",
                "1-894-567-2283"
            ],
            [
                14,
                "Blanche",
                "Huels",
                "(703)950-4708x8972"
            ],
            [
                15,
                "Nat",
                "Davis",
                "246-469-4472x359"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers:`customers_card_transactions.Customers`)\nRETURN customers.customer_id,customers.customer_first_name,customers.customer_last_name,customers.customer_phone",
        "question": "What are the ids, full names, and phones of each customer?",
        "answers": [
            [
                1,
                "Aniyah",
                "Feest",
                "(673)872-5338"
            ],
            [
                2,
                "Susie",
                "Wiza",
                "679-845-8645x94312"
            ],
            [
                3,
                "Marcel",
                "Brekke",
                "1-511-656-6664"
            ],
            [
                4,
                "Art",
                "Turcotte",
                "941-213-6716x675"
            ],
            [
                5,
                "Armani",
                "Farrell",
                "224-123-1012"
            ],
            [
                6,
                "Kiel",
                "Schinner",
                "1-564-044-3909"
            ],
            [
                7,
                "Izabella",
                "Erdman",
                "751.049.9948"
            ],
            [
                8,
                "Elyssa",
                "Lind",
                "+12(6)9024410984"
            ],
            [
                9,
                "Faustino",
                "Langworth",
                "284.749.0453"
            ],
            [
                10,
                "Axel",
                "Effertz",
                "+90(8)1290735932"
            ],
            [
                11,
                "Frederic",
                "Swift",
                "1-207-977-5182"
            ],
            [
                12,
                "Bryce",
                "Rath",
                "(415)237-0701x3115"
            ],
            [
                13,
                "Serenity",
                "Effertz",
                "1-894-567-2283"
            ],
            [
                14,
                "Blanche",
                "Huels",
                "(703)950-4708x8972"
            ],
            [
                15,
                "Nat",
                "Davis",
                "246-469-4472x359"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers:`customers_card_transactions.Customers`)\nWHERE customers.customer_first_name = 'Aniyah' AND customers.customer_last_name = 'Feest'\nRETURN customers.customer_phone,customers.customer_email",
        "question": "What is the phone and email for customer with first name Aniyah and last name Feest?",
        "answers": [
            [
                "(673)872-5338",
                "fahey.dorian@example.com"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN count(*)",
        "question": "Show the number of customer cards.",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN count(*)",
        "question": "How many customer cards are there?",
        "answers": [
            [
                15
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN customers_cards.card_id,customers_cards.customer_id,customers_cards.card_type_code,customers_cards.card_number",
        "question": "Show ids, customer ids, card type codes, card numbers for all cards.",
        "answers": [
            [
                1,
                14,
                "Credit",
                "4560596484842"
            ],
            [
                2,
                9,
                "Credit",
                "4859448397570735"
            ],
            [
                3,
                6,
                "Debit",
                "348237249146948"
            ],
            [
                4,
                15,
                "Credit",
                "4485460762694"
            ],
            [
                5,
                13,
                "Credit",
                "5122249720639438"
            ],
            [
                6,
                10,
                "Debit",
                "5102229294602335"
            ],
            [
                7,
                9,
                "Credit",
                "4716674779726"
            ],
            [
                8,
                12,
                "Credit",
                "6011225247353230"
            ],
            [
                9,
                3,
                "Debit",
                "4929590358481"
            ],
            [
                10,
                10,
                "Debit",
                "4532488235104"
            ],
            [
                11,
                8,
                "Debit",
                "4707949584519"
            ],
            [
                12,
                3,
                "Debit",
                "4929896676202959"
            ],
            [
                13,
                2,
                "Credit",
                "5484846021884483"
            ],
            [
                14,
                5,
                "Debit",
                "4929384762825"
            ],
            [
                15,
                2,
                "Debit",
                "345475370003028"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN customers_cards.card_id,customers_cards.customer_id,customers_cards.card_type_code,customers_cards.card_number",
        "question": "What are card ids, customer ids, card types, and card numbers for each customer card?",
        "answers": [
            [
                1,
                14,
                "Credit",
                "4560596484842"
            ],
            [
                2,
                9,
                "Credit",
                "4859448397570735"
            ],
            [
                3,
                6,
                "Debit",
                "348237249146948"
            ],
            [
                4,
                15,
                "Credit",
                "4485460762694"
            ],
            [
                5,
                13,
                "Credit",
                "5122249720639438"
            ],
            [
                6,
                10,
                "Debit",
                "5102229294602335"
            ],
            [
                7,
                9,
                "Credit",
                "4716674779726"
            ],
            [
                8,
                12,
                "Credit",
                "6011225247353230"
            ],
            [
                9,
                3,
                "Debit",
                "4929590358481"
            ],
            [
                10,
                10,
                "Debit",
                "4532488235104"
            ],
            [
                11,
                8,
                "Debit",
                "4707949584519"
            ],
            [
                12,
                3,
                "Debit",
                "4929896676202959"
            ],
            [
                13,
                2,
                "Credit",
                "5484846021884483"
            ],
            [
                14,
                5,
                "Debit",
                "4929384762825"
            ],
            [
                15,
                2,
                "Debit",
                "345475370003028"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (T1:`customers_card_transactions.Customers_Cards`)-[]-(T2:`customers_card_transactions.Customers`)\nWHERE T2.customer_first_name = 'Art' AND T2.customer_last_name = 'Turcotte'\nRETURN count(*)",
        "question": "How many cards does customer Art Turcotte have?",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (T1:`customers_card_transactions.Customers_Cards`)-[]-(T2:`customers_card_transactions.Customers`)\nWHERE T2.customer_first_name = 'Art' AND T2.customer_last_name = 'Turcotte'\nRETURN count(*)",
        "question": "Count the number of cards the customer with the first name Art and last name Turcotte has.",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN customers_cards.customer_id,count(*)",
        "question": "Show all customer ids and the number of cards owned by each customer.",
        "answers": [
            [
                14,
                1
            ],
            [
                9,
                2
            ],
            [
                6,
                1
            ],
            [
                15,
                1
            ],
            [
                13,
                1
            ],
            [
                10,
                2
            ],
            [
                12,
                1
            ],
            [
                3,
                2
            ],
            [
                8,
                1
            ],
            [
                2,
                2
            ],
            [
                5,
                1
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN customers_cards.customer_id,count(*)",
        "question": "What are the different customer ids, and how many cards does each one hold?",
        "answers": [
            [
                14,
                1
            ],
            [
                9,
                2
            ],
            [
                6,
                1
            ],
            [
                15,
                1
            ],
            [
                13,
                1
            ],
            [
                10,
                2
            ],
            [
                12,
                1
            ],
            [
                3,
                2
            ],
            [
                8,
                1
            ],
            [
                2,
                2
            ],
            [
                5,
                1
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN customers_cards.card_type_code,count(*)",
        "question": "Show all card type codes and the number of cards in each type.",
        "answers": [
            [
                "Credit",
                7
            ],
            [
                "Debit",
                8
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN customers_cards.card_type_code,count(*)",
        "question": "What are the different card types, and how many cards are there of each?",
        "answers": [
            [
                "Credit",
                7
            ],
            [
                "Debit",
                8
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN customers_cards.card_type_code\nORDER BY customers_cards.card_type_code DESC\nLIMIT 1",
        "question": "What is the card type code with most number of cards?",
        "answers": [
            [
                "Debit"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN customers_cards.card_type_code\nORDER BY customers_cards.card_type_code DESC\nLIMIT 1",
        "question": "Return the code of the card type that is most common.",
        "answers": [
            [
                "Debit"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nWITH count(*) AS count, customers_cards.card_type_code AS card_type_code\nWHERE count  >= 5\nRETURN card_type_code",
        "question": "Show card type codes with at least 5 cards.",
        "answers": [
            [
                "Credit"
            ],
            [
                "Debit"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nWITH count(*) AS count, customers_cards.card_type_code AS card_type_code\nWHERE count  >= 5\nRETURN card_type_code",
        "question": "What are the codes of card types that have 5 or more cards?",
        "answers": [
            [
                "Credit"
            ],
            [
                "Debit"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN customers_cards.card_type_code,count(DISTINCT customers_cards.customer_id)",
        "question": "Show all card type codes and the number of customers holding cards in each type.",
        "answers": [
            [
                "Credit",
                6
            ],
            [
                "Debit",
                6
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN customers_cards.card_type_code,count(DISTINCT customers_cards.customer_id)",
        "question": "What are the different card type codes, and how many different customers hold each type?",
        "answers": [
            [
                "Credit",
                6
            ],
            [
                "Debit",
                6
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN DISTINCT customers_cards.card_type_code",
        "question": "Show all card type codes.",
        "answers": [
            [
                "Credit"
            ],
            [
                "Debit"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN DISTINCT customers_cards.card_type_code",
        "question": "What are the different card type codes?",
        "answers": [
            [
                "Credit"
            ],
            [
                "Debit"
            ]
        ]
    },
    {
        "db_id": "customers_card_transactions",
        "query": "MATCH (customers_cards:`customers_card_transactions.Customers_Cards`)\nRETURN count(DISTINCT customers_cards.card_type_code)",
        "question": "Show the number of card types.",
        "answers": [
            [
                2
            ]
        ]
    }
]