[
    {
        "question": "How many lessons did the customer Ryan Goodwin complete?",
        "query": "MATCH (T1:`driving_school.Lessons`)-[]-(T2:`driving_school.Customers`)\nWHERE T2.first_name = 'Rylan' AND T2.last_name = 'Goodwin' AND T1.lesson_status_code = 'Completed'\nRETURN count(*)",
        "db_id": "driving_school",
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "question": "List the first name and last name of customers have the amount of outstanding between 1000 and 3000.",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE 1000<=customers.amount_outstanding<=3000\nRETURN customers.first_name,customers.last_name",
        "db_id": "driving_school",
        "answers": [
            [
                "Rylan",
                "Goodwin"
            ],
            [
                "Omer",
                "Leuschke"
            ],
            [
                "Sigrid",
                "Schmeler"
            ]
        ]
    },
    {
        "question": "List first name and last name of customers lived in city Lockmanfurt.",
        "query": "MATCH (T1:`driving_school.Customers`)-[]-(T2:`driving_school.Addresses`)\nWHERE T2.city = 'Lockmanfurt'\nRETURN T1.first_name,T1.last_name",
        "db_id": "driving_school",
        "answers": [
            [
                "Sigrid",
                "Schmeler"
            ]
        ]
    },
    {
        "question": "What are the first and last names of all customers who lived in Lockmanfurt?",
        "query": "MATCH (T1:`driving_school.Customers`)-[]-(T2:`driving_school.Addresses`)\nWHERE T2.city = 'Lockmanfurt'\nRETURN T1.first_name,T1.last_name",
        "db_id": "driving_school",
        "answers": [
            [
                "Sigrid",
                "Schmeler"
            ]
        ]
    },
    {
        "question": "Which country does customer with first name as Carole and last name as Bernhard lived in?",
        "query": "MATCH (T1:`driving_school.Customers`)-[]-(T2:`driving_school.Addresses`)\nWHERE T1.first_name = 'Carole' AND T1.last_name = 'Bernhard'\nRETURN T2.country",
        "db_id": "driving_school",
        "answers": [
            [
                "USA"
            ]
        ]
    },
    {
        "question": "What is the country in which the customer Carole Bernhard lived?",
        "query": "MATCH (T1:`driving_school.Customers`)-[]-(T2:`driving_school.Addresses`)\nWHERE T1.first_name = 'Carole' AND T1.last_name = 'Bernhard'\nRETURN T2.country",
        "db_id": "driving_school",
        "answers": [
            [
                "USA"
            ]
        ]
    },
    {
        "question": "What is zip code of customer with first name as Carole and last name as Bernhard?",
        "query": "MATCH (T1:`driving_school.Customers`)-[]-(T2:`driving_school.Addresses`)\nWHERE T1.first_name = 'Carole' AND T1.last_name = 'Bernhard'\nRETURN T2.zip_postcode",
        "db_id": "driving_school",
        "answers": [
            [
                "75074"
            ]
        ]
    },
    {
        "question": "What is the zip code of the customer Carole Bernhard?",
        "query": "MATCH (T1:`driving_school.Customers`)-[]-(T2:`driving_school.Addresses`)\nWHERE T1.first_name = 'Carole' AND T1.last_name = 'Bernhard'\nRETURN T2.zip_postcode",
        "db_id": "driving_school",
        "answers": [
            [
                "75074"
            ]
        ]
    },
    {
        "question": "List the number of customers that did not have any payment history.",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE NOT (customers:`driving_school.Customers`)-[]-(:`driving_school.Customer_Payments`)\nRETURN count(*)",
        "db_id": "driving_school",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "question": "How many customers have no payment histories?",
        "query": "MATCH (customers:`driving_school.Customers`)\nWHERE NOT (customers:`driving_school.Customers`)-[]-(:`driving_school.Customer_Payments`)\nRETURN count(*)",
        "db_id": "driving_school",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "question": "List first name and last name of customers that have more than 2 payments.",
        "query": "MATCH (T1:`driving_school.Customer_Payments`)-[]-(T2:`driving_school.Customers`)\nWITH T2.first_name AS first_name, T2.last_name AS last_name, count(*) AS count\nWHERE count  > 2\nRETURN first_name,last_name",
        "db_id": "driving_school",
        "answers": [
            [
                "Estelle",
                "Grant"
            ]
        ]
    },
    {
        "question": "List all payment methods and number of payments using each payment methods.",
        "query": "MATCH (customer_payments:`driving_school.Customer_Payments`)\nWITH count(customer_payments.payment_method_code) AS count, customer_payments.payment_method_code AS payment_method_code\nRETURN payment_method_code,count",
        "db_id": "driving_school",
        "answers": [
            [
                "Direct Debit",
                10
            ],
            [
                "Credit Card",
                5
            ]
        ]
    },
    {
        "question": "How many lessons were in cancelled state?",
        "query": "MATCH (lessons:`driving_school.Lessons`)\nWHERE lessons.lesson_status_code = 'Cancelled'\nRETURN count(*)",
        "db_id": "driving_school",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "question": "How many lessons have been cancelled?",
        "query": "MATCH (lessons:`driving_school.Lessons`)\nWHERE lessons.lesson_status_code = 'Cancelled'\nRETURN count(*)",
        "db_id": "driving_school",
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "question": "What is average lesson price taught by staff with first name as Janessa and last name as Sawayn?",
        "query": "MATCH (T1:`driving_school.Lessons`)-[]-(T2:`driving_school.Staff`)\nWHERE T2.first_name = 'Janessa' AND T2.last_name = 'Sawayn'\nRETURN avg(T1.price)",
        "db_id": "driving_school",
        "answers": [
            [
                306.0
            ]
        ]
    },
    {
        "question": "What is the average price for a lesson taught by Janessa Sawayn?",
        "query": "MATCH (T1:`driving_school.Lessons`)-[]-(T2:`driving_school.Staff`)\nWHERE T2.first_name = 'Janessa' AND T2.last_name = 'Sawayn'\nRETURN avg(T1.price)",
        "db_id": "driving_school",
        "answers": [
            [
                306.0
            ]
        ]
    },
    {
        "question": "How many lesson does customer with first name Ray took?",
        "query": "MATCH (T1:`driving_school.Lessons`)-[]-(T2:`driving_school.Customers`)\nWHERE T2.first_name = 'Ray'\nRETURN count(*)",
        "db_id": "driving_school",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "How many lessons did the customer with the first name Ray take?",
        "query": "MATCH (T1:`driving_school.Lessons`)-[]-(T2:`driving_school.Customers`)\nWHERE T2.first_name = 'Ray'\nRETURN count(*)",
        "db_id": "driving_school",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "Find the list of distinct ranks for faculty.",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN DISTINCT faculty.Rank",
        "db_id": "activity_1",
        "answers": [
            [
                "Instructor"
            ],
            [
                "Professor"
            ],
            [
                "AssocProf"
            ],
            [
                "AsstProf"
            ]
        ]
    },
    {
        "question": "Show all the distinct buildings that have faculty rooms.",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nRETURN DISTINCT faculty.Building",
        "db_id": "activity_1",
        "answers": [
            [
                "NEB"
            ],
            [
                "Barton"
            ],
            [
                "Krieger"
            ]
        ]
    },
    {
        "question": "Show the first name, last name, and phone number for all female faculty members.",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Sex = 'F'\nRETURN faculty.Fname,faculty.Lname,faculty.Phone",
        "db_id": "activity_1",
        "answers": [
            [
                "Stacey",
                "Jones",
                3550
            ],
            [
                "Joanne",
                "Houlahan",
                1260
            ],
            [
                "Ellie",
                "Angelopoulou",
                2152
            ],
            [
                "Lenore",
                "Cowen",
                2870
            ],
            [
                "Brenda",
                "Rapp",
                2032
            ],
            [
                "Geraldine",
                "Legendre",
                8972
            ],
            [
                "Leslie",
                "Hall",
                7332
            ]
        ]
    },
    {
        "question": "Show ids for all the male faculty.",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Sex = 'M'\nRETURN faculty.FacID",
        "db_id": "activity_1",
        "answers": [
            [
                1082
            ],
            [
                1121
            ],
            [
                1148
            ],
            [
                1172
            ],
            [
                1177
            ],
            [
                1823
            ],
            [
                2028
            ],
            [
                2119
            ],
            [
                2192
            ],
            [
                2291
            ],
            [
                2311
            ],
            [
                2738
            ],
            [
                2881
            ],
            [
                3457
            ],
            [
                4432
            ],
            [
                5718
            ],
            [
                6112
            ],
            [
                6182
            ],
            [
                6191
            ],
            [
                6330
            ],
            [
                6541
            ],
            [
                6910
            ],
            [
                6925
            ],
            [
                7134
            ],
            [
                7231
            ],
            [
                7271
            ],
            [
                7506
            ],
            [
                7712
            ],
            [
                7723
            ],
            [
                7792
            ],
            [
                8102
            ],
            [
                8118
            ],
            [
                8122
            ],
            [
                8423
            ],
            [
                8721
            ],
            [
                8722
            ],
            [
                8723
            ],
            [
                8741
            ],
            [
                8791
            ],
            [
                8918
            ],
            [
                8989
            ],
            [
                9172
            ],
            [
                9191
            ],
            [
                9199
            ],
            [
                9210
            ],
            [
                9379
            ],
            [
                9514
            ],
            [
                9811
            ],
            [
                9823
            ],
            [
                9824
            ],
            [
                9826
            ]
        ]
    },
    {
        "question": "How many female Professors do we have?",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Sex = 'F' AND faculty.Rank = 'Professor'\nRETURN count(*)",
        "db_id": "activity_1",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Show the phone, room, and building for the faculty named Jerry Prince.",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Fname = 'Jerry' AND faculty.Lname = 'Prince'\nRETURN faculty.Phone,faculty.Room,faculty.Building",
        "db_id": "activity_1",
        "answers": [
            [
                5106,
                "119",
                "Barton"
            ]
        ]
    },
    {
        "question": "What are the phone, room, and building of the faculty member called Jerry Prince?",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Fname = 'Jerry' AND faculty.Lname = 'Prince'\nRETURN faculty.Phone,faculty.Room,faculty.Building",
        "db_id": "activity_1",
        "answers": [
            [
                5106,
                "119",
                "Barton"
            ]
        ]
    },
    {
        "question": "How many Professors are in building NEB?",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Rank = 'Professor' AND faculty.Building = 'NEB'\nRETURN count(*)",
        "db_id": "activity_1",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "Show the first name and last name for all the instructors.",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Rank = 'Instructor'\nRETURN faculty.Fname,faculty.Lname",
        "db_id": "activity_1",
        "answers": [
            [
                "Mark",
                "Giuliano"
            ],
            [
                "Stacey",
                "Jones"
            ],
            [
                "Joanne",
                "Houlahan"
            ],
            [
                "Louis",
                "Beach"
            ],
            [
                "William",
                "Byrne"
            ],
            [
                "Ellie",
                "Angelopoulou"
            ],
            [
                "Robert",
                "Glaser"
            ],
            [
                "Arthur",
                "Delcher"
            ]
        ]
    },
    {
        "question": "What are the first name and last name of all the instructors?",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Rank = 'Instructor'\nRETURN faculty.Fname,faculty.Lname",
        "db_id": "activity_1",
        "answers": [
            [
                "Mark",
                "Giuliano"
            ],
            [
                "Stacey",
                "Jones"
            ],
            [
                "Joanne",
                "Houlahan"
            ],
            [
                "Louis",
                "Beach"
            ],
            [
                "William",
                "Byrne"
            ],
            [
                "Ellie",
                "Angelopoulou"
            ],
            [
                "Robert",
                "Glaser"
            ],
            [
                "Arthur",
                "Delcher"
            ]
        ]
    },
    {
        "question": "Show all the buildings along with the number of faculty members the buildings have.",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWITH count(faculty.Building) AS count, faculty.Building AS Building\nRETURN Building,count",
        "db_id": "activity_1",
        "answers": [
            [
                "NEB",
                18
            ],
            [
                "Barton",
                20
            ],
            [
                "Krieger",
                20
            ]
        ]
    },
    {
        "question": "Show all the buildings that have at least 10 professors.",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Rank = 'Professor'\nWITH count(*) AS count, faculty.Building AS Building\nWHERE count  >= 10\nRETURN Building",
        "db_id": "activity_1",
        "answers": [
            [
                "Krieger"
            ],
            [
                "Barton"
            ]
        ]
    },
    {
        "question": "In which buildings are there at least ten professors?",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Rank = 'Professor'\nWITH count(*) AS count, faculty.Building AS Building\nWHERE count  >= 10\nRETURN Building",
        "db_id": "activity_1",
        "answers": [
            [
                "Krieger"
            ],
            [
                "Barton"
            ]
        ]
    },
    {
        "question": "For each faculty rank, show the number of faculty members who have it.",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWITH count(faculty.Rank) AS count, faculty.Rank AS Rank\nRETURN Rank,count",
        "db_id": "activity_1",
        "answers": [
            [
                "Instructor",
                8
            ],
            [
                "Professor",
                27
            ],
            [
                "AssocProf",
                8
            ],
            [
                "AsstProf",
                15
            ]
        ]
    },
    {
        "question": "Show the number of male and female assistant professors.",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Rank = 'AsstProf'\nWITH faculty.Sex AS Sex, count(faculty.Sex) AS count\nRETURN Sex,count",
        "db_id": "activity_1",
        "answers": [
            [
                "M",
                12
            ],
            [
                "F",
                3
            ]
        ]
    },
    {
        "question": "How many male and female assistant professors do we have?",
        "query": "MATCH (faculty:`activity_1.Faculty`)\nWHERE faculty.Rank = 'AsstProf'\nWITH faculty.Sex AS Sex, count(faculty.Sex) AS count\nRETURN Sex,count",
        "db_id": "activity_1",
        "answers": [
            [
                "M",
                12
            ],
            [
                "F",
                3
            ]
        ]
    },
    {
        "question": "List all the activities we have.",
        "query": "MATCH (activity:`activity_1.Activity`)\nRETURN activity.activity_name",
        "db_id": "activity_1",
        "answers": [
            [
                "Mountain Climbing"
            ],
            [
                "Canoeing"
            ],
            [
                "Kayaking"
            ],
            [
                "Spelunking"
            ],
            [
                "Extreme Canasta"
            ],
            [
                "Soccer"
            ],
            [
                "Baseball"
            ],
            [
                "Accordion Ensemble"
            ],
            [
                "Football"
            ],
            [
                "Volleyball"
            ],
            [
                "Canasta"
            ],
            [
                "Chess"
            ],
            [
                "Crossword Puzzles"
            ],
            [
                "Proselytizing"
            ],
            [
                "Square Dancing"
            ],
            [
                "Bungee Jumping"
            ]
        ]
    },
    {
        "question": "Find the number of activities available.",
        "query": "MATCH (activity:`activity_1.Activity`)\nRETURN count(*)",
        "db_id": "activity_1",
        "answers": [
            [
                16
            ]
        ]
    },
    {
        "question": "Find the id of the order made most recently.",
        "query": "MATCH (orders:`tracking_orders.Orders`)\nRETURN orders.order_id\nORDER BY orders.date_order_placed DESC\nLIMIT 1",
        "db_id": "tracking_orders",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "Find the order id and customer id associated with the oldest order.",
        "query": "MATCH (orders:`tracking_orders.Orders`)\nRETURN orders.order_id,orders.customer_id\nORDER BY orders.date_order_placed\nLIMIT 1",
        "db_id": "tracking_orders",
        "answers": [
            [
                15,
                8
            ]
        ]
    },
    {
        "question": "Find the id of the order whose shipment tracking number is \"3452\".",
        "query": "MATCH (shipments:`tracking_orders.Shipments`)\nWHERE shipments.shipment_tracking_number = '3452'\nRETURN shipments.order_id",
        "db_id": "tracking_orders",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "question": "Find the ids of all the order items whose product id is 11.",
        "query": "MATCH (order_items:`tracking_orders.Order_Items`)\nWHERE order_items.product_id = 11\nRETURN order_items.order_item_id",
        "db_id": "tracking_orders",
        "answers": [
            [
                5
            ],
            [
                9
            ]
        ]
    },
    {
        "question": "List the name of all the distinct customers who have orders with status \"Packing\".",
        "query": "MATCH (T1:`tracking_orders.Customers`)-[]-(T2:`tracking_orders.Orders`)\nWHERE T2.order_status = 'Packing'\nRETURN DISTINCT T1.customer_name",
        "db_id": "tracking_orders",
        "answers": [
            [
                "Jeramie"
            ],
            [
                "Hadley"
            ],
            [
                "Violet"
            ]
        ]
    },
    {
        "question": "Find the details of all the distinct customers who have orders with status \"On Road\".",
        "query": "MATCH (T1:`tracking_orders.Customers`)-[]-(T2:`tracking_orders.Orders`)\nWHERE T2.order_status = 'On Road'\nRETURN DISTINCT T1.customer_details",
        "db_id": "tracking_orders",
        "answers": [
            [
                "commodi"
            ],
            [
                "deleniti"
            ],
            [
                "est"
            ],
            [
                "doloribus"
            ],
            [
                "officia"
            ],
            [
                "rerum"
            ]
        ]
    },
    {
        "question": "Give me a list of id and status of orders which belong to the customer named \"Jeramie\".",
        "query": "MATCH (T1:`tracking_orders.Customers`)-[]-(T2:`tracking_orders.Orders`)\nWHERE T1.customer_name = 'Jeramie'\nRETURN T2.order_id,T2.order_status",
        "db_id": "tracking_orders",
        "answers": [
            [
                13,
                "On Road"
            ],
            [
                4,
                "Packing"
            ],
            [
                7,
                "Packing"
            ]
        ]
    },
    {
        "question": "Find the dates of orders which belong to the customer named \"Jeramie\".",
        "query": "MATCH (T1:`tracking_orders.Customers`)-[]-(T2:`tracking_orders.Orders`)\nWHERE T1.customer_name = 'Jeramie'\nRETURN T2.date_order_placed",
        "db_id": "tracking_orders",
        "answers": [
            [
                "2002-12-06 14:13:30"
            ],
            [
                "1974-08-10 08:15:16"
            ],
            [
                "1976-09-01 09:27:00"
            ]
        ]
    },
    {
        "question": "Give me the names of customers who have placed orders between 2009-01-01 and 2010-01-01.",
        "query": "MATCH (T1:`tracking_orders.Customers`)-[]-(T2:`tracking_orders.Orders`)\nWHERE T2.date_order_placed >= \"2009-01-01\" AND T2.date_order_placed <= \"2010-01-01\"\nRETURN T1.customer_name",
        "db_id": "tracking_orders",
        "answers": [
            [
                "George"
            ]
        ]
    },
    {
        "question": "Find the ids of orders which are shipped after 2000-01-01.",
        "query": "MATCH (shipments:`tracking_orders.Shipments`)\nWHERE shipments.shipment_date > \"2000-01-01\"\nRETURN shipments.order_id",
        "db_id": "tracking_orders",
        "answers": [
            [
                10
            ],
            [
                12
            ]
        ]
    },
    {
        "question": "List the names of all distinct products in alphabetical order.",
        "query": "MATCH (products:`tracking_orders.Products`)\nRETURN DISTINCT products.product_name\nORDER BY products.product_name",
        "db_id": "tracking_orders",
        "answers": [
            [
                "book"
            ],
            [
                "clothes"
            ],
            [
                "food"
            ],
            [
                "music"
            ],
            [
                "phone"
            ]
        ]
    },
    {
        "question": "Find the invoice numbers which are created before 1989-09-03 or after 2007-12-25.",
        "query": "MATCH (invoices:`tracking_orders.Invoices`)\nWHERE invoices.invoice_date < \"1989-09-03\" OR invoices.invoice_date > \"2007-12-25\"\nRETURN invoices.invoice_number",
        "db_id": "tracking_orders",
        "answers": [
            [
                4
            ],
            [
                5
            ],
            [
                6
            ],
            [
                8
            ],
            [
                9
            ],
            [
                11
            ],
            [
                12
            ],
            [
                13
            ],
            [
                15
            ]
        ]
    },
    {
        "question": "Find the distinct details of invoices which are created before 1989-09-03 or after 2007-12-25.",
        "query": "MATCH (invoices:`tracking_orders.Invoices`)\nWHERE invoices.invoice_date < \"1989-09-03\" OR invoices.invoice_date > \"2007-12-25\"\nRETURN DISTINCT invoices.invoice_details",
        "db_id": "tracking_orders",
        "answers": [
            [
                "tempore"
            ],
            [
                "labore"
            ],
            [
                "optio"
            ],
            [
                "doloremque"
            ],
            [
                "quo"
            ],
            [
                "earum"
            ],
            [
                "ea"
            ],
            [
                "voluptatem"
            ]
        ]
    },
    {
        "question": "For each customer who has at least two orders, find the customer name and number of orders made.",
        "query": "MATCH (T1:`tracking_orders.Orders`)-[]-(T2:`tracking_orders.Customers`)\nWITH count(*) AS count, T2.customer_name AS customer_name\nWHERE count  >= 2\nRETURN customer_name,count",
        "db_id": "tracking_orders",
        "answers": [
            [
                "George",
                3
            ],
            [
                "Jeramie",
                3
            ],
            [
                "Beulah",
                2
            ]
        ]
    },
    {
        "question": "Find the name of the customers who have at most two orders.",
        "query": "MATCH (T1:`tracking_orders.Orders`)-[]-(T2:`tracking_orders.Customers`)\nWITH count(*) AS count, T2.customer_name AS customer_name\nWHERE count  <= 2\nRETURN customer_name",
        "db_id": "tracking_orders",
        "answers": [
            [
                "Hershel"
            ],
            [
                "Leilani"
            ],
            [
                "Hadley"
            ],
            [
                "Violet"
            ],
            [
                "Beulah"
            ],
            [
                "Alberto"
            ],
            [
                "Devan"
            ],
            [
                "Parker"
            ]
        ]
    },
    {
        "question": "List the name, nationality and id of all male architects ordered by their names lexicographically.",
        "query": "MATCH (architect:`architecture.architect`)\nWHERE architect.gender = 'male'\nRETURN architect.name,architect.nationality,architect.id\nORDER BY architect.name",
        "db_id": "architecture",
        "answers": [
            [
                "Frank Gehry",
                "Canadian",
                "2"
            ],
            [
                "Frank Lloyd Wright",
                "American",
                "1"
            ],
            [
                "Le Corbusier",
                "Swiss, French",
                "5"
            ],
            [
                "Mies Van Der Rohe",
                "German, American",
                "4"
            ]
        ]
    },
    {
        "question": "Count the number of book clubs.",
        "query": "MATCH (book_club:`culture_company.book_club`)\nRETURN count(*)",
        "db_id": "culture_company",
        "answers": [
            [
                12
            ]
        ]
    },
    {
        "question": "show the titles, and authors or editors for all books made after the year 1989.",
        "query": "MATCH (book_club:`culture_company.book_club`)\nWHERE book_club.Year > 1989\nRETURN book_club.Book_Title,book_club.Author_or_Editor",
        "db_id": "culture_company",
        "answers": [
            [
                "Somewhere in the Night",
                "Jeffrey N. McMahan"
            ],
            [
                "Walking Water / After All This",
                "Thom Nickels"
            ]
        ]
    },
    {
        "question": "Show all distinct publishers for books.",
        "query": "MATCH (book_club:`culture_company.book_club`)\nRETURN DISTINCT book_club.Publisher",
        "db_id": "culture_company",
        "answers": [
            [
                "Alyson"
            ],
            [
                "St. Martin's Press"
            ],
            [
                "William Morrow"
            ],
            [
                "Mysterious Press"
            ],
            [
                "International Polygonics"
            ],
            [
                "Banned Books"
            ],
            [
                "Naiad Press"
            ],
            [
                "Crossing Press"
            ]
        ]
    }
]