[
    {
        "question": "Show the case burden of counties in descending order of population.",
        "query": "MATCH (county_public_safety:`county_public_safety.county_public_safety`)\nRETURN county_public_safety.Case_burden\nORDER BY county_public_safety.Population DESC",
        "db_id": "county_public_safety",
        "answers": [
            [
                100
            ],
            [
                81
            ],
            [
                140
            ],
            [
                137
            ],
            [
                39
            ],
            [
                107
            ]
        ]
    },
    {
        "question": "Find the names of all modern rooms with a base price below $160 and two beds.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.basePrice < 160 AND rooms.beds = 2 AND rooms.decor = 'modern'\nRETURN rooms.roomName",
        "db_id": "inn_1",
        "answers": [
            [
                "Mendicant with cryptic"
            ]
        ]
    },
    {
        "question": "Find all the rooms that have a price higher than 160 and can accommodate more than 2 people. Report room names and ids.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.basePrice > 160 AND rooms.maxOccupancy > 2\nRETURN rooms.roomName,rooms.RoomId",
        "db_id": "inn_1",
        "answers": [
            [
                "Abscond or bolster",
                "AOB"
            ],
            [
                "Convoke and sanguine",
                "CAS"
            ],
            [
                "Riddle to exculpate",
                "RTE"
            ],
            [
                "Frugal not apropos",
                "FNA"
            ]
        ]
    },
    {
        "question": "Find the most popular room in the hotel. The most popular room is the room that had seen the largest number of reservations.",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nWITH count(T1.Room) AS count, T2.roomName AS roomName\nRETURN roomName\nORDER BY count DESC\nLIMIT 1",
        "db_id": "inn_1",
        "answers": [
            [
                "Convoke and sanguine"
            ]
        ]
    },
    {
        "question": "Which room has the largest number of reservations?",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nWITH count(T1.Room) AS count, T2.roomName AS roomName\nRETURN roomName\nORDER BY count DESC\nLIMIT 1",
        "db_id": "inn_1",
        "answers": [
            [
                "Convoke and sanguine"
            ]
        ]
    },
    {
        "question": "Find the number of kids staying in the rooms reserved by a person called ROY SWEAZ.",
        "query": "MATCH (reservations:`inn_1.Reservations`)\nWHERE reservations.FirstName = 'ROY' AND reservations.LastName = 'SWEAZY'\nRETURN reservations.Kids",
        "db_id": "inn_1",
        "answers": [
            [
                1
            ],
            [
                1
            ]
        ]
    },
    {
        "question": "How many times does ROY SWEAZY has reserved a room.",
        "query": "MATCH (reservations:`inn_1.Reservations`)\nWHERE reservations.FirstName = 'ROY' AND reservations.LastName = 'SWEAZY'\nRETURN count(*)",
        "db_id": "inn_1",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "List the names and decor of rooms that have a king bed. Sort the list by their price.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.bedType = 'King'\nRETURN rooms.roomName,rooms.decor\nORDER BY rooms.basePrice",
        "db_id": "inn_1",
        "answers": [
            [
                "Recluse and defiance",
                "modern"
            ],
            [
                "Interim but salutary",
                "traditional"
            ],
            [
                "Convoke and sanguine",
                "traditional"
            ],
            [
                "Frugal not apropos",
                "traditional"
            ]
        ]
    },
    {
        "question": "Which room has cheapest base price? List the room's name and the base price.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.roomName,rooms.basePrice\nORDER BY rooms.basePrice ASC\nLIMIT 1",
        "db_id": "inn_1",
        "answers": [
            [
                "Thrift and accolade",
                75
            ]
        ]
    },
    {
        "question": "Return the decor of the room named \"Recluse and defiance\".",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.roomName = 'Recluse and defiance'\nRETURN rooms.decor",
        "db_id": "inn_1",
        "answers": [
            [
                "modern"
            ]
        ]
    },
    {
        "question": "List how many times the number of people in the room reached the maximum occupancy of the room. The number of people include adults and kids.",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nWHERE T2.maxOccupancy = T1.Adults + T1.Kids\nRETURN count(*)",
        "db_id": "inn_1",
        "answers": [
            [
                204
            ]
        ]
    },
    {
        "question": "Find the number of rooms with a king bed.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.bedType = 'King'\nRETURN count(*)",
        "db_id": "inn_1",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "question": "Find the number of rooms for each bed type.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWITH count(rooms.bedType) AS count, rooms.bedType AS bedType\nRETURN bedType,count",
        "db_id": "inn_1",
        "answers": [
            [
                "King",
                4
            ],
            [
                "Queen",
                4
            ],
            [
                "Double",
                2
            ]
        ]
    },
    {
        "question": "Find the name of the room with the maximum occupancy.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.roomName\nORDER BY rooms.maxOccupancy DESC\nLIMIT 1",
        "db_id": "inn_1",
        "answers": [
            [
                "Abscond or bolster"
            ]
        ]
    },
    {
        "question": "Find the id and name of the most expensive base price room.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.RoomId,rooms.roomName\nORDER BY rooms.basePrice DESC\nLIMIT 1",
        "db_id": "inn_1",
        "answers": [
            [
                "FNA",
                "Frugal not apropos"
            ]
        ]
    },
    {
        "question": "List the type of bed and name of all traditional rooms.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.decor = 'traditional'\nRETURN rooms.roomName,rooms.bedType",
        "db_id": "inn_1",
        "answers": [
            [
                "Interim but salutary",
                "King"
            ],
            [
                "Abscond or bolster",
                "Queen"
            ],
            [
                "Convoke and sanguine",
                "King"
            ],
            [
                "Frugal not apropos",
                "King"
            ]
        ]
    },
    {
        "question": "Find the number of rooms with king bed for each decor type.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.bedType = 'King'\nWITH count(rooms.decor) AS count, rooms.decor AS decor\nRETURN decor,count",
        "db_id": "inn_1",
        "answers": [
            [
                "modern",
                1
            ],
            [
                "traditional",
                3
            ]
        ]
    },
    {
        "question": "List the name of all rooms sorted by their prices.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.roomName\nORDER BY rooms.basePrice",
        "db_id": "inn_1",
        "answers": [
            [
                "Thrift and accolade"
            ],
            [
                "Harbinger but bequest"
            ],
            [
                "Mendicant with cryptic"
            ],
            [
                "Recluse and defiance"
            ],
            [
                "Interim but salutary"
            ],
            [
                "Immutable before decorum"
            ],
            [
                "Abscond or bolster"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Riddle to exculpate"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "question": "Find the number of rooms with price higher than 120 for different decor.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.basePrice > 120\nWITH count(rooms.decor) AS count, rooms.decor AS decor\nRETURN decor,count",
        "db_id": "inn_1",
        "answers": [
            [
                "modern",
                2
            ],
            [
                "traditional",
                4
            ],
            [
                "rustic",
                2
            ]
        ]
    },
    {
        "question": "List the name of rooms with king or queen bed.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE rooms.bedType = 'King' OR rooms.bedType = 'Queen'\nRETURN rooms.roomName",
        "db_id": "inn_1",
        "answers": [
            [
                "Recluse and defiance"
            ],
            [
                "Interim but salutary"
            ],
            [
                "Abscond or bolster"
            ],
            [
                "Harbinger but bequest"
            ],
            [
                "Immutable before decorum"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Riddle to exculpate"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "question": "Find the number of distinct bed types available in this inn.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN count(DISTINCT rooms.bedType)",
        "db_id": "inn_1",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "Find the name and id of the top 3 expensive rooms.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nRETURN rooms.RoomId,rooms.roomName\nORDER BY rooms.basePrice DESC\nLIMIT 3",
        "db_id": "inn_1",
        "answers": [
            [
                "FNA",
                "Frugal not apropos"
            ],
            [
                "AOB",
                "Abscond or bolster"
            ],
            [
                "CAS",
                "Convoke and sanguine"
            ]
        ]
    },
    {
        "question": "Find the number of rooms that do not have any reservation.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE NOT (rooms:`inn_1.Rooms`)-[]-(:`inn_1.Reservations`)\nRETURN count(*)",
        "db_id": "inn_1",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "How many rooms have not had any reservation yet?",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE NOT (rooms:`inn_1.Rooms`)-[]-(:`inn_1.Reservations`)\nRETURN count(*)",
        "db_id": "inn_1",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Return the name and number of reservations made for each of the rooms.",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nWITH T1.Room AS Room, count(T1.Room) AS count, T2.roomName AS roomName\nRETURN roomName,count,Room",
        "db_id": "inn_1",
        "answers": [
            [
                "Recluse and defiance",
                62,
                "RND"
            ],
            [
                "Interim but salutary",
                59,
                "IBS"
            ],
            [
                "Abscond or bolster",
                51,
                "AOB"
            ],
            [
                "Mendicant with cryptic",
                56,
                "MWC"
            ],
            [
                "Harbinger but bequest",
                60,
                "HBB"
            ],
            [
                "Immutable before decorum",
                63,
                "IBD"
            ],
            [
                "Thrift and accolade",
                59,
                "TAA"
            ],
            [
                "Convoke and sanguine",
                69,
                "CAS"
            ],
            [
                "Riddle to exculpate",
                55,
                "RTE"
            ],
            [
                "Frugal not apropos",
                66,
                "FNA"
            ]
        ]
    },
    {
        "question": "Find the names of rooms that have been reserved for more than 60 times.",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nWITH count(*) AS count, T2.roomName AS roomName\nWHERE count  > 60\nRETURN roomName",
        "db_id": "inn_1",
        "answers": [
            [
                "Recluse and defiance"
            ],
            [
                "Immutable before decorum"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "question": "Find the name of rooms whose base price is between 120 and 150.",
        "query": "MATCH (rooms:`inn_1.Rooms`)\nWHERE 120<=rooms.basePrice<=150\nRETURN rooms.roomName",
        "db_id": "inn_1",
        "answers": [
            [
                "Recluse and defiance"
            ],
            [
                "Interim but salutary"
            ],
            [
                "Mendicant with cryptic"
            ],
            [
                "Immutable before decorum"
            ]
        ]
    },
    {
        "question": "Find the name of rooms booked by some customers whose first name contains ROY.",
        "query": "MATCH (T1:`inn_1.Reservations`)-[]-(T2:`inn_1.Rooms`)\nWHERE T1.FirstName =~'.*[R|r]OY.*'\nRETURN T2.roomName",
        "db_id": "inn_1",
        "answers": [
            [
                "Harbinger but bequest"
            ],
            [
                "Harbinger but bequest"
            ],
            [
                "Harbinger but bequest"
            ],
            [
                "Thrift and accolade"
            ],
            [
                "Convoke and sanguine"
            ],
            [
                "Frugal not apropos"
            ],
            [
                "Frugal not apropos"
            ]
        ]
    },
    {
        "question": "What is the cmi cross reference id that is related to at least one council tax entry? List the cross reference id and source system code.",
        "query": "MATCH (T1:`local_govt_mdm.CMI_Cross_References`)-[]-(T2:`local_govt_mdm.Council_Tax`)\nWITH count(*) AS count, T1.cmi_cross_ref_id AS cmi_cross_ref_id, T1.source_system_code AS source_system_code\nWHERE count  >= 1\nRETURN cmi_cross_ref_id,source_system_code",
        "db_id": "local_govt_mdm",
        "answers": [
            [
                101,
                "Tax"
            ],
            [
                103,
                "Tax"
            ],
            [
                104,
                "Tax"
            ],
            [
                102,
                "Tax"
            ],
            [
                106,
                "Tax"
            ],
            [
                105,
                "Tax"
            ]
        ]
    },
    {
        "question": "How many business rates are related to each cmi cross reference? List cross reference id, master customer id and the n",
        "query": "MATCH (T1:`local_govt_mdm.Business_Rates`)-[]-(T2:`local_govt_mdm.CMI_Cross_References`)\nWITH T2.cmi_cross_ref_id AS cmi_cross_ref_id, T2.master_customer_id AS master_customer_id, count(T2.cmi_cross_ref_id) AS count\nRETURN cmi_cross_ref_id,master_customer_id,count",
        "db_id": "local_govt_mdm",
        "answers": [
            [
                99,
                9,
                1
            ],
            [
                49,
                1,
                1
            ],
            [
                95,
                2,
                1
            ]
        ]
    },
    {
        "question": "What is the tax source system code related to the benefits and overpayments? List the code and the benifit id, order by benifit id.",
        "query": "MATCH (T1:`local_govt_mdm.CMI_Cross_References`)-[]-(T2:`local_govt_mdm.Benefits_Overpayments`)\nRETURN T1.source_system_code,T2.council_tax_id\nORDER BY T2.council_tax_id",
        "db_id": "local_govt_mdm",
        "answers": [
            [
                "Benefits",
                3
            ],
            [
                "Benefits",
                6
            ],
            [
                "Benefits",
                7
            ],
            [
                "Benefits",
                8
            ]
        ]
    },
    {
        "question": "List the council tax ids and their related cmi cross references of all the parking fines.",
        "query": "MATCH (parking_fines:`local_govt_mdm.Parking_Fines`)\nRETURN parking_fines.council_tax_id,parking_fines.cmi_cross_ref_id",
        "db_id": "local_govt_mdm",
        "answers": [
            [
                9,
                4
            ],
            [
                10,
                81
            ]
        ]
    },
    {
        "question": "Count the number of parties.",
        "query": "MATCH (party:`party_host.party`)\nRETURN count(*)",
        "db_id": "party_host",
        "answers": [
            [
                8
            ]
        ]
    },
    {
        "question": "List the themes of parties in ascending order of number of hosts.",
        "query": "MATCH (party:`party_host.party`)\nRETURN party.Party_Theme\nORDER BY party.Number_of_hosts ASC",
        "db_id": "party_host",
        "answers": [
            [
                "Hardcore Resurrection"
            ],
            [
                "QrimeTime"
            ],
            [
                "Spring"
            ],
            [
                "Teqnology"
            ],
            [
                "In Qontrol"
            ],
            [
                "Houseqlassics"
            ],
            [
                "Club Q-BASE"
            ],
            [
                "Qlubtempo"
            ]
        ]
    },
    {
        "question": "Give me the theme and location of each party.",
        "query": "MATCH (party:`party_host.party`)\nRETURN party.Party_Theme,party.Location",
        "db_id": "party_host",
        "answers": [
            [
                "Spring",
                "Hemkade 48 Zaandam"
            ],
            [
                "Club Q-BASE",
                "Hemkade 48 Zaandam"
            ],
            [
                "Hardcore Resurrection",
                "Various locations"
            ],
            [
                "Teqnology",
                "Heineken Music Hall Amsterdam"
            ],
            [
                "Qlubtempo",
                "Hemkade 48 Zaandam, Heineken Music Hall Amsterdam"
            ],
            [
                "QrimeTime",
                "Heineken Music Hall Amsterdam"
            ],
            [
                "In Qontrol",
                "RAI Amsterdam"
            ],
            [
                "Houseqlassics",
                "Various locations"
            ]
        ]
    },
    {
        "question": "Show the first year and last year of parties with theme \"Spring\" or \"Teqnology\".",
        "query": "MATCH (party:`party_host.party`)\nWHERE party.Party_Theme = 'Spring' OR party.Party_Theme = 'Teqnology'\nRETURN party.First_year,party.Last_year",
        "db_id": "party_host",
        "answers": [
            [
                "2000",
                "2001"
            ],
            [
                "2002",
                "2004"
            ]
        ]
    },
    {
        "question": "Compute the average number of hosts for parties.",
        "query": "MATCH (party:`party_host.party`)\nRETURN avg(party.Number_of_hosts)",
        "db_id": "party_host",
        "answers": [
            [
                12.25
            ]
        ]
    },
    {
        "question": "Which party had the most hosts? Give me the party location.",
        "query": "MATCH (party:`party_host.party`)\nRETURN party.Location\nORDER BY party.Number_of_hosts DESC\nLIMIT 1",
        "db_id": "party_host",
        "answers": [
            [
                "Hemkade 48 Zaandam, Heineken Music Hall Amsterdam"
            ]
        ]
    },
    {
        "question": "Show different nationalities along with the number of hosts of each nationality.",
        "query": "MATCH (host:`party_host.host`)\nWITH count(host.Nationality) AS count, host.Nationality AS Nationality\nRETURN Nationality,count",
        "db_id": "party_host",
        "answers": [
            [
                "United States",
                8
            ],
            [
                "Hungary",
                1
            ],
            [
                "Argentina",
                1
            ]
        ]
    },
    {
        "question": "Show the most common nationality of hosts.",
        "query": "MATCH (host:`party_host.host`)\nWITH count(host.Nationality) AS count, host.Nationality AS Nationality\nRETURN Nationality\nORDER BY count DESC\nLIMIT 1",
        "db_id": "party_host",
        "answers": [
            [
                "United States"
            ]
        ]
    },
    {
        "question": "Show the name and the nationality of the oldest host.",
        "query": "MATCH (host:`party_host.host`)\nRETURN host.Name,host.Nationality\nORDER BY host.Age DESC\nLIMIT 1",
        "db_id": "party_host",
        "answers": [
            [
                "Derrick Dial",
                "United States"
            ]
        ]
    },
    {
        "question": "List the names of hosts who did not serve as a host of any party in our record.",
        "query": "MATCH (host:`party_host.host`)\nWHERE NOT (host:`party_host.host`)-[:`party_host.party_host`]-()\nRETURN host.Name",
        "db_id": "party_host",
        "answers": [
            [
                "Antonio Davis"
            ],
            [
                "Hubert Davis"
            ],
            [
                "Justin Dentmon"
            ],
            [
                "DeMar DeRozan"
            ]
        ]
    },
    {
        "question": "What are the names of hosts who did not host any party in our record?",
        "query": "MATCH (host:`party_host.host`)\nWHERE NOT (host:`party_host.host`)-[:`party_host.party_host`]-()\nRETURN host.Name",
        "db_id": "party_host",
        "answers": [
            [
                "Antonio Davis"
            ],
            [
                "Hubert Davis"
            ],
            [
                "Justin Dentmon"
            ],
            [
                "DeMar DeRozan"
            ]
        ]
    },
    {
        "question": "Count the number of regions.",
        "query": "MATCH (region:`storm_record.region`)\nRETURN count(*)",
        "db_id": "storm_record",
        "answers": [
            [
                13
            ]
        ]
    },
    {
        "question": "Show all region code and region name sorted by the codes.",
        "query": "MATCH (region:`storm_record.region`)\nRETURN region.Region_code,region.Region_name\nORDER BY region.Region_code",
        "db_id": "storm_record",
        "answers": [
            [
                "AD",
                "Andorra"
            ],
            [
                "AF",
                "Afghanistan"
            ],
            [
                "AG",
                "Antigua and Barbuda"
            ],
            [
                "AI",
                "Anguilla"
            ],
            [
                "AL",
                "Albania"
            ],
            [
                "AO",
                "Angola"
            ],
            [
                "AQ",
                "Antarctica"
            ],
            [
                "CY",
                "Cyprus"
            ],
            [
                "CZ",
                "Czech Republic"
            ],
            [
                "DJ",
                "Djibouti"
            ],
            [
                "DK",
                "Denmark"
            ],
            [
                "DS",
                "American Samoa"
            ],
            [
                "DZ",
                "Algeria"
            ]
        ]
    },
    {
        "question": "List all region names in alphabetical order.",
        "query": "MATCH (region:`storm_record.region`)\nRETURN region.Region_name\nORDER BY region.Region_name",
        "db_id": "storm_record",
        "answers": [
            [
                "Afghanistan"
            ],
            [
                "Albania"
            ],
            [
                "Algeria"
            ],
            [
                "American Samoa"
            ],
            [
                "Andorra"
            ],
            [
                "Angola"
            ],
            [
                "Anguilla"
            ],
            [
                "Antarctica"
            ],
            [
                "Antigua and Barbuda"
            ],
            [
                "Cyprus"
            ],
            [
                "Czech Republic"
            ],
            [
                "Denmark"
            ],
            [
                "Djibouti"
            ]
        ]
    },
    {
        "question": "Show names for all regions except for Denmark.",
        "query": "MATCH (region:`storm_record.region`)\nWHERE region.Region_name <> 'Denmark'\nRETURN region.Region_name",
        "db_id": "storm_record",
        "answers": [
            [
                "Afghanistan"
            ],
            [
                "Albania"
            ],
            [
                "Algeria"
            ],
            [
                "American Samoa"
            ],
            [
                "Andorra"
            ],
            [
                "Angola"
            ],
            [
                "Anguilla"
            ],
            [
                "Antarctica"
            ],
            [
                "Antigua and Barbuda"
            ],
            [
                "Cyprus"
            ],
            [
                "Czech Republic"
            ],
            [
                "Djibouti"
            ]
        ]
    },
    {
        "question": "Count the number of storms in which at least 1 person died.",
        "query": "MATCH (storm:`storm_record.storm`)\nWHERE storm.Number_Deaths > 0\nRETURN count(*)",
        "db_id": "storm_record",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "question": "List name, dates active, and number of deaths for all storms with at least 1 death.",
        "query": "MATCH (storm:`storm_record.storm`)\nWHERE storm.Number_Deaths >= 1\nRETURN storm.Name,storm.Dates_active,storm.Number_Deaths",
        "db_id": "storm_record",
        "answers": [
            [
                "Two",
                "August3\u2013August10",
                7
            ],
            [
                "Three",
                "August5\u2013August14",
                52
            ],
            [
                "Four",
                "August26\u2013September2",
                7
            ],
            [
                "Five",
                "September7\u2013September17",
                3
            ],
            [
                "Six",
                "September18\u2013September25",
                2
            ],
            [
                "9 cyclones",
                "May19 \u2013October26",
                71
            ]
        ]
    },
    {
        "question": "Show the average and maximum damage for all storms with max speed higher than 1000.",
        "query": "MATCH (storm:`storm_record.storm`)\nWHERE storm.Max_speed > 1000\nRETURN avg(storm.Damage_millions_USD),max(storm.Damage_millions_USD)",
        "db_id": "storm_record",
        "answers": [
            [
                6.5195,
                13.0
            ]
        ]
    },
    {
        "question": "List name and damage for all storms in a descending order of max speed.",
        "query": "MATCH (storm:`storm_record.storm`)\nRETURN storm.Name,storm.Damage_millions_USD\nORDER BY storm.Max_speed DESC",
        "db_id": "storm_record",
        "answers": [
            [
                "Nine",
                13.0
            ],
            [
                "Six",
                0.039
            ],
            [
                "One",
                13.0
            ],
            [
                "Five",
                1.49
            ],
            [
                "Eight",
                13.0
            ],
            [
                "Seven",
                13.0
            ],
            [
                "Two",
                10.75
            ],
            [
                "Three",
                13.0
            ],
            [
                "Four",
                4.05
            ],
            [
                "9 cyclones",
                29.3
            ]
        ]
    },
    {
        "question": "Show the name for regions not affected.",
        "query": "MATCH (region:`storm_record.region`)\nWHERE NOT (region:`storm_record.region`)-[:`storm_record.affected_region`]-()\nRETURN region.Region_name",
        "db_id": "storm_record",
        "answers": [
            [
                "American Samoa"
            ],
            [
                "Andorra"
            ],
            [
                "Angola"
            ],
            [
                "Anguilla"
            ],
            [
                "Antarctica"
            ],
            [
                "Antigua and Barbuda"
            ],
            [
                "Cyprus"
            ],
            [
                "Czech Republic"
            ],
            [
                "Djibouti"
            ]
        ]
    },
    {
        "question": "Show the name for regions and the number of storms for each region.",
        "query": "MATCH (T1:`storm_record.region`)-[T2:`storm_record.affected_region`]-()\nWITH count(T1.Region_id) AS count, T1.Region_name AS Region_name\nRETURN Region_name,count",
        "db_id": "storm_record",
        "answers": [
            [
                "Afghanistan",
                2
            ],
            [
                "Albania",
                2
            ],
            [
                "Algeria",
                1
            ],
            [
                "Denmark",
                1
            ]
        ]
    },
    {
        "question": "List the name for storms and the number of affected regions for each storm.",
        "query": "MATCH (T1:`storm_record.storm`)-[T2:`storm_record.affected_region`]-()\nWITH count(T1.Storm_ID) AS count, T1.Name AS Name\nRETURN Name,count",
        "db_id": "storm_record",
        "answers": [
            [
                "One",
                2
            ],
            [
                "Three",
                1
            ],
            [
                "Four",
                1
            ],
            [
                "Five",
                2
            ]
        ]
    }
]