[
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T2.Name",
        "question": "Return the names of entrepreneurs.",
        "answers": [
            [
                "Francesco Postiglione"
            ],
            [
                "Leonardo Binchi"
            ],
            [
                "Fabrizio Buonocore"
            ],
            [
                "Roberto Calcaterra"
            ],
            [
                "Goran Fiorentini"
            ],
            [
                "Maurizio Felugo"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nWHERE T1.Investor <> 'Rachel Elnaugh'\nRETURN T2.Name",
        "question": "What are the names of entrepreneurs whose investor is not \"Rachel Elnaugh\"?",
        "answers": [
            [
                "Francesco Postiglione"
            ],
            [
                "Leonardo Binchi"
            ],
            [
                "Roberto Calcaterra"
            ],
            [
                "Goran Fiorentini"
            ],
            [
                "Maurizio Felugo"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nWHERE T1.Investor <> 'Rachel Elnaugh'\nRETURN T2.Name",
        "question": "Return the names of entrepreneurs do no not have the investor Rachel Elnaugh.",
        "answers": [
            [
                "Francesco Postiglione"
            ],
            [
                "Leonardo Binchi"
            ],
            [
                "Roberto Calcaterra"
            ],
            [
                "Goran Fiorentini"
            ],
            [
                "Maurizio Felugo"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (people:`entrepreneur.people`)\nRETURN people.Weight\nORDER BY people.Height ASC\nLIMIT 1",
        "question": "What is the weight of the shortest person?",
        "answers": [
            [
                75.0
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (people:`entrepreneur.people`)\nRETURN people.Weight\nORDER BY people.Height ASC\nLIMIT 1",
        "question": "Return the weight of the shortest person.",
        "answers": [
            [
                75.0
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T2.Name\nORDER BY T2.Weight DESC\nLIMIT 1",
        "question": "What is the name of the entrepreneur with the greatest weight?",
        "answers": [
            [
                "Goran Fiorentini"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T2.Name\nORDER BY T2.Weight DESC\nLIMIT 1",
        "question": "Return the name of the heaviest entrepreneur.",
        "answers": [
            [
                "Goran Fiorentini"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nWHERE T1.Investor = 'Simon Woodroffe' OR T1.Investor = 'Peter Jones'\nRETURN T2.Date_of_Birth",
        "question": "What are the dates of birth of entrepreneurs with investor \"Simon Woodroffe\" or \"Peter Jones\"?",
        "answers": [
            [
                "1972-02-06"
            ],
            [
                "1981-11-21"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nWHERE T1.Investor = 'Simon Woodroffe' OR T1.Investor = 'Peter Jones'\nRETURN T2.Date_of_Birth",
        "question": "Return the dates of birth for entrepreneurs who have either the investor Simon Woodroffe or Peter Jones.",
        "answers": [
            [
                "1972-02-06"
            ],
            [
                "1981-11-21"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T2.Weight\nORDER BY T1.Money_Requested DESC",
        "question": "What are the weights of entrepreneurs in descending order of money requested?",
        "answers": [
            [
                80.0
            ],
            [
                57.0
            ],
            [
                76.0
            ],
            [
                89.0
            ],
            [
                45.0
            ],
            [
                67.0
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T2.Weight\nORDER BY T1.Money_Requested DESC",
        "question": "Return the weights of entrepreneurs, ordered descending by amount of money requested.",
        "answers": [
            [
                80.0
            ],
            [
                57.0
            ],
            [
                76.0
            ],
            [
                89.0
            ],
            [
                45.0
            ],
            [
                67.0
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN entrepreneur.Investor,count(*)",
        "question": "What are the investors of entrepreneurs and the corresponding number of entrepreneurs invested by each investor?",
        "answers": [
            [
                "Duncan Bannatyne",
                2
            ],
            [
                "Doug Richard",
                1
            ],
            [
                "Rachel Elnaugh",
                1
            ],
            [
                "Peter Jones",
                1
            ],
            [
                "Simon Woodroffe",
                1
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN entrepreneur.Investor,count(*)",
        "question": "How many entrepreneurs correspond to each investor?",
        "answers": [
            [
                "Duncan Bannatyne",
                2
            ],
            [
                "Doug Richard",
                1
            ],
            [
                "Rachel Elnaugh",
                1
            ],
            [
                "Peter Jones",
                1
            ],
            [
                "Simon Woodroffe",
                1
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nWITH count(*) AS count, entrepreneur.Investor AS Investor\nWHERE count  >= 2\nRETURN Investor",
        "question": "What are the investors that have invested in at least two entrepreneurs?",
        "answers": [
            [
                "Duncan Bannatyne"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nWITH count(*) AS count, entrepreneur.Investor AS Investor\nWHERE count  >= 2\nRETURN Investor",
        "question": "Return the investors who have invested in two or more entrepreneurs.",
        "answers": [
            [
                "Duncan Bannatyne"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T2.Name,T1.Company\nORDER BY T1.Money_Requested",
        "question": "List the names of entrepreneurs and their companies in descending order of money requested?",
        "answers": [
            [
                "Roberto Calcaterra",
                "IV Cam"
            ],
            [
                "Fabrizio Buonocore",
                "Le Beanock"
            ],
            [
                "Goran Fiorentini",
                "Mycorrhizal Systems"
            ],
            [
                "Maurizio Felugo",
                "Elizabeth Galton Ltd"
            ],
            [
                "Leonardo Binchi",
                "Grails Ltd"
            ],
            [
                "Francesco Postiglione",
                "Umbrolly"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T2.Name,T1.Company\nORDER BY T1.Money_Requested",
        "question": "What are the names of entrepreneurs and their corresponding investors, ordered descending by the amount of money requested?",
        "answers": [
            [
                "Roberto Calcaterra",
                "IV Cam"
            ],
            [
                "Fabrizio Buonocore",
                "Le Beanock"
            ],
            [
                "Goran Fiorentini",
                "Mycorrhizal Systems"
            ],
            [
                "Maurizio Felugo",
                "Elizabeth Galton Ltd"
            ],
            [
                "Leonardo Binchi",
                "Grails Ltd"
            ],
            [
                "Francesco Postiglione",
                "Umbrolly"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (people:`entrepreneur.people`)\nWHERE NOT (people)-[]-(:`entrepreneur.entrepreneur`)    \nRETURN people.Name",
        "question": "List the names of people that are not entrepreneurs.",
        "answers": [
            [
                "Marco Gerini"
            ],
            [
                "Alberto Angelini"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (people:`entrepreneur.people`)\nWHERE NOT (people)-[]-(:`entrepreneur.entrepreneur`)    \nRETURN people.Name",
        "question": "What are the names of people who are not entrepreneurs?",
        "answers": [
            [
                "Marco Gerini"
            ],
            [
                "Alberto Angelini"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN count(DISTINCT entrepreneur.Company)",
        "question": "How many distinct companies are there?",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (entrepreneur:`entrepreneur.entrepreneur`)\nRETURN count(DISTINCT entrepreneur.Company)",
        "question": "Count the number of different companies.",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T1.Company\nORDER BY T2.Height DESC\nLIMIT 1",
        "question": "Show the company of the tallest entrepreneur.",
        "answers": [
            [
                "Elizabeth Galton Ltd"
            ]
        ]
    },
    {
        "db_id": "entrepreneur",
        "query": "MATCH (T1:`entrepreneur.entrepreneur`)-[]-(T2:`entrepreneur.people`)\nRETURN T1.Company\nORDER BY T2.Height DESC\nLIMIT 1",
        "question": "Which company was started by the entrepreneur with the greatest height?",
        "answers": [
            [
                "Elizabeth Galton Ltd"
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (perpetrator:`perpetrator.perpetrator`)\nRETURN count(*)",
        "question": "How many perpetrators are there?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (perpetrator:`perpetrator.perpetrator`)\nRETURN perpetrator.Date\nORDER BY perpetrator.Killed DESC",
        "question": "List the date of perpetrators in descending order of the number of people killed.",
        "answers": [
            [
                "04.26 April 26/27"
            ],
            [
                "11.18 Nov. 18"
            ],
            [
                "05.21 May 21"
            ],
            [
                "09.20 Sep. 20"
            ],
            [
                "04.00 April"
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (perpetrator:`perpetrator.perpetrator`)\nRETURN perpetrator.Injured\nORDER BY perpetrator.Injured ASC",
        "question": "List the number of people injured by perpetrators in ascending order.",
        "answers": [
            [
                0
            ],
            [
                3
            ],
            [
                16
            ],
            [
                37
            ],
            [
                80
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (perpetrator:`perpetrator.perpetrator`)\nRETURN avg(perpetrator.Injured)",
        "question": "What is the average number of people injured by all perpetrators?",
        "answers": [
            [
                27.2
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (perpetrator:`perpetrator.perpetrator`)\nRETURN perpetrator.Location\nORDER BY perpetrator.Killed DESC\nLIMIT 1",
        "question": "What is the location of the perpetrator with the largest kills.",
        "answers": [
            [
                "Uiryeong"
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (people:`perpetrator.people`)\nRETURN people.Name\nORDER BY people.Height ASC",
        "question": "What are the names of people in ascending order of height?",
        "answers": [
            [
                "Jim Krivacs"
            ],
            [
                "John Moore"
            ],
            [
                "Brent Boyd"
            ],
            [
                "Ron Baxter"
            ],
            [
                "Ovie Dotson"
            ],
            [
                "John Danks"
            ],
            [
                "Henry Johnson"
            ],
            [
                "Tyrone Brayan"
            ],
            [
                "Gary Goodner"
            ],
            [
                "Rob Cunningham"
            ],
            [
                "Mike Murphy"
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (T1:`perpetrator.people`)-[]-(T2:`perpetrator.perpetrator`)\nRETURN T1.Name",
        "question": "What are the names of perpetrators?",
        "answers": [
            [
                "Ron Baxter"
            ],
            [
                "Tyrone Brayan"
            ],
            [
                "Rob Cunningham"
            ],
            [
                "Ovie Dotson"
            ],
            [
                "Henry Johnson"
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (T1:`perpetrator.people`)-[]-(T2:`perpetrator.perpetrator`)\nWHERE T2.Country <> 'China'\nRETURN T1.Name",
        "question": "What are the names of perpetrators whose country is not \"China\"?",
        "answers": [
            [
                "Ron Baxter"
            ],
            [
                "Rob Cunningham"
            ],
            [
                "Henry Johnson"
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (T1:`perpetrator.people`)-[]-(T2:`perpetrator.perpetrator`)\nRETURN T1.Name\nORDER BY T1.Weight DESC\nLIMIT 1",
        "question": "What is the name of the perpetrator with the biggest weight.",
        "answers": [
            [
                "Tyrone Brayan"
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (T1:`perpetrator.people`)-[]-(T2:`perpetrator.perpetrator`)\nWHERE T2.Country = 'China' OR T2.Country = 'Japan'\nRETURN T1.Name",
        "question": "What are the names of perpetrators in country \"China\" or \"Japan\"?",
        "answers": [
            [
                "Tyrone Brayan"
            ],
            [
                "Rob Cunningham"
            ],
            [
                "Ovie Dotson"
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (T1:`perpetrator.people`)-[]-(T2:`perpetrator.perpetrator`)\nRETURN T1.Height\nORDER BY T2.Injured DESC",
        "question": "What are the heights of perpetrators in descending order of the number of people they injured?",
        "answers": [
            [
                6.5
            ],
            [
                6.4
            ],
            [
                6.7
            ],
            [
                6.8
            ],
            [
                6.6
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (perpetrator:`perpetrator.perpetrator`)\nRETURN perpetrator.Country,count(*)",
        "question": "What are the countries of perpetrators? Show each country and the corresponding number of perpetrators there.",
        "answers": [
            [
                "South Korea",
                1
            ],
            [
                "China",
                2
            ],
            [
                "Japan",
                1
            ],
            [
                "India",
                1
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (perpetrator:`perpetrator.perpetrator`)\nWITH count(*) AS count, perpetrator.Country AS Country\nWHERE count  >= 2\nRETURN Country,count",
        "question": "What are the countries that have at least two perpetrators?",
        "answers": [
            [
                "China",
                2
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (T1:`perpetrator.people`)-[]-(T2:`perpetrator.perpetrator`)\nRETURN T1.Name\nORDER BY T2.Year DESC",
        "question": "List the names of perpetrators in descending order of the year.",
        "answers": [
            [
                "Tyrone Brayan"
            ],
            [
                "Ovie Dotson"
            ],
            [
                "Ron Baxter"
            ],
            [
                "Henry Johnson"
            ],
            [
                "Rob Cunningham"
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (people:`perpetrator.people`)\nWHERE NOT (people)-[]-(:`perpetrator.perpetrator`)    \nRETURN people.Name",
        "question": "List the names of people that are not perpetrators.",
        "answers": [
            [
                "Brent Boyd"
            ],
            [
                "John Danks"
            ],
            [
                "Gary Goodner"
            ],
            [
                "Jim Krivacs"
            ],
            [
                "John Moore"
            ],
            [
                "Mike Murphy"
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (perpetrator:`perpetrator.perpetrator`)\nRETURN count(DISTINCT perpetrator.Location)",
        "question": "How many distinct locations of perpetrators are there?",
        "answers": [
            [
                5
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (T1:`perpetrator.people`)-[]-(T2:`perpetrator.perpetrator`)\nRETURN T2.Date\nORDER BY T1.Height DESC\nLIMIT 1",
        "question": "Show the date of the tallest perpetrator.",
        "answers": [
            [
                "05.21 May 21"
            ]
        ]
    },
    {
        "db_id": "perpetrator",
        "query": "MATCH (perpetrator:`perpetrator.perpetrator`)\nRETURN max(perpetrator.Year)",
        "question": "In which year did the most recent crime happen?",
        "answers": [
            [
                1995.0
            ]
        ]
    },
    {
        "db_id": "csu_1",
        "query": "MATCH (campuses:`csu_1.Campuses`)\nWHERE campuses.County = 'Los Angeles'\nRETURN campuses.Campus",
        "question": "Report the name of all campuses in Los Angeles county.",
        "answers": [
            [
                "California State University-Dominguez Hills"
            ],
            [
                "Long Beach State University"
            ],
            [
                "California State University-Los Angeles"
            ],
            [
                "California State University-Northridge"
            ],
            [
                "California State Polytechnic University-Pomona"
            ]
        ]
    },
    {
        "db_id": "csu_1",
        "query": "MATCH (campuses:`csu_1.Campuses`)\nWHERE campuses.Year = 1958\nRETURN campuses.Campus",
        "question": "Find all the campuses opened in 1958.",
        "answers": [
            [
                "California State University-Northridge"
            ]
        ]
    },
    {
        "db_id": "csu_1",
        "query": "MATCH (campuses:`csu_1.Campuses`)\nWHERE campuses.Year < 1800\nRETURN campuses.Campus",
        "question": "Find the name of the campuses opened before 1800.",
        "answers": []
    },
    {
        "db_id": "csu_1",
        "query": "MATCH (campuses:`csu_1.Campuses`)\nWHERE campuses.Location = 'Northridge' AND campuses.County = 'Los Angeles'\nRETURN campuses.Campus  AS campus \nUNION\nMATCH (campuses:`csu_1.Campuses`)\nWHERE campuses.Location = 'San Francisco' AND campuses.County = 'San Francisco'\nRETURN campuses.Campus  AS campus",
        "question": "Find the name of the campuses that is in Northridge, Los Angeles or in San Francisco, San Francisco.",
        "answers": [
            [
                "California State University-Northridge"
            ],
            [
                "San Francisco State University"
            ]
        ]
    },
    {
        "db_id": "csu_1",
        "query": "MATCH (csu_fees:`csu_1.csu_fees`)\nWITH avg(csu_fees.CampusFee) AS campusfee\nMATCH (csu_fees:`csu_1.csu_fees`)\nWHERE  csu_fees.CampusFee >  campusfee \nRETURN count(*)",
        "question": "Find the count of universities whose campus fee is greater than the average campus fee.",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "csu_1",
        "query": "MATCH (csu_fees:`csu_1.csu_fees`)\nWITH avg(csu_fees.CampusFee) AS campusfee\nMATCH (csu_fees:`csu_1.csu_fees`)\nWHERE  csu_fees.CampusFee >  campusfee \nRETURN count(*)",
        "question": "How many universities have a campus fee higher than average?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "csu_1",
        "query": "MATCH (csu_fees:`csu_1.csu_fees`)\nWITH avg(csu_fees.CampusFee) AS campusfee\nMATCH (csu_fees:`csu_1.csu_fees`)\nWHERE  csu_fees.CampusFee >  campusfee \nRETURN count(*)",
        "question": "How many universities have a campus fee greater than the average?",
        "answers": [
            [
                10
            ]
        ]
    },
    {
        "db_id": "csu_1",
        "query": "MATCH (T1:`csu_1.Campuses`)-[]-(T2:`csu_1.faculty`)\nWHERE T2.Year = 2003\nRETURN T1.Campus\nORDER BY T2.Faculty DESC\nLIMIT 1",
        "question": "Which campus has the most faculties in year 2003?",
        "answers": [
            [
                "San Diego State University"
            ]
        ]
    },
    {
        "db_id": "csu_1",
        "query": "MATCH (campuses:`csu_1.Campuses`)\nWHERE campuses.County = 'Los Angeles'\nRETURN campuses.Campus",
        "question": "List the campuses in Los Angeles county.",
        "answers": [
            [
                "California State University-Dominguez Hills"
            ],
            [
                "Long Beach State University"
            ],
            [
                "California State University-Los Angeles"
            ],
            [
                "California State University-Northridge"
            ],
            [
                "California State Polytechnic University-Pomona"
            ]
        ]
    },
    {
        "db_id": "csu_1",
        "query": "MATCH (t1:`csu_1.csu_fees`)-[]-(t2:`csu_1.Campuses`)\nWHERE t2.Campus = 'San Francisco State University' AND t1.Year = 2000\nRETURN t1.CampusFee",
        "question": "What is the campus fee of \"San Francisco State University\" in year 2000?",
        "answers": []
    },
    {
        "db_id": "csu_1",
        "query": "MATCH (t1:`csu_1.csu_fees`)-[]-(t2:`csu_1.Campuses`)\nWHERE t2.Campus = 'San Francisco State University' AND t1.Year = 2000\nRETURN t1.CampusFee",
        "question": "In the year 2000, what is the campus fee for San Francisco State University?",
        "answers": []
    },
    {
        "db_id": "csu_1",
        "query": "MATCH (t1:`csu_1.csu_fees`)-[]-(t2:`csu_1.Campuses`)\nWHERE t2.Campus = 'San Jose State University' AND t1.Year = 2000\nRETURN t1.CampusFee",
        "question": "Find the campus fee of \"San Jose State University\" in year 2000.",
        "answers": []
    },
    {
        "db_id": "csu_1",
        "query": "MATCH (t1:`csu_1.csu_fees`)-[]-(t2:`csu_1.Campuses`)\nWHERE t2.Campus = 'San Jose State University' AND t1.Year = 2000\nRETURN t1.CampusFee",
        "question": "What is the campus fee in the year 2000 for San Jose State University?",
        "answers": []
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN count(*)",
        "question": "Count the number of candidates.",
        "answers": [
            [
                6
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN candidate.Support_rate\nORDER BY candidate.Support_rate DESC\nLIMIT 3",
        "question": "Return the top 3 greatest support rates.",
        "answers": [
            [
                0.33
            ],
            [
                0.25
            ],
            [
                0.24
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN candidate.Candidate_ID\nORDER BY candidate.Oppose_rate\nLIMIT 1",
        "question": "Find the id of the candidate who got the lowest oppose rate.",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN candidate.Candidate_ID\nORDER BY candidate.Oppose_rate\nLIMIT 1",
        "question": "What is the id of the candidate with the lowest oppose rate?",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN candidate.Support_rate,candidate.Consider_rate,candidate.Oppose_rate\nORDER BY candidate.Unsure_rate",
        "question": "Please list support, consider, and oppose rates for each candidate in ascending order by unsure rate.",
        "answers": [
            [
                0.25,
                0.3,
                0.43
            ],
            [
                0.33,
                0.2,
                0.45
            ],
            [
                0.24,
                0.27,
                0.43
            ],
            [
                0.18,
                0.34,
                0.44
            ],
            [
                0.24,
                0.3,
                0.32
            ],
            [
                0.17,
                0.42,
                0.32
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN candidate.Poll_Source\nORDER BY candidate.Oppose_rate DESC\nLIMIT 1",
        "question": "which poll source does the highest oppose rate come from?",
        "answers": [
            [
                "Newsweek Poll"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (candidate:`candidate_poll.candidate`)\nRETURN candidate.Poll_Source\nORDER BY candidate.Oppose_rate DESC\nLIMIT 1",
        "question": "Return the poll source corresponding to the candidate who has the oppose rate.",
        "answers": [
            [
                "Newsweek Poll"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (people:`candidate_poll.people`)\nRETURN people.Name\nORDER BY people.Date_of_Birth",
        "question": "List all people names in the order of their date of birth from old to young.",
        "answers": [
            [
                "Vincent Montm\u00e9at"
            ],
            [
                "St\u00e9phane Antiga"
            ],
            [
                "Laurent Capet"
            ],
            [
                "Hubert Henno"
            ],
            [
                "Frantz Granvorka"
            ],
            [
                "Dominique Daquin"
            ],
            [
                "Lo\u00efc De Kergret"
            ],
            [
                "Philippe Bar\u00e7a-Cysique"
            ],
            [
                "Guillaume Samica"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (people:`candidate_poll.people`)\nWHERE people.Sex = 'M'\nRETURN avg(people.Height),avg(people.Weight)",
        "question": "Find the average height and weight for all males (sex is M).",
        "answers": [
            [
                195.14285714285714,
                86.71428571428571
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (people:`candidate_poll.people`)\nWHERE people.Height > 200 OR people.Height < 190\nRETURN people.Name",
        "question": "find the names of people who are taller than 200 or lower than 190.",
        "answers": [
            [
                "Hubert Henno"
            ],
            [
                "Laurent Capet"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (people:`candidate_poll.people`)\nRETURN avg(people.Weight),min(people.Weight),people.Sex",
        "question": "Find the average and minimum weight for each gender.",
        "answers": [
            [
                86.71428571428571,
                82.0,
                "M"
            ],
            [
                92.0,
                90.0,
                "F"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (t1:`candidate_poll.people`)-[]-(t2:`candidate_poll.candidate`)\nRETURN t1.Name,t1.Sex\nORDER BY t2.Support_rate DESC\nLIMIT 1",
        "question": "Find the name and gender of the candidate who got the highest support rate.",
        "answers": [
            [
                "Vincent Montm\u00e9at",
                "M"
            ]
        ]
    },
    {
        "db_id": "candidate_poll",
        "query": "MATCH (t1:`candidate_poll.people`)-[]-(t2:`candidate_poll.candidate`)\nRETURN t1.Name,t1.Sex\nORDER BY t2.Support_rate DESC\nLIMIT 1",
        "question": "What is the name and sex of the candidate with the highest support rate?",
        "answers": [
            [
                "Vincent Montm\u00e9at",
                "M"
            ]
        ]
    }
]