[
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nRETURN list.Classroom,count(DISTINCT list.Grade)",
        "question": "For each classroom, report the classroom number and the number of grades using it.",
        "answers": [
            [
                101,
                1
            ],
            [
                112,
                1
            ],
            [
                107,
                1
            ],
            [
                105,
                1
            ],
            [
                111,
                1
            ],
            [
                102,
                1
            ],
            [
                104,
                1
            ],
            [
                109,
                1
            ],
            [
                110,
                1
            ],
            [
                103,
                1
            ],
            [
                106,
                1
            ],
            [
                108,
                1
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nRETURN list.Classroom,count(DISTINCT list.Grade)",
        "question": "For each classroom, show the classroom number and count the number of distinct grades that use the room.",
        "answers": [
            [
                101,
                1
            ],
            [
                112,
                1
            ],
            [
                107,
                1
            ],
            [
                105,
                1
            ],
            [
                111,
                1
            ],
            [
                102,
                1
            ],
            [
                104,
                1
            ],
            [
                109,
                1
            ],
            [
                110,
                1
            ],
            [
                103,
                1
            ],
            [
                106,
                1
            ],
            [
                108,
                1
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nRETURN list.Classroom,count(*)",
        "question": "Report the number of students in each classroom.",
        "answers": [
            [
                101,
                3
            ],
            [
                112,
                3
            ],
            [
                107,
                6
            ],
            [
                105,
                5
            ],
            [
                111,
                4
            ],
            [
                102,
                7
            ],
            [
                104,
                4
            ],
            [
                109,
                8
            ],
            [
                110,
                6
            ],
            [
                103,
                5
            ],
            [
                106,
                7
            ],
            [
                108,
                2
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nRETURN list.Classroom,count(*)",
        "question": "For each classroom, show the classroom number and find how many students are using it.",
        "answers": [
            [
                101,
                3
            ],
            [
                112,
                3
            ],
            [
                107,
                6
            ],
            [
                105,
                5
            ],
            [
                111,
                4
            ],
            [
                102,
                7
            ],
            [
                104,
                4
            ],
            [
                109,
                8
            ],
            [
                110,
                6
            ],
            [
                103,
                5
            ],
            [
                106,
                7
            ],
            [
                108,
                2
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Grade = 0\nRETURN list.Classroom,count(*)",
        "question": "For each grade 0 classroom, report the total number of students.",
        "answers": [
            [
                105,
                5
            ],
            [
                104,
                4
            ],
            [
                106,
                7
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Grade = 0\nRETURN list.Classroom,count(*)",
        "question": "For each grade 0 classroom, return the classroom number and the count of students.",
        "answers": [
            [
                105,
                5
            ],
            [
                104,
                4
            ],
            [
                106,
                7
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Grade = 4\nRETURN list.Classroom,count(*)",
        "question": "Report the total number of students for each fourth-grade classroom.",
        "answers": [
            [
                111,
                4
            ],
            [
                110,
                6
            ],
            [
                108,
                2
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nWHERE list.Grade = 4\nRETURN list.Classroom,count(*)",
        "question": "For each fourth-grade classroom, show the classroom number and the total number of students using it.",
        "answers": [
            [
                111,
                4
            ],
            [
                110,
                6
            ],
            [
                108,
                2
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nRETURN count(*),list.Classroom",
        "question": "Find the number of students in one classroom.",
        "answers": [
            [
                3,
                101
            ],
            [
                3,
                112
            ],
            [
                6,
                107
            ],
            [
                5,
                105
            ],
            [
                4,
                111
            ],
            [
                7,
                102
            ],
            [
                4,
                104
            ],
            [
                8,
                109
            ],
            [
                6,
                110
            ],
            [
                5,
                103
            ],
            [
                7,
                106
            ],
            [
                2,
                108
            ]
        ]
    },
    {
        "db_id": "student_1",
        "query": "MATCH (list:`student_1.list`)\nRETURN count(*),list.Classroom",
        "question": "How many students does one classroom have?",
        "answers": [
            [
                3,
                101
            ],
            [
                3,
                112
            ],
            [
                6,
                107
            ],
            [
                5,
                105
            ],
            [
                4,
                111
            ],
            [
                7,
                102
            ],
            [
                4,
                104
            ],
            [
                8,
                109
            ],
            [
                6,
                110
            ],
            [
                5,
                103
            ],
            [
                7,
                106
            ],
            [
                2,
                108
            ]
        ]
    },
    {
        "db_id": "company_employee",
        "query": "MATCH (company:`company_employee.company`)\nRETURN company.Name\nORDER BY company.Sales_in_Billion ASC",
        "question": "List the names of companies by ascending number of sales.",
        "answers": [
            [
                "Agricultural Bank of China"
            ],
            [
                "China Construction Bank"
            ],
            [
                "Industrial and Commercial Bank of China"
            ],
            [
                "Wells Fargo"
            ],
            [
                "HSBC"
            ],
            [
                "Citigroup"
            ],
            [
                "JPMorgan Chase"
            ],
            [
                "Gazprom"
            ],
            [
                "Berkshire Hathaway"
            ],
            [
                "Petrobras"
            ],
            [
                "General Electric"
            ],
            [
                "Total"
            ],
            [
                "Volkswagen Group"
            ],
            [
                "Chevron"
            ],
            [
                "PetroChina"
            ],
            [
                "BP"
            ],
            [
                "ExxonMobil"
            ],
            [
                "Walmart"
            ],
            [
                "Royal Dutch Shell"
            ]
        ]
    },
    {
        "db_id": "company_employee",
        "query": "MATCH (company:`company_employee.company`)\nRETURN company.Headquarters,count(*)",
        "question": "Show the different headquarters and number of companies at each headquarter.",
        "answers": [
            [
                "USA",
                8
            ],
            [
                "Netherlands",
                1
            ],
            [
                "China",
                4
            ],
            [
                "UK",
                2
            ],
            [
                "Brazil",
                1
            ],
            [
                "Russia",
                1
            ],
            [
                "Germany",
                1
            ],
            [
                "France",
                1
            ]
        ]
    },
    {
        "db_id": "company_employee",
        "query": "MATCH (company:`company_employee.company`)\nRETURN company.Headquarters\nORDER BY company.Headquarters DESC\nLIMIT 1",
        "question": "Show the most common headquarter for companies.",
        "answers": [
            [
                "USA"
            ]
        ]
    },
    {
        "db_id": "company_employee",
        "query": "MATCH (company:`company_employee.company`)\nWITH count(*) AS count, company.Headquarters AS Headquarters\nWHERE count  >= 2\nRETURN Headquarters",
        "question": "Show the headquarters that have at least two companies.",
        "answers": [
            [
                "USA"
            ],
            [
                "China"
            ],
            [
                "UK"
            ]
        ]
    },
    {
        "db_id": "company_employee",
        "query": "MATCH (company:`company_employee.company`)\nWHERE company.Sales_in_Billion > 200\nRETURN company.Name\nORDER BY company.Sales_in_Billion,company.Profits_in_Billion DESC",
        "question": "list the names of the companies with more than 200 sales in the descending order of sales and profits.",
        "answers": [
            [
                "Total"
            ],
            [
                "Volkswagen Group"
            ],
            [
                "Chevron"
            ],
            [
                "PetroChina"
            ],
            [
                "BP"
            ],
            [
                "ExxonMobil"
            ],
            [
                "Walmart"
            ],
            [
                "Royal Dutch Shell"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nRETURN count(*)",
        "question": "How many film are there?",
        "answers": [
            [
                13
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nRETURN count(*)",
        "question": "Count the number of films.",
        "answers": [
            [
                13
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nRETURN DISTINCT film.Director",
        "question": "List the distinct director of all films.",
        "answers": [
            [
                "Steven Spielberg"
            ],
            [
                "Sydney Pollack"
            ],
            [
                "Taylor Hackford"
            ],
            [
                "Sylvester Stallone"
            ],
            [
                "Bob Clark"
            ],
            [
                "Nicholas Meyer"
            ],
            [
                "Walter Hill"
            ],
            [
                "Tobe Hooper"
            ],
            [
                "Colin Higgins"
            ],
            [
                "John Huston"
            ],
            [
                "Sidney Lumet"
            ],
            [
                "Richard Attenborough"
            ],
            [
                "Ted Kotcheff"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nRETURN DISTINCT film.Director",
        "question": "What are the different film Directors?",
        "answers": [
            [
                "Steven Spielberg"
            ],
            [
                "Sydney Pollack"
            ],
            [
                "Taylor Hackford"
            ],
            [
                "Sylvester Stallone"
            ],
            [
                "Bob Clark"
            ],
            [
                "Nicholas Meyer"
            ],
            [
                "Walter Hill"
            ],
            [
                "Tobe Hooper"
            ],
            [
                "Colin Higgins"
            ],
            [
                "John Huston"
            ],
            [
                "Sidney Lumet"
            ],
            [
                "Richard Attenborough"
            ],
            [
                "Ted Kotcheff"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nRETURN avg(film.Gross_in_dollar)",
        "question": "What is the average ticket sales gross in dollars of films?",
        "answers": [
            [
                114827242.38461539
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nRETURN avg(film.Gross_in_dollar)",
        "question": "Return the average gross sales in dollars across all films.",
        "answers": [
            [
                114827242.38461539
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film_market_estimation:`film_rank.film_market_estimation`)\nRETURN film_market_estimation.Low_Estimate,film_market_estimation.High_Estimate",
        "question": "What are the low and high estimates of film markets?",
        "answers": [
            [
                80000.0,
                80400.0
            ],
            [
                8000.0,
                8000.0
            ],
            [
                3000.0,
                80400.0
            ],
            [
                960.0,
                960.0
            ],
            [
                913.0,
                913.0
            ],
            [
                300.0,
                1000.0
            ],
            [
                53.0,
                53.0
            ],
            [
                39.0,
                39.0
            ],
            [
                16.0,
                16.0
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film_market_estimation:`film_rank.film_market_estimation`)\nRETURN film_market_estimation.Low_Estimate,film_market_estimation.High_Estimate",
        "question": "Return the low and high estimates for all film markets.",
        "answers": [
            [
                80000.0,
                80400.0
            ],
            [
                8000.0,
                8000.0
            ],
            [
                3000.0,
                80400.0
            ],
            [
                960.0,
                960.0
            ],
            [
                913.0,
                913.0
            ],
            [
                300.0,
                1000.0
            ],
            [
                53.0,
                53.0
            ],
            [
                39.0,
                39.0
            ],
            [
                16.0,
                16.0
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film_market_estimation:`film_rank.film_market_estimation`)\nWHERE film_market_estimation.Year = 1995\nRETURN film_market_estimation.Type",
        "question": "What are the types of film market estimations in year 1995?",
        "answers": [
            [
                "Mass suicide"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film_market_estimation:`film_rank.film_market_estimation`)\nWHERE film_market_estimation.Year = 1995\nRETURN film_market_estimation.Type",
        "question": "Return the types of film market estimations in 1995.",
        "answers": [
            [
                "Mass suicide"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (market:`film_rank.market`)\nRETURN max(market.Number_cities),min(market.Number_cities)",
        "question": "What are the maximum and minimum number of cities in all markets.",
        "answers": [
            [
                700,
                209
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (market:`film_rank.market`)\nRETURN max(market.Number_cities),min(market.Number_cities)",
        "question": "Return the maximum and minimum number of cities across all markets.",
        "answers": [
            [
                700,
                209
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (market:`film_rank.market`)\nWHERE market.Number_cities < 300\nRETURN count(*)",
        "question": "How many markets have number of cities smaller than 300?",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (market:`film_rank.market`)\nWHERE market.Number_cities < 300\nRETURN count(*)",
        "question": "Count the number of markets that have a number of cities lower than 300.",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (market:`film_rank.market`)\nRETURN market.Country\nORDER BY market.Country ASC",
        "question": "List all countries of markets in ascending alphabetical order.",
        "answers": [
            [
                "China"
            ],
            [
                "France"
            ],
            [
                "Japan"
            ],
            [
                "Poland"
            ],
            [
                "Russia"
            ],
            [
                "USA"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (market:`film_rank.market`)\nRETURN market.Country\nORDER BY market.Country ASC",
        "question": "What are the countries for each market, ordered alphabetically?",
        "answers": [
            [
                "China"
            ],
            [
                "France"
            ],
            [
                "Japan"
            ],
            [
                "Poland"
            ],
            [
                "Russia"
            ],
            [
                "USA"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (market:`film_rank.market`)\nRETURN market.Country\nORDER BY market.Number_cities DESC",
        "question": "List all countries of markets in descending order of number of cities.",
        "answers": [
            [
                "USA"
            ],
            [
                "China"
            ],
            [
                "Poland"
            ],
            [
                "Russia"
            ],
            [
                "France"
            ],
            [
                "Japan"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (market:`film_rank.market`)\nRETURN market.Country\nORDER BY market.Number_cities DESC",
        "question": "What are the countries for each market ordered by decreasing number of cities?",
        "answers": [
            [
                "USA"
            ],
            [
                "China"
            ],
            [
                "Poland"
            ],
            [
                "Russia"
            ],
            [
                "France"
            ],
            [
                "Japan"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (T1:`film_rank.film`)-[]-(T2:`film_rank.film_market_estimation`)\nRETURN T1.Title,T2.Type",
        "question": "Please show the titles of films and the types of market estimations.",
        "answers": [
            [
                "ET the Extra-Terrestrial",
                "Mass suicide"
            ],
            [
                "ET the Extra-Terrestrial",
                "Mass suicide"
            ],
            [
                "ET the Extra-Terrestrial",
                "Mass suicide murder"
            ],
            [
                "Tootsie",
                "Mass suicide"
            ],
            [
                "An Officer and a Gentleman",
                "Mass human sacrifice"
            ],
            [
                "Rocky III",
                "Mass suicide"
            ],
            [
                "Rocky III",
                "Mass suicide murder"
            ],
            [
                "Rocky III",
                "Mass suicide"
            ],
            [
                "Rocky III",
                "Mass suicide"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (T1:`film_rank.film`)-[]-(T2:`film_rank.film_market_estimation`)\nRETURN T1.Title,T2.Type",
        "question": "What are the titles of films and corresponding types of market estimations?",
        "answers": [
            [
                "ET the Extra-Terrestrial",
                "Mass suicide"
            ],
            [
                "ET the Extra-Terrestrial",
                "Mass suicide"
            ],
            [
                "ET the Extra-Terrestrial",
                "Mass suicide murder"
            ],
            [
                "Tootsie",
                "Mass suicide"
            ],
            [
                "An Officer and a Gentleman",
                "Mass human sacrifice"
            ],
            [
                "Rocky III",
                "Mass suicide"
            ],
            [
                "Rocky III",
                "Mass suicide murder"
            ],
            [
                "Rocky III",
                "Mass suicide"
            ],
            [
                "Rocky III",
                "Mass suicide"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (T1:`film_rank.film`)-[]-(T2:`film_rank.film_market_estimation`)\nWHERE T2.Year = 1995\nRETURN DISTINCT T1.Director",
        "question": "Show the distinct director of films with market estimation in the year of 1995.",
        "answers": [
            [
                "Steven Spielberg"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (T1:`film_rank.film`)-[]-(T2:`film_rank.film_market_estimation`)\nWHERE T2.Year = 1995\nRETURN DISTINCT T1.Director",
        "question": "Who are the different directors of films which had market estimation in 1995?",
        "answers": [
            [
                "Steven Spielberg"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (T1:`film_rank.film_market_estimation`)-[]-(T2:`film_rank.market`)\nRETURN T2.Country,T1.Year",
        "question": "Please list the countries and years of film market estimations.",
        "answers": [
            [
                "Japan",
                2000
            ],
            [
                "Japan",
                1994
            ],
            [
                "Japan",
                1945
            ],
            [
                "Japan",
                1978
            ],
            [
                "China",
                1944
            ],
            [
                "China",
                1973
            ],
            [
                "China",
                1997
            ],
            [
                "USA",
                1487
            ],
            [
                "USA",
                1995
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (T1:`film_rank.film_market_estimation`)-[]-(T2:`film_rank.market`)\nRETURN T2.Country,T1.Year",
        "question": "What are the countries of markets and their corresponding years of market estimation?",
        "answers": [
            [
                "Japan",
                2000
            ],
            [
                "Japan",
                1994
            ],
            [
                "Japan",
                1945
            ],
            [
                "Japan",
                1978
            ],
            [
                "China",
                1944
            ],
            [
                "China",
                1973
            ],
            [
                "China",
                1997
            ],
            [
                "USA",
                1487
            ],
            [
                "USA",
                1995
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (T1:`film_rank.film_market_estimation`)-[]-(T2:`film_rank.market`)\nWHERE T2.Country = 'Japan'\nRETURN T1.Year\nORDER BY T1.Year DESC",
        "question": "Please list the years of film market estimations when the market is in country \"Japan\" in descending order.",
        "answers": [
            [
                2000
            ],
            [
                1994
            ],
            [
                1978
            ],
            [
                1945
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (T1:`film_rank.film_market_estimation`)-[]-(T2:`film_rank.market`)\nWHERE T2.Country = 'Japan'\nRETURN T1.Year\nORDER BY T1.Year DESC",
        "question": "What are the years of film market estimation for the market of Japan, ordered by year descending?",
        "answers": [
            [
                2000
            ],
            [
                1994
            ],
            [
                1978
            ],
            [
                1945
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nRETURN film.Studio,count(*)",
        "question": "List the studios of each film and the number of films produced by that studio.",
        "answers": [
            [
                "Universal",
                1
            ],
            [
                "Columbia",
                2
            ],
            [
                "Paramount / Lorimar",
                1
            ],
            [
                "United Artists",
                1
            ],
            [
                "20th Century Fox",
                2
            ],
            [
                "Paramount",
                2
            ],
            [
                "MGM",
                1
            ],
            [
                "Universal / RKO",
                1
            ],
            [
                "Columbia / Rastar",
                1
            ],
            [
                "Orion / Carolco",
                1
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nRETURN film.Studio,count(*)",
        "question": "How films are produced by each studio?",
        "answers": [
            [
                "Universal",
                1
            ],
            [
                "Columbia",
                2
            ],
            [
                "Paramount / Lorimar",
                1
            ],
            [
                "United Artists",
                1
            ],
            [
                "20th Century Fox",
                2
            ],
            [
                "Paramount",
                2
            ],
            [
                "MGM",
                1
            ],
            [
                "Universal / RKO",
                1
            ],
            [
                "Columbia / Rastar",
                1
            ],
            [
                "Orion / Carolco",
                1
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nWITH count(*) AS count, film.Studio AS Studio\nWHERE count  >= 2\nRETURN Studio",
        "question": "List the names of studios that have at least two films.",
        "answers": [
            [
                "Columbia"
            ],
            [
                "20th Century Fox"
            ],
            [
                "Paramount"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nWITH count(*) AS count, film.Studio AS Studio\nWHERE count  >= 2\nRETURN Studio",
        "question": "What are the names of studios that have made two or more films?",
        "answers": [
            [
                "Columbia"
            ],
            [
                "20th Century Fox"
            ],
            [
                "Paramount"
            ]
        ]
    },
    {
        "db_id": "film_rank",
        "query": "MATCH (film:`film_rank.film`)\nWHERE NOT (film)-[]-(:`film_rank.film_market_estimation`)    \nRETURN film.Title",
        "question": "List the title of films that do not have any market estimation.",
        "answers": [
            [
                "Porky's"
            ],
            [
                "Star Trek II: The Wrath of Khan"
            ],
            [
                "48 Hrs"
            ],
            [
                "Poltergeist"
            ],
            [
                "The Best Little Whorehouse in Texas"
            ],
            [
                "Annie"
            ],
            [
                "The Verdict"
            ],
            [
                "Gandhi"
            ],
            [
                "First Blood"
            ]
        ]
    }
]