[
    {
        "question": "Retrieve all the first and last names of authors in the alphabetical order of last names.",
        "query": "MATCH (authors:`icfp_1.Authors`)\nRETURN authors.fname,authors.lname\nORDER BY authors.lname",
        "db_id": "icfp_1",
        "answers": [
            [
                "Amal",
                "Ahmed"
            ],
            [
                "Matthias",
                "Blume"
            ],
            [
                "Jeremy",
                "Gibbons"
            ],
            [
                "Ralf",
                "Hinze"
            ],
            [
                "Daniel W. H.",
                "James"
            ],
            [
                "Atsushi",
                "Ohori"
            ],
            [
                "Nicolas",
                "Pouillard"
            ],
            [
                "Tim",
                "Sheard"
            ],
            [
                "Olin",
                "Shivers"
            ],
            [
                "Aaron",
                "Turon"
            ],
            [
                "Katsuhiro",
                "Ueno"
            ],
            [
                "Stephanie",
                "Weirich"
            ],
            [
                "Brent",
                "Yorgey"
            ]
        ]
    },
    {
        "question": "How many stores are there?",
        "query": "MATCH (store:`sakila_1.store`)\nRETURN count(*)",
        "db_id": "sakila_1",
        "answers": [
            [
                0
            ]
        ]
    },
    {
        "question": "Count the number of bank branches.",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN count(*)",
        "db_id": "loan_1",
        "answers": [
            [
                4
            ]
        ]
    },
    {
        "question": "Find the average number of customers in all banks of Utah state.",
        "query": "MATCH (bank:`loan_1.bank`)\nWHERE bank.state = 'Utah'\nRETURN avg(bank.no_of_customers)",
        "db_id": "loan_1",
        "answers": [
            [
                123.0
            ]
        ]
    },
    {
        "question": "Find the average number of customers cross all banks.",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN avg(bank.no_of_customers)",
        "db_id": "loan_1",
        "answers": [
            [
                286.5
            ]
        ]
    },
    {
        "question": "Find the city and state of the bank branch named morningside.",
        "query": "MATCH (bank:`loan_1.bank`)\nWHERE bank.bname = 'morningside'\nRETURN bank.city,bank.state",
        "db_id": "loan_1",
        "answers": [
            [
                "New York City",
                "New York"
            ]
        ]
    },
    {
        "question": "Find the branch names of banks in the New York state.",
        "query": "MATCH (bank:`loan_1.bank`)\nWHERE bank.state = 'New York'\nRETURN bank.bname",
        "db_id": "loan_1",
        "answers": [
            [
                "morningside"
            ],
            [
                "broadway"
            ]
        ]
    },
    {
        "question": "List the name of all customers sorted by their account balance in ascending order.",
        "query": "MATCH (customer:`loan_1.customer`)\nRETURN customer.cust_name\nORDER BY customer.acc_bal",
        "db_id": "loan_1",
        "answers": [
            [
                "Jack"
            ],
            [
                "Mary"
            ],
            [
                "Owen"
            ]
        ]
    },
    {
        "question": "Find the state, account type, and credit score of the customer whose number of loan is 0.",
        "query": "MATCH (customer:`loan_1.customer`)\nWHERE customer.no_of_loans = 0\nRETURN customer.state,customer.acc_type,customer.credit_score",
        "db_id": "loan_1",
        "answers": [
            [
                "New York",
                "saving",
                210
            ]
        ]
    },
    {
        "question": "Find the number of different cities which banks are located at.",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN count(DISTINCT bank.city)",
        "db_id": "loan_1",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "Find the number of different states which banks are located at.",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN count(DISTINCT bank.state)",
        "db_id": "loan_1",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "Count the number of different account types.",
        "query": "MATCH (customer:`loan_1.customer`)\nRETURN count(DISTINCT customer.acc_type)",
        "db_id": "loan_1",
        "answers": [
            [
                2
            ]
        ]
    },
    {
        "question": "Find the name and account balance of the customer whose name includes the letter \u2018a\u2019.",
        "query": "MATCH (customer:`loan_1.customer`)\nWHERE customer.cust_name =~'.*[A|a].*'\nRETURN customer.cust_name,customer.acc_bal",
        "db_id": "loan_1",
        "answers": [
            [
                "Mary",
                2000
            ],
            [
                "Jack",
                1000
            ]
        ]
    },
    {
        "question": "Find the branch name of the bank that has the most number of customers.",
        "query": "MATCH (bank:`loan_1.bank`)\nRETURN bank.bname\nORDER BY bank.no_of_customers DESC\nLIMIT 1",
        "db_id": "loan_1",
        "answers": [
            [
                "broadway"
            ]
        ]
    },
    {
        "question": "Find the name of customer who has the lowest credit score.",
        "query": "MATCH (customer:`loan_1.customer`)\nRETURN customer.cust_name\nORDER BY customer.credit_score\nLIMIT 1",
        "db_id": "loan_1",
        "answers": [
            [
                "Jack"
            ]
        ]
    },
    {
        "question": "Find the name, account type, and account balance of the customer who has the highest credit score.",
        "query": "MATCH (customer:`loan_1.customer`)\nRETURN customer.cust_name,customer.acc_type,customer.acc_bal\nORDER BY customer.credit_score DESC\nLIMIT 1",
        "db_id": "loan_1",
        "answers": [
            [
                "Owen",
                "saving",
                800000
            ]
        ]
    },
    {
        "question": "Return all distinct detention type codes.",
        "query": "MATCH (detention:`behavior_monitoring.Detention`)\nRETURN DISTINCT detention.detention_type_code",
        "db_id": "behavior_monitoring",
        "answers": [
            [
                "AFTER"
            ],
            [
                "BREAK "
            ],
            [
                "LUNCH"
            ]
        ]
    },
    {
        "question": "What are the start and end dates for incidents with incident type code \"NOISE\"?",
        "query": "MATCH (behavior_incident:`behavior_monitoring.Behavior_Incident`)\nWHERE behavior_incident.incident_type_code = 'NOISE'\nRETURN behavior_incident.date_incident_start,behavior_incident.date_incident_end",
        "db_id": "behavior_monitoring",
        "answers": [
            [
                "2017-07-09 10:04:13",
                "2018-03-08 14:08:54"
            ],
            [
                "2017-08-13 22:15:05",
                "2018-02-25 05:38:58"
            ],
            [
                "2017-06-19 14:25:54",
                "2018-03-08 09:36:36"
            ],
            [
                "2018-01-27 09:24:45",
                "2018-03-13 05:18:05"
            ],
            [
                "2017-08-29 20:48:56",
                "2018-03-16 14:37:20"
            ],
            [
                "2018-02-05 13:13:45",
                "2018-03-08 09:00:48"
            ]
        ]
    },
    {
        "question": "Return the cell phone number and email address for all students.",
        "query": "MATCH (students:`behavior_monitoring.Students`)\nRETURN students.cell_mobile_number,students.email_address",
        "db_id": "behavior_monitoring",
        "answers": [
            [
                "235.899.9744",
                "derrick.jenkins@example.com"
            ],
            [
                "1-247-673-8446",
                "rohan.clarabelle@example.org"
            ],
            [
                "1-751-162-9676x115",
                "kkirlin@example.org"
            ],
            [
                "1-895-196-9979",
                "eolson@example.com"
            ],
            [
                "1-036-062-5465",
                "dicki.kathryne@example.org"
            ],
            [
                "(874)070-9495",
                "norwood.howell@example.org"
            ],
            [
                "763.072.5520x5907",
                "lisette.brekke@example.net"
            ],
            [
                "319.497.4575x2214",
                "jasmin.schuppe@example.com"
            ],
            [
                "(568)451-0917x3945",
                "dora.zboncak@example.org"
            ],
            [
                "08605192839",
                "frederique.mante@example.org"
            ],
            [
                "+60(5)3280072514",
                "qharvey@example.com"
            ],
            [
                "(921)011-7909x3518",
                "mitchel55@example.net"
            ],
            [
                "(062)892-7033",
                "gbeatty@example.com"
            ],
            [
                "(820)260-5721",
                "foster.zemlak@example.com"
            ],
            [
                "1-498-138-8088",
                "kertzmann.devon@example.net"
            ]
        ]
    },
    {
        "question": "What is the email of the student with first name \"Emma\" and last name \"Rohan\"?",
        "query": "MATCH (students:`behavior_monitoring.Students`)\nWHERE students.first_name = 'Emma' AND students.last_name = 'Rohan'\nRETURN students.email_address",
        "db_id": "behavior_monitoring",
        "answers": [
            [
                "derrick.jenkins@example.com"
            ]
        ]
    },
    {
        "question": "What is the gender of the teacher with last name \"Medhurst\"?",
        "query": "MATCH (teachers:`behavior_monitoring.Teachers`)\nWHERE teachers.last_name = 'Medhurst'\nRETURN teachers.gender",
        "db_id": "behavior_monitoring",
        "answers": [
            [
                "1"
            ]
        ]
    },
    {
        "question": "What is the incident type description for the incident type with code \"VIOLENCE\"?",
        "query": "MATCH (ref_incident_type:`behavior_monitoring.Ref_Incident_Type`)\nWHERE ref_incident_type.incident_type_code = 'VIOLENCE'\nRETURN ref_incident_type.incident_type_description",
        "db_id": "behavior_monitoring",
        "answers": [
            [
                "Violence"
            ]
        ]
    },
    {
        "question": "Find the first names of teachers whose email address contains the word \"man\".",
        "query": "MATCH (teachers:`behavior_monitoring.Teachers`)\nWHERE teachers.email_address =~'.*[M|m]an.*'\nRETURN teachers.first_name",
        "db_id": "behavior_monitoring",
        "answers": [
            [
                "Woodrow"
            ]
        ]
    },
    {
        "question": "List all cities of addresses in alphabetical order.",
        "query": "MATCH (addresses:`behavior_monitoring.Addresses`)\nRETURN addresses.city\nORDER BY addresses.city",
        "db_id": "behavior_monitoring",
        "answers": [
            [
                "Beierview"
            ],
            [
                "Caitlynstad"
            ],
            [
                "Corkeryborough"
            ],
            [
                "Edmundton"
            ],
            [
                "Elinoreport"
            ],
            [
                "Gleasonshire"
            ],
            [
                "Hegmannborough"
            ],
            [
                "Hintzport"
            ],
            [
                "Lake Ahmadland"
            ],
            [
                "Larkinport"
            ],
            [
                "Meganeland"
            ],
            [
                "New Annabellefort"
            ],
            [
                "North Fletcherside"
            ],
            [
                "North Jayceton"
            ],
            [
                "North Loyceville"
            ],
            [
                "North Orlobury"
            ],
            [
                "Tressamouth"
            ],
            [
                "Unachester"
            ],
            [
                "West Lianafurt"
            ],
            [
                "West Sean"
            ]
        ]
    },
    {
        "question": "Find the first names and last names of teachers in alphabetical order of last name.",
        "query": "MATCH (teachers:`behavior_monitoring.Teachers`)\nRETURN teachers.first_name,teachers.last_name\nORDER BY teachers.last_name",
        "db_id": "behavior_monitoring",
        "answers": [
            [
                "Aniya",
                "Becker"
            ],
            [
                "Hobart",
                "Bergnaum"
            ],
            [
                "Sid",
                "Brakus"
            ],
            [
                "Woodrow",
                "Goldner"
            ],
            [
                "Evelyn",
                "Hansen"
            ],
            [
                "Gregory",
                "Heller"
            ],
            [
                "Donnie",
                "Kuhic"
            ],
            [
                "Citlalli",
                "Kuhic"
            ],
            [
                "Edmond",
                "Lang"
            ],
            [
                "Lyla",
                "Medhurst"
            ],
            [
                "Camren",
                "Moore"
            ],
            [
                "Stephanie",
                "Price"
            ],
            [
                "Alvis",
                "Schultz"
            ],
            [
                "Trystan",
                "Schuster"
            ],
            [
                "Cecilia",
                "Ward"
            ]
        ]
    },
    {
        "question": "What is the zip code of the address where the teacher with first name \"Lyla\" lives?",
        "query": "MATCH (T1:`behavior_monitoring.Addresses`)-[]-(T2:`behavior_monitoring.Teachers`)\nWHERE T2.first_name = 'Lyla'\nRETURN T1.zip_postcode",
        "db_id": "behavior_monitoring",
        "answers": [
            [
                "435"
            ]
        ]
    },
    {
        "question": "What are the email addresses of teachers whose address has zip code \"918\"?",
        "query": "MATCH (T1:`behavior_monitoring.Addresses`)-[]-(T2:`behavior_monitoring.Teachers`)\nWHERE T1.zip_postcode = '918'\nRETURN T2.email_address",
        "db_id": "behavior_monitoring",
        "answers": [
            [
                "everardo.lynch@example.net"
            ]
        ]
    },
    {
        "question": "Which third party companies have at least 2 maintenance engineers or have at least 2 maintenance contracts? List the company id and name.",
        "query": "MATCH (T1:`assets_maintenance.Third_Party_Companies`)-[]-(T2:`assets_maintenance.Maintenance_Engineers`)\nWITH count(*) AS count, T1.company_name AS company_name, T1.company_id AS company_id\nWHERE count  >= 2\nRETURN company_id,company_name \nUNION\nMATCH (T3:`assets_maintenance.Third_Party_Companies`)-[]-(T4:`assets_maintenance.Maintenance_Contracts`)\nWITH count(*) AS count, T3.company_id AS company_id, T3.company_name AS company_name\nWHERE count  >= 2\nRETURN company_id,company_name",
        "db_id": "assets_maintenance",
        "answers": [
            [
                2,
                "McDermott Group"
            ],
            [
                3,
                "Schuppe-Carroll"
            ],
            [
                4,
                "Dooley-Langosh"
            ],
            [
                11,
                "Kuvalis, Boehm and Hettinger"
            ],
            [
                15,
                "Rau, Ullrich and King"
            ],
            [
                13,
                "Greenholt-D'Amore"
            ],
            [
                6,
                "Grimes, Mosciski and Renner"
            ]
        ]
    },
    {
        "question": "Which parts have more than 2 faults? Show the part name and id.",
        "query": "MATCH (T1:`assets_maintenance.Parts`)-[]-(T2:`assets_maintenance.Part_Faults`)\nWITH count(*) AS count, T1.part_name AS part_name, T1.part_id AS part_id\nWHERE count  > 2\nRETURN part_name,part_id",
        "db_id": "assets_maintenance",
        "answers": [
            [
                "top",
                1
            ],
            [
                "package",
                3
            ]
        ]
    },
    {
        "question": "How many engineer visits are required at most for a single fault log? List the number and the log entry id.",
        "query": "MATCH (T1:`assets_maintenance.Fault_Log`)-[]-(T2:`assets_maintenance.Engineer_Visits`)\nWITH T1.fault_log_entry_id AS fault_log_entry_id, count(T1.fault_log_entry_id) AS count\nRETURN count,fault_log_entry_id\nORDER BY count DESC\nLIMIT 1",
        "db_id": "assets_maintenance",
        "answers": [
            [
                5,
                13
            ]
        ]
    },
    {
        "question": "Which engineers have never visited to maintain the assets? List the engineer first name and last name.",
        "query": "MATCH (maintenance_engineers:`assets_maintenance.Maintenance_Engineers`)\nWHERE NOT (maintenance_engineers:`assets_maintenance.Maintenance_Engineers`)-[]-(:`assets_maintenance.Engineer_Visits`)\nRETURN maintenance_engineers.first_name,maintenance_engineers.last_name",
        "db_id": "assets_maintenance",
        "answers": [
            [
                "Clemens",
                "Orn"
            ],
            [
                "Samanta",
                "Hauck"
            ],
            [
                "Manley",
                "Grady"
            ],
            [
                "Josie",
                "Harvey"
            ],
            [
                "Brian",
                "Stamm"
            ],
            [
                "Weston",
                "Hahn"
            ],
            [
                "Jules",
                "Goldner"
            ]
        ]
    },
    {
        "question": "List the asset id, details, make and model for every asset.",
        "query": "MATCH (assets:`assets_maintenance.Assets`)\nRETURN assets.asset_id,assets.asset_details,assets.asset_make,assets.asset_model",
        "db_id": "assets_maintenance",
        "answers": [
            [
                1,
                "dell laptop1",
                "PT",
                "58 ub"
            ],
            [
                2,
                "dell laptop2",
                "IN",
                "35 xt"
            ],
            [
                3,
                "dell laptop3",
                "IT",
                "63 ok"
            ],
            [
                4,
                "dell laptop4",
                "RU",
                "69 uv"
            ],
            [
                5,
                "dell laptop5",
                "DE",
                "90 oq"
            ],
            [
                6,
                "monitor1",
                "CN",
                "91 ub"
            ],
            [
                7,
                "monitor2",
                "CN",
                "27 du"
            ],
            [
                8,
                "monitor3",
                "GB",
                "94 kg"
            ],
            [
                9,
                "machine1",
                "RU",
                "07 yt"
            ],
            [
                10,
                "machine2",
                "FR",
                "20 tl"
            ],
            [
                11,
                "machine3",
                "FR",
                "11 wi"
            ],
            [
                12,
                "machine4",
                "RU",
                "95 vn"
            ],
            [
                13,
                "system1",
                "DE",
                "08 yy"
            ],
            [
                14,
                "system2",
                "IN",
                "66 xm"
            ],
            [
                15,
                "system3",
                "IE",
                "24 ak"
            ]
        ]
    },
    {
        "question": "Which kind of part has the least number of faults? List the part name.",
        "query": "MATCH (T1:`assets_maintenance.Parts`)-[]-(T2:`assets_maintenance.Part_Faults`)\nWITH T1.part_name AS part_name, count(T1.part_name) AS count\nRETURN part_name\nORDER BY count ASC\nLIMIT 1",
        "db_id": "assets_maintenance",
        "answers": [
            [
                "middle"
            ]
        ]
    },
    {
        "question": "List the all the assets make, model, details by the disposed date ascendingly.",
        "query": "MATCH (assets:`assets_maintenance.Assets`)\nRETURN assets.asset_make,assets.asset_model,assets.asset_details\nORDER BY assets.asset_disposed_date ASC",
        "db_id": "assets_maintenance",
        "answers": [
            [
                "IE",
                "24 ak",
                "system3"
            ],
            [
                "DE",
                "90 oq",
                "dell laptop5"
            ],
            [
                "RU",
                "95 vn",
                "machine4"
            ],
            [
                "GB",
                "94 kg",
                "monitor3"
            ],
            [
                "FR",
                "20 tl",
                "machine2"
            ],
            [
                "DE",
                "08 yy",
                "system1"
            ],
            [
                "RU",
                "07 yt",
                "machine1"
            ],
            [
                "IT",
                "63 ok",
                "dell laptop3"
            ],
            [
                "CN",
                "91 ub",
                "monitor1"
            ],
            [
                "PT",
                "58 ub",
                "dell laptop1"
            ],
            [
                "RU",
                "69 uv",
                "dell laptop4"
            ],
            [
                "FR",
                "11 wi",
                "machine3"
            ],
            [
                "IN",
                "35 xt",
                "dell laptop2"
            ],
            [
                "CN",
                "27 du",
                "monitor2"
            ],
            [
                "IN",
                "66 xm",
                "system2"
            ]
        ]
    },
    {
        "question": "Which part has the least chargeable amount? List the part id and amount.",
        "query": "MATCH (parts:`assets_maintenance.Parts`)\nRETURN parts.part_id,parts.chargeable_amount\nORDER BY parts.chargeable_amount ASC\nLIMIT 1",
        "db_id": "assets_maintenance",
        "answers": [
            [
                1,
                "4"
            ]
        ]
    },
    {
        "question": "Which company started the earliest the maintenance contract? Show the company name.",
        "query": "MATCH (T1:`assets_maintenance.Third_Party_Companies`)-[]-(T2:`assets_maintenance.Maintenance_Contracts`)\nRETURN T1.company_name\nORDER BY T2.contract_start_date ASC\nLIMIT 1",
        "db_id": "assets_maintenance",
        "answers": [
            [
                "Grimes, Mosciski and Renner"
            ]
        ]
    },
    {
        "question": "How many engineers did each staff contact? List both the contact staff name and number of engineers contacted.",
        "query": "MATCH (T1:`assets_maintenance.Staff`)-[]-(T2:`assets_maintenance.Engineer_Visits`)\nWITH count(T1.staff_name) AS count, T1.staff_name AS staff_name\nRETURN staff_name,count",
        "db_id": "assets_maintenance",
        "answers": [
            [
                "Berneice",
                2
            ],
            [
                "Edmond",
                3
            ],
            [
                "Rodger",
                1
            ],
            [
                "Kadin",
                4
            ],
            [
                "Christophe",
                1
            ],
            [
                "Bernice",
                2
            ],
            [
                "Oren",
                1
            ],
            [
                "Cyrus",
                1
            ]
        ]
    },
    {
        "question": "list the local authorities and services provided by all stations.",
        "query": "MATCH (station:`station_weather.station`)\nRETURN station.local_authority,station.services",
        "db_id": "station_weather",
        "answers": [
            [
                "Chiltern",
                "Metropolitan line and Chiltern Railways"
            ],
            [
                "Watford",
                "London Overground and London Midland"
            ],
            [
                "Brentwood",
                "Greater Anglia"
            ],
            [
                "Broxbourne",
                "Greater Anglia"
            ],
            [
                "Three Rivers",
                "London Overground"
            ],
            [
                "Thurrock",
                "c2c"
            ],
            [
                "Chiltern",
                "Metropolitan line and Chiltern Railways"
            ],
            [
                "Chiltern",
                "Metropolitan line"
            ],
            [
                "Broxbourne",
                "Greater Anglia"
            ],
            [
                "Three Rivers",
                "Metropolitan line and Chiltern Railways"
            ],
            [
                "Three Rivers",
                "Metropolitan line"
            ]
        ]
    },
    {
        "question": "Find the number of trains starting from each origin.",
        "query": "MATCH (train:`station_weather.train`)\nWITH count(train.origin) AS count, train.origin AS origin\nRETURN origin,count",
        "db_id": "station_weather",
        "answers": [
            [
                "Trivandrum",
                1
            ],
            [
                "Chennai",
                2
            ],
            [
                "Guruvayur",
                1
            ],
            [
                "Kanniyakumari",
                2
            ],
            [
                "Quilon",
                1
            ],
            [
                "Madurai",
                1
            ],
            [
                "Bangalore",
                1
            ],
            [
                "Mumbai",
                1
            ],
            [
                "Nagercoil",
                1
            ]
        ]
    },
    {
        "question": "show the lowest low temperature and highest wind speed in miles per hour.",
        "query": "MATCH (weekly_weather:`station_weather.weekly_weather`)\nRETURN min(weekly_weather.low_temperature),max(weekly_weather.wind_speed_mph)",
        "db_id": "station_weather",
        "answers": [
            [
                46,
                24
            ]
        ]
    },
    {
        "question": "Find the origins from which more than 1 train starts.",
        "query": "MATCH (train:`station_weather.train`)\nWITH count(*) AS count, train.origin AS origin\nWHERE count  > 1\nRETURN origin",
        "db_id": "station_weather",
        "answers": [
            [
                "Chennai"
            ],
            [
                "Kanniyakumari"
            ]
        ]
    },
    {
        "question": "What is the code of the school where the accounting department belongs to?",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nWHERE department.DEPT_NAME = 'Accounting'\nRETURN department.SCHOOL_CODE",
        "db_id": "college_1",
        "answers": [
            [
                "BUS"
            ]
        ]
    },
    {
        "question": "What is the school code of the accounting department?",
        "query": "MATCH (department:`college_1.DEPARTMENT`)\nWHERE department.DEPT_NAME = 'Accounting'\nRETURN department.SCHOOL_CODE",
        "db_id": "college_1",
        "answers": [
            [
                "BUS"
            ]
        ]
    },
    {
        "question": "Find the number of classes offered for all class rooms that held at least 2 classes.",
        "query": "MATCH (class:`college_1.CLASS`)\nWITH class.CLASS_ROOM AS CLASS_ROOM, count(*) AS count\nWHERE count  >= 2\nRETURN count,CLASS_ROOM",
        "db_id": "college_1",
        "answers": [
            [
                2,
                "BUS311"
            ],
            [
                2,
                "BUS252"
            ],
            [
                3,
                "KLR209"
            ],
            [
                4,
                "KLR200"
            ]
        ]
    },
    {
        "question": "Find the count and code of the job has most employees.",
        "query": "MATCH (employee:`college_1.EMPLOYEE`)\nWITH count(employee.EMP_JOBCODE) AS count, employee.EMP_JOBCODE AS EMP_JOBCODE\nRETURN EMP_JOBCODE,count\nORDER BY count DESC\nLIMIT 1",
        "db_id": "college_1",
        "answers": [
            [
                "PROF",
                22
            ]
        ]
    },
    {
        "question": "What is the count and code of the job with the most employee?",
        "query": "MATCH (employee:`college_1.EMPLOYEE`)\nWITH count(employee.EMP_JOBCODE) AS count, employee.EMP_JOBCODE AS EMP_JOBCODE\nRETURN EMP_JOBCODE,count\nORDER BY count DESC\nLIMIT 1",
        "db_id": "college_1",
        "answers": [
            [
                "PROF",
                22
            ]
        ]
    },
    {
        "question": "Find the number of students for each department.",
        "query": "MATCH (student:`college_1.STUDENT`)\nWITH count(student.DEPT_CODE) AS count, student.DEPT_CODE AS DEPT_CODE\nRETURN count,DEPT_CODE",
        "db_id": "college_1",
        "answers": [
            [
                1,
                "BIOL"
            ],
            [
                2,
                "CIS"
            ],
            [
                3,
                "ACCT"
            ],
            [
                1,
                "ENGL"
            ],
            [
                1,
                "EDU"
            ]
        ]
    },
    {
        "question": "How many sections does course ACCT-211 has?",
        "query": "MATCH (class:`college_1.CLASS`)\nWHERE class.CRS_CODE = 'ACCT-211'\nRETURN count(DISTINCT class.CLASS_SECTION)",
        "db_id": "college_1",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "What is the number of different class sections offered in the course ACCT-211?",
        "query": "MATCH (class:`college_1.CLASS`)\nWHERE class.CRS_CODE = 'ACCT-211'\nRETURN count(DISTINCT class.CLASS_SECTION)",
        "db_id": "college_1",
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "question": "Find the total number of employees.",
        "query": "MATCH (employee:`college_1.EMPLOYEE`)\nRETURN count(*)",
        "db_id": "college_1",
        "answers": [
            [
                37
            ]
        ]
    }
]