[
    {
        "db_id": "assets_maintenance",
        "question": "How many assets does each third party company supply? List the count and the company id.",
        "cypher_query": "MATCH (T1:Third_Party_Companies)-[]-(T2:Assets)\nWITH count(T1.company_id) AS count, T1.company_id AS company_id\nRETURN count,company_id",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "company_id",
                "count"
            ],
            "Token_Name_Label": [
                "Third_Party_Companies",
                "Assets"
            ],
            "Token_Name_Function": "count",
            "Token_Operator": "."
        },
        "answers": [
            [
                1,
                1
            ],
            [
                3,
                2
            ],
            [
                2,
                5
            ],
            [
                3,
                6
            ],
            [
                1,
                7
            ],
            [
                1,
                8
            ],
            [
                1,
                11
            ],
            [
                1,
                12
            ],
            [
                1,
                13
            ],
            [
                1,
                14
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "Which third party companies have at least 2 maintenance engineers or have at least 2 maintenance contracts? List the company id and name.",
        "cypher_query": "MATCH (T1:Third_Party_Companies)-[]-(T2:Maintenance_Engineers)\nWITH T1.company_id AS company_id, count(*) AS count, T1.company_name AS company_name\nWHERE count  >= 2\nRETURN company_id,company_name \nUNION\nMATCH (T3:Third_Party_Companies)-[]-(T4:Maintenance_Contracts)\nWITH T3.company_name AS company_name, T3.company_id AS company_id, count(*) AS count\nWHERE count  >= 2\nRETURN company_id,company_name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "WHERE",
                "RETURN",
                "UNION"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n",
                "  ",
                " \n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "company_id",
                "count",
                "company_name",
                "T3",
                "T4"
            ],
            "Token_Name_Label": [
                "Third_Party_Companies",
                "Maintenance_Engineers",
                "Maintenance_Contracts"
            ],
            "Token_Operator": [
                ".",
                "*",
                ">="
            ],
            "Token_Name_Function": "count",
            "Token_Literal_Number_Integer": "2"
        },
        "answers": [
            [
                2,
                "McDermott Group"
            ],
            [
                3,
                "Schuppe-Carroll"
            ],
            [
                4,
                "Dooley-Langosh"
            ],
            [
                11,
                "Kuvalis, Boehm and Hettinger"
            ],
            [
                15,
                "Rau, Ullrich and King"
            ],
            [
                13,
                "Greenholt-D'Amore"
            ],
            [
                6,
                "Grimes, Mosciski and Renner"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "Which parts have more than 2 faults? Show the part name and id.",
        "cypher_query": "MATCH (T1:Parts)-[]-(T2:Part_Faults)\nWITH T1.part_id AS part_id, T1.part_name AS part_name, count(*) AS count\nWHERE count  > 2\nRETURN part_name,part_id",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "WHERE",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n",
                "  "
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "part_id",
                "part_name",
                "count"
            ],
            "Token_Name_Label": [
                "Parts",
                "Part_Faults"
            ],
            "Token_Operator": [
                ".",
                "*",
                ">"
            ],
            "Token_Name_Function": "count",
            "Token_Literal_Number_Integer": "2"
        },
        "answers": [
            [
                "top",
                1
            ],
            [
                "package",
                3
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "How many engineer visits are required at most for a single fault log? List the number and the log entry id.",
        "cypher_query": "MATCH (T1:Fault_Log)-[]-(T2:Engineer_Visits)\nWITH count(T1.fault_log_entry_id) AS count, T1.fault_log_entry_id AS fault_log_entry_id\nRETURN count,fault_log_entry_id\nORDER BY count DESC\nLIMIT 1",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "RETURN",
                "ORDER BY",
                "DESC",
                "LIMIT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "fault_log_entry_id",
                "count"
            ],
            "Token_Name_Label": [
                "Fault_Log",
                "Engineer_Visits"
            ],
            "Token_Name_Function": "count",
            "Token_Operator": ".",
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                5,
                13
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "Which engineers have never visited to maintain the assets? List the engineer first name and last name.",
        "cypher_query": "MATCH (ma:Maintenance_Engineers)\nWHERE NOT (ma:Maintenance_Engineers)-[]-(:Engineer_Visits)\nRETURN ma.first_name,ma.last_name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ")-[",
                "]-(",
                ","
            ],
            "Token_Name_Variable": [
                "ma",
                "first_name",
                "last_name"
            ],
            "Token_Name_Label": [
                "Maintenance_Engineers",
                "Engineer_Visits"
            ],
            "Token_Operator": [
                "NOT",
                "."
            ]
        },
        "answers": [
            [
                "Clemens",
                "Orn"
            ],
            [
                "Samanta",
                "Hauck"
            ],
            [
                "Manley",
                "Grady"
            ],
            [
                "Josie",
                "Harvey"
            ],
            [
                "Brian",
                "Stamm"
            ],
            [
                "Weston",
                "Hahn"
            ],
            [
                "Jules",
                "Goldner"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "List the asset id, details, make and model for every asset.",
        "cypher_query": "MATCH (as:Assets)\nRETURN as.asset_id,as.asset_details,as.asset_make,as.asset_model",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "as",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Label": "Assets",
            "Token_Operator": ".",
            "Token_Name_Variable": [
                "asset_id",
                "asset_details",
                "asset_make",
                "asset_model"
            ]
        },
        "answers": [
            [
                1,
                "dell laptop1",
                "PT",
                "58 ub"
            ],
            [
                2,
                "dell laptop2",
                "IN",
                "35 xt"
            ],
            [
                3,
                "dell laptop3",
                "IT",
                "63 ok"
            ],
            [
                4,
                "dell laptop4",
                "RU",
                "69 uv"
            ],
            [
                5,
                "dell laptop5",
                "DE",
                "90 oq"
            ],
            [
                6,
                "monitor1",
                "CN",
                "91 ub"
            ],
            [
                7,
                "monitor2",
                "CN",
                "27 du"
            ],
            [
                8,
                "monitor3",
                "GB",
                "94 kg"
            ],
            [
                9,
                "machine1",
                "RU",
                "07 yt"
            ],
            [
                10,
                "machine2",
                "FR",
                "20 tl"
            ],
            [
                11,
                "machine3",
                "FR",
                "11 wi"
            ],
            [
                12,
                "machine4",
                "RU",
                "95 vn"
            ],
            [
                13,
                "system1",
                "DE",
                "08 yy"
            ],
            [
                14,
                "system2",
                "IN",
                "66 xm"
            ],
            [
                15,
                "system3",
                "IE",
                "24 ak"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "Which part fault requires the most number of skills to fix? List part id and name.",
        "cypher_query": "MATCH (T1:Parts)-[]-(T2:Part_Faults)-[T3:Skills_Required_To_Fix]-()\nWITH count(T1.part_id) AS count, T1.part_name AS part_name, T1.part_id AS part_id\nRETURN part_id,part_name\nORDER BY count DESC\nLIMIT 1",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "RETURN",
                "ORDER BY",
                "DESC",
                "LIMIT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "T3",
                "part_id",
                "count",
                "part_name"
            ],
            "Token_Name_Label": [
                "Parts",
                "Part_Faults",
                "Skills_Required_To_Fix"
            ],
            "Token_Name_Function": "count",
            "Token_Operator": ".",
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                1,
                "top"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "Which kind of part has the least number of faults? List the part name.",
        "cypher_query": "MATCH (T1:Parts)-[]-(T2:Part_Faults)\nWITH count(T1.part_name) AS count, T1.part_name AS part_name\nRETURN part_name\nORDER BY count ASC\nLIMIT 1",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "RETURN",
                "ORDER BY",
                "ASC",
                "LIMIT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "part_name",
                "count"
            ],
            "Token_Name_Label": [
                "Parts",
                "Part_Faults"
            ],
            "Token_Name_Function": "count",
            "Token_Operator": ".",
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                "middle"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "Which fault log included the most number of faulty parts? List the fault log id, description and record time.",
        "cypher_query": "MATCH (T1:Fault_Log)-[T2:Fault_Log_Parts]-()\nWITH T1.fault_log_entry_datetime AS fault_log_entry_datetime, T1.fault_description AS fault_description, count(T1.fault_log_entry_id) AS count, T1.fault_log_entry_id AS fault_log_entry_id\nRETURN fault_log_entry_id,fault_description,fault_log_entry_datetime\nORDER BY count DESC\nLIMIT 1",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "RETURN",
                "ORDER BY",
                "DESC",
                "LIMIT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "fault_log_entry_datetime",
                "fault_description",
                "fault_log_entry_id",
                "count"
            ],
            "Token_Name_Label": [
                "Fault_Log",
                "Fault_Log_Parts"
            ],
            "Token_Operator": ".",
            "Token_Name_Function": "count",
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                1,
                "system error",
                "2018-03-21 04:25:00"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "List the all the assets make, model, details by the disposed date ascendingly.",
        "cypher_query": "MATCH (as:Assets)\nRETURN as.asset_make,as.asset_model,as.asset_details\nORDER BY as.asset_disposed_date ASC",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "as",
                "RETURN",
                "ORDER BY",
                "ASC"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Label": "Assets",
            "Token_Operator": ".",
            "Token_Name_Variable": [
                "asset_make",
                "asset_model",
                "asset_details",
                "asset_disposed_date"
            ]
        },
        "answers": [
            [
                "IE",
                "24 ak",
                "system3"
            ],
            [
                "DE",
                "90 oq",
                "dell laptop5"
            ],
            [
                "RU",
                "95 vn",
                "machine4"
            ],
            [
                "GB",
                "94 kg",
                "monitor3"
            ],
            [
                "FR",
                "20 tl",
                "machine2"
            ],
            [
                "DE",
                "08 yy",
                "system1"
            ],
            [
                "RU",
                "07 yt",
                "machine1"
            ],
            [
                "IT",
                "63 ok",
                "dell laptop3"
            ],
            [
                "CN",
                "91 ub",
                "monitor1"
            ],
            [
                "PT",
                "58 ub",
                "dell laptop1"
            ],
            [
                "RU",
                "69 uv",
                "dell laptop4"
            ],
            [
                "FR",
                "11 wi",
                "machine3"
            ],
            [
                "IN",
                "35 xt",
                "dell laptop2"
            ],
            [
                "CN",
                "27 du",
                "monitor2"
            ],
            [
                "IN",
                "66 xm",
                "system2"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "Which part has the least chargeable amount? List the part id and amount.",
        "cypher_query": "MATCH (pa:Parts)\nRETURN pa.part_id,pa.chargeable_amount\nORDER BY pa.chargeable_amount ASC\nLIMIT 1",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "ORDER BY",
                "ASC",
                "LIMIT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "pa",
                "part_id",
                "chargeable_amount"
            ],
            "Token_Name_Label": "Parts",
            "Token_Operator": ".",
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                1,
                "4"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "Which company started the earliest the maintenance contract? Show the company name.",
        "cypher_query": "MATCH (T1:Third_Party_Companies)-[]-(T2:Maintenance_Contracts)\nRETURN T1.company_name\nORDER BY T2.contract_start_date ASC\nLIMIT 1",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "ORDER BY",
                "ASC",
                "LIMIT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "company_name",
                "contract_start_date"
            ],
            "Token_Name_Label": [
                "Third_Party_Companies",
                "Maintenance_Contracts"
            ],
            "Token_Operator": ".",
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                "Grimes, Mosciski and Renner"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "How many engineers did each staff contact? List both the contact staff name and number of engineers contacted.",
        "cypher_query": "MATCH (T1:Staff)-[]-(T2:Engineer_Visits)\nWITH count(T1.staff_name) AS count, T1.staff_name AS staff_name\nRETURN staff_name,count",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "staff_name",
                "count"
            ],
            "Token_Name_Label": [
                "Staff",
                "Engineer_Visits"
            ],
            "Token_Name_Function": "count",
            "Token_Operator": "."
        },
        "answers": [
            [
                "Berneice",
                2
            ],
            [
                "Edmond",
                3
            ],
            [
                "Rodger",
                1
            ],
            [
                "Kadin",
                4
            ],
            [
                "Christophe",
                1
            ],
            [
                "Bernice",
                2
            ],
            [
                "Oren",
                1
            ],
            [
                "Cyrus",
                1
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "Which assets did not incur any fault log? List the asset model.",
        "cypher_query": "MATCH (as:Assets)\nWHERE NOT (as:Assets)-[]-(:Fault_Log)\nRETURN as.asset_model",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "as",
                "WHERE",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ")-[",
                "]-("
            ],
            "Token_Name_Label": [
                "Assets",
                "Fault_Log"
            ],
            "Token_Operator": [
                "NOT",
                "."
            ],
            "Token_Name_Variable": "asset_model"
        },
        "answers": [
            [
                "58 ub"
            ],
            [
                "69 uv"
            ],
            [
                "20 tl"
            ],
            [
                "11 wi"
            ],
            [
                "08 yy"
            ],
            [
                "66 xm"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "List the names of patients who have made appointments.",
        "cypher_query": "MATCH (T1:Appointment)-[]-(T2:Patient)\nRETURN T2.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2"
            ],
            "Token_Name_Label": [
                "Appointment",
                "Patient"
            ],
            "Token_Operator": "."
        },
        "answers": [
            [
                "John Smith"
            ],
            [
                "Grace Ritchie"
            ],
            [
                "Dennis Doe"
            ],
            [
                "Random J. Patient"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Which patients made more than one appointment? Tell me the name and phone number of these patients.",
        "cypher_query": "MATCH (T1:Appointment)-[]-(T2:Patient)\nWITH T2.Phone AS Phone, T2.Name AS Name, count(*) AS count\nWHERE count  > 1\nRETURN Name,Phone",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "Name",
                "WHERE",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n",
                "  "
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "Phone",
                "count"
            ],
            "Token_Name_Label": [
                "Appointment",
                "Patient"
            ],
            "Token_Operator": [
                ".",
                "*",
                ">"
            ],
            "Token_Name_Function": "count",
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                "John Smith",
                "555-0256"
            ],
            [
                "Grace Ritchie",
                "555-0512"
            ],
            [
                "Dennis Doe",
                "555-2048"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "List the name of physicians who took some appointment.",
        "cypher_query": "MATCH (T1:Appointment)-[]-(T2:Physician)\nRETURN T2.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2"
            ],
            "Token_Name_Label": [
                "Appointment",
                "Physician"
            ],
            "Token_Operator": "."
        },
        "answers": [
            [
                "John Dorian"
            ],
            [
                "Elliot Reid"
            ],
            [
                "Percival Cox"
            ],
            [
                "Christopher Turk"
            ],
            [
                "Molly Clock"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the names of all physicians and their primary affiliated departments' names.",
        "cypher_query": "MATCH (T1:Physician)-[T2:Affiliated_With]-(T3:Department)\nWHERE T2.PrimaryAffiliation = 1\nRETURN T1.Name,T3.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "T3",
                "PrimaryAffiliation"
            ],
            "Token_Name_Label": [
                "Physician",
                "Affiliated_With",
                "Department"
            ],
            "Token_Operator": [
                ".",
                "="
            ],
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                "Elliot Reid",
                "General Medicine"
            ],
            [
                "John Dorian",
                "General Medicine"
            ],
            [
                "Keith Dudemeister",
                "General Medicine"
            ],
            [
                "Bob Kelso",
                "General Medicine"
            ],
            [
                "Percival Cox",
                "General Medicine"
            ],
            [
                "Christopher Turk",
                "Surgery"
            ],
            [
                "John Wen",
                "Surgery"
            ],
            [
                "Todd Quinlan",
                "Surgery"
            ],
            [
                "Molly Clock",
                "Psychiatry"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the name of the patient who made the appointment with the most recent start date.",
        "cypher_query": "MATCH (T1:Patient)-[]-(T2:Appointment)\nRETURN T1.Name\nORDER BY T2.Start DESC\nLIMIT 1",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "Name",
                "ORDER BY",
                "Start",
                "DESC",
                "LIMIT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2"
            ],
            "Token_Name_Label": [
                "Patient",
                "Appointment"
            ],
            "Token_Operator": ".",
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                "Dennis Doe"
            ]
        ]
    }
]