[
    {
        "db_id": "department_management",
        "question": "List the name, born state and age of the heads of departments ordered by age.",
        "cypher_query": "MATCH (he:head)\nRETURN he.name,he.born_state,he.age\nORDER BY he.age",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "name",
                "ORDER BY"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "he",
                "born_state",
                "age"
            ],
            "Token_Name_Label": "head",
            "Token_Operator": "."
        },
        "answers": [
            [
                "P\u00e1draig Harrington",
                "Connecticut",
                43.0
            ],
            [
                "Stewart Cink",
                "Florida",
                50.0
            ],
            [
                "Dudley Hart",
                "California",
                52.0
            ],
            [
                "Jeff Maggert",
                "Delaware",
                53.0
            ],
            [
                "Nick Faldo",
                "California",
                56.0
            ],
            [
                "Tiger Woods",
                "Alabama",
                67.0
            ],
            [
                "Franklin Langham",
                "Connecticut",
                67.0
            ],
            [
                "Sergio Garc\u00eda",
                "California",
                68.0
            ],
            [
                "K. J. Choi",
                "Alabama",
                69.0
            ],
            [
                "Billy Mayfair",
                "California",
                69.0
            ]
        ]
    },
    {
        "db_id": "department_management",
        "question": "List the creation year, name and budget of each department.",
        "cypher_query": "MATCH (de:department)\nRETURN de.Creation,de.Name,de.Budget_in_Billions",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "de",
                "Creation",
                "Budget_in_Billions"
            ],
            "Token_Name_Label": "department",
            "Token_Operator": "."
        },
        "answers": [
            [
                "1789",
                "State",
                9.96
            ],
            [
                "1789",
                "Treasury",
                11.1
            ],
            [
                "1947",
                "Defense",
                439.3
            ],
            [
                "1870",
                "Justice",
                23.4
            ],
            [
                "1849",
                "Interior",
                10.7
            ],
            [
                "1889",
                "Agriculture",
                77.6
            ],
            [
                "1903",
                "Commerce",
                6.2
            ],
            [
                "1913",
                "Labor",
                59.7
            ],
            [
                "1953",
                "Health and Human Services",
                543.2
            ],
            [
                "1965",
                "Housing and Urban Development",
                46.2
            ],
            [
                "1966",
                "Transportation",
                58.0
            ],
            [
                "1977",
                "Energy",
                21.5
            ],
            [
                "1979",
                "Education",
                62.8
            ],
            [
                "1989",
                "Veterans Affairs",
                73.2
            ],
            [
                "2002",
                "Homeland Security",
                44.6
            ]
        ]
    },
    {
        "db_id": "department_management",
        "question": "Which head's name has the substring 'Ha'? List the id and name.",
        "cypher_query": "MATCH (he:head)\nWHERE he.name =~'.*[H|h]a.*'\nRETURN he.head_ID,he.name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "name",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "he",
                "head_ID"
            ],
            "Token_Name_Label": "head",
            "Token_Operator": [
                ".",
                "=~"
            ],
            "Token_Literal_String": "'.*[H|h]a.*'"
        },
        "answers": [
            [
                4,
                "Dudley Hart"
            ],
            [
                9,
                "P\u00e1draig Harrington"
            ],
            [
                10,
                "Franklin Langham"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "Count the number of actors.",
        "cypher_query": "MATCH (ac:actor)\nRETURN count(*)",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": "ac",
            "Token_Name_Label": "actor",
            "Token_Name_Function": "count",
            "Token_Operator": "*"
        },
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "List the name of actors in ascending alphabetical order.",
        "cypher_query": "MATCH (ac:actor)\nRETURN ac.Name\nORDER BY ac.Name ASC",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "Name",
                "ORDER BY",
                "ASC"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": "ac",
            "Token_Name_Label": "actor",
            "Token_Operator": "."
        },
        "answers": [
            [
                "Alan Fletcher"
            ],
            [
                "Ian Smith"
            ],
            [
                "Jackie Woodburne"
            ],
            [
                "Kate Ritchie"
            ],
            [
                "Lynne McGranger"
            ],
            [
                "Ray Meagher"
            ],
            [
                "Ryan Moloney"
            ],
            [
                "Stefan Dennis"
            ],
            [
                "Tom Oliver"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "Return the characters and durations for each actor.",
        "cypher_query": "MATCH (ac:actor)\nRETURN ac.Character,ac.Duration",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "ac",
                "Character",
                "Duration"
            ],
            "Token_Name_Label": "actor",
            "Token_Operator": "."
        },
        "answers": [
            [
                "Alf Stewart",
                "1988\u2014"
            ],
            [
                "Lou Carpenter",
                "1988, 1992\u2014"
            ],
            [
                "Irene Roberts",
                "1993\u2014"
            ],
            [
                "Sally Fletcher",
                "1988\u20132008, 2013"
            ],
            [
                "Karl Kennedy",
                "1994\u2014"
            ],
            [
                "Susan Kennedy",
                "1994\u2014"
            ],
            [
                "Toadfish Rebecchi",
                "1995, 1996\u2014"
            ],
            [
                "Harold Bishop",
                "1987\u20131991, 1996\u20132009, 2011"
            ],
            [
                "Paul Robinson",
                "1985\u20131992, 1993, 2004\u2014"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "List the name of actors whose age is not 20.",
        "cypher_query": "MATCH (ac:actor)\nWHERE ac.age <> 20\nRETURN ac.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": [
                "ac",
                "age"
            ],
            "Token_Name_Label": "actor",
            "Token_Operator": [
                ".",
                "<>"
            ],
            "Token_Literal_Number_Integer": "20"
        },
        "answers": [
            [
                "Ray Meagher"
            ],
            [
                "Tom Oliver"
            ],
            [
                "Lynne McGranger"
            ],
            [
                "Ryan Moloney"
            ],
            [
                "Ian Smith"
            ],
            [
                "Stefan Dennis"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "Return the characters for actors, ordered by age descending.",
        "cypher_query": "MATCH (ac:actor)\nRETURN ac.Character\nORDER BY ac.age DESC",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "ORDER BY",
                "DESC"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": [
                "ac",
                "Character",
                "age"
            ],
            "Token_Name_Label": "actor",
            "Token_Operator": "."
        },
        "answers": [
            [
                "Alf Stewart"
            ],
            [
                "Lou Carpenter"
            ],
            [
                "Irene Roberts"
            ],
            [
                "Sally Fletcher"
            ],
            [
                "Karl Kennedy"
            ],
            [
                "Susan Kennedy"
            ],
            [
                "Toadfish Rebecchi"
            ],
            [
                "Harold Bishop"
            ],
            [
                "Paul Robinson"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "Return the duration of the actor with the greatest age.",
        "cypher_query": "MATCH (ac:actor)\nRETURN ac.Duration\nORDER BY ac.age DESC\nLIMIT 1",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "ORDER BY",
                "DESC",
                "LIMIT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": [
                "ac",
                "Duration",
                "age"
            ],
            "Token_Name_Label": "actor",
            "Token_Operator": ".",
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                "1988\u2014"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "What are the names of musicals with nominee \"Bob Fosse\"?",
        "cypher_query": "MATCH (mu:musical)\nWHERE mu.Nominee = 'Bob Fosse'\nRETURN mu.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": [
                "mu",
                "Nominee"
            ],
            "Token_Name_Label": "musical",
            "Token_Operator": [
                ".",
                "="
            ],
            "Token_Literal_String": "'Bob Fosse'"
        },
        "answers": [
            [
                "The Phantom of the Opera"
            ],
            [
                "Wicked"
            ],
            [
                "West Side Story"
            ],
            [
                "The Book of Mormon"
            ],
            [
                "Chicago"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "What are the distinct nominees of the musicals with the award that is not \"Tony Award\"?",
        "cypher_query": "MATCH (mu:musical)\nWHERE mu.Award <> 'Tony Award'\nRETURN DISTINCT mu.Nominee",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN DISTINCT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": [
                "mu",
                "Award",
                "Nominee"
            ],
            "Token_Name_Label": "musical",
            "Token_Operator": [
                ".",
                "<>"
            ],
            "Token_Literal_String": "'Tony Award'"
        },
        "answers": [
            [
                "Cleavant Derricks"
            ],
            [
                "Bob Fosse"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "Show names of actors and names of musicals they are in.",
        "cypher_query": "MATCH (T1:actor)-[]-(T2:musical)\nRETURN T1.Name,T2.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2"
            ],
            "Token_Name_Label": [
                "actor",
                "musical"
            ],
            "Token_Operator": "."
        },
        "answers": [
            [
                "Ray Meagher",
                "The Phantom of the Opera"
            ],
            [
                "Tom Oliver",
                "The Phantom of the Opera"
            ],
            [
                "Lynne McGranger",
                "Les Mis\u00e9rables"
            ],
            [
                "Kate Ritchie",
                "Les Mis\u00e9rables"
            ],
            [
                "Alan Fletcher",
                "West Side Story"
            ],
            [
                "Jackie Woodburne",
                "The Book of Mormon"
            ],
            [
                "Ryan Moloney",
                "The Book of Mormon"
            ],
            [
                "Ian Smith",
                "The Book of Mormon"
            ],
            [
                "Stefan Dennis",
                "The Book of Mormon"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "Show names of actors that have appeared in musical with name \"The Phantom of the Opera\".",
        "cypher_query": "MATCH (T1:actor)-[]-(T2:musical)\nWHERE T2.Name = 'The Phantom of the Opera'\nRETURN T1.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "Name",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2"
            ],
            "Token_Name_Label": [
                "actor",
                "musical"
            ],
            "Token_Operator": [
                ".",
                "="
            ],
            "Token_Literal_String": "'The Phantom of the Opera'"
        },
        "answers": [
            [
                "Tom Oliver"
            ],
            [
                "Ray Meagher"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "Show names of actors in descending order of the year their musical is awarded.",
        "cypher_query": "MATCH (T1:actor)-[]-(T2:musical)\nRETURN T1.Name\nORDER BY T2.Year DESC",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "Name",
                "ORDER BY",
                "DESC"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "Year"
            ],
            "Token_Name_Label": [
                "actor",
                "musical"
            ],
            "Token_Operator": "."
        },
        "answers": [
            [
                "Ray Meagher"
            ],
            [
                "Tom Oliver"
            ],
            [
                "Lynne McGranger"
            ],
            [
                "Kate Ritchie"
            ],
            [
                "Alan Fletcher"
            ],
            [
                "Jackie Woodburne"
            ],
            [
                "Ryan Moloney"
            ],
            [
                "Ian Smith"
            ],
            [
                "Stefan Dennis"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "Show names of musicals and the number of actors who have appeared in the musicals.",
        "cypher_query": "MATCH (T1:actor)-[]-(T2:musical)\nWITH count(T1.Musical_ID) AS count, T2.Name AS Name\nRETURN Name,count",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "Name",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "Musical_ID",
                "count"
            ],
            "Token_Name_Label": [
                "actor",
                "musical"
            ],
            "Token_Name_Function": "count",
            "Token_Operator": "."
        },
        "answers": [
            [
                "The Phantom of the Opera",
                2
            ],
            [
                "Les Mis\u00e9rables",
                2
            ],
            [
                "West Side Story",
                1
            ],
            [
                "The Book of Mormon",
                4
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "Show names of musicals which have at least three actors.",
        "cypher_query": "MATCH (T1:actor)-[]-(T2:musical)\nWITH T2.Name AS Name, count(*) AS count\nWHERE count  >= 3\nRETURN Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "Name",
                "AS",
                "WHERE",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n",
                "  "
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "count"
            ],
            "Token_Name_Label": [
                "actor",
                "musical"
            ],
            "Token_Operator": [
                ".",
                "*",
                ">="
            ],
            "Token_Name_Function": "count",
            "Token_Literal_Number_Integer": "3"
        },
        "answers": [
            [
                "The Book of Mormon"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "Show different nominees and the number of musicals they have been nominated.",
        "cypher_query": "MATCH (mu:musical)\nWITH count(mu.Nominee) AS count, mu.Nominee AS Nominee\nRETURN Nominee,count",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "mu",
                "Nominee",
                "count"
            ],
            "Token_Name_Label": "musical",
            "Token_Name_Function": "count",
            "Token_Operator": "."
        },
        "answers": [
            [
                "Bob Fosse",
                5
            ],
            [
                "Cleavant Derricks",
                2
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "Please show the nominee who has been nominated the greatest number of times.",
        "cypher_query": "MATCH (mu:musical)\nWITH count(mu.Nominee) AS count, mu.Nominee AS Nominee\nRETURN Nominee\nORDER BY count DESC\nLIMIT 1",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "RETURN",
                "ORDER BY",
                "DESC",
                "LIMIT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "mu",
                "Nominee",
                "count"
            ],
            "Token_Name_Label": "musical",
            "Token_Name_Function": "count",
            "Token_Operator": ".",
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                "Bob Fosse"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "List the most common result of the musicals.",
        "cypher_query": "MATCH (mu:musical)\nWITH count(mu.Result) AS count, mu.Result AS Result\nRETURN Result\nORDER BY count DESC\nLIMIT 1",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "RETURN",
                "ORDER BY",
                "DESC",
                "LIMIT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "mu",
                "Result",
                "count"
            ],
            "Token_Name_Label": "musical",
            "Token_Name_Function": "count",
            "Token_Operator": ".",
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                "Nominated"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "List the nominees that have been nominated more than two musicals.",
        "cypher_query": "MATCH (mu:musical)\nWITH mu.Nominee AS Nominee, count(*) AS count\nWHERE count  > 2\nRETURN Nominee",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "WHERE",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n",
                "  "
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "mu",
                "Nominee",
                "count"
            ],
            "Token_Name_Label": "musical",
            "Token_Operator": [
                ".",
                "*",
                ">"
            ],
            "Token_Name_Function": "count",
            "Token_Literal_Number_Integer": "2"
        },
        "answers": [
            [
                "Bob Fosse"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "List the name of musicals that do not have actors.",
        "cypher_query": "MATCH (mu:musical)\nWHERE NOT (mu:musical)-[]-(:actor)\nRETURN mu.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ")-[",
                "]-("
            ],
            "Token_Name_Variable": "mu",
            "Token_Name_Label": [
                "musical",
                "actor"
            ],
            "Token_Operator": [
                "NOT",
                "."
            ]
        },
        "answers": [
            [
                "Wicked"
            ],
            [
                "Rent"
            ],
            [
                "Chicago"
            ]
        ]
    },
    {
        "db_id": "musical",
        "question": "Show the musical nominee with award \"Bob Fosse\" or \"Cleavant Derricks\".",
        "cypher_query": "MATCH (mu:musical)\nWHERE mu.Award = 'Tony Award' OR mu.Award = 'Cleavant Derricks'\nRETURN mu.Nominee",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": [
                "mu",
                "Award",
                "Nominee"
            ],
            "Token_Name_Label": "musical",
            "Token_Operator": [
                ".",
                "=",
                "OR"
            ],
            "Token_Literal_String": [
                "'Tony Award'",
                "'Cleavant Derricks'"
            ]
        },
        "answers": [
            [
                "Bob Fosse"
            ],
            [
                "Cleavant Derricks"
            ]
        ]
    },
    {
        "db_id": "assets_maintenance",
        "question": "How many assets does each maintenance contract contain? List the number and the contract id.",
        "cypher_query": "MATCH (T1:Maintenance_Contracts)-[]-(T2:Assets)\nWITH T1.maintenance_contract_id AS maintenance_contract_id, count(T1.maintenance_contract_id) AS count\nRETURN count,maintenance_contract_id",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "maintenance_contract_id",
                "count"
            ],
            "Token_Name_Label": [
                "Maintenance_Contracts",
                "Assets"
            ],
            "Token_Operator": ".",
            "Token_Name_Function": "count"
        },
        "answers": [
            [
                2,
                2
            ],
            [
                2,
                6
            ],
            [
                2,
                7
            ],
            [
                2,
                8
            ],
            [
                1,
                10
            ],
            [
                2,
                11
            ],
            [
                1,
                12
            ],
            [
                1,
                13
            ],
            [
                1,
                14
            ],
            [
                1,
                15
            ]
        ]
    }
]