[
    {
        "db_id": "hospital_1",
        "question": "How many patients are not using Procrastin-X as medication?",
        "cypher_query": "MATCH (pa:Patient)\nWHERE NOT (pa:Patient)-[]-(:Prescribes)-[]-(:Medication { Name : 'Procrastin-X' })\nRETURN count(*)",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ")-[",
                "]-(",
                "{",
                "}"
            ],
            "Token_Name_Variable": [
                "pa",
                "Name"
            ],
            "Token_Name_Label": [
                "Patient",
                "Prescribes",
                "Medication"
            ],
            "Token_Operator": [
                "NOT",
                "*"
            ],
            "Token_Literal_String": "'Procrastin-X'",
            "Token_Name_Function": "count"
        },
        "answers": [
            [
                3
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Count how many appointments have been made in total.",
        "cypher_query": "MATCH (ap:Appointment)\nRETURN count(*)",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": "ap",
            "Token_Name_Label": "Appointment",
            "Token_Name_Function": "count",
            "Token_Operator": "*"
        },
        "answers": [
            [
                9
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the names of nurses who are on call.",
        "cypher_query": "MATCH (T1:Nurse)-[]-(T2:On_Call)\nRETURN DISTINCT T1.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN DISTINCT",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2"
            ],
            "Token_Name_Label": [
                "Nurse",
                "On_Call"
            ],
            "Token_Operator": "."
        },
        "answers": [
            [
                "Carla Espinosa"
            ],
            [
                "Laverne Roberts"
            ],
            [
                "Paul Flowers"
            ]
        ]
    }
]