[
    {
        "db_id": "hospital_1",
        "question": "Count the number of patients who stayed in room 112.",
        "cypher_query": "MATCH (st:Stay)\nWHERE st.Room = 112\nRETURN count(st.Patient)",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": [
                "st",
                "Room",
                "Patient"
            ],
            "Token_Name_Label": "Stay",
            "Token_Operator": [
                ".",
                "="
            ],
            "Token_Literal_Number_Integer": "112",
            "Token_Name_Function": "count"
        },
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "How many patients' prescriptions are made by physician John Dorian?",
        "cypher_query": "MATCH (T1:Patient)-[]-(T3:Physician)-[]-(T2:Prescribes)\nWHERE T3.Name = 'John Dorian'\nRETURN count(T1.SSN)",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "Name",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T3",
                "T2",
                "SSN"
            ],
            "Token_Name_Label": [
                "Patient",
                "Physician",
                "Prescribes"
            ],
            "Token_Operator": [
                ".",
                "="
            ],
            "Token_Literal_String": "'John Dorian'",
            "Token_Name_Function": "count"
        },
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the patient who most recently stayed in room 111.",
        "cypher_query": "MATCH (st:Stay)\nWHERE st.Room = 111\nRETURN st.Patient\nORDER BY st.StayStart DESC\nLIMIT 1",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN",
                "ORDER BY",
                "DESC",
                "LIMIT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": [
                "st",
                "Room",
                "Patient",
                "StayStart"
            ],
            "Token_Name_Label": "Stay",
            "Token_Operator": [
                ".",
                "="
            ],
            "Token_Literal_Number_Integer": "111"
        },
        "answers": [
            [
                100000001
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "How many patients do each physician take care of? List their names and number of patients they take care of.",
        "cypher_query": "MATCH (T1:Physician)-[]-(T2:Patient)\nWITH count(T1.EmployeeID) AS count, T1.Name AS Name\nRETURN Name,count",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "Name",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "EmployeeID",
                "count"
            ],
            "Token_Name_Label": [
                "Physician",
                "Patient"
            ],
            "Token_Name_Function": "count",
            "Token_Operator": "."
        },
        "answers": [
            [
                "John Dorian",
                1
            ],
            [
                "Elliot Reid",
                2
            ],
            [
                "Christopher Turk",
                1
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the name of physicians who are in charge of more than one patient.",
        "cypher_query": "MATCH (T1:Physician)-[]-(T2:Patient)\nWITH count(*) AS count, T1.Name AS Name\nWHERE count  > 1\nRETURN Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WITH",
                "AS",
                "Name",
                "WHERE",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n",
                "  "
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "count"
            ],
            "Token_Name_Label": [
                "Physician",
                "Patient"
            ],
            "Token_Name_Function": "count",
            "Token_Operator": [
                "*",
                ".",
                ">"
            ],
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                "Elliot Reid"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the number of rooms located on each block floor.",
        "cypher_query": "MATCH (T1:Block) MATCH (T2:Room)\nWHERE T1.BlockFloor = T2.BlockFloor AND T1.BlockCode = T2.BlockCode\nWITH count(T1.BlockFloor) AS count, T1.BlockFloor AS BlockFloor\nRETURN count,BlockFloor",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "WITH",
                "AS",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "BlockFloor",
                "BlockCode",
                "count"
            ],
            "Token_Name_Label": [
                "Block",
                "Room"
            ],
            "Token_Operator": [
                ".",
                "=",
                "AND"
            ],
            "Token_Name_Function": "count"
        },
        "answers": [
            [
                9,
                1
            ],
            [
                9,
                2
            ],
            [
                9,
                3
            ],
            [
                9,
                4
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Tell me the distinct block codes where some rooms are available.",
        "cypher_query": "MATCH (ro:Room)\nWHERE ro.Unavailable = 0\nRETURN DISTINCT ro.BlockCode",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN DISTINCT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": [
                "ro",
                "Unavailable",
                "BlockCode"
            ],
            "Token_Name_Label": "Room",
            "Token_Operator": [
                ".",
                "="
            ],
            "Token_Literal_Number_Integer": "0"
        },
        "answers": [
            [
                1
            ],
            [
                2
            ],
            [
                3
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the number of distinct room types available.",
        "cypher_query": "MATCH (ro:Room)\nRETURN count(DISTINCT ro.RoomType)",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": [
                "ro",
                "RoomType"
            ],
            "Token_Name_Label": "Room",
            "Token_Name_Function": "count",
            "Token_Operator": [
                "DISTINCT",
                "."
            ]
        },
        "answers": [
            [
                1
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "What is the names of the physicians who prescribe medication Thesisin?",
        "cypher_query": "MATCH (T1:Physician)-[]-(T2:Prescribes)-[]-(T3:Medication)\nWHERE T3.Name = 'Thesisin'\nRETURN DISTINCT T1.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "Name",
                "RETURN DISTINCT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "T3"
            ],
            "Token_Name_Label": [
                "Physician",
                "Prescribes",
                "Medication"
            ],
            "Token_Operator": [
                ".",
                "="
            ],
            "Token_Literal_String": "'Thesisin'"
        },
        "answers": [
            [
                "Molly Clock"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the name and position of physicians who prescribe some medication whose brand is X?",
        "cypher_query": "MATCH (T1:Physician)-[]-(T2:Prescribes)-[]-(T3:Medication)\nWHERE T3.Brand = 'X'\nRETURN DISTINCT T1.Name,T1.Position",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN DISTINCT",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "T3",
                "Brand",
                "Position"
            ],
            "Token_Name_Label": [
                "Physician",
                "Prescribes",
                "Medication"
            ],
            "Token_Operator": [
                ".",
                "="
            ],
            "Token_Literal_String": "'X'"
        },
        "answers": [
            [
                "John Dorian",
                "Staff Internist"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the name of physicians whose position title contains the word 'senior'.",
        "cypher_query": "MATCH (ph:Physician)\nWHERE ph.Position =~'.*[S|s]enior.*'\nRETURN ph.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": [
                "ph",
                "Position"
            ],
            "Token_Name_Label": "Physician",
            "Token_Operator": [
                ".",
                "=~"
            ],
            "Token_Literal_String": "'.*[S|s]enior.*'"
        },
        "answers": [
            [
                "Percival Cox"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the names of all patients who have an undergoing treatment and are staying in room 111.",
        "cypher_query": "MATCH (T3:Stay)-[]-(T1:Undergoes)-[]-(T2:Patient)\nWHERE T3.Room = 111\nRETURN DISTINCT T2.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN DISTINCT",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T3",
                "T1",
                "T2",
                "Room"
            ],
            "Token_Name_Label": [
                "Stay",
                "Undergoes",
                "Patient"
            ],
            "Token_Operator": [
                ".",
                "="
            ],
            "Token_Literal_Number_Integer": "111"
        },
        "answers": [
            [
                "John Smith"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the names of nurses who are nursing an undergoing treatment.",
        "cypher_query": "MATCH (T1:Undergoes)-[]-(T2:Nurse)\nRETURN DISTINCT T2.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN DISTINCT",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2"
            ],
            "Token_Name_Label": [
                "Undergoes",
                "Nurse"
            ],
            "Token_Operator": "."
        },
        "answers": [
            [
                "Carla Espinosa"
            ],
            [
                "Laverne Roberts"
            ],
            [
                "Paul Flowers"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "List the names of all distinct medications, ordered in an alphabetical order.",
        "cypher_query": "MATCH (me:Medication)\nRETURN DISTINCT me.Name\nORDER BY me.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN DISTINCT",
                "Name",
                "ORDER BY"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": "me",
            "Token_Name_Label": "Medication",
            "Token_Operator": "."
        },
        "answers": [
            [
                "Awakin"
            ],
            [
                "Crescavitin"
            ],
            [
                "Melioraurin"
            ],
            [
                "Procrastin-X"
            ],
            [
                "Thesisin"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "What nurses are on call with block floor 1 and block code 1? Tell me their names.",
        "cypher_query": "MATCH (on:On_Call)\nWHERE on.BlockFloor = 1 AND on.BlockCode = 1\nRETURN on.Nurse",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "on",
                "WHERE",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Label": "On_Call",
            "Token_Operator": [
                ".",
                "=",
                "AND"
            ],
            "Token_Name_Variable": [
                "BlockFloor",
                "BlockCode",
                "Nurse"
            ],
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                101
            ],
            [
                103
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Tell me the highest, lowest, and average cost of procedures.",
        "cypher_query": "MATCH (pr:Procedures)\nRETURN max(pr.Cost),min(pr.Cost),avg(pr.Cost)",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "pr",
                "Cost"
            ],
            "Token_Name_Label": "Procedures",
            "Token_Name_Function": [
                "max",
                "min",
                "avg"
            ],
            "Token_Operator": "."
        },
        "answers": [
            [
                10000.0,
                25.0,
                4324.857142857143
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "List the name and cost of all procedures sorted by the cost from the highest to the lowest.",
        "cypher_query": "MATCH (pr:Procedures)\nRETURN pr.Name,pr.Cost\nORDER BY pr.Cost DESC",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "Name",
                "ORDER BY",
                "DESC"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ","
            ],
            "Token_Name_Variable": [
                "pr",
                "Cost"
            ],
            "Token_Name_Label": "Procedures",
            "Token_Operator": "."
        },
        "answers": [
            [
                "Complete Walletectomy",
                10000.0
            ],
            [
                "Reversible Pancreomyoplasty",
                5600.0
            ],
            [
                "Obfuscated Dermogastrotomy",
                4899.0
            ],
            [
                "Folded Demiophtalmectomy",
                4500.0
            ],
            [
                "Obtuse Pyloric Recombobulation",
                3750.0
            ],
            [
                "Reverse Rhinopodoplasty",
                1500.0
            ],
            [
                "Follicular Demiectomy",
                25.0
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the three most expensive procedures.",
        "cypher_query": "MATCH (pr:Procedures)\nRETURN pr.Name\nORDER BY pr.Cost\nLIMIT 3",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "Name",
                "ORDER BY",
                "LIMIT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")"
            ],
            "Token_Name_Variable": [
                "pr",
                "Cost"
            ],
            "Token_Name_Label": "Procedures",
            "Token_Operator": ".",
            "Token_Literal_Number_Integer": "3"
        },
        "answers": [
            [
                "Follicular Demiectomy"
            ],
            [
                "Reverse Rhinopodoplasty"
            ],
            [
                "Obtuse Pyloric Recombobulation"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the physicians who are trained in a procedure that costs more than 5000.",
        "cypher_query": "MATCH (T1:Physician)-[T2:Trained_In]-(T3:Procedures)\nWHERE T3.Cost > 5000\nRETURN T1.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN",
                "Name"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "T3",
                "Cost"
            ],
            "Token_Name_Label": [
                "Physician",
                "Trained_In",
                "Procedures"
            ],
            "Token_Operator": [
                ".",
                ">"
            ],
            "Token_Literal_Number_Integer": "5000"
        },
        "answers": [
            [
                "John Wen"
            ],
            [
                "Todd Quinlan"
            ],
            [
                "Christopher Turk"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Which physician was trained in the procedure that costs the most.",
        "cypher_query": "MATCH (T1:Physician)-[T2:Trained_In]-(T3:Procedures)\nRETURN T1.Name\nORDER BY T3.Cost DESC\nLIMIT 1",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "RETURN",
                "Name",
                "ORDER BY",
                "DESC",
                "LIMIT"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "T3",
                "Cost"
            ],
            "Token_Name_Label": [
                "Physician",
                "Trained_In",
                "Procedures"
            ],
            "Token_Operator": ".",
            "Token_Literal_Number_Integer": "1"
        },
        "answers": [
            [
                "John Wen"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Compute the mean price of procedures physician John Wen was trained in.",
        "cypher_query": "MATCH (T1:Physician)-[T2:Trained_In]-(T3:Procedures)\nWHERE T1.Name = 'John Wen'\nRETURN avg(T3.Cost)",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "Name",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "T3",
                "Cost"
            ],
            "Token_Name_Label": [
                "Physician",
                "Trained_In",
                "Procedures"
            ],
            "Token_Operator": [
                ".",
                "="
            ],
            "Token_Literal_String": "'John Wen'",
            "Token_Name_Function": "avg"
        },
        "answers": [
            [
                4324.857142857143
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the names of procedures which physician John Wen was trained in.",
        "cypher_query": "MATCH (T1:Physician)-[T2:Trained_In]-(T3:Procedures)\nWHERE T1.Name = 'John Wen'\nRETURN T3.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "Name",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "T3"
            ],
            "Token_Name_Label": [
                "Physician",
                "Trained_In",
                "Procedures"
            ],
            "Token_Operator": [
                ".",
                "="
            ],
            "Token_Literal_String": "'John Wen'"
        },
        "answers": [
            [
                "Obfuscated Dermogastrotomy"
            ],
            [
                "Reverse Rhinopodoplasty"
            ],
            [
                "Complete Walletectomy"
            ],
            [
                "Folded Demiophtalmectomy"
            ],
            [
                "Follicular Demiectomy"
            ],
            [
                "Reversible Pancreomyoplasty"
            ],
            [
                "Obtuse Pyloric Recombobulation"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find all procedures which cost more than 1000 or which physician John Wen was trained in.",
        "cypher_query": "MATCH (pr:Procedures)\nWHERE pr.Cost > 1000\nRETURN pr.Name  AS name \nUNION\nMATCH (T1:Physician)-[T2:Trained_In]-(T3:Procedures)\nWHERE T1.Name = 'John Wen'\nRETURN T3.Name  AS name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN",
                "Name",
                "AS",
                "name",
                "UNION"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n",
                "  ",
                " \n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ")-[",
                "]-("
            ],
            "Token_Name_Variable": [
                "pr",
                "Cost",
                "T1",
                "T2",
                "T3"
            ],
            "Token_Name_Label": [
                "Procedures",
                "Physician",
                "Trained_In"
            ],
            "Token_Operator": [
                ".",
                ">",
                "="
            ],
            "Token_Literal_Number_Integer": "1000",
            "Token_Literal_String": "'John Wen'"
        },
        "answers": [
            [
                "Reverse Rhinopodoplasty"
            ],
            [
                "Obtuse Pyloric Recombobulation"
            ],
            [
                "Folded Demiophtalmectomy"
            ],
            [
                "Complete Walletectomy"
            ],
            [
                "Obfuscated Dermogastrotomy"
            ],
            [
                "Reversible Pancreomyoplasty"
            ],
            [
                "Follicular Demiectomy"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the name of physicians who are affiliated with Surgery or Psychiatry department.",
        "cypher_query": "MATCH (T1:Physician)-[T2:Affiliated_With]-(T3:Department)\nWHERE T3.Name = 'Surgery' OR T3.Name = 'Psychiatry'\nRETURN T1.Name",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "Name",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")-[",
                "]-(",
                ")"
            ],
            "Token_Name_Variable": [
                "T1",
                "T2",
                "T3"
            ],
            "Token_Name_Label": [
                "Physician",
                "Affiliated_With",
                "Department"
            ],
            "Token_Operator": [
                ".",
                "=",
                "OR"
            ],
            "Token_Literal_String": [
                "'Surgery'",
                "'Psychiatry'"
            ]
        },
        "answers": [
            [
                "Christopher Turk"
            ],
            [
                "John Wen"
            ],
            [
                "Todd Quinlan"
            ],
            [
                "Molly Clock"
            ]
        ]
    },
    {
        "db_id": "hospital_1",
        "question": "Find the number of patients who are not using the medication of Procrastin-X.",
        "cypher_query": "MATCH (pa:Patient)\nWHERE NOT (pa:Patient)-[]-(:Prescribes)-[]-(:Medication { Name : 'Procrastin-X' })\nRETURN count(*)",
        "parsed_cpypher": {
            "Token_Keyword": [
                "MATCH",
                "WHERE",
                "RETURN"
            ],
            "Token_Text_Whitespace": [
                " ",
                "\n"
            ],
            "Token_Punctuation": [
                "(",
                ":",
                ")",
                ")-[",
                "]-(",
                "{",
                "}"
            ],
            "Token_Name_Variable": [
                "pa",
                "Name"
            ],
            "Token_Name_Label": [
                "Patient",
                "Prescribes",
                "Medication"
            ],
            "Token_Operator": [
                "NOT",
                "*"
            ],
            "Token_Literal_String": "'Procrastin-X'",
            "Token_Name_Function": "count"
        },
        "answers": [
            [
                3
            ]
        ]
    }
]